[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"779400\">@Mekeor Melire</span> ,</p>\n<p>First, I wanted to say that I appreciate what you've initiated with nael and now with lean4-mode itself.</p>\n<p>FWIW, I started experimenting with Lean4 about a year ago and found that lean4-mode barely worked at all (mathlib would constantly rebuild).  After many hours of debugging, I rediscovered and fixed a serious issue for which there had been a pull request several months prior (which seems to have since been merged).  Not long after, I came across the eglot fork <a href=\"https://github.com/bustercopley/lean4-mode\">https://github.com/bustercopley/lean4-mode</a> (which I've since seen others in the zulip directed to).  I've been using my own fork <a href=\"https://github.com/ultronozm/lean4-mode\">https://github.com/ultronozm/lean4-mode</a> of that plus the embellishments at <a href=\"https://github.com/ultronozm/czm-lean4.el\">https://github.com/ultronozm/czm-lean4.el</a>.  Based on this experience, I wonder how many users are actually on the main fork.</p>\n<p>A few things:</p>\n<ol>\n<li>\n<p>I'd be happy to test and offer feedback on the main fork when it approximates parity with my own.</p>\n</li>\n<li>\n<p>There's at least one feature originating in my fork that I'd be happy to submit to the main fork when the latter is in reasonable shape: \"hover docs\" for the goal view, which can also be made interactive/explorable like in VSCode.</p>\n</li>\n<li>\n<p>I've thought a bit about how one could track the goal state without a separate buffer, something I found lacking in nael.  I worked out a practical solution that might be something to discuss down the road (see screenshot). <br>\n<a href=\"/user_uploads/3121/i6aDpGyT5k0NCFtCrvYXae5u/Screenshot-2024-12-05-at-10.04.45.png\">Screenshot 2024-12-05 at 10.04.45.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/i6aDpGyT5k0NCFtCrvYXae5u/Screenshot-2024-12-05-at-10.04.45.png\" title=\"Screenshot 2024-12-05 at 10.04.45.png\"><img data-original-dimensions=\"1774x516\" src=\"/user_uploads/thumbnail/3121/i6aDpGyT5k0NCFtCrvYXae5u/Screenshot-2024-12-05-at-10.04.45.png/840x560.webp\"></a></div></li>\n</ol>",
        "id": 486258133,
        "sender_full_name": "Paul Nelson",
        "timestamp": 1733390409
    },
    {
        "content": "<p>I was already aware of your fork because Buster mentioned it.</p>\n<p>Your \"hover docs\" feature, how does it compare to the feature that <span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span> implemented in their own personal local fork? They had <a href=\"#narrow/channel/468104-Emacs/topic/Development.3A.20Maintainership/near/482366432\">described</a> it as follows:</p>\n<blockquote>\n<p>[Lean4] allows users to ask for the underlying representation of terms that appear in messages (and then to recursively do so again on subterms). The VSCode/Neovim modes do this, and I've got a private fork of the Emacs mode laying around that also does (but it's a bit broken and I ran out of time to make it ready for anyone else to use, so it's just laying about gathering dust)</p>\n</blockquote>\n<p>Personally, I had initially created Nael out of personal interests. Later, I decided to keep it because the Lean4-Mode maintainers were not responsive at that time. That has changed now. Anyone is welcome to contribute to Lean4-Mode now. I have write-access and do review issue reports and pull-requests. In particular in the current ongoing refactoring phase, I would appreciate support; it's a lot of work.</p>\n<p>We will need to discuss how the future Lean4-Mode Info View is implemented. To me, it makes sense to use a separate buffer. But yes, it'd be nice to optionally show its content as an overlay or a childframe.  <span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span> in linked post had also briefly described how ElDoc could perhaps be used for Info View without sacrifice. Then, we could do something similar to <a href=\"https://github.com/casouri/eldoc-box\">eldoc-box</a>.</p>",
        "id": 486380279,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1733427436
    },
    {
        "content": "<p>The hover view in my fork (and also in bustercopley's) sounds similar to what David describes (except the \"broken\" aspect).  I incorporated \"interactivity\" (or \"recursive hovering\") as follows:</p>\n<ol>\n<li>When you put the point on a term, eldoc puts some text in the echo area.</li>\n<li>The mini-package <a href=\"https://github.com/ultronozm/eldoc-icebox.el\">https://github.com/ultronozm/eldoc-icebox.el</a> gives a command that stores a frozen copy of the eldoc text in some separate buffer.  It comes with a hook that can be used to set up Lean4 interactivity.</li>\n<li>You can thus \"recursively hover\" by hovering over a term, activating eldoc-icebox, switching to the eldoc-icebox buffer, hovering over a term, and so on.</li>\n</ol>\n<p>This is a bit crufty, but I couldn't quickly think of a simpler way.</p>",
        "id": 486385874,
        "sender_full_name": "Paul Nelson",
        "timestamp": 1733429625
    },
    {
        "content": "<p>Regarding development of lean4-mode, I guess we're still in the initial clean-up phase.  For the later step where lsp-mode is replaced by eglot, would it be feasible simply to pull in the eglot implementations in <span class=\"user-mention\" data-user-id=\"400544\">@Richard Copley</span> 's fork (or at least much of them)?  That would simplify the task of getting the main fork and my own to parity.</p>",
        "id": 486385884,
        "sender_full_name": "Paul Nelson",
        "timestamp": 1733429632
    },
    {
        "content": "<p>Thanks for explaining.</p>\n<blockquote>\n<p>we're still in the initial clean-up phase</p>\n</blockquote>\n<p>I already did some clean up and am now in the refactor phase. In parallel, we need to decide how to drop the dependency on lsp-mode.</p>\n<blockquote>\n<p>step where lsp-mode is replaced by eglot</p>\n</blockquote>\n<p>I would not drop support for lsp-mode even though I personally don't like it.</p>\n<p>Could you create issues in Github regarding 1. hover docs; and 2. Info View without separate window? I personally can't decide on whether or how to implement these right now, but it'd be good to keep the ideas tracked.</p>",
        "id": 486394087,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1733433109
    },
    {
        "content": "<p>Sure, I'll add the issues you mention.</p>\n<p>I read through the issues/comments on GH just now.  I agree with everything you propose (lean4-settings, lean4-lake, ...) except for keeping lsp-mode, where you propose having it available via a setting.  I'm curious about the rationale.  The only argument I saw was <a href=\"https://github.com/leanprover-community/lean4-mode/issues/7#issuecomment-1345190360\">https://github.com/leanprover-community/lean4-mode/issues/7#issuecomment-1345190360</a>, but that no longer applies since the noted parts of lean4-mode (info view, orange bars) have been adapted to eglot, as  I suspect you know.  The hovers docs code is also specific to eglot at present.  I don't personally see any advantage to keeping lsp-mode support, while the disadvantages are clear (maintenance, duplication, ...).  Happy to learn if I missed something.</p>",
        "id": 486400449,
        "sender_full_name": "Paul Nelson",
        "timestamp": 1733435961
    },
    {
        "content": "<p>Does eglot support semantic tokens now? I thought that was the main holdup (and is very important).</p>",
        "id": 486404598,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1733437882
    },
    {
        "content": "<p>AFAIK it doesn't.  Is it simple to explain the importance?</p>",
        "id": 486404899,
        "sender_full_name": "Paul Nelson",
        "timestamp": 1733438033
    },
    {
        "content": "<p>The syntax of Lean is highly dynamic; half the tactics in Mathlib are user-defined. So you can't accurately highlight Lean without running the Lean server, and that's what semantics token do. Additionally, the grammar is very complicated, so static approximations tend to be fairly far from optimal.</p>",
        "id": 486405702,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1733438358
    },
    {
        "content": "<p>OK, I see, thanks for clarifying.  I guess I don't know what I've been missing :) but can see how that's a feature worth preserving</p>",
        "id": 486405918,
        "sender_full_name": "Paul Nelson",
        "timestamp": 1733438463
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256311\">Jannis Limperg</span> <a href=\"#narrow/stream/468104-Emacs/topic/thanks.20.2B.20a.20few.20thoughts/near/486404598\">said</a>:</p>\n<blockquote>\n<p>Does eglot support semantic tokens now? </p>\n</blockquote>\n<p>No. There are half-baked, third-party implementations though: <a href=\"https://codeberg.org/harald/eglot-supplements\">https://codeberg.org/harald/eglot-supplements</a></p>",
        "id": 486407780,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1733439305
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"779400\">Mekeor Melire</span> has marked this topic as resolved.</p>",
        "id": 513972681,
        "sender_full_name": "Notification Bot",
        "timestamp": 1745446216
    }
]