[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"214703\">@Yury G. Kudryashov</span> one of my students, <span class=\"user-mention\" data-user-id=\"779400\">@Mekeor Melire</span>, is interested in contributing to the Emacs Lean mode. He has so far mostly worked on his own <a href=\"https://codeberg.org/mekeor/nael\">fork</a>, but would like to upstream some of his changes. He's an experienced Emacs developer, so I believe his PRs would need only minimal review as long as the intended design is clearly established beforehand. Would you be able to make some time to work with him on this?</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"400544\">@Richard Copley</span> and <span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> since you might be interested as well.</p>",
        "id": 482271937,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1731536311
    },
    {
        "content": "<p>The main issue with emacs more maintenance is that I'm not an experienced emacs developer.</p>",
        "id": 482285662,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1731543369
    },
    {
        "content": "<p>I fixed a few linter errors, then Sebastian made me a maintainer.</p>",
        "id": 482285778,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1731543458
    },
    {
        "content": "<p>The official fork is in a heartbreaking state. I don't know what to do about it (but I certainly wouldn't want to be using it).</p>",
        "id": 482288604,
        "sender_full_name": "Richard Copley",
        "timestamp": 1731545375
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> avowed years ago not to touch the thing. It's incredibly weird that he is still the maintainer. (No, I'm not going to subtweet. He's a grown-up.)<br>\nIt functions mainly as a gravitational well to suck away any enthusiasm that anyone might have.</p>",
        "id": 482291195,
        "sender_full_name": "Richard Copley",
        "timestamp": 1731547071
    },
    {
        "content": "<p>Do you want to maintain it?</p>",
        "id": 482292835,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1731548148
    },
    {
        "content": "<p>Personally, I'd happily maintain it. Or commit access would be great.</p>\n<p>Because currently, no discussions take place at reported tickets. And I don't like to risk spending time on a PR that is then rejected due to a lack of prior discussion.</p>",
        "id": 482293294,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1731548448
    },
    {
        "content": "<p>The link to the fork mentioned above, <a href=\"https://codeberg.org/mekeor/nael\">https://codeberg.org/mekeor/nael</a>, doesn't even load for me...</p>",
        "id": 482293716,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1731548725
    },
    {
        "content": "<p>Apart from a big refactor that the code needs, the most urgent task, in my opinion, is to remove the hard dependency on lsp-mode so that the mode can be distributed via Melpa. (I wanted to share this because I had also opened some less relevant Github issues.)</p>",
        "id": 482293882,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1731548854
    },
    {
        "content": "<p>(My suggestion here is that Yury gives Mekeor maintainer access, they do whatever they please with it. :-)</p>",
        "id": 482293888,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1731548860
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/stream/113488-general/topic/Emacs.20lean4-mode.20maintenance/near/482293716\">said</a>:</p>\n<blockquote>\n<p>The link to the fork mentioned above, <a href=\"https://codeberg.org/mekeor/nael\">https://codeberg.org/mekeor/nael</a>, doesn't even load for me...</p>\n</blockquote>\n<p>I cannot reproduce. Can you access <a href=\"http://codeberg.org\">codeberg.org</a>?</p>",
        "id": 482294189,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1731549005
    },
    {
        "content": "<p>The page is now loading, but <em>really</em> slowly. I had time to take a screenshot mid-render :-)</p>\n<p><a href=\"/user_uploads/3121/MPmU72DbSBPEycAfeimgr2Ex/Screenshot-2024-11-14-at-12.52.06PM.png\">Screenshot 2024-11-14 at 12.52.06 PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/MPmU72DbSBPEycAfeimgr2Ex/Screenshot-2024-11-14-at-12.52.06PM.png\" title=\"Screenshot 2024-11-14 at 12.52.06 PM.png\"><img data-original-dimensions=\"3662x1136\" src=\"/user_uploads/thumbnail/3121/MPmU72DbSBPEycAfeimgr2Ex/Screenshot-2024-11-14-at-12.52.06PM.png/840x560.webp\"></a></div>",
        "id": 482294402,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1731549170
    },
    {
        "content": "<p>I forked it at <a href=\"https://github.com/bustercopley/nael\">https://github.com/bustercopley/nael</a> (with a description [edit: fixed] \"read-only fork of <a href=\"https://codeberg.org/mekeor/nael\">https://codeberg.org/mekeor/nael</a>\"). Just for convenience. I will probably delete it at some time in the near future to avoid confusion.</p>",
        "id": 482294777,
        "sender_full_name": "Richard Copley",
        "timestamp": 1731549389
    },
    {
        "content": "<p>(It loads fine here).</p>\n<p>Just to mention, I'm not sure if there's a huge opportunity, but to extend the olive branch, if there are things we can share between the emacs and nvim plugins (even if it's potentially a rubber ducking on TUI design or building functionality to help make that easier) I'm happy to chat whenever.</p>",
        "id": 482295602,
        "sender_full_name": "Julian Berman",
        "timestamp": 1731549866
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"779400\">@Mekeor Melire</span>, I'm sorry I didn't try it earlier. The reason is that when you first mentioned the new mode, I felt a sort of visceral dread after reading this part of the README:</p>\n<blockquote>\n<p>Nael does not offer any special buffer for information on the current goal etc.  Instead, Nael introduces two ElDoc documentation functions which will show up in the usual ElDoc buffer.</p>\n</blockquote>\n<p>It was my misunderstanding: I thought there would be no automatic display of the goals and hypotheses at point.<br>\nI'll find time to make a constructive suggestion about that wording, but first I need to sleep, and then go to work.</p>",
        "id": 482297250,
        "sender_full_name": "Richard Copley",
        "timestamp": 1731551051
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"400544\">Richard Copley</span> <a href=\"#narrow/channel/113488-general/topic/Emacs.20lean4-mode.20maintenance/near/482291195\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"110024\">Sebastian Ullrich</span> avowed years ago not to touch the thing. It's incredibly weird that he is still the maintainer. (No, I'm not going to subtweet. He's a grown-up.)<br>\nIt functions mainly as a gravitational well to suck away any enthusiasm that anyone might have.</p>\n</blockquote>\n<p>The fact that Yury mentioned he is a maintainer but is not listed in the main file could have suggested to you that this list is heavily out of date, I don't even have write access to the repo...</p>",
        "id": 482335284,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1731573553
    },
    {
        "content": "<p>Good to have clarified the current state of maintainership.</p>\n<p>Supported by several participants of this conversation, I suggest Yury makes me maintainer of the project.</p>\n<p>Furthermore, I suggest to create a channel in this Zulip that is dedicated to Emacs in general and lean4-mode in particular, because it'd be nice to discuss some ideas and the roadmap of lean4-mode with you all, and y'all seem to be more available here than in the lean4-mode issue tracker.</p>",
        "id": 482358389,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1731580646
    },
    {
        "content": "<p>I have a reasonably large amount of Emacs knowledge, but absolutely zero time to devote to Emacs dev. I've got a couple of thoughts on the direction of <code>nael</code>:</p>\n<ul>\n<li>In general, it's great to use more built-in features of Emacs rather than build things from scratch, because then everything will work better with other nice libraries.</li>\n<li>Eglot has one key advantage over <code>lsp-mode</code>: it correctly handles LSP's weird specification of source positions, where column numbers have to be in terms of 16-bit Unicode. <a href=\"https://github.com/emacs-lsp/lsp-mode/issues/2080\"><code>lsp-mode</code> still doesn't</a></li>\n<li>Eglot also has one key disadvantage: <a href=\"https://github.com/joaotavora/eglot/issues/615\">it doesn't support semantic tokens</a>, which are very important for Lean. Lean can't be correctly highlighted with regexes/<code>font-lock</code>.</li>\n<li>Using Eldoc for docstrings is great, but using it for proof states or other Lean compiler info sounds like a bad idea to me. For clients that opt in, Lean provides a much richer representation than LSP's markdown strings; in particular, it allows users to ask for the underlying representation of terms that appear in messages (and then to recursively do so again on subterms). The VSCode/Neovim modes do this, and I've got a private fork of the Emacs mode laying around that also does (but it's a bit broken and I ran out of time to make it ready for anyone else to use, so it's just laying about gathering dust). I think a dedicated info view is pretty important to having a good Lean user experience in any editor, and I use the interactivity a lot (often while wishing I could just get a buffer with the contents of the hover...). As far as I know, Eldoc doesn't give sufficient primitives to implement the interactive features - I think that propertized strings are not enough, and you'll need overlays. Unless you wrote your own <code>eldoc-display-function entry</code> and then used  the callback's keyword arguments in <code>eldoc-documentation-functions</code> to communicate the active regions? That might work.</li>\n<li>The input method should really match what other editors use by default, because many Lean users refer to the symbols by the abbreviations used elsewhere, and because it'll make documentation make more sense. At least shipping a table of the standard Lean abbreviations with the mode would be useful, I think, and having the Quail config in the mode is a pretty small thing.</li>\n</ul>\n<p>Overall, the smaller codebase is quite nice and more maintainable, and perhaps a maintained mode that's missing important features is better than an unmaintained one with features? Having <code>nael</code> around is great, but having it be the only Lean mode (which would be the result of replacing the contents of <code>lean4-mode</code> with it) seems like a step back to me.</p>",
        "id": 482366432,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1731583140
    },
    {
        "content": "<p>Thanks for the feedback and the interesting ideas, David. I agree that we should not just merge all changes from Nael to lean4-mode. I think Nael should be regarded as a proof of concept and source for inspiration.</p>\n<p>I suggest to concentrate this Zulip topic on the question of how to proceed with maintenance in general; and to discuss technical questions in detail in Zulip-topics within a new #emacs channel. Otherwise we will probably loose focus.</p>\n<p>I do agree with all items you wrote though.</p>",
        "id": 482373209,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1731585392
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"779400\">@Mekeor Melire</span> Could you please add your github name to your Zulip user profile? Then I'll give you write access to <code>lean4-mode</code>.</p>",
        "id": 482440572,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1731603718
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"214703\">@Yury G. Kudryashov</span>, I have updated my Zulip profile to mention my Github alias \"mekeor\". Thank you in advance.</p>",
        "id": 482493740,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1731623150
    },
    {
        "content": "<p>I've sent you a github invitation granting write access to the repo. If you plan some big changes, then please discuss them here first.</p>",
        "id": 482543236,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1731653519
    },
    {
        "content": "<p>Thank you, Yury. I accepted the invitation that grants me push privileges. Thank y'all for your trust.</p>\n<p>The next thing I will do is a roadmap.</p>",
        "id": 482682414,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1731699279
    },
    {
        "content": "<p>Hi everyone. I have been quiet for some time due to exams. But I have now been granted credit points for my masters for working on Lean4-Mode. Beginning next week, I'll continue my work on Milestone 3 as well as bug fixes. See you :)</p>",
        "id": 511181000,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1744207006
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"779400\">Mekeor Melire</span> has marked this topic as resolved.</p>",
        "id": 513978034,
        "sender_full_name": "Notification Bot",
        "timestamp": 1745449350
    },
    {
        "content": "<p>9 messages were moved from this topic to <a class=\"stream-topic\" data-stream-id=\"468104\" href=\"/#narrow/channel/468104-Emacs/topic/Semantic.20Tokens/with/537144091\">#Emacs &gt; Semantic Tokens</a> by <span class=\"user-mention silent\" data-user-id=\"400544\">Richard Copley</span>.</p>",
        "id": 537144093,
        "sender_full_name": "Notification Bot",
        "timestamp": 1756745114
    }
]