[
    {
        "content": "<p>Hi all. I'm sorry to have missed the previous conversation, but I have a fork of <code>lean4-mode</code> that uses eglot, tries to be minimal and serves a browser infoview (the latter not finished yet).<br>\n<a href=\"https://github.com/estradilua/lean4-minimal-mode\">https://github.com/estradilua/lean4-minimal-mode</a></p>\n<p><span class=\"user-mention\" data-user-id=\"779400\">@Mekeor Melire</span> since you are also working on similar things, do you want to collaborate?</p>",
        "id": 518853456,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747514535
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"779400\">@Mekeor Melire</span> I'm also somewhat busy finishing masters (need to write the dissertation <span aria-label=\"crying cat\" class=\"emoji emoji-1f63f\" role=\"img\" title=\"crying cat\">:crying_cat:</span>) but for personal reasons I'd really like to have the infoview (I don't want to leave my emacs).</p>\n<p>Right now the RPC communication between browser and emacs via websocket is working well, but I don't know enough react to figure out why things are not updating in the browser view</p>",
        "id": 518853910,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747514909
    },
    {
        "content": "<p>Once I have the infoview and the fringe set up, I'll probably push to melpa.</p>",
        "id": 518859872,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747520136
    },
    {
        "content": "<p>Thanks for your interest and engagement.</p>\n<p>Personally, I'm not convinced that writing a React.js application, that is opened in the webbrowser and consumes data from Emacs via websockets, is the right approach. I'd prefer a solution in Elisp.</p>",
        "id": 519703932,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747862592
    },
    {
        "content": "<p>4 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"468104\" href=\"/#narrow/channel/468104-Emacs/topic/.E2.9C.94.20Development.3A.20Maintainership/with/482271937\">#Emacs &gt; ✔ Development: Maintainership</a> by <span class=\"user-mention silent\" data-user-id=\"779400\">Mekeor Melire</span>.</p>",
        "id": 519704157,
        "sender_full_name": "Notification Bot",
        "timestamp": 1747862699
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"779400\">@Mekeor Melire</span> are you aware that the lean4-infoview itself is written in React?</p>",
        "id": 519798262,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747909110
    },
    {
        "content": "<p>in fact, there is no need to use React in my wrapper around the infoview, and I may just remove it. But unless you recreate the whole infoview, there is no escape from \"using\" React. Do you have another idea?</p>",
        "id": 519798415,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747909164
    },
    {
        "content": "<p>TBF, the question in the title of the topic you created is to some extend rethoric. Either you use <code>lean4-infoview</code> <em>as an application in a browser</em>, or you don't use the infoview or anything that supports widgets (since they are, by definition, React HTML applets).</p>",
        "id": 519798906,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747909331
    },
    {
        "content": "<p>whether this aforementioned browser is running inside or outside of your editor is a matter of support and taste. But it is a browser nevertheless.</p>",
        "id": 519799194,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747909428
    },
    {
        "content": "<p>What does neovim do?</p>",
        "id": 519810291,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1747913218
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321696\">@Julian Berman</span> can probably explain this better but it's basically a reimplementation of large chunks what the react application does but from within neovim as I understand. It does notably not support widgets but all the other good stuff like hovering in the middle of terms in the infoview and such just works.</p>",
        "id": 519811606,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1747913678
    },
    {
        "content": "<p>For a web application like VS Code, it's fine to implement the Info in React.js. Emacs Lean4-Mode already has an Info that is implemented in Elisp. It's not feature-complete or whatsoever, but we should work on it rather than using React.js, if you ask me.</p>\n<p><span class=\"user-mention\" data-user-id=\"214703\">@Yury G. Kudryashov</span> is the official maintainer, if you want an official opinion or decision on this matter.</p>",
        "id": 519812775,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747914067
    },
    {
        "content": "<p>And my argument is not only meant for React.js specifically but also generally on JavaScript, or even using an external web browser.</p>",
        "id": 519813159,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747914194
    },
    {
        "content": "<p>(When Lean4-Mode has basic support for Eglot, we'll need to investigate whether we want to make the already existing lean4-info module to work with Eglot, too, that is in addition to lsp-mode. Or if we want to use Eldoc as an informational view for Eglot, because that's the default for it.)</p>",
        "id": 519813659,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747914342
    },
    {
        "content": "<p>lean.nvim implements Infoview in Lua, just like Emacs Lean4-Mode uses Elisp in lean4-info.el: <a href=\"https://github.com/Julian/lean.nvim/blob/main/lua/lean/infoview.lua\">https://github.com/Julian/lean.nvim/blob/main/lua/lean/infoview.lua</a></p>",
        "id": 519814234,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747914508
    },
    {
        "content": "<p>What is the problem with javascript specifically?</p>",
        "id": 519821371,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747916697
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"779400\">Mekeor Melire</span> <a href=\"#narrow/channel/468104-Emacs/topic/lean4-minimal-mode/near/519814234\">said</a>:</p>\n<blockquote>\n<p>lean.nvim implements Infoview in Lua, just like Emacs Lean4-Mode uses Elisp in lean4-info.el: <a href=\"https://github.com/Julian/lean.nvim/blob/main/lua/lean/infoview.lua\">https://github.com/Julian/lean.nvim/blob/main/lua/lean/infoview.lua</a></p>\n</blockquote>\n<p>My issue with this approach is that, while it has the advantage of working in a terminal-only environment, it cannot support more advanced widgets and is a burden to implement and maintain. Re-using <code>lean4-infoview</code> means that every new feature there is readily available in the Emacs package.</p>",
        "id": 519821926,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747916853
    },
    {
        "content": "<p>But even if you want to use terminal emacs remotely via SSH, you can just open the remote infoview webpage locally and it would work. You can even open the infoview in your tablet or phone if you want. I don't think supporting the unlikely situation where a browser is completely inaccessible is worth this much work...</p>",
        "id": 519823718,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747917373
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"395550\">Henrik Böving</span> <a href=\"#narrow/channel/468104-Emacs/topic/lean4-minimal-mode/near/519811606\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"321696\">Julian Berman</span> can probably explain this better but it's basically a reimplementation of large chunks what the react application does but from within neovim as I understand.</p>\n</blockquote>\n<p>This is right, yeah, as you all linked. I will say a not-so-secret announcement is that more advanced widgets are also now working (some on main, some on a branch). Not <em>all</em> (i.e. we still don't render fancy animated JS which really does depend on having a browser) -- but reaching Mathlib things like <code>conv?</code> and <code>unfold?</code> and friends.</p>\n<p>More generally I don't know that there's a fully objective \"right\" answer here between \"reimplement in the host language [lua|elisp]\" vs \"use <code>lean4-infoview</code> via a Javascript engine\". Yes it's nice to have to do the work (and it's a <em>lot</em> of work). On the other hand I certainly use neovim for many reasons, a small one of them is precisely not to have neither external windows (which are less integrated in the overall terminal [or emacs] centric workflow, powerful as it is) nor browsers (which besides the above come with extra baggage.)</p>\n<p>To me a nice distant future has a third option emerge here, which is that those of us who care about this help build a layer which minimizes how much a browser really matters. In other words, only once someone really has a thing written in HTML+JS should it be needed to render HTML+JS -- the actual lingua franca to define widgets and the infoview more broadly could be something which is maybe more amenable to multiple rendering models. I have some ideas for what that looks like but not fully detailed ones, not until I finish with this last bit of widget work.</p>\n<p>I should also say that I intend to some day get <code>lean4-infoview</code> <em>also</em> working, which should be easy (I'll have a Lua infoview API which is \"externally managed\" and just renders in the way you have it). But yeah for me this is a secondary option.</p>\n<p>In short I have no advice :) it's a preference question, but I'm happy to help think it through.</p>",
        "id": 519830682,
        "sender_full_name": "Julian Berman",
        "timestamp": 1747919206
    },
    {
        "content": "<blockquote>\n<p>a small one of them is precisely not to have neither external windows (which are less integrated in the overall terminal [or emacs] centric workflow, powerful as it is) nor browsers</p>\n</blockquote>\n<p>I think it's helpful to add that in the case of Emacs, since it is commonly run in a gui frame, you can also open the served infoview as an Emacs window if you want (either using xwidgets/webkit — which is currently broken in some OSes, but that's another issue — or something else like EAF).</p>",
        "id": 519833796,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747920011
    },
    {
        "content": "<p>Yeah this is possible in Neovim too these days (and in fact that's the case even in a terminal now, given there are simple browsers like <code>awrit</code> which I'd bet could render <code>lean4-infoview</code> inside a Neovim <code>:terminal</code> window). I still don't personally like that solution, because every application of course has its own UX and one of the nice things about being inside Neovim (and emacs, in my small amount of emacs life) is that all of what you're doing \"feels\" the same, and this isn't the case if you have 2 applications you're switching between.</p>",
        "id": 519835814,
        "sender_full_name": "Julian Berman",
        "timestamp": 1747920505
    },
    {
        "content": "<p>A silly example perhaps just because coincidentally I was thinking about this morning before seeing this thread is I want to implement a text motion for moving to the next/previous subexpression in the infoview goal state. Of course as long as everything is within the editor it's all fair game to do so, and of course if you're in some other application, you're on your own (and you're going to be figuring out whether or how to add that to <code>lean4-infoview</code>).</p>",
        "id": 519837191,
        "sender_full_name": "Julian Berman",
        "timestamp": 1747920839
    },
    {
        "content": "<p>I see, and I think that's a very valid point. In my case, I'm just frustrated with how Emacs is lagging behind in terms of good support, and I think having the same infoview as VSCode (which is the main editor for Lean user, nowadays) would go a long way. Part of the \"UX\" niceties can be achieved with CSS, and you can also implement and send custom RPC commands to the webpage if you want.</p>",
        "id": 519838739,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747921230
    },
    {
        "content": "<p>It's certainly more mouse-oriented and not \"native\" to the editor. But it solves my problem which is that I want to have my Emacs environment while editing Lean, without the need to keep another VSCode window open.</p>",
        "id": 519839389,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747921418
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"321696\">Julian Berman</span> <a href=\"#narrow/channel/468104-Emacs/topic/lean4-minimal-mode/near/519830682\">said</a>:</p>\n<blockquote>\n<p>To me a nice distant future has a third option emerge here, which is that those of us who care about this help build a layer which minimizes how much a browser really matters.</p>\n</blockquote>\n<p>That'd be really great!</p>",
        "id": 519839391,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747921419
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"571941\">Lua Viana Reis</span> <a href=\"#narrow/channel/468104-Emacs/topic/lean4-minimal-mode/near/519833796\">said</a>:</p>\n<blockquote>\n<p>open the served infoview as an Emacs window if you want (either using xwidgets/webkit — which is currently broken in some OSes, but that's another issue — or something else like EAF).</p>\n</blockquote>\n<p>Note that only a fraction of Emacs users have built Emacs with Xwidgets support and EAF is a pain to install.</p>",
        "id": 519839674,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747921499
    },
    {
        "content": "<p>Yes, I'm not counting on that (but I hope that xwidgets is brought back soon!)</p>",
        "id": 519839855,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747921551
    },
    {
        "content": "<p>Would it be possible and make sense to put a process in between the LSP server and Emacs, which does not only forward the communicated data, but also forwards infoview-relevant data to the infoview-rendering web application? That way, we wouldn't put another burden on single-threaded Emacs that is already struggling with incoming LSP data; and also, we wouldn't touch Lean4-Mode code at all.</p>",
        "id": 519840718,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747921756
    },
    {
        "content": "<p>in case you have a tablet, it's also a nice experience to open the infoview there :) it makes it look like a \"leanpad\". I'll send a video when I make it pretty</p>",
        "id": 519840932,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747921805
    },
    {
        "content": "<p>(not claiming that it's actually useful, though :p but perhaps it could be)</p>",
        "id": 519841572,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747921952
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"571941\">Lua Viana Reis</span> <a href=\"#narrow/channel/468104-Emacs/topic/lean4-minimal-mode/near/519838739\">said</a>:</p>\n<blockquote>\n<p>I'm just frustrated with how Emacs is lagging behind in terms of good support</p>\n</blockquote>\n<p>I'm also frustrated by that. We're all! :(</p>",
        "id": 519841657,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747921973
    },
    {
        "content": "<p>By the way, I don't find <code>lean4-minimal-mode</code> a fair naming of your fork, since it arguably introduces many, many external dependencies.</p>",
        "id": 519842140,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747922100
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"779400\">Mekeor Melire</span> <a href=\"#narrow/channel/468104-Emacs/topic/lean4-minimal-mode/near/519840718\">said</a>:</p>\n<blockquote>\n<p>Would it be possible and make sense to put a process in between the LSP server and Emacs, which does not only forward the communicated data, but also forwards infoview-relevant data to the infoview-rendering web application? That way, we wouldn't put another burden on single-threaded Emacs that is already struggling with incoming LSP data; and also, we wouldn't touch Lean4-Mode code at all.</p>\n</blockquote>\n<p>If Lean had working HTTP and websocket implementations, I would have done this directly there (so it would work in any editor!).</p>",
        "id": 519842515,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747922191
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"779400\">Mekeor Melire</span> <a href=\"#narrow/channel/468104-Emacs/topic/lean4-minimal-mode/near/519842140\">said</a>:</p>\n<blockquote>\n<p>By the way, I don't find <code>lean4-minimal-mode</code> a fair naming of your fork, since it arguably introduces many, many external dependencies.</p>\n</blockquote>\n<p>minimal as in: easy to maintain and I'm doing as little work as possible. And I'm not sure what external dependencies you are talking about. Probably \"the browser\" but welp, isn't that already installed?</p>",
        "id": 519843095,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747922326
    },
    {
        "content": "<p>The NPM package dependencies are listed here: <a href=\"https://github.com/estradilua/lean4-minimal-mode/blob/main/infoview/package-lock.json\">https://github.com/estradilua/lean4-minimal-mode/blob/main/infoview/package-lock.json</a><br>\nBut more importantly, it introduces another language and framework, that maintainers must be familiar with.</p>",
        "id": 519843610,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747922456
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"571941\">Lua Viana Reis</span> <a href=\"#narrow/channel/468104-Emacs/topic/lean4-minimal-mode/near/519842515\">said</a>:</p>\n<blockquote>\n<p>If Lean had working HTTP and websocket implementations, I would have done this directly there (so it would work in any editor!).</p>\n</blockquote>\n<p>Maybe it's possible without websockets.</p>",
        "id": 519843932,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747922531
    },
    {
        "content": "<p>You must communicate with the browser window somehow. The alternative I see would be a REST API, I think it would also work</p>",
        "id": 519844161,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747922586
    },
    {
        "content": "<p>but the problem with a REST API is that afaik there is no straightforward way for the server to send a request to the webpage, so I think it would involve some polling and therefore probably would be slower</p>",
        "id": 519844706,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747922723
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"779400\">Mekeor Melire</span> <a href=\"#narrow/channel/468104-Emacs/topic/lean4-minimal-mode/near/519843610\">said</a>:</p>\n<blockquote>\n<p>The NPM package dependencies are listed here: <a href=\"https://github.com/estradilua/lean4-minimal-mode/blob/main/infoview/package-lock.json\">https://github.com/estradilua/lean4-minimal-mode/blob/main/infoview/package-lock.json</a><br>\nBut more importantly, it introduces another language and framework, that maintainers must be familiar with.</p>\n</blockquote>\n<p>I see. But these are transitive dependencies of <code>lean4-infoview</code>, so again, it's a requirement if you are working with it.</p>",
        "id": 519845745,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747922984
    },
    {
        "content": "<p>Perhaps you could just read the data from the LSP server from its socket or via standard input/output, and provide websockets to the webbrowser. And you'd need to bidirectionally forward data between the LSP server and Emacs.</p>",
        "id": 519847630,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747923502
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"779400\">Mekeor Melire</span> <a href=\"#narrow/channel/468104-Emacs/topic/lean4-minimal-mode/near/519847630\">said</a>:</p>\n<blockquote>\n<p>Perhaps you could just read the data from the LSP server from its socket or via standard input/output, and provide websockets to the webbrowser. And you'd need to bidirectionally forward data between the LSP server and Emacs.</p>\n</blockquote>\n<p>I think that's what I've done currently, basically?</p>",
        "id": 519847950,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747923589
    },
    {
        "content": "<p>or do you mean, with a process in the middle outside of emacs? (like something in Rust?)</p>",
        "id": 519848367,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747923695
    },
    {
        "content": "<p>Yes, I meant a process in the middle, outside of Emacs.</p>",
        "id": 519848577,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747923740
    },
    {
        "content": "<p>Node.js should also work, but is also single-threaded at its core.</p>",
        "id": 519848932,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747923830
    },
    {
        "content": "<p>(But that'd be fine because the main objective is to relieve Emacs.)</p>",
        "id": 519849321,
        "sender_full_name": "Mekeor Melire",
        "timestamp": 1747923925
    },
    {
        "content": "<p>it's possible, but personaly I have not felt that having emacs be the process in the middle made it slower in any noticeable way. I see the advantage of doing it directly in Lean, but if performance is not an issue at first, then I would prefer to stick with Emacs</p>",
        "id": 519849388,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1747923942
    },
    {
        "content": "<p>Has anybody made such a process in the middle since this conversation?</p>",
        "id": 527361124,
        "sender_full_name": "Luke Naylor",
        "timestamp": 1751823329
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"935191\">@Luke Naylor</span> what would be your use case for it? (to see if I could help)</p>",
        "id": 527361667,
        "sender_full_name": "Lua Viana Reis",
        "timestamp": 1751823968
    }
]