[
    {
        "content": "<p>It seems PRs to the repository <a href=\"https://github.com/mo271/FormalBook\">https://github.com/mo271/FormalBook</a> trigger a request to sign a Google CLA. This surprised me because the project readme also says:</p>\n<blockquote>\n<p>This project is not an official Google project. It is not supported by Google and Google specifically disclaims all warranties as to its quality, merchantability, or fitness for a particular purpose.</p>\n</blockquote>\n<p>So then why is the CLA needed? The <code>CONTRIBUTING.md</code> says \"this simply gives us permission to use and redistribute your contributions as part of the project\" - I thought the Apache 2.0 license would be sufficient for this?</p>\n<p>I am asking because the Google CLA page also says \"A Google account is required to sign the CLA.\" I do not use a Google account and this might be a reason for me not to contribute.</p>",
        "id": 481974103,
        "sender_full_name": "Malvin Gattinger",
        "timestamp": 1731424976
    },
    {
        "content": "<p>Hi, thanks for your question! I'm not a layer, and not quite sure why the CLA is needed, I just followed what I thought was my company's policy when open sourcing this repo. Let me double check if it is really needed or if it is possible to obtain an exception, so that you might still be able to contribute even if you do not use a Google account.</p>",
        "id": 481977479,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1731425781
    },
    {
        "content": "<p>(This will probably take at least a day to figure out, right now pushing changes to a fork of this repo are not affected by the CLA bot)</p>",
        "id": 481979203,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1731426238
    },
    {
        "content": "<p>Update: I'm working on this and it looks like the CLA will not be needed anymore soon.</p>",
        "id": 483300831,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1732032875
    },
    {
        "content": "<p>I'm happy to report signing the CLA is no longer needed!</p>",
        "id": 483422201,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1732088671
    }
]