[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"687698\">@Chris Henson</span>, jumping back here from Github. Thanks for your assistance there!</p>\n<p>I think the thing that I had been missing was that I had been assuming (incorrectly) that CsLib was continuously updating to Mathlib master, and so the change from <code>v4.27.0-rc1</code> to <code>v4.27.0</code> would be trivial.</p>\n<p>If we're not doing that, then we need a more complicated staging mechanism than just using <code>nightly-testing</code>, or it won't be possible to ever move CsLib onto stable toolchains (because <code>nightly-testing</code> will contain the fixes needed to advance the Mathlib dependency, but <em>also</em> the changes for the forthcoming release candidate).</p>",
        "id": 569838713,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1769233478
    },
    {
        "content": "<p>I wonder if we could instead maintain both a </p>\n<ul>\n<li><code>mathlib-testing</code> branch, which continuously runs <code>lake update</code>, depending on Mathlib master, but stays on whatever toolchain Mathlib master is on.</li>\n<li><code>nightly-testing</code> branch, as currently, which depends on Mathlib's <code>nightly-testing</code> and both runs <code>lake update</code> and advances the toolchain to each new nightly.</li>\n</ul>",
        "id": 569838847,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1769233578
    },
    {
        "content": "<p>I think all changes that every land on <code>mathlib-testing</code> would then also be wanted on <code>nightly-testing</code> (but not conversely).</p>",
        "id": 569838864,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1769233599
    },
    {
        "content": "<p>Then when it is time to move CsLib from <code>v4.X.0-rcK</code> to <code>v4.X.0</code>, we would include whatever changes are on <code>mathlib-testing</code>.</p>\n<p>and when it was time to move from <code>v4.X.0</code> to <code>v4.X+1.0-rc1</code>, we would include whatever changes are on <code>nightly-testing</code>.</p>",
        "id": 569838923,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1769233655
    },
    {
        "content": "<p>No problem! There is some learning curve to having a Mathlib dependency in the release process it seems. Hopefully the lessons learned here can benefit others.</p>\n<p>Your description above makes sense, but do you have a preference/opinion on if we <em>should</em> move to just updating Mathlib master continuously? I guess the setup for that would be</p>\n<ul>\n<li>an equivalent of <code>update_dependencies.yml</code> makes PRs to the <code>main</code> branch doing <code>lake update</code></li>\n<li>when there are Mathlib deprecations, etc. we fix them in these PRs</li>\n<li><code>nightly-testing</code> would remain the same, and you'd expect it to be broken until the above PRs are merged</li>\n</ul>\n<p>The primary difference seems to be how fast-moving our <code>main</code> branch is in tracking Mathlib. Past this I'm not sure that from the maintainer perspective that I have a strong preference, so long as I'm able to still quickly fix these issues as they come along. If a bot opens these PRs I can push to them and approve, I just don't want to lose the autonomy I have with being able to push directly to <code>nightly-testing</code>.</p>",
        "id": 569841968,
        "sender_full_name": "Chris Henson",
        "timestamp": 1769236675
    },
    {
        "content": "<p>I don't want to be prescriptive to downstream repos here, but my preference is that when there is capacity to do so repos keep up with Mathlib master more closely.</p>",
        "id": 569848299,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1769243671
    },
    {
        "content": "<p>I tend to agree. We'll end up tracking Mathlib one way or another, so it seems easier to not pollute <code>nightly-testing</code> with these changes. If there are no objections, my plan will be after the <code>v4.28.0-rc1</code> bump to:</p>\n<ul>\n<li>unpin the Mathlib revision in our lakefile</li>\n<li>start closely tracking Mathlib master, with <code>lake update</code> PRs making adaptations as needed </li>\n<li>automate creating these PRs in the near future (in the meantime <code>nightly-testing</code> will still signal when they are required)</li>\n</ul>",
        "id": 569849506,
        "sender_full_name": "Chris Henson",
        "timestamp": 1769244706
    },
    {
        "content": "<p>(and hopefully this will make your process easier too!)</p>",
        "id": 569849603,
        "sender_full_name": "Chris Henson",
        "timestamp": 1769244769
    },
    {
        "content": "<p>I have opened <a href=\"https://github.com/leanprover/cslib/pull/293\">cslib#293</a> unpinning the Mathlib revision. I don't think this breaks any of the CI assumptions? I think they all are based on the nightly lakefile, which remains unchanged.</p>",
        "id": 570201370,
        "sender_full_name": "Chris Henson",
        "timestamp": 1769467110
    },
    {
        "content": "<p>Anything that ordinary users of cslib needs to pay attention to?</p>",
        "id": 570201484,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1769467165
    },
    {
        "content": "<p>No, I don't think you should notice any difference. It is pretty much just a change in the process for me and Kim. We will track Mathlib more closely, so maybe a bit less churn with issues like transitive imports we were discussing in the other thread.</p>",
        "id": 570202107,
        "sender_full_name": "Chris Henson",
        "timestamp": 1769467478
    },
    {
        "content": "<p>I fixed the PR link above, sorry. I also opened issue <a href=\"https://github.com/leanprover/cslib/pull/294\">cslib#294</a> for a workflow to automate <code>lake update</code> PRs. (If anyone is itching to do CI work, feel free to claim it!)</p>",
        "id": 570204220,
        "sender_full_name": "Chris Henson",
        "timestamp": 1769468503
    },
    {
        "content": "<p>The first lake update PR is up at <a href=\"https://github.com/leanprover/cslib/pull/313\">cslib#313</a>. <span class=\"user-mention\" data-user-id=\"929508\">@Fabrizio Montesi</span> if you can prioritize reviewing these it will help keep nightly testing smooth. (I'll soon make a workflow to help too)</p>",
        "id": 571567792,
        "sender_full_name": "Chris Henson",
        "timestamp": 1770091898
    },
    {
        "content": "<p><code>lake update</code> for 2026-02-06: <a href=\"https://github.com/leanprover/cslib/pull/326\">cslib#326</a></p>",
        "id": 572479943,
        "sender_full_name": "Chris Henson",
        "timestamp": 1770421503
    }
]