[
    {
        "content": "<p>I'm happy to announce the new CSLib channel.  This channel will host discussion regarding the emerging CSLib effort, an initiative to formalize undergraduate Computer Science in Lean.  An introduction to the effort will be held via Google Meet on at <time datetime=\"2025-07-02T15:00:00Z\">2025-07-02T08:00:00-07:00</time> .  All are welcome to join.  The meeting info is below.</p>",
        "id": 526702494,
        "sender_full_name": "Clark Barrett",
        "timestamp": 1751417614
    },
    {
        "content": "<p>Are you familiar with existing efforts and previous discussions on this topic?</p>",
        "id": 526702542,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1751417651
    },
    {
        "content": "<p>Video call link: <a href=\"https://meet.google.com/hut-zidv-mcu\">https://meet.google.com/hut-zidv-mcu</a></p>",
        "id": 526702605,
        "sender_full_name": "Clark Barrett",
        "timestamp": 1751417700
    },
    {
        "content": "<p>I think there are quite a few threads and now active repositories on this topic. We should probably link them in here as references.</p>",
        "id": 526702654,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1751417736
    },
    {
        "content": "<p>Yes, we are interested in unifying these efforts.  Our effort is supported by Amazon, DeepMind and LeanFRO.  But it is just getting started, so we need lots of volunteers.  That's part of what tomorrow's meeting is about.</p>",
        "id": 526702757,
        "sender_full_name": "Clark Barrett",
        "timestamp": 1751417812
    },
    {
        "content": "<p>Okay. In that case I propose that we at least discuss one basic question: Whether it even makes sense to have a unified CS library. There is such a wide gulf between different areas of CS that needs bridging. </p>\n<p>I am doing my PhD working with algorithms theorists. Even within algorithms theory, the notion of a sequential algorithm is not very well defined, especially once we start talking about models. I have been writing my thoughts (and privately some incomplete code on some algol like language) based on the notion that all algorithms are queries + combinators in disguise and at some level that is what the average STOC/FOCS/SODA theorist actually works with and counts for complexity purposes. So we need a combinator inductive type parametrised by a query type with mechanisms for WF recursion to prove termination. It unifies a lot of models of computation, including impractical ones using real numbers.</p>\n<p>In the European TCS community there is a clear line between so called Track A and Track B theorists as seen at conferences like ICALP and ESA. Likewise, Distributed algorithms folks and distributed systems folks mostly work on very different models with some overlap. There is an ongoing project here on this server, just to clearly define some of the distributed algorithms models and relations between them</p>",
        "id": 526703637,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1751418482
    },
    {
        "content": "<p>We have a well-defined subset we are going to start with.  And we are building a DSL for describing computation. Please come to the meeting if you'd like to know more!</p>",
        "id": 526703801,
        "sender_full_name": "Clark Barrett",
        "timestamp": 1751418619
    },
    {
        "content": "<p>I'm excited to see this, and will stay up late for the meeting. :-) </p>\n<p>I hope we can design it from the ground up so that <code>grind</code> deals with as much boring stuff as possible! I'll be happy to help on that front.</p>\n<p>At the FRO we're also thinking about a refresh of our cross-repository testing infrastructure, and we'd very much like to include CSLib in whatever we do next here, to make sure that changes in Lean have only positive effects on the project!</p>\n<p>I'm really looking forward to seeing the roadmap and scope for CSLib.</p>",
        "id": 526704731,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1751419354
    },
    {
        "content": "<p>Having just taught undergrad algorithms, I'm looking forward to seeing where this goes!</p>\n<p>Can't make the meeting (5 am my time), but I will look at the minutes/summary/roadmap</p>",
        "id": 526712719,
        "sender_full_name": "David J. Webb",
        "timestamp": 1751426277
    },
    {
        "content": "<p>There will be many people who have similar time zone issues or will be otherwise engaged. Could we have a recording of the meeting posted here?</p>",
        "id": 526739781,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1751442604
    },
    {
        "content": "<p>We will record the meeting, and there will be another meeting next Wednesday at the same time.</p>",
        "id": 526761947,
        "sender_full_name": "Swarat Chaudhuri",
        "timestamp": 1751449751
    },
    {
        "content": "<p>CSLib Discussion: July 2, 2025</p>\n<p>Please put your questions about the CSLib effort in this document. We will try to respond to all questions, some verbally during the meeting and some in written form offline.</p>\n<p><a href=\"https://docs.google.com/document/d/1d0mwj3IMC4ucYjHaD5glpEIQhJ4YhnWsl8nyQL_jYHo/edit?pli=1&amp;tab=t.0#heading=h.elxu16sem8xl\">https://docs.google.com/document/d/1d0mwj3IMC4ucYjHaD5glpEIQhJ4YhnWsl8nyQL_jYHo/edit?pli=1&amp;tab=t.0#heading=h.elxu16sem8xl</a></p>",
        "id": 526828109,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1751469850
    },
    {
        "content": "<p>Links to slides</p>\n<p><a href=\"https://docs.google.com/presentation/d/1aJFM3EaI4LcppHR_2YFQHiBjUfMMhMKxCeM3BfINi48/edit?slide=id.g34fce84c8b2_0_3#slide=id.g34fce84c8b2_0_3\">https://docs.google.com/presentation/d/1aJFM3EaI4LcppHR_2YFQHiBjUfMMhMKxCeM3BfINi48/edit?slide=id.g34fce84c8b2_0_3#slide=id.g34fce84c8b2_0_3</a></p>",
        "id": 526828885,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1751470061
    },
    {
        "content": "<p>Is there published information about the application procedure for PIs to apply for the two funded positions? EDIT: I am asking so that I can forward it to people in the algorithms theory research community who might be interested.</p>",
        "id": 526869825,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1751485745
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/channel/513188-CSLib/topic/Announcing.20CSLib/near/526869825\">said</a>:</p>\n<blockquote>\n<p>Is there published information about the application procedure for PIs to apply for the two funded position?</p>\n</blockquote>\n<p>Making this information available is a top priority.  Stay tuned.</p>",
        "id": 526875768,
        "sender_full_name": "Clark Barrett",
        "timestamp": 1751488717
    },
    {
        "content": "<p>I just heard about this, so unfortunately missed the google meeting. This is very cool! </p>\n<p>Looking forward to learning more about this as more information become available. One quick comment about Boole (sorry if this is covered in the meeting): If we are to go through the trouble of adopting a DSL, I really hope that it doesn't stop at complexity/resource usage, and can in principle be extended to reason about all real-world effects of programs, such as input/output and networking. </p>\n<p>If one were to adopt the worldview of <a href=\"https://arxiv.org/pdf/2405.06624\">Guaranteed Safe AI</a>, we need to build world models as part of safe AI systems. I see complexity/resource usage as one part of a larger world model. Boole has the potential of becoming such a world model for computer programs, if it can be made general enough.</p>",
        "id": 526893269,
        "sender_full_name": "GasStationManager",
        "timestamp": 1751498782
    },
    {
        "content": "<blockquote>\n<p>Boole is a language in the Amazon MIDI family</p>\n</blockquote>\n<p>Is there more information available about Boole or the MIDI family? Google was not helpful...</p>",
        "id": 526933342,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1751527886
    },
    {
        "content": "<p>As I understood, Amazon MIDI is currently internal, and to be released by the end of the month, while Boole is yet-to-be-defined</p>",
        "id": 526934750,
        "sender_full_name": "Ayhon",
        "timestamp": 1751528420
    },
    {
        "content": "<p>But wait for someone else to confirm before concluding Im right</p>",
        "id": 526934866,
        "sender_full_name": "Ayhon",
        "timestamp": 1751528469
    },
    {
        "content": "<p>Yes - that is correct.  So unfortunately, you'll have to wait for the Amazon release to get your hands on MIDI and Boole.</p>",
        "id": 527004231,
        "sender_full_name": "Clark Barrett",
        "timestamp": 1751551243
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"934082\">@Clark Barrett</span> is there an ETA for that?</p>",
        "id": 527022269,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1751555791
    },
    {
        "content": "<p>I see it's in the slides:</p>\n<blockquote>\n<p>Early August: Definition of initial version of Boole</p>\n</blockquote>",
        "id": 527023059,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1751556025
    },
    {
        "content": "<p>A good chunk of \"complexity\" is only reasonably describable in terms of I/O and side-effect laden behavior. Streaming algorithms, query complexity, and communication complexity, for instance, all require some kind of \"request more input\". (Randomized algorithms can be done without this, but I think are most natural if you can \"request a random bit\".)</p>\n<p>I think this makes a good case that, even if this was entirely about \"undergrad complexity theory\", it would need to extend beyond just the \"internal\" metrics of time and space usage.</p>",
        "id": 527053017,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1751567071
    },
    {
        "content": "<p>My impression is that this project doesn’t care about such models, although these might very well appear in an upper undergrad course depending on the university. The notion of “undergrad curriculum” in CS is incredibly broad and diverse.</p>",
        "id": 527064325,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1751572353
    },
    {
        "content": "<p>My impression was, rather than it doesn't care, that it's not their priority for now, but that they'd be interested in supporting this through dialects of Boole</p>",
        "id": 527064571,
        "sender_full_name": "Ayhon",
        "timestamp": 1751572489
    },
    {
        "content": "<p>Nothing presented so far suggests support for user specified complexity models even in the sequential realm. If one needs dialects for every model then I am not optimistic about them being covered anytime soon.</p>",
        "id": 527065432,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1751572903
    },
    {
        "content": "<p>This is fine since there are entirely too many models to fit into one box. Meanwhile projects outside this library are bound to continue chugging along perfectly fine by themselves (including mine). So it is fine if this library doesn’t cover all models. A diversity of efforts is good  for the community.</p>",
        "id": 527066011,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1751573189
    },
    {
        "content": "<p>The second iteration of our CSLib discussion is happening shortly: <time datetime=\"2025-07-09T15:00:00Z\">2025-07-09T08:00:00-07:00</time>.  This will be a repeat of last week's presentation for those who missed it.  The link is: <a href=\"https://meet.google.com/xgn-efnm-czp?hs=224\">https://meet.google.com/xgn-efnm-czp?hs=224</a></p>",
        "id": 527893459,
        "sender_full_name": "Clark Barrett",
        "timestamp": 1752068990
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"934082\">Clark Barrett</span> <a href=\"#narrow/channel/513188-CSLib/topic/Announcing.20CSLib/near/527893459\">said</a>:</p>\n<blockquote>\n<p>The second iteration of our CSLib discussion is happening shortly: <time datetime=\"2025-07-09T15:00:00Z\">2025-07-09T08:00:00-07:00</time>.  This will be a repeat of last week's presentation for those who missed it.  The link is: <a href=\"https://meet.google.com/xgn-efnm-czp?hs=224\">https://meet.google.com/xgn-efnm-czp?hs=224</a></p>\n</blockquote>\n<p>Are these meetings recorded by any chance?</p>",
        "id": 529260225,
        "sender_full_name": "Paulo Matos",
        "timestamp": 1752752581
    },
    {
        "content": "<p>Is there a link to the recordings of these meetings?</p>",
        "id": 544329799,
        "sender_full_name": "Pieter Cuijpers",
        "timestamp": 1760197065
    },
    {
        "content": "<p>Hi Pieter,,as far as I know, no recordings.</p>",
        "id": 544823973,
        "sender_full_name": "Alexandre Rademaker",
        "timestamp": 1760470717
    }
]