[
    {
        "content": "<p>Pasting a question I asked which couldn't be answered due to time constraints:</p>\n<blockquote>\n<p>Since the algorithms will be represented as Lean data (terms of a <code>Boole</code> type?) and not Lean definitions, how will theorems be proven? Will Boole have to reimplement the mechanics that Lean has in order to introspect on the body of functions to prove its own theorems (not Lean theorems)?</p>\n</blockquote>",
        "id": 526836863,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1751472490
    },
    {
        "content": "<p>My understanding (without any context beyond the slides and discussion) is that we would end up with something like <code>def mergeSort : Boole (List α → List α)</code>, and then the theorem about correctness would be something about <code>mergeSort.eval l : List α</code></p>",
        "id": 526856979,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1751480239
    },
    {
        "content": "<p>Why <code>Boole (List a - &gt; List a) </code> over <code>List a - &gt; Boole (List a) </code>?</p>",
        "id": 526859299,
        "sender_full_name": "Ayhon",
        "timestamp": 1751481117
    },
    {
        "content": "<p>I know this is all still hypothetical, but thats what I thought about first</p>",
        "id": 526859380,
        "sender_full_name": "Ayhon",
        "timestamp": 1751481158
    },
    {
        "content": "<p>Ayhon, the latter option you wrote would mean \"a Lean function which takes a List, and gives you a Boole function <code>genList()</code> with no arguments which produces a list\".</p>\n<p>In terms of reasoning about correctness (it produces a sorted permutation) that would work, but it omits everything about computation time or memory: the \"outer\" Lean function could rely on anything, be exponential time, or even on undecidable statements - and spit out an O(1) \"sorting algorithm\" that returns an appropriate constant. </p>\n<p>By wrapping the whole thing in Boole, you start to talk about the whole process.</p>",
        "id": 526864123,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1751483133
    },
    {
        "content": "<p>Hmm, so then Boole in this context is literally the semantic function, which translates the algorithm to a <code>List a - &gt; List a</code>? Or more so, the <code>Boole.eval</code> is that function</p>",
        "id": 526866593,
        "sender_full_name": "Ayhon",
        "timestamp": 1751484189
    },
    {
        "content": "<p>This feels like denotational semanrics, I think?</p>",
        "id": 526866702,
        "sender_full_name": "Ayhon",
        "timestamp": 1751484251
    },
    {
        "content": "<p>I believe the answers to these questions will become clearer once we have the initial release of Amazon's MIDI language framework - goal is end of this month.</p>",
        "id": 526876072,
        "sender_full_name": "Clark Barrett",
        "timestamp": 1751488889
    }
]