[
    {
        "content": "<p>With <a href=\"https://github.com/leanprover-community/mathlib4/pull/30313\">#30313</a> merged, there is a small bit of work in bumping to the new toolchain for the lambda calculus directory. I can handle this since I'm familiar. (And in general, I'm happy to do these PRs for incrementing the toolchain)</p>\n<p>I'd also like to include the new <code>mergeWithGrind</code> linter as I mentioned in <a href=\"https://github.com/leanprover/cslib/pull/95\">cslib#95</a>, any objections?</p>",
        "id": 544701030,
        "sender_full_name": "Chris Henson",
        "timestamp": 1760434477
    },
    {
        "content": "<p>My preference is actually that I do the toolchain bumps myself (as part of the bigger release process: it is <em>much</em> easier if one person can pull this off in one sitting, without having to coordinate).</p>\n<p>This means that prior to the release, it's very helpful if CSLib <code>main</code> is already using a sufficiently recent version of Mathlib (because the release process will run <code>lake update</code>). </p>\n<p>And similarly, if prior to the release of release candidates, any changes needed are already present on the nightly-testing branch. (But as I discovered today, the nightly-testing infrastructure wasn't actually working --- so we'll all learn this process together next month. :-)</p>",
        "id": 544721060,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1760440821
    },
    {
        "content": "<p>Okay, sorry for the hassle. It also doesn't help that my Mathib PR was just merged before the release. We had been updating Mathlib alongside toolchain updates, your preference is to be more frequent than this?</p>\n<p>I have pushed the changes I had staged and the build is passing CI. There is an error in the linting action though, not sure what that is from. I tried updating to the commit Mathlib is using, but that didn't help.</p>",
        "id": 544724373,
        "sender_full_name": "Chris Henson",
        "timestamp": 1760441728
    },
    {
        "content": "<p>Ideally, a <code>lake update</code> PR could happen (at least) shortly before release day. Usually release day is the 14th or 15th of each month. To date I've only been coordinating that date internally at the FRO, but I don't mind announcing it more publicly too!</p>",
        "id": 544729443,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1760443258
    },
    {
        "content": "<p>That sounds reasonable. I will plan to do a <code>lake update</code> a day or two before that then. And if we do have a situation like this month where code is moving from CSLib to Mathlib, I will be more cognizant of where that falls relative to the upcoming release so you aren't waiting on us.</p>\n<p>(And thank you again for your patience this morning! I am glad I happen to be up early by a fluke...)</p>",
        "id": 544731124,
        "sender_full_name": "Chris Henson",
        "timestamp": 1760443718
    }
]