[
    {
        "content": "<p>I am very happy to hear that my suggestion was helpful.</p>\n<p>I am coincidentally interested in similar topics: in the short term, turning STLC into a category, and in the long term, extending properties such as strong normalization to other systems.</p>\n<p>If you plan to push your work on the strong normalization property, it would be very helpful for my work.</p>",
        "id": 574275254,
        "sender_full_name": "Sehun Kim",
        "timestamp": 1771330074
    },
    {
        "content": "<p>Do you mean the categorical semantics for STLC? I've worked on this a lot myself, but there are some technical issues that I think make formalization difficult. I'd be interested to see your approach.</p>",
        "id": 574279347,
        "sender_full_name": "Chris Henson",
        "timestamp": 1771331620
    },
    {
        "content": "<p>(Maybe I will move this to a new thread if we'd like to discuss this more, just to keep the conversation organized)</p>",
        "id": 574279511,
        "sender_full_name": "Chris Henson",
        "timestamp": 1771331675
    },
    {
        "content": "<p>Unfortunately, I do not have much to show right now because I am starting from scratch. However, I hope to be able to contribute to CSlib in the near future.</p>",
        "id": 574283240,
        "sender_full_name": "Sehun Kim",
        "timestamp": 1771332897
    },
    {
        "content": "<p>4 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"513188\" href=\"/#narrow/channel/513188-CSLib/topic/Strong.20norm.20for.20Stlc/with/574195284\">#CSLib &gt; Strong norm for Stlc</a> by <span class=\"user-mention silent\" data-user-id=\"687698\">Chris Henson</span>.</p>",
        "id": 574294091,
        "sender_full_name": "Notification Bot",
        "timestamp": 1771336058
    },
    {
        "content": "<p>I went ahead and moved these messages. Can I ask which references you're looking at? Even for STLC there are a couple of approaches that look a bit different formally. I think it'd be good to discuss a bit beforehand so we don't duplicate each other's work, but it's great to hear others are interested in this.</p>",
        "id": 574295471,
        "sender_full_name": "Chris Henson",
        "timestamp": 1771336448
    },
    {
        "content": "<p>Since I am looking for STLC as a part of the other project, It was appeared as a lemma, but if you want specify for STLC,<br>\n<a href=\"https://www.paultaylor.eu/stable/prot.pdf\">https://www.paultaylor.eu/stable/prot.pdf</a><br>\nwould be my main source.<br>\nFor showing strictly normalizing of other systems, I am following the source <br>\n<a href=\"https://www.irit.fr/~Ralph.Matthes/dissertation/matthesdiss.pdf\">https://www.irit.fr/~Ralph.Matthes/dissertation/matthesdiss.pdf</a><br>\nThe reason why I am interested in this topic is because I am interested in CHAD(Combinatory Homomorphic Automatic Differentiation), So one day I hope to formalize this article.<br>\n<a href=\"https://arxiv.org/abs/2007.05283\">https://arxiv.org/abs/2007.05283</a></p>",
        "id": 574301548,
        "sender_full_name": "Sehun Kim",
        "timestamp": 1771337977
    },
    {
        "content": "<p>But they are now just in consideration.</p>",
        "id": 574302854,
        "sender_full_name": "Sehun Kim",
        "timestamp": 1771338278
    },
    {
        "content": "<p>When I talk about there being different approaches to categorical semantics of STLC, I mean that one could be referring to:</p>\n<ul>\n<li>The most familiar thing people mean: STLC extended with unit and product types, where both contexts and types are mapped to categorical products, see <a href=\"https://www.cl.cam.ac.uk/teaching/1617/L108/catl-notes.pdf\">these notes</a> which summarize Crole's book</li>\n<li>STLC <em>without</em> these extensions, which requires an approach like fibered category theory, see the first chapters of <a href=\"https://people.mpi-sws.org/~dreyer/courses/catlogic/jacobs.pdf\">Categorical Logic and Type Theory</a></li>\n<li>Any of the above, but instead using multicategories which are in some sense more natural</li>\n<li>Categorical semantics of normalization, see <a href=\"https://www.repository.cam.ac.uk/items/dac7b590-eea5-4afc-853d-0822147bba6e\">this thesis</a> and its references</li>\n</ul>\n<p>All of these are welcome in CSLib, but I think there are various technical difficulties in formalization. I came to the conclusion that it might be easiest if we have an intrinsically typed formalization of STLC to avoid some universe issues, but hadn't added this to CSLib yet.</p>",
        "id": 574307996,
        "sender_full_name": "Chris Henson",
        "timestamp": 1771339459
    },
    {
        "content": "<p>Would you mind explaining what 'intrinsically typed' means?</p>",
        "id": 574310610,
        "sender_full_name": "Sehun Kim",
        "timestamp": 1771340090
    },
    {
        "content": "<p>In the currently locally nameless formalization for instance, we first define untyped terms and types as data (not in <code>Prop</code>) then define a proposition that given a context and term we have a given typing derivation. This is extrinsic. For various reasons, this is nice to do in Lean for an idiomatic formalization that makes use of tactics.</p>\n<p>In contrast, we could define a single inductive type that captures all of this, but is no longer a proposition. This is intrinsic typing. For universe reasons, I think this is easier to use with categorical semantics, but not what we really want elsewhere. (It is non-trivial to scale this formalization style to more complicated type systems.)</p>",
        "id": 574313086,
        "sender_full_name": "Chris Henson",
        "timestamp": 1771340643
    },
    {
        "content": "<p>I see what you mean. Initially, I thought it would be straightforward to formalize this in an extrinsic setting, as it is in CSlib, but I did not anticipate that universe issues might arise.</p>\n<p>Since I only needed it as an intermediary result, I had not examined it very deeply at first. However, because it is required for my subsequent work, I would like to ask whether there is any way I could help or contribute to this effort.</p>",
        "id": 574316971,
        "sender_full_name": "Sehun Kim",
        "timestamp": 1771341591
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"878228\">Sehun Kim</span> <a href=\"#narrow/channel/513188-CSLib/topic/Categorical.20Semantics/near/574316971\">said</a>:</p>\n<blockquote>\n<p>However, because it is required for my subsequent work, I would like to ask whether there is any way I could help or contribute to this effort.</p>\n</blockquote>\n<p>Yes, please feel free to work on this. We can definitely collaborate on what exactly ends up in CSLib. I'm still not sure precisely what you're aiming to formalize as an intermediate result, so it would help to revisit this once you have gotten further.</p>",
        "id": 574332364,
        "sender_full_name": "Chris Henson",
        "timestamp": 1771345362
    }
]