[
    {
        "content": "<p>I have a couple of students who may want to make small (relatively beginner) CSLib contributions over the next few months. I was thinking I could have them contribute a couple of sorting algorithms (e.g., insertion sort), and associated time complexity proofs, in the style of the merge sort example. Would that kind of thing be accepted as a contribution (assuming I worked with the students to make sure everything was styled and set up correctly)?</p>",
        "id": 576163617,
        "sender_full_name": "Harry Goldstein",
        "timestamp": 1772158294
    },
    {
        "content": "<p>I think there are at least 4 PRs that contribute insertionSort in some form, so probably another one is not that helpful a contribution</p>",
        "id": 576164859,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1772159334
    },
    {
        "content": "<p>I'm not sure I've seen one for bubble sort anyway though</p>",
        "id": 576164891,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1772159358
    },
    {
        "content": "<p>Oh I see. I had looked through the issues but not the PRs. Fair enough. I can look for other sorting algorithms and similar CS 1 or CS 2 style algorithms. Also happy to take suggestions for other things that seem relatively easy but that no one currently has the appetite to tackle.</p>",
        "id": 576165167,
        "sender_full_name": "Harry Goldstein",
        "timestamp": 1772159541
    },
    {
        "content": "<p>Perhaps it would be interesting to formalize some non-comparison sort algorithms like radix sort.</p>",
        "id": 576172054,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1772164160
    },
    {
        "content": "<p>Yes, I unfortunately don't think the issues have much at the moment that is great for beginners. Many of them are me leaving a paper trail of technical chores. I think it would be fine to work on some sorting algorithm other than insertion sort.</p>",
        "id": 576172166,
        "sender_full_name": "Chris Henson",
        "timestamp": 1772164225
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"686704\">@Harry Goldstein</span> : I’d like to see a binary search algorithm for lists on top of the <code>Prog</code> model in  PR <a href=\"https://github.com/leanprover/cslib/pull/372\">cslib#372</a>. It can use the ListSearch model.</p>",
        "id": 576186313,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1772172557
    },
    {
        "content": "<p>It’s not too difficult, but still hard enough for new students learning lean.</p>",
        "id": 576186379,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1772172600
    },
    {
        "content": "<p>I’d also recommend quicksort, though in this case I would also suggest using a model similar to SortOpsCmp, but using Vectors, and changing the cmpLT query to compare an argument against a given index of the vector.</p>",
        "id": 576186772,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1772172859
    },
    {
        "content": "<p>So that’s slightly harder and requires students to think about what is being counted carefully.</p>",
        "id": 576186830,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1772172892
    },
    {
        "content": "<p>I would even suggest selection sort on Vectors. That should be much simpler than quicksort</p>",
        "id": 576188543,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1772174015
    }
]