[
    {
        "content": "<p>Hi!</p>\n<p>As a means to learn both Lean and Denotational Semantics, I've started to read the book \"The Formal Semantics of Programming Languages\" (Glynn Winskel, 1993) and translate all its concepts to Lean. It's on <a href=\"https://github.com/juanjomadrigal/denotational-lean\">https://github.com/juanjomadrigal/denotational-lean</a> ; I plan to upload some content every few days.</p>\n<p>I have little experience with Lean so I'm sure it is terribly un-idiomatic and with lots of things to improve. Any feedback will be much appreciated <span aria-label=\"pray\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"pray\">:pray:</span> </p>\n<p>If after having much more content and after polishing etc. there is something that is useful as a formalized theory that can be contributed, that would be great.</p>\n<p>Thank you!</p>",
        "id": 545584957,
        "sender_full_name": "Juanjo Madrigal",
        "timestamp": 1760712203
    },
    {
        "content": "<p>Mathlib has some elements of denotational semantics including Scott continuous functions and a lot of the lattice theory that goes into denotational semantics. You might want to explore what you could add to that</p>",
        "id": 545587129,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1760712735
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"965137\">@Juanjo Madrigal</span>! We definitely will have denotational semantics of various forms at some point. Winskel starts without binding, so this is probably a suitable place to start since you say you are new to both denotational semantics and Lean. Some of the semantics functions in chapter 5 may require a few tweaks to express them formally. One suggestion is to use one of the Mathlib developments on maps like <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=AList#doc\">docs#AList</a>.</p>\n<p>Regarding the direction Shreyas is indicating, I would point you towards <a href=\"https://github.com/tomdjong/MGS-domain-theory?tab=readme-ov-file#links-to-the-notes\">these notes</a> for later. I would like to have this in CSLib as well, but it is a bit more involved. I'd like to set up our well-scoped infrastructure before doing this.</p>",
        "id": 545891736,
        "sender_full_name": "Chris Henson",
        "timestamp": 1760942737
    },
    {
        "content": "<p>Great!! That's very interesting (and these notes look really nice). Thank you both for your comments <span aria-label=\"raised hands\" class=\"emoji emoji-1f64c\" role=\"img\" title=\"raised hands\">:raised_hands:</span></p>\n<p><span class=\"user-mention\" data-user-id=\"466334\">@Shreyas Srinivas</span> , you mean <a href=\"https://leanprover-community.github.io/con-nf/doc/Mathlib/Order/ScottContinuity.html\">https://leanprover-community.github.io/con-nf/doc/Mathlib/Order/ScottContinuity.html</a> , right?</p>\n<p>Also, for improving my Lean code and receiving feedback, perhaps should I post it in <code>general/new_members</code>? Or do you recommend any other way?</p>",
        "id": 545912008,
        "sender_full_name": "Juanjo Madrigal",
        "timestamp": 1760949467
    },
    {
        "content": "<p>Yes, and there is <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=OmegaCompletePartialOrder#doc\">docs#OmegaCompletePartialOrder</a>. For various reasons, you might find it a bit difficult to work with if you're just learning Lean, but definitely something to look at. </p>\n<p>If there is something CS-specific, maybe post in the computer science channel, otherwise new members is fine.</p>",
        "id": 545916115,
        "sender_full_name": "Chris Henson",
        "timestamp": 1760950617
    },
    {
        "content": "<p>I would be happy to help in formalizing the notes you attached. I've studied a bit of domain theory. I'm unfamiliar with the \"well scoped infrastructure\", could you elaborate? <span class=\"user-mention\" data-user-id=\"687698\">@Chris Henson</span></p>",
        "id": 553486362,
        "sender_full_name": "Tanner Duve",
        "timestamp": 1762206346
    },
    {
        "content": "<p>I mean well-scoped de Bruijn indices, where the type of terms is indexed by the number of free variables in scope. I'd like to have a PR this month giving an example for simple types so that further developments have a template to work from.</p>",
        "id": 553488752,
        "sender_full_name": "Chris Henson",
        "timestamp": 1762207321
    },
    {
        "content": "<p>The formalization of the book goes on well: first five chapters <span aria-label=\"partying face\" class=\"emoji emoji-1f973\" role=\"img\" title=\"partying face\">:partying_face:</span> starting with Hoare rules</p>\n<p>I'm not using the tools in <code>Mathlib/Order</code>; I'm essentially making everything I need to better grasp all the concepts. At the end I will adapt everything to Mathlib, and I hope I have then enough context in the subject to see whether there is something valuable to adapt for CSLib.</p>\n<p>In the meanwhile, any advice to improvement is welcome :)</p>",
        "id": 560644439,
        "sender_full_name": "Juanjo Madrigal",
        "timestamp": 1764263909
    },
    {
        "content": "<p>For Hoare logic you might want to look at <a href=\"http://std.do\">std.do</a> and loom.</p>",
        "id": 560733098,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1764319964
    }
]