[
    {
        "content": "<p>In <a href=\"#narrow/channel/287929-mathlib4/topic/can't.20.60lake.20update.60/near/546525052\">#mathlib4 &gt; can't &#96;lake update&#96; @ 💬</a> it is suggested that the current best practice for documentation is to use <a href=\"https://github.com/leanprover-community/docgen-action\">leanprover-community/docgen-action</a>. I'd like to do this for a few reasons:</p>\n<ul>\n<li>it standardizes the documentation build, which currently sets up and builds everything by hand</li>\n<li>it eliminates the current hassle of checking that the docs toolchain is synced, something people have to remember and a CI annoyance</li>\n<li>it puts the documentation workflow in a more standard place (it is currently in the old organization), preferably built on commits to <code>main</code> rather than on a cron basis</li>\n</ul>\n<p>I can't think of any problems off the top of my head, am I missing any tradeoffs? There is a small point of figuring out where it will deploy to, that's all I could think of.</p>",
        "id": 546552511,
        "sender_full_name": "Chris Henson",
        "timestamp": 1761167836
    },
    {
        "content": "<p>Can we just patch this maybe? <a href=\"https://github.com/cs-lean/cs-lean.github.io/blob/main/.github/workflows/update-cslib-docs.yaml\">https://github.com/cs-lean/cs-lean.github.io/blob/main/.github/workflows/update-cslib-docs.yaml</a></p>",
        "id": 546654268,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1761218883
    },
    {
        "content": "<p>We can certainly make changes incrementally there, like making it use the action first. Long-term though, I think it would be best for it to be in our organization/repo.</p>",
        "id": 546665772,
        "sender_full_name": "Chris Henson",
        "timestamp": 1761222175
    },
    {
        "content": "<p>Ah, definitely. It's in the plans of the SG as well, but we gotta find a place. We'll probably look at this again after we finish a webpage for cslib</p>",
        "id": 546808638,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1761280724
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"929508\">@Fabrizio Montesi</span> The documentation workflow is no longer running because GitHub by default disabled it after 60 days of inactivity in the old repo. You can probably make a trivial commit or retrigger manually for now, but I am partial to us getting <a href=\"https://github.com/leanprover/cslib/pull/128\">cslib#128</a> merged.</p>",
        "id": 553793546,
        "sender_full_name": "Chris Henson",
        "timestamp": 1762332070
    },
    {
        "content": "<p>My preference would be to merge that, using the default location for GitHub pages which would now be tied to the <code>leanprover/cslib</code> repo, then figure out the domain you suggested later. We can have the old url (<a href=\"https://cs-lean.github.io/\">https://cs-lean.github.io/</a>) redirect for compatibility, but it is better IMO to go ahead and do this now rather than have to keep one isolated workflow in an unaffiliated repo.</p>",
        "id": 553794805,
        "sender_full_name": "Chris Henson",
        "timestamp": 1762332471
    },
    {
        "content": "<p>Thanks for noticing, I was wondering why it wasn't updating yesterday! <span class=\"user-mention\" data-user-id=\"121542\">@Alexandre Rademaker</span> is working on that repo to make a website for cslib, which will include the API documentation. It'll all be available at <a href=\"http://cs-lean.github.io\">cs-lean.github.io</a> for now, we'll then move it somewhere else in the future.</p>",
        "id": 553801482,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1762334418
    },
    {
        "content": "<p>No problem. I don't check the docs that often, it's actually been a couple of weeks...</p>\n<p>I'm not sure I've conveyed well what I'm requesting above. I am asking that the documentation should be built, regardless of where it is deployed now or eventually to an external site, in a workflow that lives in <code>leanprover/cslib</code>. This preempts problems like this and generally simplifies CI, and this is something we can do now. Does that seem reasonable?</p>",
        "id": 553804235,
        "sender_full_name": "Chris Henson",
        "timestamp": 1762335103
    },
    {
        "content": "<p>You mean adding a check that docs <em>can</em> be built in our CI? If so, YES PLEASE! :-)</p>",
        "id": 553820228,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1762339625
    },
    {
        "content": "<p>I mean that they are built in our CI, and then distributed to wherever you would like.</p>",
        "id": 553820411,
        "sender_full_name": "Chris Henson",
        "timestamp": 1762339679
    },
    {
        "content": "<p>How would they be distributed?</p>",
        "id": 553820481,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1762339695
    },
    {
        "content": "<p>commit to a remote repo of the built doc files?</p>",
        "id": 553820523,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1762339707
    },
    {
        "content": "<p>GitHub pages even support custom domains, they could just live in <code>leanprover/cslib</code>'s GitHub pages. If they really need to be sent somewhere else, there are actions to send artifacts.</p>",
        "id": 553822544,
        "sender_full_name": "Chris Henson",
        "timestamp": 1762340252
    },
    {
        "content": "<p>I just do not want to have documentation builds spread across different repos. It is a recipe for confusion.</p>",
        "id": 553822764,
        "sender_full_name": "Chris Henson",
        "timestamp": 1762340316
    },
    {
        "content": "<p>ah yes, sure. <span class=\"user-mention\" data-user-id=\"121542\">@Alexandre Rademaker</span> let's look into this after we're done with v1 of the website. It is good to centralise where we build stuff from the cslib repo.</p>",
        "id": 553822798,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1762340328
    },
    {
        "content": "<p>Okay, thanks! Whatever short term fix is probably fine (if you make a commit in the old repo I guess that buys two months, though I still vote for trying <a href=\"https://github.com/leanprover/cslib/pull/128\">cslib#128</a> as it won't hurt anything), and we'll just keep this in mind for later. Once upon a time I did DevOps work, it seems I have unwittingly found a use for that knowledge again...</p>",
        "id": 553824087,
        "sender_full_name": "Chris Henson",
        "timestamp": 1762340683
    },
    {
        "content": "<p>This has been merged and the first deployment was successful! Thanks again to <span class=\"user-mention\" data-user-id=\"754512\">@Jesse Alama</span> for taking up this PR. It is great to have folks proactively make and address GitHub issues.</p>\n<p>The docs now appear at <a href=\"https://leanprover.github.io/cslib/docs/\">https://leanprover.github.io/cslib/docs/</a>. <span class=\"user-mention\" data-user-id=\"121542\">@Alexandre Rademaker</span> can you update the website to use this link?</p>",
        "id": 558224572,
        "sender_full_name": "Chris Henson",
        "timestamp": 1763563926
    }
]