[
    {
        "content": "<p>Hi folks,</p>\n<p>This effort is very exciting! Especially hearing that non-standard (non-safety) properties like complexity are now in scope. I have myself worked on liveness properties with the goal of unifying Hoare Logic and Temporal Logic in a general structural way---our logic Ticl from OOPSLA '25 <a href=\"https://arxiv.org/abs/2410.14906\">https://arxiv.org/abs/2410.14906</a> is a start. I am currently working on porting Ticl to Lean, and I think it can be useful in CSLib as it connects a lot of nodes in the library. </p>\n<p>Should I be using <a href=\"https://github.com/alexkeizer/QpfTypes\">https://github.com/alexkeizer/QpfTypes</a> which seems to be in beta mode?<br>\nFor bisimulation for example, which appears in your arxiv paper, how should one take the greatest fixpoint? Do you plan to merge Qpf in Lean, or is there some other recommended way to support coinductive relations? And more generally, do you see work on making coinduction more usuable like coq-coinduction (<a href=\"https://perso.ens-lyon.fr/damien.pous/cawu/\">https://perso.ens-lyon.fr/damien.pous/cawu/</a>) and Ticl also landing in CSLib or is it out of scope?</p>",
        "id": 575435296,
        "sender_full_name": "Lef Ioannidis",
        "timestamp": 1771897478
    },
    {
        "content": "<p>Hi! I think that this is definitely in-scope for CSLib, but we have to think a bit about the encoding of coinduction. </p>\n<p>I think that supporting QPFTypes as a dependency would be a bit difficult given its current disclaimer of being \"not at all ready for serious use\". Are you familiar with the work at <a class=\"stream-topic\" data-stream-id=\"270676\" href=\"/#narrow/channel/270676-lean4/topic/Core.20support.20for.20coinductive.20predicates/with/575308767\">#lean4 &gt; Core support for coinductive predicates</a> that is now released? I am not an expert in what this supports, but In his <a href=\"https://researchseminars.org/talk/LT2026/31/\">Lean Together talk</a> I recall <span class=\"user-mention\" data-user-id=\"644702\">@Wojciech Różowski</span> mentioning applications to CSLib. This was released slightly after the work on bisimulation (cc <span class=\"user-mention\" data-user-id=\"929508\">@Fabrizio Montesi</span>), automata, etc. talked about in the arXiv paper, but I and some others have discussed using this in CSLib.</p>",
        "id": 575592578,
        "sender_full_name": "Chris Henson",
        "timestamp": 1771951302
    },
    {
        "content": "<p>I see <span class=\"user-mention\" data-user-id=\"644702\">@Wojciech Różowski</span> as the way to go for many things, once it's cooked enough for what we have. Maybe it's cooked enough for some things already?</p>",
        "id": 575605669,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1771954902
    },
    {
        "content": "<p>One thing I plan to do after my vacation is to see whether there is any applications of coinductive predicates in <code>ωSequence</code> and <code>ωLanguage</code>.  But at first glance Lean's coinduction seems to work only on predicates, not on general data types.  So there doesn't seem to be a direct way to use it to define (for example) infinite sequences or operations on infinite sequences (like <code>ωSequence.flatten</code>).</p>",
        "id": 575619017,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1771959130
    },
    {
        "content": "<p>I was wondering how <span class=\"user-mention\" data-user-id=\"644702\">@Wojciech Różowski</span> ‘s PR correlates to the  FixedPoints.gfp definition in CompleteLattice, which includes the Knaster-Tarsky lemma. As far I understand we are still far from support  for codata like stream, except by the Qpf extension. This also seems to be in  scope for CSLib (ω sequences and traces for LTL), and something worthwhile to work on.</p>",
        "id": 575628249,
        "sender_full_name": "Lef Ioannidis",
        "timestamp": 1771962398
    }
]