[
    {
        "content": "<p>Hello all. I am a student in IIT Gandhinagar, I am currently trying to form a group of people interested in programming languages and formal verification, and one of the things we'd be interested in contributing to CSLib.</p>\n<p>The background of this group is primarily undergrad students, many of whom might themselves be getting familiar with Theoretical CS through this project. Before we start working on a PR, I want to ask if there are any specific recommendations you may have, or if there are any specific theorems/areas that the project might like for the PR to cover.</p>",
        "id": 539638105,
        "sender_full_name": "Sati",
        "timestamp": 1757966259
    },
    {
        "content": "<p>We are busy laying some groundwork.  We hope to have a call for participation/contributions soon.  Stay tuned!</p>",
        "id": 539906329,
        "sender_full_name": "Clark Barrett",
        "timestamp": 1758064851
    },
    {
        "content": "<p>I see I see. Good to know!</p>",
        "id": 539932524,
        "sender_full_name": "Sati",
        "timestamp": 1758087552
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"934082\">Clark Barrett</span> <a href=\"#narrow/channel/513188-CSLib/topic/Inquiry.20about.20Desirable.20PR/near/539906329\">said</a>:</p>\n<blockquote>\n<p>We are busy laying some groundwork.  We hope to have a call for participation/contributions soon.  Stay tuned!</p>\n</blockquote>\n<p>Out of curiosity, is there any expected range for the date for the call for contributions? I saw discussion about Boole looking to be developed by August, but as far as I understand, that hasn't happen? I hope I'm not misunderstanding anything.</p>",
        "id": 541342077,
        "sender_full_name": "Sati",
        "timestamp": 1758754765
    },
    {
        "content": "<p>Fair critique.  I'm afraid that early August was unrealistically optimistic.  We are working on something now and hope to have something to share soon!</p>",
        "id": 541460033,
        "sender_full_name": "Clark Barrett",
        "timestamp": 1758807321
    }
]