[
    {
        "content": "<p>I am about a half dozen <code>sorry</code> away from proving type safety for a locally nameless System F with subtyping. I should have a PR ready in a week or so and I'll post here when it's ready. (I am especially excited to showcase how well <code>grind</code> works)</p>\n<p>Along with this are some lemmas that should eventually be added to <code>Mathlib.Data.List.Sigma</code>. I propose we follow the convention from other projects and add a top level <code>ForMathlib</code> directory where we stage things we intend to upstream. Does this sound good to everyone?</p>",
        "id": 540382453,
        "sender_full_name": "Chris Henson",
        "timestamp": 1758263707
    },
    {
        "content": "<p>Could I encourage limiting how much ends up in For Mathlib? It's a trade-off between moving quickly, and risking material getting stuck/abandoned there. </p>\n<p>What about one of the following:</p>\n<ul>\n<li>It's okay during review, but needs to be PRd into mathlib <em>before</em> merging. </li>\n<li>Don't merge any PRs by authors who have files in ForMathlib from <em>previous</em> PRs that don't have corresponding open PRs at Mathlib?</li>\n</ul>\n<p>The problem is, sadly, that someone has to do this work, and <code>ForMathlib</code> can easily become a repository of wishful thinking that someone else will do it. :-)</p>\n<p>I appreciate that many projects do it, but I hope Cslib can err on the more responsible side here!</p>",
        "id": 540410572,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1758273829
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"687698\">@Chris Henson</span> sounds like great work. How does your work compare to the POPLmark?<br>\n<a href=\"https://www.seas.upenn.edu/~plclub/poplmark/\">https://www.seas.upenn.edu/~plclub/poplmark/</a></p>",
        "id": 540445196,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1758285460
    },
    {
        "content": "<p>I second <span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span>'s opinion. <code>ForMathlib</code> sounds nice, but it will likely become a great source of technical debt. I suggest we just put whatever theorems we like elsewhere in <code>Foundations</code> and let the mathlib people know that there is cool stuff in there every now and then (through PRs and/or discussions in this Zulip, for example).<br>\nBut I wouldn't 'leak' project management in the repo's structure.</p>",
        "id": 540445671,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1758285602
    },
    {
        "content": "<p>(For System F, GREAT! :))</p>",
        "id": 540445705,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1758285612
    },
    {
        "content": "<p>For example, we have some stuff in <code>Foundations.Data.Relation</code>that would make sense for mathlib.</p>",
        "id": 540446216,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1758285797
    },
    {
        "content": "<p>Okay, sounds like the consensus is there's a technical debt danger. So maybe we keep it decentralized and either add a comment or open an issue as a reminder.</p>",
        "id": 540448204,
        "sender_full_name": "Chris Henson",
        "timestamp": 1758286340
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"259452\">Bas Spitters</span> <a href=\"#narrow/channel/513188-CSLib/topic/Locally.20nameless.20System.20F.20and.20ForMathlib.20directory/near/540445196\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"687698\">Chris Henson</span> sounds like great work. How does your work compare to the POPLmark?<br>\n<a href=\"https://www.seas.upenn.edu/~plclub/poplmark/\">https://www.seas.upenn.edu/~plclub/poplmark/</a></p>\n</blockquote>\n<p>Thanks! I closely follow Arthur Charguéraud's locally nameless solution linked there.</p>",
        "id": 540450121,
        "sender_full_name": "Chris Henson",
        "timestamp": 1758286860
    },
    {
        "content": "<p>In particular, porting this has been a good case study in comparing <code>grind</code> to Rocq's eauto/eapply. I'm still refining annotations, but currently <code>grind</code> will sometimes infer a bit more, sometimes a bit less. At this point it's roughly comparable in length overall, but I think I can shave it down to be a bit smaller. (While still being careful to not over-annotate in a way that's misleading or hurts performance).</p>",
        "id": 540452833,
        "sender_full_name": "Chris Henson",
        "timestamp": 1758287659
    },
    {
        "content": "<p>Yes, it would be interesting to have a careful comparison. It will hopefully give ideas on how to improve the automation on both sides.</p>\n<p>In case you get bored ;-) <br>\n<a href=\"https://poplmark-reloaded.github.io/\">https://poplmark-reloaded.github.io/</a></p>",
        "id": 540503928,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1758302882
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"259452\">Bas Spitters</span> <a href=\"#narrow/channel/513188-CSLib/topic/Locally.20nameless.20System.20F.20and.20ForMathlib.20directory/near/540503928\">said</a>:</p>\n<blockquote>\n<p>In case you get bored ;-) <br>\n<a href=\"https://poplmark-reloaded.github.io/\">https://poplmark-reloaded.github.io/</a></p>\n</blockquote>\n<p>Yes, this is on my todo list :) I was thinking (mostly for the sake of simplicity) of first trying strong normalization/logical relations when I get around to doing well-scoped de Bruijn indices.</p>",
        "id": 540509374,
        "sender_full_name": "Chris Henson",
        "timestamp": 1758304910
    },
    {
        "content": "<p>Regarding logical relations it would be nice to explore the gluing approach. I believe I've seen a formalization of it, but I cannot directly find it now...<br>\n<a href=\"https://drops.dagstuhl.de/storage/00lipics/lipics-vol131-fscd2019/LIPIcs.FSCD.2019.25/LIPIcs.FSCD.2019.25.pdf\">https://drops.dagstuhl.de/storage/00lipics/lipics-vol131-fscd2019/LIPIcs.FSCD.2019.25/LIPIcs.FSCD.2019.25.pdf</a></p>",
        "id": 540639982,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1758441246
    },
    {
        "content": "<p>I agree, this would be great! <a href=\"https://arxiv.org/abs/2505.07780\">This paper</a> discusses a Rocq formalization of the categorical NbE cited above, but I'm not sure the code is public yet.</p>\n<p>In general, I have been working on formalizing categorical semantics in Lean for some time, but had some difficulties. For instance even in formalizing semantics of simple types following Crole, two things are difficult formally:</p>\n<ul>\n<li>In Lean, it is likely more idiomatic to have typing derivations in Prop, while morphisms must be in Type. You can ULift, but it's awkward.</li>\n<li>If your lambda calculus has contexts and types that are not definitionally equal types, you end up needing <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.eqToHom#doc\">docs#CategoryTheory.eqToHom</a> (though you can sometimes get away with defining their interpretations in terms of each other and avoid this).  </li>\n</ul>\n<p>I also tried formalizing CwFs a while back. As they mention in the paper you linked, the term-level definitions require casting of the type-level definitions. Not impossible, but I wasn't sure how usable what I ended up with was.</p>",
        "id": 540668622,
        "sender_full_name": "Chris Henson",
        "timestamp": 1758472357
    },
    {
        "content": "<p>Oh yes, that paper was on my reading list. It would be interesting to see how much of that could be done in Lean. I guess it might work with sufficient use of \"Computable\".</p>\n<p>The universe problem can perhaps be avoided if Lean adopt's the new algebraic universes which are making their way into Rocq...</p>\n<p>I guess there are CwFs/natural models in HoTT-lean, aren't there?</p>",
        "id": 540778531,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1758541457
    },
    {
        "content": "<p>Okay the PR <a href=\"https://github.com/leanprover/cslib/pull/68\">cslib#68</a> is open! I'd like to again highlight the extensive use of <code>grind</code> here: </p>\n<ul>\n<li>This is just over a 40% LOC reduction from the Rocq formalization I was following, which already made extensive use of eapply, eauto, etc. </li>\n<li>Working with contexts is done by augmenting Mathlib's <code>List.Sigma</code> with <code>grind</code> annotations. I found I only needed a small handful of additional lemmas.</li>\n<li>This formalization continues to use the <a href=\"https://cs-lean.github.io/Cslib/Foundations/Data/HasFresh.html#freeUnion\">free_union</a> tactic, which allows you to extensibility select variables free from existing contexts, terms, etc. which <code>grind</code> can then work with. Note that this tactic is very general, and is <em>not</em> specialized at all to this formalization or even lambda calculi.</li>\n</ul>\n<p><span class=\"user-mention\" data-user-id=\"929508\">@Fabrizio Montesi</span>  I realize this is a bit of a large PR, I will try to be better about that in the future! The docs/boilerplate make it seem longer than it really is. I think it'd have been more awkward to do it in pieces while I was working through the <code>grind</code> automation.</p>",
        "id": 541192475,
        "sender_full_name": "Chris Henson",
        "timestamp": 1758709078
    },
    {
        "content": "<p>Wonderful!! I'll start going through it.</p>",
        "id": 541197709,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1758710855
    },
    {
        "content": "<p>How's this related to <a href=\"https://github.com/leanprover/cslib/pull/28\">https://github.com/leanprover/cslib/pull/28</a> ?</p>",
        "id": 541199942,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1758711588
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"929508\">Fabrizio Montesi</span> <a href=\"#narrow/channel/513188-CSLib/topic/Locally.20nameless.20System.20F.20and.20ForMathlib.20directory/near/541199942\">said</a>:</p>\n<blockquote>\n<p>How's this related to <a href=\"https://github.com/leanprover/cslib/pull/28\">https://github.com/leanprover/cslib/pull/28</a> ?</p>\n</blockquote>\n<p>That PR uses well-scoped de Bruijn indices (similar to the style of Austosubst2), so would begin a separate directory at the level of <code>LambdaCalculus/Named</code> and <code>LambdaCalculus/LocallyNameless</code>. I do want to add that formalization, but would like to first do well-scoped STLC to make sure we get the design correct.</p>",
        "id": 541202164,
        "sender_full_name": "Chris Henson",
        "timestamp": 1758712313
    },
    {
        "content": "<p>In my mind these are the three most prominent choices of formalizing binding: explicit names, well-scoped, and locally nameless. As we've discussed previously, I think it would be great to have all three and some equivalence proofs.</p>",
        "id": 541203422,
        "sender_full_name": "Chris Henson",
        "timestamp": 1758712730
    }
]