[
    {
        "content": "<p>Hi. I have been working on formalising Barrington's theorem in Lean. Here is the repository:<br>\n<a href=\"https://github.com/AnvitAggarwal/barrington-theorem-lean\">https://github.com/AnvitAggarwal/barrington-theorem-lean</a></p>\n<p>I posted on the CSLib group a few months ago:<br>\n<a href=\"#narrow/channel/513188-CSLib/topic/Formalisation.20of.20Barrington's.20Theorem/with/548137132\">https://leanprover.zulipchat.com/#narrow/channel/513188-CSLib/topic/Formalisation.20of.20Barrington's.20Theorem/with/548137132</a><br>\nand I have tried to incorporate the feedback from that discussion. The main takeaways were:</p>\n<ol>\n<li>Reduce the usage of <code>simp</code> and split longer proofs. </li>\n<li>Change the definition of <code>Formula</code> to remove the fixed basis.</li>\n<li>Generalise some proofs (e.g. using <code>Sym → G</code> instead of <code>Perm (Fin n)</code> and <code>Bool</code>).</li>\n<li>Prove Barrington’s theorem for branching programs, not only for group programs.</li>\n</ol>\n<p>I am currently working on removing the fixed basis and have updated my definition of <code>Formula</code>.<br>\nTo prove Barrington’s theorem for a general basis, my current plan is:</p>\n<ol>\n<li>Prove it for OR gates,</li>\n<li>Use this to show that <code>{AND, OR, NOT}</code> are functionally complete,</li>\n<li>Extend the proof to a general basis using this.</li>\n</ol>\n<p>I would like to ask two things:</p>\n<ol>\n<li>Does this approach seem reasonable?</li>\n<li>More importantly, I would like to define a <em>minimal</em> version of this development that would be acceptable for merging into CSLib, before pursuing further generalisations. What would you consider <strong>must-have</strong> for such a mergeable version, and what would be <strong>nice-to-have</strong> or suitable for later work?</li>\n</ol>",
        "id": 570187753,
        "sender_full_name": "Anvit Aggarwal",
        "timestamp": 1769460913
    },
    {
        "content": "<p>Any suggestions would be appreciated. Thanks!</p>",
        "id": 570242905,
        "sender_full_name": "Anvit Aggarwal",
        "timestamp": 1769495498
    },
    {
        "content": "<p>To make this question easier to answer, let me make it more concrete.<br>\nBarrington's theorem states that:<br>\n\"Every Boolean function computable by a polynomial-size, logarithmic-depth Boolean formula can be computed by a width-5 polynomial-size branching program.\"<br>\nHere's a <a href=\"https://www.ccs.neu.edu/home/viola/classes/gems-08/lectures/le11.pdf\">handout</a> I have been referring to.<br>\nCurrently, I have defined Formula for a general basis but proved Barrington's theorem only for group programs and not branching programs, and only for the {AND, NOT} basis, and not a general basis. While I plan to define and prove Barrington's theorem for branching programs as well along with a general basis, I wanted to ask whether the current version might be an acceptable first version to get it merged to CSLib.</p>",
        "id": 570343784,
        "sender_full_name": "Anvit Aggarwal",
        "timestamp": 1769526105
    },
    {
        "content": "<p>I am not sure exactly how the group program aspect interacts, but I know that <span class=\"user-mention\" data-user-id=\"448405\">@Alex Meiburg</span> mentioned at <a class=\"message-link\" href=\"/#narrow/channel/513188-CSLib/topic/Parity.20is.20not.20in.20AC0/near/570128310\">#CSLib &gt; Parity is not in AC0 @ 💬</a> that he's also been working in this area and reached some form of Barrington's theorem. His definitions seem like a fairly general base that may take a bit of time to get PR'd before we are ready for Barrington.</p>",
        "id": 570349999,
        "sender_full_name": "Chris Henson",
        "timestamp": 1769527512
    }
]