[
    {
        "content": "<p>The following announcement went out this morning by email to the <a href=\"https://groups.google.com/a/lean-fro.org/g/cslib-announce\">cslib-announce</a> list as well as to a long list of people who have expressed interest.  I wanted to share it also here and encourage folks to join the cslib-announce list if you aren't on it already.</p>\n<p>Dear colleagues,</p>\n<p>We are pleased to announce the official launch of CSLib, an open-source effort to formalize computer science in the Lean 4 theorem prover. CSLib is inspired by the impact of the Mathlib project in mathematics and aims to do something similar for computer science. CSLib is broadly organized into two pillars. Pillar one involves formalizing essential computer science concepts in Lean, and pillar two involves building infrastructure in Lean for reasoning about real-world code. We expect the two pillars to inform and build off of each other. We also hope that CSLib will play an important role in advancing neurosymbolic approaches that connect modern AI with formal and symbolic reasoning.</p>\n<p>We invite computer science researchers, practitioners, and enthusiasts to learn more and consider getting involved. The main CSLib website is: <a href=\"http://cslib.io/\">cslib.io</a>.  To learn more about the big picture and vision of the project, you can read the CSLib <a href=\"https://arxiv.org/abs/2602.04846\">white paper</a>.  And for concrete suggestions on how to get involved, please see the <a href=\"https://github.com/leanprover/cslib/blob/main/CONTRIBUTING.md\">CONTRIBUTING</a> document in the GitHub repository.</p>\n<p>We are excited about the possibilities that this project will provide for building infrastructure, collaborations and community. We also appreciate your patience with the inevitable growing pains that a big new project like this faces. We look forward to working together with many of you to make this vision a reality.</p>\n<p>Best Regards,</p>\n<p>The CSLib Steering Committee</p>\n<p>Clark Barrett, Stanford University and Amazon Scholar<br>\nSwarat Chaudhuri, Google DeepMind and UT Austin<br>\nFabrizio Montesi, FORM and DIAS, University of Southern Denmark<br>\nJim Grundy, Amazon<br>\nPushmeet Kohli, Google DeepMind<br>\nLeo deMoura, Amazon and Lean FRO</p>",
        "id": 575028078,
        "sender_full_name": "Clark Barrett",
        "timestamp": 1771621589
    },
    {
        "content": "<p>Can you clarify the role of the Google group as opposed to this Zulip channel? Where do you expect the main collaboration to happen?</p>",
        "id": 575031051,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1771623063
    },
    {
        "content": "<p>I do not speak for the Steering Committee, but I don't think it was meant to imply anything about not using Zulip for collaboration. The contributing guidelines link you here to the Zulip.</p>",
        "id": 575034176,
        "sender_full_name": "Chris Henson",
        "timestamp": 1771624659
    },
    {
        "content": "<p>The Google group is a low traffic occasional announcements list for people who aren't monitoring Zulip.</p>",
        "id": 575037227,
        "sender_full_name": "Clark Barrett",
        "timestamp": 1771626252
    },
    {
        "content": "<p>Congratulations on the launch, just read the paper, exciting!</p>",
        "id": 575115149,
        "sender_full_name": "Nadim Farhat",
        "timestamp": 1771709973
    }
]