[
    {
        "content": "<p>Creating a topic to discuss efforts on process calculi.</p>",
        "id": 543885653,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1759994100
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"563058\">@Pieter Cuijpers</span> I think recruiting students to work on process calculi/algebra sounds great. A few pointers:</p>\n<ul>\n<li>We do have an LTS module, see <a href=\"https://cs-lean.github.io/Cslib/Foundations/Semantics/LTS/Basic.html\">https://cs-lean.github.io/Cslib/Foundations/Semantics/LTS/Basic.html</a>. It has the signature you expect (<code>State → Label → State → Prop</code>). Theory of nondeterministic automata extends LTS.</li>\n<li>In the same directory you'll find several definitions of equivalences and proofs about them. I've basically formalised most of the key concepts in Sangiorgi's 'Introduction to Bisimulation and Coinduction'.</li>\n<li>We have CCS (as given in Sangiorgi2011) formalised in <a href=\"https://cs-lean.github.io/Cslib/Languages/CCS/Basic.html\">https://cs-lean.github.io/Cslib/Languages/CCS/Basic.html</a>, with a proof that bisimilarity is a congruence.</li>\n</ul>",
        "id": 543886212,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1759994273
    },
    {
        "content": "<p>On ongoing work: I have a student who's formalising the Curry-Howard isomorphism between the (right variant of the) internal pi-calculus and classical linear logic.</p>",
        "id": 543886340,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1759994324
    },
    {
        "content": "<p>Yes, looking into the CCS work and the LTS definitions as we speak.<br>\nMy roots are more ACP style, and I was thinking of steps towards formalizing a book like Handbook of Process Algebra (probably too ambitious). The CCS &amp; bisim as a congruence is probably a good place to start for some of my students. (Still have to see how many I can get interested, though).</p>\n<p>I have some \"starting questions\" about LTS, but I'll start a new topic for that.</p>",
        "id": 544328554,
        "sender_full_name": "Pieter Cuijpers",
        "timestamp": 1760195831
    }
]