[
    {
        "content": "<p>I'd like to discuss unbundling relations from <a href=\"https://api.cslib.io/docs/Cslib/Foundations/Semantics/ReductionSystem/Basic.html#Cslib.ReductionSystem\">Cslib.ReductionSystem</a>. Here are my thoughts:</p>\n<ul>\n<li>This is one of the oldest definitions first used by <span class=\"user-mention\" data-user-id=\"929508\">@Fabrizio Montesi</span> and I at the very beginning of the library. I'm a bit fuzzy on if we talked it over much, but I think I agreed with this design at the time because I thought it might become an abstraction barrier similar to <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Digraph#doc\">docs#Digraph</a> or <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=SimpleGraph#doc\">docs#SimpleGraph</a> that also bundle relations</li>\n<li>In practice however, this is tightly coupled with <code>Mathlib.Logic.Relation</code>, <code>Cslib.Foundations.Data.Relation</code>, and even core. At the moment there is a growing amount of duplication from these modules. I have enforced that anything added here should directly correspond to the unbundled version definitionally, but this is still burdensome.</li>\n<li>Especially because there is notation involved, it is confusing when there are gaps in this duplicated API. In general, the ergonomics are frustrating.</li>\n</ul>\n<p>As far as I can tell, there are no advantages to this bundling. I propose that we remove <code>ReductionSystem</code> entirely and refactor the <code>reduction_sys</code> attribute to just directly make notation for the relation it annotates. This change doesn't seem overly difficult and I think has the end result of simplifying the experience of working with reductions to the usual theorems about relations.</p>",
        "id": 571888430,
        "sender_full_name": "Chris Henson",
        "timestamp": 1770205911
    },
    {
        "content": "<p>This makes sense, generally speaking. How would things like MRed or the equivalent of LTS.OmegaExecution look like?<br>\nMaking it easy to access derived motions was one of the main motivations, iirc.</p>",
        "id": 572056032,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1770264844
    },
    {
        "content": "<p><code>MRed</code> will still be the reflexive transitive closure and use the same notation, just directly with the relation instead of paramaterized by the bundled structure. I think this will make it easier to work with because you don't have to keep in mind the bundling.</p>\n<p>Can you point out <code>LTS.OmegaExecution</code>? I'm not seeing it.</p>",
        "id": 572057439,
        "sender_full_name": "Chris Henson",
        "timestamp": 1770265827
    },
    {
        "content": "<p>Sorry I meant this: <a href=\"https://api.cslib.io/docs/Cslib/Foundations/Semantics/LTS/Basic.html#Cslib.LTS.%CF%89Tr\">https://api.cslib.io/docs/Cslib/Foundations/Semantics/LTS/Basic.html#Cslib.LTS.%CF%89Tr</a></p>",
        "id": 572057835,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1770265988
    },
    {
        "content": "<p>We haven't really needed this much for relations yet, but I don't think the (un)bundling is too relevant here. You can imagine something like <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=wellFounded_iff_isEmpty_descending_chain#doc\">docs#wellFounded_iff_isEmpty_descending_chain</a> restated in terms of <code>ωSequence</code>.</p>",
        "id": 572058257,
        "sender_full_name": "Chris Henson",
        "timestamp": 1770266347
    },
    {
        "content": "<p>That looks fine, but is MRed gonna be an abbrev, or just replaced by ReflTransGen, or..?</p>",
        "id": 572058337,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1770266429
    },
    {
        "content": "<p>The notation currently used for <code>MRed</code> will just expand to <code>ReflTransGen r</code>. There is no need for a separate declaration when unbundled.</p>",
        "id": 572058500,
        "sender_full_name": "Chris Henson",
        "timestamp": 1770266566
    },
    {
        "content": "<p>I think this is preferable because then you just use the usual theorems on relations instead of needing to remember a possibly imperfectly duplicated API.</p>",
        "id": 572058578,
        "sender_full_name": "Chris Henson",
        "timestamp": 1770266638
    },
    {
        "content": "<p>It is definitely preferable, I agree, just trying to think of corner cases.</p>\n<p>Re notation: we don't really have a notation for these relations, only their instances. So theorems about MRed and similar things on general relations won't use the notation. You'd get access to it only in specific developments, e.g., the reduction relation of lambda-calculus.</p>\n<p>The idea sounds fine to me otherwise.</p>",
        "id": 572058832,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1770266832
    },
    {
        "content": "<p>I completely agree, though this is an existing problem. I've thought about defining local notation in <code>Cslib.Foundations.Data.Relation</code>, where we'd mirror the arrows we picked for the paramaterized notations.</p>",
        "id": 572059244,
        "sender_full_name": "Chris Henson",
        "timestamp": 1770267159
    },
    {
        "content": "<p>I have opened <a href=\"https://github.com/leanprover/cslib/pull/320\">cslib#320</a>. This seemed very straightforward and is a <code>+125 -468</code> diff. The only oddity I encountered was a single strange <code>grind</code> failure, but this was very easily solved by calling <code>simp</code> on a hypothesis first.</p>",
        "id": 572092860,
        "sender_full_name": "Chris Henson",
        "timestamp": 1770282276
    }
]