[
    {
        "content": "<p>I know that there have been various projects to do various cryptography related things in Lean in the past - e.g. some of my own work, Joey Lupo's Cryptolib (<a href=\"https://github.com/JoeyLupo/cryptolib/tree/main\">https://github.com/JoeyLupo/cryptolib/tree/main</a>) and more. I think there's also the work of ArkLib (<a href=\"https://github.com/Verified-zkEVM/ArkLib\">https://github.com/Verified-zkEVM/ArkLib</a>).</p>\n<p>I would like to propose that a library in the vein of mathlib or cslib would be desirable, focused on cryptography - both implementing cryptography and proving things about it. Perhaps this project already exists and I'm not aware of it - but I am not aware of it!</p>\n<p>I would like to be involved in such a project but I cannot do it alone - so I would like to ask who IS interested. I think having one repo for cryptography in Lean is desirable compared to many small repos each implementing various things, and having an explictly cryptographic focus is also desirable.</p>\n<p>I think any such repo will <em>probably</em> be downstream of mathlib, cslib but I suppose I am willing to hear arguments to the contrary.</p>",
        "id": 542228122,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1759225172
    },
    {
        "content": "<p>A mathlib dependency would be natural, since I expect you'll have good use for groups and related types, right?<br>\nCslib as well, because we're developing languages/frameworks to write and verify sequential and concurrent software. Combining those with crypto primitives would enable, for example, writing and verifying security protocols. Some of the theory in cslib might help with proving crypto primitives correct, too.<br>\nHave you considered getting this _into_ cslib?</p>",
        "id": 542270658,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1759237513
    },
    {
        "content": "<p>As the main developer of ArkLib, I definitely agree on having a central cryptolib repo. There are a ton of cryptography to be formalized and much work to set things up - our effort on <a href=\"https://github.com/Verified-zkEVM/VCV-io\">VCVio</a> is meant to be the base layer for formalization.</p>\n<p>Happy to talk more over a call or DM</p>",
        "id": 542277523,
        "sender_full_name": "Quang Dao",
        "timestamp": 1759239182
    },
    {
        "content": "<p>It might be that it fits better into CSLib, but my feelings is that the concerns of cryptographers are adjacent to but not the same as those of theoretical computer scientists.</p>",
        "id": 542277782,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1759239235
    },
    {
        "content": "<p>Possibly it might be the case that CSLib makes use of it <em>as</em> a dependency.</p>",
        "id": 542277864,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1759239259
    },
    {
        "content": "<p>My sense is that cryptographers are a distinct enough group (separate conferences, separate preprint website) that we should have a separate cryptolib repo as well</p>",
        "id": 542282280,
        "sender_full_name": "Quang Dao",
        "timestamp": 1759240346
    },
    {
        "content": "<p>I think it'd make good sense, but it'd also be good to keep an eye on what goes where as things develop. For example, some proofs involve defining an operational semantics, which makes cslib or something downstream of it a natural place to carry them out.</p>",
        "id": 542293220,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1759242809
    },
    {
        "content": "<p>I wanna avoid ending up in a circular dependency problem. :-)</p>",
        "id": 542293303,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1759242828
    },
    {
        "content": "<p>Yes definitely.</p>",
        "id": 542431675,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1759306059
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246591\">@Quang Dao</span> who are you aware of who is also doing active work in this area currently?</p>",
        "id": 542431791,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1759306095
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"330967\">@Wrenna Robson</span> I use Rocq to formalise my crypto implementation related to electronic voting. (My main goal is to always extract a computer program from my  formalisation).</p>",
        "id": 542554772,
        "sender_full_name": "Mukesh Tiwari",
        "timestamp": 1759341823
    },
    {
        "content": "<p>Yeah I'm aware of a lot more work in Rocq in these areas (and in custom tools like EasyCrypt).</p>",
        "id": 542556922,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1759342530
    },
    {
        "content": "<p>The people involved in ArkLib are all I know. There are also some work from the Aeneas team.</p>",
        "id": 542627786,
        "sender_full_name": "Quang Dao",
        "timestamp": 1759360133
    },
    {
        "content": "<p>Hi, this seems like the best place to ask about my project! Our first idea for my project was to somehow expand on Joey Lupo's library that <span class=\"user-mention\" data-user-id=\"330967\">@Wrenna Robson</span> mentioned, but from looking at VCVio I get the impression that VCVio already is an expansion of the idea of Joey's cryptolib, so I think it makes more sense to use VCVio instead of porting cryptolib to Lean4.</p>",
        "id": 545787722,
        "sender_full_name": "Kajetan Granops",
        "timestamp": 1760828927
    },
    {
        "content": "<p>Tagging <span class=\"user-mention\" data-user-id=\"319772\">@Devon Tuma</span> who is the main developer of VCVio. We would love to hear what application you have in mind for the library</p>",
        "id": 545830335,
        "sender_full_name": "Quang Dao",
        "timestamp": 1760880751
    },
    {
        "content": "<p>I am personally strongly of the view that it would be desirable to both have good, correct, performant, secure implementations of common cryptographic primitives and protocols in Lean, but also link these to both security proofs and proofs of correctness.</p>",
        "id": 545980464,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1760967313
    },
    {
        "content": "<p>There's quite a lot of prior work in this area in Rocq and in more specialised tools like EasyCrypt and many others.</p>",
        "id": 545980565,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1760967339
    },
    {
        "content": "<p>This is why I think performant implementations are particularly of interest to me.</p>",
        "id": 545980731,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1760967376
    },
    {
        "content": "<p>I don't personally work much with the EasyCrypt/Jasmin stack but I work for François Dupressoir who very much does. Trying to get Cameron, who also works for/with him and has done some work with trying to implement EasyCrypt semantics in lean, to come here and share thoughts.</p>",
        "id": 545980998,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1760967444
    },
    {
        "content": "<p>Definitely, all of this is of interest to me &amp; many others. The path toward such a goal is unclear to me however. On the implementation side, I think we should make use of recent tooling (like LeanMLIR) in addition to copying / adapting Jasmin</p>",
        "id": 546487632,
        "sender_full_name": "Quang Dao",
        "timestamp": 1761146670
    },
    {
        "content": "<p>This is for instance what we are aiming for at ArkLib. At the minimum, have executable spec of SNARK protocols, but moreover, have these spec either be verified to be equivalent to extracted Rust implementation, or, verifiably compile these spec directly to a lower level language (through toolchains like MLIR)</p>",
        "id": 546488703,
        "sender_full_name": "Quang Dao",
        "timestamp": 1761146904
    }
]