[
    {
        "content": "<p>I'm currently trying to work through <a href=\"https://github.com/leanprover/lean4/blob/master/tests/lean/run/doLogicTests.lean\">https://github.com/leanprover/lean4/blob/master/tests/lean/run/doLogicTests.lean</a> (linked from a zulip discussion on proving runtime.) -- but I'm a bit lost, not sure what is going on. I.e. I see we have a imperative Fib impl, and a functional Fib spec, but it's not obvious to me what \"technique\" (besides induction) is used to prove they match up.</p>\n<p>Questions:</p>\n<ol>\n<li>\n<p>Is this <code>std.do</code> the so called <code>Boole</code> language? Or is <code>Boole</code> something else ? If something else, what is <code>Boole</code>? (The only terms more difficult to Google would be <code>True/False</code>).</p>\n</li>\n<li>\n<p>Is there any documentation for this, or is: \"replicate the examples in vscode/lean4, look at compiler errors along the way\" the best way to learn this ?</p>\n</li>\n</ol>\n<p>Thanks!</p>",
        "id": 560877926,
        "sender_full_name": "TongKe Xue",
        "timestamp": 1764387215
    },
    {
        "content": "<p><code>Std.Do</code> and <code>Boole</code> are separate frameworks with overlapping applications. <code>Boole</code> is a dialect made using <a href=\"https://github.com/strata-org/Strata\">Strata</a>, a library for defining languages embedded in Lean. This will in the near future be used in CSLib for verification of imperative programs.</p>",
        "id": 560878529,
        "sender_full_name": "Chris Henson",
        "timestamp": 1764387973
    },
    {
        "content": "<p>Not trolling -- I'm genuinely this clueless -- is Boole publicly available ? Can I install it from a public github repo (compiling from source is fine) ? Are there sample programs (Fibonacci? MergeSort?) written in Boole with proofs ?</p>\n<p>I've heard <code>Boole</code> mentioned a few time in discussions, but I can't find a install link or sample code.</p>\n<p>Thanks!</p>",
        "id": 560879023,
        "sender_full_name": "TongKe Xue",
        "timestamp": 1764388687
    },
    {
        "content": "<p>I think finding examples this early will be difficult, but it is possible already to use <code>Strata</code> as a dependency. There is a \"getting started\" guide there, but I have not tried this out myself.</p>",
        "id": 560881208,
        "sender_full_name": "Chris Henson",
        "timestamp": 1764390936
    },
    {
        "content": "<p>At this point you will probably find it easier to get started with <code>Std.Do</code>, maybe starting from examples posted here on Zulip.</p>",
        "id": 560881331,
        "sender_full_name": "Chris Henson",
        "timestamp": 1764391093
    }
]