[
    {
        "content": "<p>Hello, folks, I already posted about <code>PSBP</code> in the <code>general</code> topic.<br>\nA member of the <code>Lean</code> community suggested me to also post in this <code>computer science</code>topic. </p>\n<p>see<br>\n<a href=\"https://github.com/LucDuponcheelAtGitHub/PSBP\">https://github.com/LucDuponcheelAtGitHub/PSBP</a><br>\nfor code<br>\nsee<br>\n<a href=\"https://github.com/LucDuponcheelAtGitHub/psbpDocumentation\">https://github.com/LucDuponcheelAtGitHub/psbpDocumentation</a><br>\nfor documentation</p>\n<p>You'll have to build the documentation locally yourself as<br>\nexplained in the README.md.</p>\n<p>I am working on a \"<a href=\"http://github.io\">github.io</a>\" site.</p>\n<p>The content is now</p>\n<ol>\n<li>About</li>\n<li>Naming conventions</li>\n<li>Programs versus Computations</li>\n<li>The PSBP library type classes</li>\n<li>fibonacci and factorial</li>\n<li>Laws</li>\n<li>Computation Valued Functions</li>\n<li>Theorems</li>\n<li>ActiveProgram</li>\n<li>ReactiveProgram</li>\n<li>Positional Programming</li>\n<li>Programming With State</li>\n<li>Programming With Failure</li>\n</ol>\n<p>Hopefully the set of interested computer scientists is not empty. <br>\nAll comments are welcome.</p>",
        "id": 536051585,
        "sender_full_name": "Luc Duponcheel",
        "timestamp": 1756136013
    },
    {
        "content": "<p>You may wonder why I do this <code>PSBP</code> (Program Description Based Programming) project. Just like computations (monads) are effectful expression specifications, (what I call) programs are effectful function specifications. 32 years ago I worked on the fundaments of computations and computation transformers at the University of Utrecht. Computations (monads) are mainstream now in many programming language libraries. Now that I am retired, I think that programs are the way to go. <strong>Why?</strong> Well because computations (and expression) are operational artifacts, while programs (and functions) are denotational  artifacts (they have a meaning and can be given a meaningful name). For example, the associativity law of  computations is an operational law (and difficult to remember). The associativity law of  programs is a denotational law (and easy to remember).</p>",
        "id": 536069526,
        "sender_full_name": "Luc Duponcheel",
        "timestamp": 1756141678
    },
    {
        "content": "<p>Hello folks, I decided to document the <code>PSBP</code> library in the <code>README.md</code> file of the <code>PSBP</code> repository itself.  Agreed, a bit more \"low profile\" than other <code>Lean</code> documentation. The documentation is also a kind of course with exercises and solutions. </p>\n<p>Once again, sorry for all my posts, hopefully the set of interested people is not empty. And, once again, all comments are welcome.</p>",
        "id": 537678261,
        "sender_full_name": "Luc Duponcheel",
        "timestamp": 1756994037
    }
]