[
    {
        "content": "<p>As a first experiment with Lean, I created proofs of correctness and amortized running time for various operations on splay trees. I used Claude to create the proofs. Is there any appetite for these proofs in Mathlib.</p>\n<p>Specifically, I've implemented a complete formalization of splay trees for mathlib4:</p>\n<ul>\n<li>6 modules with full proofs (no sorries)</li>\n<li>Amortized O(log n) complexity analysis</li>\n<li>Working set property, dynamic finger theorem</li>\n<li>Branch: <a href=\"https://github.com/derrickburns/mathlib4/tree/splay-mathlib4\">https://github.com/derrickburns/mathlib4/tree/splay-mathlib4</a></li>\n</ul>\n<p>If there is interest, what is the process?</p>",
        "id": 535781899,
        "sender_full_name": "Derrick R Burns",
        "timestamp": 1755924706
    },
    {
        "content": "<p>I haven't looked at everything in detail, but I don't think it proves the dynamic finger theorem.</p>",
        "id": 535797506,
        "sender_full_name": "Yuyang Zhao",
        "timestamp": 1755944846
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"455791\">Yuyang Zhao</span> <a href=\"#narrow/channel/516743-computer-science/topic/Splay.20trees/near/535797506\">said</a>:</p>\n<blockquote>\n<p>I haven't looked at everything in detail, but I don't think it proves the dynamic finger theorem.</p>\n</blockquote>\n<p>Perhaps you are thinking of the open dynamic optimality conjecture?</p>",
        "id": 535819090,
        "sender_full_name": "Derrick R Burns",
        "timestamp": 1755970338
    },
    {
        "content": "<p>I meant that your lean code does not correctly state the dynamic finger theorem (and a lot of other things). Were they written by Claude? LLMs often fail to formalize a definition or statement correctly, and you need to check it yourself.</p>",
        "id": 535857495,
        "sender_full_name": "Yuyang Zhao",
        "timestamp": 1755974791
    },
    {
        "content": "<p>Ah!  Yes this is my first test of Claude for this.  I will check the work! Thank you for this feedback!</p>",
        "id": 535858536,
        "sender_full_name": "Derrick R Burns",
        "timestamp": 1755976069
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"950857\">@Derrick R Burns</span>, you need to clearly label work done largely by LLMs as such, up front. Otherwise you are egregiously wasting other people's time. LLMs <em>can</em> produce both good and useful code. But they usually don't.</p>\n<p>I'm a bit annoyed that I gave you feedback when you first posted about this work and you reposted it without first addressing my feedback. That's really wasting people's time, and just adds to the negative feeling towards AI assisted work.</p>",
        "id": 535868642,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1755991078
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span>  I’m sorry to annoy you. I have likely read more pull requests than most people you know. I have no issue with providing and receiving constructive feedback. I’m particularly kind to newcomers. I suggest you consider doing the same.</p>\n<p>You said that my work was likely out of scope for Mathlib. You said I didn’t use a Mathlib tree.  Perhaps you are annoyed that I did not make changes to use the Mathlib tree?  Or perhaps you are annoyed that I used AI and it produced erroneous statements of theorems that I did not catch?  I can see where this might be annoying.  But consider this...</p>\n<p>Your other advice was to post to the computer science project.  I did.</p>\n<p>I clearly stated in my very first message that the files were produced by Claude:</p>\n<blockquote>\n<p>As a first experiment with Lean, I created proofs of correctness and amortized running time for various operations on splay trees. I used Claude to create the proofs. Is there any appetite for these proofs in Mathlib.</p>\n</blockquote>\n<p>Perhaps you can suggest a more effective way to communicate that.</p>\n<p>I’m trying to learn lean, automated theorem proving, the calculus of inductive constructions,  and to understand the limits of AI, particularly in the area of logical deduction and reasoning.</p>\n<p>I am 61,  an actual former student of Robert Tarjan from 1985 when he first discovered splay trees, and recently retired.  I’m trying to figure out how to engage a new community.  I appreciate all suggestions. My vision is to provide proofs of complexity bounds for his proofs in appreciation of his advocacy for me.  If my time is not valued here, I can find something else to do!</p>\n<p>Alternatively, perhaps we can start over. :)</p>",
        "id": 535873109,
        "sender_full_name": "Derrick R Burns",
        "timestamp": 1755998508
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 535873155,
        "sender_full_name": "Derrick R Burns",
        "timestamp": 1755998577
    },
    {
        "content": "<p>I've loaded <a href=\"http://live.lean-lang.org/#url=https%3A%2F%2Fraw.githubusercontent.com%2Fderrickburns%2Fmathlib4%2Fc3137c429d4d8f1f8dc1caf37cfd922241375f56%2FMathlib%2FData%2FTree%2FSplay%2FBasic.lean\">one of your files into the web editor</a> and I'm seeing errors. Did you attempt to verify that the code type-checked correctly?</p>",
        "id": 535875860,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1756003125
    },
    {
        "content": "<p>I did. Let me try again to confirm. Also, as pointed out earlier, some of the theorems are not correct. Let me fix it. Thx!</p>",
        "id": 535882480,
        "sender_full_name": "Derrick R Burns",
        "timestamp": 1756013610
    },
    {
        "content": "<p>My apologies --- I simply read your message too quickly and missed the reference to Claude. That was clearly sufficient flagging, and I was in error to criticize as quickly as I did.</p>\n<p>In particular, I hope that:</p>\n<blockquote>\n<p>Alternatively, perhaps we can start over. :)</p>\n</blockquote>\n<p>is a good option!</p>",
        "id": 535885067,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756017688
    },
    {
        "content": "<p>(I'm actually quite enthusiastic about the prospects for LLMs to assist in both programming and theorem proving in Lean; indeed somewhat exasperated sometimes about resistance to it, and so when I see what I (in this case mistakenly!) think is someone \"dragging down\" LLMs by failing to explain that they are being used, I can get critical quickly.)</p>",
        "id": 535885073,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756017693
    },
    {
        "content": "<p>Now, that said, my criticism about not using the Mathlib tree is only a small one. But I think interesting to think about in the context of using LLMs to assist new developments. AIs are very prone to \"doing things over again\", and it's easy for them, and its easy for the human driving it to just accept the duplication. This is something that both needs to be addressed in prompting (e.g. when you notice an LLMs duplicating things, update Claude.md to steer it away from doing so!), but also I'm curious how it interacts with the review process. When, as has happened, a reviewer says \"actually, your <code>Tree</code> definition is isomorphic to the existing definition\", can you then turn that into detailed instructions to the LLM about how to refactor the entire development? (e.g. a basic question is: do we define <code>abbrev SplayTree := Tree</code>, and then put functions in that namespace, or do we just add new operations on the existing tree, e.g. <code>Tree.splayInsert</code>; can an LLM help with that question? can it coherently implement a decision on this question?).</p>",
        "id": 535885077,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756017698
    },
    {
        "content": "<p>Getting material into Mathlib or Cslib <em>always</em> requires substantial revision --- and usually the material gets much better along the way. Can LLMs cope with this process? I think an easy pitfall here is that the ridiculous speed of current LLMs means a development can quickly get so big that it becomes expensive to be responsive to review comments that require refactors of the entire corpus. But maybe that expense can be paid off by the speed of the LLM.</p>",
        "id": 535885078,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756017699
    },
    {
        "content": "<p>theorem sequential_access_optimal (xs : List α) (t : Tree α)<br>\n    (h_sorted : xs.Sorted (· &lt; ·)) (h_all : ∀ x ∈ xs, x ∈ t) :<br>\n    ∃ (total_cost : ℝ), total_cost ≤ 3 * xs.length := </p>\n<p>This statement does not seem to capture the cost of the splay tree.  It states that there is a real number at most 3*xs.length.</p>",
        "id": 539888282,
        "sender_full_name": "Sorrachai Yingchareonthawornchai",
        "timestamp": 1758054393
    }
]