[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/7821\">#7821</a> I introduce the notion of \"refinement\" which enables doing diagram chases in general abelian categories. Abstractly, this could be thought as the replacement of an object <code>X</code> in an abelian category <code>C</code> by its yoneda presheaf (maps to <code>X</code>) and then arguing locally for the canonical topology on <code>C</code>: monomorphisms, epimorphisms and exactness in <code>C</code> can be characterized as injectivity, surjective-like, exactness-like properties in terms of maps in <code>C</code>, provided we argue \"up to refinements\", i.e. allow precomposition with epimorphisms. (More details in the docstring of the file introduced in this PR.) This shall be used in my formalization of the snake lemma.</p>",
        "id": 397836078,
        "sender_full_name": "Joël Riou",
        "timestamp": 1697883303
    },
    {
        "content": "<p>Can you please remind me how this differs from pseudo-elements?</p>",
        "id": 397837177,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1697884281
    },
    {
        "content": "<p>The pseudo-elements of <code>X : C</code> that are in mathlib are equivalence classes of morphisms <code>f : A ⟶ X</code>by an equivalence relation. The pseudoelement of <code>X</code> attached to<code>f : A ⟶ X</code>equals the pseudoelement attached to <code>f' : A' ⟶ X</code> iff <code>f</code> and <code>f'</code> have the same image. Forgetting everything but the image of <code>f</code> is forgetting a lot of information, which is why there is no extensionnality property for the pseudo-elements in mathlib (in the sense that a morphism <code>X ⟶ Y</code> is not determined by its action on pseudoelements). In my approach, I do not introduce other types, I phrase everything in terms of morphisms <code>A ⟶ X</code> for a given <code>A</code> (for which equality obviously make sense) and in the proofs we sometimes have to introduce some auxiliary epi <code>A' ⟶ A</code> and precompose with it.<br>\nMorphisms are easier to work with as compared to these pseudoelements because we have the whole category theory library to deal with it, and there are results which I had attempted to prove using the pseudoelements, but fail to do so mainly because of the extensionnality issue.</p>",
        "id": 397841792,
        "sender_full_name": "Joël Riou",
        "timestamp": 1697886882
    },
    {
        "content": "<p>Thanks for explaining. I think this subtlety should be documented somewhere.</p>",
        "id": 397842419,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1697887484
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"459699\">@Joël Riou</span> , is this a notion you coined out yourself? It deserves to be popularized, in particular, to emphasize the geometric insight that underlies it.</p>",
        "id": 397848472,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1697893174
    },
    {
        "content": "<p>No, I have just rediscovered something which appeared in unpublished notes by George Bergman in 1974, see the first page of <a href=\"http://math.berkeley.edu/~gbergman/papers/unpub/elem-chase.pdf\">http://math.berkeley.edu/~gbergman/papers/unpub/elem-chase.pdf</a></p>",
        "id": 397848743,
        "sender_full_name": "Joël Riou",
        "timestamp": 1697893379
    },
    {
        "content": "<p>Oh so then it's best to just publicise on this thread and nowhere else, so it just remains \"known to the experts\" :-)</p>",
        "id": 397848784,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1697893415
    },
    {
        "content": "<p>Well, it is mentionned there too: <a href=\"https://ncatlab.org/nlab/show/abelian+category\">https://ncatlab.org/nlab/show/abelian+category</a></p>",
        "id": 397849021,
        "sender_full_name": "Joël Riou",
        "timestamp": 1697893611
    },
    {
        "content": "<p>Another unrefereed source :-)  And subject to change at any point too!</p>",
        "id": 397849144,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1697893717
    },
    {
        "content": "<p>You suggest I should publish something about my formalization of derived categories/spectral sequences/etc...</p>",
        "id": 397849189,
        "sender_full_name": "Joël Riou",
        "timestamp": 1697893762
    },
    {
        "content": "<p>Oh of course! Absolutely! Send it to CPP or ITP. I was being silly in my last two posts but here I'm being serious.</p>",
        "id": 397849213,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1697893788
    },
    {
        "content": "<p>Joël, the work you did in mathlib very clearly deserves to be published. And having a written account would be useful too.</p>",
        "id": 397850343,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1697894970
    },
    {
        "content": "<p>If you don't want to be limited to 14 pages or whatever then JAR is another possibility <del>(Journal of Automated Research)</del> (Journal of Automated Reasoning -- thanks Patrick and sorry).</p>",
        "id": 397850903,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1697895505
    },
    {
        "content": "<p>Kevin means <a href=\"https://www.springer.com/journal/10817\">Journal of automated reasoning</a>.</p>",
        "id": 397852573,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1697897111
    }
]