[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/6701\">#6701</a>, I am starting the construction of the complex of morphisms from a cochain complex to another. If <code>F</code> and <code>G</code> are cochain complexes (indexed by the integers), a term of type <code>Cochain F G n</code> consists of morphisms <code>F.X p ⟶ G.X q</code> whenever <code>p + n = q</code>. I also introduce the composition of cochains. (When the differential is introduced, the subtype of <code>Cochain F G 0</code> consisting of cocycles will identify to morphisms <code>F ⟶ G</code>.)</p>\n<p>This complex shall be a crucial tool in the construction and study of the derived category of an abelian category, especially for the construction of the triangulated structure on the homotopy category of an additive category. Indeed, when we introduce the mapping cone of a morphism <code>φ : F ⟶ G</code> (which in degree <code>n</code> is <code>F.X (n+1) ⊞ G.X n</code>, the degreewise left/right inclusions and projections are not all morphisms of complexes, but they can all be interpreted as cochains, e.g. <code>inl φ : Cochain F (mappingCone φ) (-1)</code>, and these cochains satisfy similar relations as <code>inl/inr/fst/snd</code> do in the situation of categorical biproducts. I intend to study morphisms from and to mapping cones through the identification of morphisms with <code>0</code>-cocycles, and then \"the mapping cone will sort of behave like a biproduct\".</p>",
        "id": 386379150,
        "sender_full_name": "Joël Riou",
        "timestamp": 1692621440
    },
    {
        "content": "<p>Very nice!</p>",
        "id": 386415902,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1692630814
    },
    {
        "content": "<p>Since this is already battle-tested by your follow-up work, and it all looks well-written, let's get it in mathlib asap.</p>",
        "id": 386416113,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1692630857
    },
    {
        "content": "<p><img alt=\":merge:\" class=\"emoji\" src=\"https://zulip-avatars.s3.amazonaws.com/3121/emoji/images/18527.png\" title=\"merge\"></p>",
        "id": 386416123,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1692630860
    }
]