[
    {
        "content": "<p>I have just completed draft code for a general machinery for spectral sequences. It is exactly what I outlined at the end of my Banff talk when <span class=\"user-mention\" data-user-id=\"300245\">@Filippo A. E. Nuccio</span> asked me about the Grothendieck spectral sequence: use the constructions by Verdier in <em>Des catégories dérivées des catégories abéliennes</em>.</p>",
        "id": 368586380,
        "sender_full_name": "Joël Riou",
        "timestamp": 1687444861
    },
    {
        "content": "<p>The idea is to use the notion of <em>spectral object in a triangulated category</em> <code>T</code> (it consists of a bunch of objects and functorial distinguished triangles): a filtered cochain complex induces such a spectral object in the derived category, and I have also formalized the spectral object attached to a <code>t</code>-structure (it \"contains\" all the truncations of a given object). Then, when we apply a homological functor <code>T ⥤ A</code> (<code>A</code> is an abelian category) to such a spectral object, the distinguished triangles become long exact sequences and we get a <em>spectral object in the abelian category</em> <code>A</code>. Then, the hard part is to attach a spectral sequence to a spectral object in <code>A</code>. Up to a renumbering, it consists of beautiful as well as absurdly abstract and technical constructions: definition of the terms of all the pages, definition of the differentials, checking the compositions are zero, computing the homology, analysing convergence.</p>",
        "id": 368586550,
        "sender_full_name": "Joël Riou",
        "timestamp": 1687444884
    },
    {
        "content": "<p>This machinery should eventually be able to produce all the spectral sequences I know once the relevant specific definitions are introduced. For example, I already have a prototype of the Grothendieck spectral sequence of a composition of functors (it is stated for a composition of triangulated functors between derived categories, but once we have good notions for total derived functors, it will almost immediately give what is usually understood as the Grothendieck spectral sequence), see <a href=\"https://github.com/leanprover-community/mathlib4/blob/jriou_localization/Mathlib/Algebra/Homology/SpectralSequence/Examples/Grothendieck.lean\">https://github.com/leanprover-community/mathlib4/blob/jriou_localization/Mathlib/Algebra/Homology/SpectralSequence/Examples/Grothendieck.lean</a></p>",
        "id": 368586599,
        "sender_full_name": "Joël Riou",
        "timestamp": 1687444892
    },
    {
        "content": "<p>Amazing!</p>",
        "id": 368587842,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1687445098
    },
    {
        "content": "<p>Very nice! What's the relationship between such spectral objects and exact couples?</p>",
        "id": 368587986,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1687445117
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243562\">@Adam Topaz</span>: There might be slightly more information embedded in a spectral object as compared to an exact couple, but I am not completely sure.</p>",
        "id": 368588626,
        "sender_full_name": "Joël Riou",
        "timestamp": 1687445214
    },
    {
        "content": "<p>I see. I'll take a look at the definition soon (but I have to give a talk in 13 mins)</p>",
        "id": 368588837,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1687445247
    },
    {
        "content": "<p>I am a bit unclear about the role that derived categories have to play in mathematics now humans have invented the derived infinity-category. Is it still important to set up a theory of derived categories? If it gives us spectral sequences then it's definitely a useful tool :-)</p>",
        "id": 368596266,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1687446388
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>  Bro?</p>",
        "id": 368596518,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1687446424
    },
    {
        "content": "<p>Oh I'm serious :-) I don't know much about this stuff, but earlier this year Lenny Taelman gave some talks at Imperial and he was really down on the derived category, he said that triangulated categories were just a mess and infinity categories solved the problems.</p>",
        "id": 368596870,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1687446481
    },
    {
        "content": "<p>But maybe he was just justifying the fact that he was going to lecture on infinity categories :-)</p>",
        "id": 368597071,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1687446506
    },
    {
        "content": "<ul>\n<li>Not all triangulated categories arise as homotopy categories of stable infinity categories</li>\n<li>When they do, the utility of the <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∞</mi></mrow><annotation encoding=\"application/x-tex\">\\infty</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord\">∞</span></span></span></span>-perspective is mainly ease of use. People were already using enhancements to make the right constructions. Heck it is even implicitly in LTE.</li>\n</ul>",
        "id": 368598014,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1687446653
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> My guess is that in a stable infinity category, a \"ℤ-indexed sequence of maps\" (if this makes sense to anyone) should obviously induce a spectral object in the associated triangulated category, hence spectral sequences via Verdier's construction...</p>",
        "id": 368598321,
        "sender_full_name": "Joël Riou",
        "timestamp": 1687446704
    }
]