[
    {
        "content": "<p>Hello, we wanted to share our paper and dataset which was recently published at TMLR. We provide the complete proofs for 20 IMO problems from miniF2F and beyond. We also extract 1329 lemmas from those proofs. We then evaluate the ability of LLMs on proving the lemmas in our dataset. The best accuracy is 39% achieved by DeepSeek Prover. DeepSeek and Goedel only prove lemmas with short proofs (average length of less than 3 lines), relying heavily on automatic Lean solvers such as nlinarith.</p>\n<p>Here is the paper: <a href=\"https://openreview.net/pdf?id=CrKMqRAhBo\">https://openreview.net/pdf?id=CrKMqRAhBo</a> and here is the dataset: <a href=\"https://github.com/roozbeh-yz/IMO-Steps/tree/main\">https://github.com/roozbeh-yz/IMO-Steps/tree/main</a> </p>\n<p>Would appreciate any feedback or comments from the community.</p>",
        "id": 503179470,
        "sender_full_name": "Roozbeh Yousefzadeh",
        "timestamp": 1741063369
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general/topic/A.20dataset.20of.20proofs.20for.2020.20IMO.20problems.20and.20extracted.20lemmas\">#general &gt; A dataset of proofs for 20 IMO problems and extracted lemmas</a> by <span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span>.</p>",
        "id": 503180632,
        "sender_full_name": "Notification Bot",
        "timestamp": 1741064019
    },
    {
        "content": "<p>As of what date was \"Lean proof publicly available\" in Table 1 determined? 1962 P2, 1965 P2, 2022 P2 and 2023 P4 all currently have solutions in Compfiles. 2022 P2 also had a Lean 3 solution (<a href=\"https://github.com/leanprover-community/mathlib/pull/15621\">!3#15621</a>) available as far back as July 2022.</p>",
        "id": 503241776,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1741087476
    },
    {
        "content": "<p>13 messages were moved from this topic to <a class=\"stream-topic\" data-stream-id=\"219941\" href=\"/#narrow/channel/219941-Machine-Learning-for-Theorem-Proving/topic/A.20dataset.20of.20proofs.20for.2020.20IMO.20problems.20and.20extracted.20lem.2E.2E.2E/with/503216666\">#Machine Learning for Theorem Proving &gt; A dataset of proofs for 20 IMO problems and extracted lem...</a> by <span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span>.</p>",
        "id": 503259623,
        "sender_full_name": "Notification Bot",
        "timestamp": 1741092870
    },
    {
        "content": "<p>Thanks for your comment and for pointing out those proofs. I was not aware of the proofs available there (some of them are written very recently, e.g., December 2024, and none of them are in the IMO directory of Mathlib). For the Table 1 in our paper, I checked the proofs in the IMO directory of Mathlib. I also checked the proofs published in the AI literature.</p>\n<p>Would Compfiles like to incorporate my proofs for the problems that do not yet have a formal proof there?</p>\n<p>To make up for the 4 proofs that are already available publicly, I will release the proofs for 4 other IMO problems that do not have a formal proof at Compfiles: 1961p1, 1966p4, 1978p5, and 1993p5.</p>",
        "id": 503405391,
        "sender_full_name": "Roozbeh Yousefzadeh",
        "timestamp": 1741140894
    },
    {
        "content": "<p>Here is the list of problems that their formal proofs are released with the paper but Compfiles does not have a complete proof for them: 1969p2, 1974p3, 1983p6, 1984p6, 1985p6, 1992p1, 1997p5, 2022p5, 2007p6 (shortlist). I hope my formal proofs will be useful for others.</p>",
        "id": 503408204,
        "sender_full_name": "Roozbeh Yousefzadeh",
        "timestamp": 1741142178
    },
    {
        "content": "<blockquote>\n<p>Would Compfiles like to incorporate my proofs for the problems that do not yet have a formal proof there?</p>\n</blockquote>\n<p>Pull requests to add these to Compfiles would be welcome!</p>",
        "id": 503551637,
        "sender_full_name": "David Renshaw",
        "timestamp": 1741189100
    },
    {
        "content": "<p>It seems to me writing public solutions for IMO problems in the test set of an ML benchmark can have a negative effect on the value of that benchmark. Wouldn't it have been better to do the same thing for 20 IMO problems that are not in miniF2F?</p>",
        "id": 503640516,
        "sender_full_name": "Andreas Gittis",
        "timestamp": 1741211271
    },
    {
        "content": "<p>\"2007p6 (shortlist)\" is an odd description; recent shortlist problems have identifiers such as A1, C2, G3 or N4 (Algebra, Combinatorics, Geometry, Number Theory), not \"p6\". Don't follow the miniF2F mistake of inventing random numbers for shortlist problems and claiming they are IMO problems when they aren't at all!</p>\n<p>I don't know the Compfiles view of IMO shortlist problems, but to me it seems a reasonable place for such problems and solutions (correctly identified and with a correct formal statement corresponding to the informal one, of course).</p>",
        "id": 503647351,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1741213676
    },
    {
        "content": "<p>I'd like to see public formal statements and solutions to all 392 past IMO problems (up to mathlib archive standards, meaning that all lemmas arising of more general use go in mathlib proper in appropriate generality). (I'm gradually filling out more geometrical definitions to at least allow more past geometry problems to be <em>stated</em> cleanly with mathlib definitions.)</p>\n<p>It's for people using public benchmarks to deal with excluding material (both formal and informal) related to those benchmarks from training data or otherwise account for how such material may have influenced performance on the benchmark. If you want to train an AI to solve <em>future</em> IMO problems, training on public formal solutions to past such problems is a perfectly reasonable thing to do (although 392 problems might be rather too little to help very much in AI training).</p>",
        "id": 503648177,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1741213981
    },
    {
        "content": "<p>Thank you for your comments and feedback. I appreciate it.</p>",
        "id": 505028460,
        "sender_full_name": "Roozbeh Yousefzadeh",
        "timestamp": 1741755057
    }
]