[
    {
        "content": "<p>I asked ChatGPT to create an April Fool's Day post about Lean. Here is the output.</p>\n<hr>\n<p>Sure, here's a post for April Fool's Day about the Lean proof assistant:</p>\n<p>Introducing Lean 5.0: The Self-Proving Proof Assistant</p>\n<p>The Lean proof assistant has long been the tool of choice for mathematicians and computer scientists looking to formally verify their proofs. But what if Lean could take things one step further and actually prove the correctness of its own proofs?</p>\n<p>We're excited to announce the release of Lean 5.0, the self-proving proof assistant. With this new version of Lean, not only can you write and verify your own proofs, but Lean itself will automatically generate and verify proofs of its own correctness.</p>\n<p>How does it work? The secret is in the Lean neural network, which has been trained on millions of lines of Lean code to recognize and verify the correctness of patterns in Lean proofs. When you write a proof in Lean 5.0, the neural network springs into action, generating its own proof of correctness and checking it against yours. If the neural network's proof matches yours, you can be confident that your proof is correct, and that Lean itself is working as intended.</p>\n<p>But that's not all! Lean 5.0 also includes a new \"proof simplification\" feature, which automatically simplifies complex proofs into simpler ones. Just click the \"simplify proof\" button, and Lean will do the rest. And for those times when you're feeling stuck, Lean 5.0 now includes a \"proof suggestion\" feature, which suggests possible next steps in your proof based on the patterns it has learned from its vast database of Lean proofs.</p>\n<p>So why wait? Try Lean 5.0 today, and experience the future of proof assistants. Because in the world of formal verification, it's not enough to be confident in your proofs – you should be confident in your proof assistant too.</p>",
        "id": 346366379,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1680444818
    },
    {
        "content": "<p><a href=\"https://github.com/digama0/mm0#readme\">MM0</a> vibes :)</p>\n<blockquote>\n<p>The goal of this project is to build a formally verified (in MM0) verifier for MM0, down to the hardware, to build a strong trust base on which to build verifiers for more mainstream languages or other verified programs.</p>\n</blockquote>\n<p>\"Proof simplification\" reminds me of Venkatesh's <a href=\"https://www.math.ias.edu/~akshay/research/IASEssay.pdf\">Aleph Zero essay</a>, which contains an analysis of the impact of mechanization on mathematics (see picture below). AFAIK This essay hasn't be discussed here, but it was the theme of the <a href=\"http://www.fields.utoronto.ca/activities/22-23/fieldsmedalsym\">2022 Fields Medal Symposium</a>, which Kevin Buzzard co-organized and where Johan Commelin gave a talk (I learned about the symposium because Leo mentioned Johan's talk in his IPAM talk); Michael Harris collected participants' impressions <a href=\"https://siliconreckoner.substack.com/p/notes-from-the-2022-fields-medal\">here</a>. The symposium was pre-ChatGPT, and now, 5 months later, people are already discussing the impact of AI on humanity, not just mathematics.<br>\n<a href=\"/user_uploads/3121/pEotZI30sRYRL6vkOEdQ7T1j/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/pEotZI30sRYRL6vkOEdQ7T1j/image.png\" title=\"image.png\"><img src=\"/user_uploads/3121/pEotZI30sRYRL6vkOEdQ7T1j/image.png\"></a></div>",
        "id": 346413758,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1680469403
    }
]