[
    {
        "content": "<p>Are there any recent surveys on autoformalisation that include a description of the techniques used and a link to the relevant code? Honest accounts of both successes and failures would be particularly appreciated.</p>",
        "id": 459859686,
        "sender_full_name": "Cris Salvi",
        "timestamp": 1723365592
    },
    {
        "content": "<p>I don’t think there is such a survey. Autoformalization is pretty recent and I don’t think we have hit a stable point where a survey wouldn’t be very much out-of-date.</p>",
        "id": 459944805,
        "sender_full_name": "Jason Rute",
        "timestamp": 1723410193
    },
    {
        "content": "<p>Here are some key points that might help:</p>\n<ul>\n<li>Qingxiang Wang has a <a href=\"https://arxiv.org/abs/1912.02636\">few papers</a> trying out auto-formalization using machine translation</li>\n<li>Christian Szegedy wrote <a href=\"https://link.springer.com/chapter/10.1007/978-3-030-53518-6_1\">A Promising Path Towards Autoformalization and General Artificial Intelligence</a> which is a manifesto of sort on the topic.  The idea is that we can get into a virtuous loop where autoformalization and automated theorem proving strengthen each other in a reinforcement learning loop.</li>\n<li>Christian Szegedy gave a talk at <a href=\"https://aitp-conference.org/2020/\">AITP 2020</a> showcasing how hard this topic is and the brick walls they were running into.</li>\n</ul>",
        "id": 459944832,
        "sender_full_name": "Jason Rute",
        "timestamp": 1723410222
    },
    {
        "content": "<p>Then everything changed in 2022 with the paper <a href=\"https://arxiv.org/abs/2205.12615\">Autoformalization with Large Language Models</a>.  The main idea was that LLMs for Code (codex at the time) could do autoformalization at a sufficiently useful level (about 25% correct for theorem statements of competition problems IIRC).  That was good enough for generating additional data for reinforcement learning of automated theorem provers.</p>",
        "id": 459944838,
        "sender_full_name": "Jason Rute",
        "timestamp": 1723410239
    },
    {
        "content": "<p>Shortly after that paper, a number of works came out (many talked about on this Zulip at length):</p>\n<ul>\n<li><a href=\"https://github.com/zhangir-azerbayev/lean-chat\">LeanChat</a> (a pre-chat-gpt chat tool for autoformalization into Lean)</li>\n<li><a href=\"https://github.com/siddhartha-gadgil/LeanAide\">LeanAide</a>: Autoformalization connected to Lean metaprogramming so can better find and fix translation mistakes</li>\n<li><a href=\"https://arxiv.org/abs/2210.12283\">Draft-Sketch-Prove</a>: Formalize theorem statements into proof sketchs and fill in details with Hammer.  Many papers in automated theorem proving for Isabelle extend Draft-Sketch-Prove:<ul>\n<li><a href=\"https://arxiv.org/abs/2305.16366\">Decomposing the Enigma: Subgoal-based Demonstration Learning for Formal Theorem Proving</a></li>\n<li><a href=\"https://arxiv.org/abs/2310.00656\">LEGO-Prover: Neural Theorem Proving with Growing Libraries</a></li>\n<li><a href=\"https://arxiv.org/abs/2309.15806\">Lyra: Orchestrating Dual Correction in Automated Theorem Proving</a></li>\n<li><a href=\"https://arxiv.org/abs/2405.14414\">Proving Theorems Recursively</a></li>\n</ul>\n</li>\n<li><a href=\"https://arxiv.org/abs/2302.12433\">ProofNet</a>: A benchmark for Lean made by autoformalizing textbook exercises</li>\n<li><a href=\"https://arxiv.org/abs/2403.18120\">Don't Trust: Verify -- Grounding LLM Quantitative Reasoning with Autoformalization</a>: I think the idea is to check informal LLM generated answers by using auto-formalization.</li>\n<li><a href=\"https://arxiv.org/abs/2311.03755\">Multilingual Mathematical Autoformalization</a>: Using autoformalization in reverse (formal to informal) to generate training data for LLMs.</li>\n<li><a href=\"https://arxiv.org/abs/2405.14333\">DeepSeek-Prover</a> and <a href=\"https://deepmind.google/discover/blog/ai-solves-imo-problems-at-silver-medal-level/\">AlphaProof</a> both use autoformalized competition problems at a large scale (millions of problems) to train automated theorem provers at scale.</li>\n</ul>\n<p>(I’m sure I’m missing a lot of works.)</p>",
        "id": 459944892,
        "sender_full_name": "Jason Rute",
        "timestamp": 1723410259
    },
    {
        "content": "<p>Also, many people have been converting Lean theorems into informal statements for the purpose of either better documentation (automatic documentation), for semantic search (Moogle, LeanSearch), or for making training data for automated theorem proving.</p>",
        "id": 459944935,
        "sender_full_name": "Jason Rute",
        "timestamp": 1723410308
    },
    {
        "content": "<p>I’m less aware of work pursuing autoformalization for larger projects (e.g. formalizing a book, or a paper), but I think that would be the next big goal.  Another big goal would be to do more systematic autoformalization, like formalizing a whole database, or a whole encyclopedic reference of some sort.  Or trying to scrap and formalize all theorems of a particular form in some area of mathematics.</p>",
        "id": 459944977,
        "sender_full_name": "Jason Rute",
        "timestamp": 1723410342
    },
    {
        "content": "<p>Also just found this benchmark on autoformalization in Lean: <a href=\"https://arxiv.org/html/2406.06555v1\">An Evaluation Benchmark for Autoformalization in Lean4</a></p>",
        "id": 459945459,
        "sender_full_name": "Jason Rute",
        "timestamp": 1723410759
    },
    {
        "content": "<p>And this: <a href=\"https://arxiv.org/html/2406.01940v1\">Process-Driven Autoformalization in Lean 4</a></p>",
        "id": 459945553,
        "sender_full_name": "Jason Rute",
        "timestamp": 1723410844
    },
    {
        "content": "<p>And: <a href=\"https://arxiv.org/html/2406.03847v2\">Lean Workbook: A large-scale Lean problem set formalized from natural language math problems</a>  (discussed in <a class=\"stream-topic\" data-stream-id=\"219941\" href=\"/#narrow/stream/219941-Machine-Learning-for-Theorem-Proving/topic/Lean.20Workbook.3A.20A.20large-scale.20Lean.20formalized.20problem.20set\">#Machine Learning for Theorem Proving &gt; Lean Workbook: A large-scale Lean formalized problem set</a>)</p>",
        "id": 459945708,
        "sender_full_name": "Jason Rute",
        "timestamp": 1723410988
    },
    {
        "content": "<p>This is great <span class=\"user-mention\" data-user-id=\"115715\">@Jason Rute</span> thanks a lot for the response.</p>",
        "id": 460027995,
        "sender_full_name": "Cris Salvi",
        "timestamp": 1723450999
    }
]