[
    {
        "content": "<p><a href=\"https://theorem.dev/\">Theorem</a> is open-sourcing a (non-idiomatic) Lean translation of the 1276 theorem statements in Software Foundations Volume 1 <a href=\"https://theorem.dev/sfbench-pt1\">here</a>, along with proofs that the Lean translation is isomorphic to the original Rocq. This is the first project scaling AI software verification to handle codebases with dependencies. While more compact solutions are possible, our current approach produced ~60k LoC in Lean, proven isomorphic with ~720k LoC of Rocq.</p>\n<p>We’re very excited by this result, and will be sharing more details soon. We hope it will be useful to students of PL, as well as AI researchers excited about software verification. Happy POPL!</p>",
        "id": 568375133,
        "sender_full_name": "Jason Gross",
        "timestamp": 1768550192
    },
    {
        "content": "<p>This is great progress <span class=\"user-mention\" data-user-id=\"241007\">@Jason Gross</span> !<br>\nCan you say more about the isomorphism proof? Do you have a model of Rocq in Lean and proof the isomorphism in Lean, or the other way around?</p>\n<p>Could this also help with other porting efforts, such as iris, the computable reals or program logics for cryptography ?</p>",
        "id": 568387993,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1768554798
    },
    {
        "content": "<p>Looking at this, it seems that you've made a model of Lean in Rocq. It would be interesting to know more about it.<br>\n<a href=\"https://theorem.dev/sfbench-pt1/?id=U_original__U2_lf_dot_U_basics__U2_lf__U_basics__U_natU_playground__nat__iso\">https://theorem.dev/sfbench-pt1/?id=U_original__U2_lf_dot_U_basics__U2_lf__U_basics__U_natU_playground__nat__iso</a></p>",
        "id": 568388995,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1768555115
    },
    {
        "content": "<p>We built a module type which defines the notion of \"correct LF translation\" using what is roughly the relational lifting of isomorphism along type formers, and used  <a href=\"https://github.com/rocq-community/rocq-lean-import\">rocq-lean-import</a>* to extend this to a spec for a \"correct Lean LF translation\".  Our AI system was able to both translate and prove equivalence for 97% (1237/1276) of the statements. The remaining 39 statements pivoted off 6 extra difficult dependencies, which required human intervention to solve; these statements are marked as \"extreme\" in the list view of our dataset explorer. When given these additional 6 solutions, we were able to 100% validate the entire benchmark.</p>\n<p>With the (very big) caveat that the equivalence test is quite strict and thus tends to bias the LLM towards giving structurally identical translations at the cost of being less idiomatic, it should be extensible to porting other codebases.  We're currently looking into translating Flocq --- what other projects do you have in mind for translation?  (Iris? coqeal?)</p>\n<ul>\n<li>More details on this model of Lean in Rocq that <span class=\"user-mention\" data-user-id=\"243878\">@Gaëtan Gilbert</span> made <a href=\"https://discourse.rocq-prover.org/t/alpha-announcement-coq-is-a-lean-typechecker/581\">here</a></li>\n</ul>",
        "id": 568560207,
        "sender_full_name": "Jason Gross",
        "timestamp": 1768626542
    },
    {
        "content": "<p>There is an ongoing porting effort for iris, see <a class=\"stream\" data-stream-id=\"490604\" href=\"/#narrow/channel/490604-iris-lean\">#iris-lean</a> <br>\nThe porting of exact real numbers is more informal/manual, but ongoing I understand. It would be interesting to see what your tooling could do.</p>",
        "id": 568663590,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1768742847
    }
]