[
    {
        "content": "<p>Currently, theorem prover infrastructure is mostly closed-source. I think DeepSeekProver V1.5 and the implementation based on it are the only open source implementations available. Some major AI lab comes around, treats ATP as an RL problem, gets SOTA, and sometimes the resulting model is open weights.<br>\nI'm wondering: since training ATP models is solving a hard engineering challenge and throwing compute at the problem, how come there is no public initiative? Shouldn't it be possible to design a system working on heterogeneous hardware, so that everyone can contribute compute to it? At least a heterogeneous proof search would be exciting. The resulting dataset could be made available for everyone (or only academic institutions).</p>\n<p>I'm sure I must be missing something. I searched for old threads on this, but couldn't find any. If anyone can give me a hint to why this is not being done or where it has been discussed previously, I'd be glad!</p>",
        "id": 520465633,
        "sender_full_name": "Simon Sorg",
        "timestamp": 1748269222
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"766274\">@Simon Sorg</span> Am working on this: <a href=\"#narrow/channel/219941-Machine-Learning-for-Theorem-Proving/topic/MCP.20Tools.20for.20LLMs.20and.20Agentic.20Mathematics/with/520472402\"><a class=\"stream-topic\" data-stream-id=\"219941\" href=\"/#narrow/channel/219941-Machine-Learning-for-Theorem-Proving/topic/MCP.20Tools.20for.20LLMs.20and.20Agentic.20Mathematics/with/520472402\">#Machine Learning for Theorem Proving &gt; MCP Tools for LLMs and Agentic Mathematics</a> </a>.</p>\n<p>I know <span class=\"user-mention\" data-user-id=\"898653\">@harry sanders</span> is interested in creating a powerful Lean gym, i.e., RL environment, as well.</p>",
        "id": 520472622,
        "sender_full_name": "Justin Asher",
        "timestamp": 1748271056
    },
    {
        "content": "<p>I was thinking about running distributed proof searches on arbitrary hardware, say simply starting a docker container. For example, one could feed in stuff from SorryDB, and if a proof is found, a PR is created. This is somewhat different from MCP I think, but I do not understand MCP deep enough to be sure, so please correct me.</p>",
        "id": 520473715,
        "sender_full_name": "Simon Sorg",
        "timestamp": 1748271365
    },
    {
        "content": "<p>I think it just depends on what you want to do. The idea behind MCP is to give the LLMs access to tools, such as search engines, running Lean code, among other things. The reason I am interested in MCP is it is easy to integrate with any of the frontier models, so if we build with MCP in mind, we should always be at the cutting edge. I think that what you are describing is in line with what I would like to do: adding an agentic workflow on top of the MCP tools. I think we need the MCP tools first, though, for this to work well.</p>",
        "id": 520503342,
        "sender_full_name": "Justin Asher",
        "timestamp": 1748281611
    }
]