[
    {
        "content": "<p>I'm in the process of creating some clean Lean datasets ready for machine learning prediction, and I'm trying to figure out where to put them.  Any suggestions?</p>",
        "id": 195257662,
        "sender_full_name": "Jason Rute",
        "timestamp": 1587772714
    },
    {
        "content": "<p>One option is GitHub?  Another is Kaggle.  Or I could put it on GitHub and link to it from Kaggle.  I am sure there are many other places.  Any one with familiarity with this sort of thing?  Does anyone else what to see, play with the datasets?</p>",
        "id": 195257669,
        "sender_full_name": "Jason Rute",
        "timestamp": 1587772726
    },
    {
        "content": "<p>One of the datasets will be all (well...most) instances of tactic keywords and the state when they are applied.  (I'm a bit of a perfectionist and there are a number of small issues in this dataset, but I think it is worth releasing anyway to start playing with.  I want to learn more about formula embeddings and I think it will be a great dataset to start with.  I can always create another version later.  (This isn't a state of the art dataset.  HOLStep and the Mizar datasets have been around for a long time, so I don't think it needs to be perfect at the beginning.)</p>",
        "id": 195257697,
        "sender_full_name": "Jason Rute",
        "timestamp": 1587772781
    },
    {
        "content": "<p>Another dataset will be all of the instances of the <code>rw</code> tactic, the exact rewrite formula applied, and the state just before the rewrite is applied.  If it is easy, I might also include all the outputs of <code>rw_hint</code> so that it is a true prediction problem (pick which of these rewrites is the one the human used).</p>",
        "id": 195257782,
        "sender_full_name": "Jason Rute",
        "timestamp": 1587772851
    },
    {
        "content": "<p>I'm also still working on other methods of \"proof recording\" so I can create more and better datasets.</p>",
        "id": 195257804,
        "sender_full_name": "Jason Rute",
        "timestamp": 1587772875
    },
    {
        "content": "<p>This is great! Can't wait to take a look. I'd say github unless you are over the file size limit (100mb per file).</p>",
        "id": 195257880,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1587772985
    },
    {
        "content": "<p>I think I can stay under that.  I can always break up the files.</p>",
        "id": 195258429,
        "sender_full_name": "Jason Rute",
        "timestamp": 1587773553
    },
    {
        "content": "<p>Kaggle is a good place to get some ml folks accidentally interested in ITPs :)</p>",
        "id": 195410751,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1587991363
    }
]