[
    {
        "content": "<p>I have recently thought about how math might change, if we improve the autoproving capabilities of current AI systems. I have read the Paper of Alex Kontorovich <a href=\"https://arxiv.org/pdf/2510.15924\">The Shape of Math to come</a> and have layed down some of my own ideas and thoughts in a short <a href=\"https://huschi.bearblog.dev/autoproving-the-future-of-math/\">blog post</a>.</p>\n<p>I would love to hear different thoughts or also link me any other resources on this particular topic, that you have come across.</p>",
        "id": 568036423,
        "sender_full_name": "Franz Huschenbeth",
        "timestamp": 1768409993
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general/topic/Discussion.3A.20How.20will.20autoproving.20impact.20math.3F\">#general &gt; Discussion: How will autoproving impact math?</a> by <span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span>.</p>",
        "id": 568062866,
        "sender_full_name": "Notification Bot",
        "timestamp": 1768418448
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1010143\">@franzhusch</span> I moved your message to a more appropriate channel where you will also find a <em>lot</em> of previous discussions of this topic.</p>",
        "id": 568062952,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1768418479
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/channel/219941-Machine-Learning-for-Theorem-Proving/topic/Discussion.3A.20How.20will.20autoproving.20impact.20math.3F/near/568062952\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"1010143\">franzhusch</span> I moved your message to a more appropriate channel where you will also find a <em>lot</em> of previous discussions of this topic.</p>\n</blockquote>\n<p>Ah thanks a lot. I will look through the topics here to find some other thoughts and insights then.</p>",
        "id": 568064368,
        "sender_full_name": "Franz Huschenbeth",
        "timestamp": 1768419009
    },
    {
        "content": "<p>I don't think we are anywhere close to your definition of Math Singularity. AI have surpassed humans in Go a long time ago, and yet AI-vs-AI games (where AIs can have drastically different evaluations) indicate that we are nowhere near Go Singularity.</p>\n<p>And technically Go Singularity is a special case of Math Singularity...</p>",
        "id": 568158087,
        "sender_full_name": "Bbbbbbbbba",
        "timestamp": 1768469032
    },
    {
        "content": "<p>I mainly introduced the concept to contemplate how the workflow of a mathematician might change by thinking about the extreme end of autoproving capabilities. </p>\n<p>About the Go Singularity, I would argue that it was reached after our best humans were beat and certainly after the introduction of Alpha Zero. I mean that because the Singularity is from the perspective of humans. It is a point at which we cant tell the difference, it would not matter to the best human if he played the very best AI system in Go or a previous iteration, which was already past the Go Singularity. I dont mean Singularity in the sense of instantaneous progress.</p>\n<p>That being said, I also think we are far from a Math Singularity, because of uncertainties around autoproving progress and the fact math has deceivingly simple statements, which are very hard to prove.</p>",
        "id": 568162885,
        "sender_full_name": "Franz Huschenbeth",
        "timestamp": 1768470307
    },
    {
        "content": "<p>This may be of some historical interest to you : <a href=\"https://en.wikipedia.org/wiki/QED_manifesto\">https://en.wikipedia.org/wiki/QED_manifesto</a></p>",
        "id": 568171587,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1768472709
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"1010143\">Franz Huschenbeth</span> <a href=\"#narrow/channel/219941-Machine-Learning-for-Theorem-Proving/topic/Discussion.3A.20How.20will.20autoproving.20impact.20math.3F/near/568162885\">said</a>:</p>\n<blockquote>\n<p>I mainly introduced the concept to contemplate how the workflow of a mathematician might change by thinking about the extreme end of autoproving capabilities. </p>\n<p>About the Go Singularity, I would argue that it was reached after our best humans were beat and certainly after the introduction of Alpha Zero. I mean that because the Singularity is from the perspective of humans. It is a point at which we cant tell the difference, it would not matter to the best human if he played the very best AI system in Go or a previous iteration, which was already past the Go Singularity. I dont mean Singularity in the sense of instantaneous progress.</p>\n<p>That being said, I also think we are far from a Math Singularity, because of uncertainties around autoproving progress and the fact math has deceivingly simple statements, which are very hard to prove.</p>\n</blockquote>\n<p>As a matter of fact, I believe it does matter. In general new models can give top human players more handicap stones.</p>",
        "id": 568179411,
        "sender_full_name": "Bbbbbbbbba",
        "timestamp": 1768474989
    },
    {
        "content": "<p>Similarly we can always state more formalized statements and questions, of harder nature. Interesting.</p>\n<p>I do agree that the concept is more open ended and more of a range than a single definite inflection point. Its makes more sense to frame it around the speed at which it can make progress, which as you point out is not superb in the game of Go. It remains to be seen, if the increased interest and budget poured into accelerating math AI systems, is enough to overcome the slowdown that Go AI systems have experienced.</p>",
        "id": 568192639,
        "sender_full_name": "Franz Huschenbeth",
        "timestamp": 1768479206
    },
    {
        "content": "<p>Maybe (just my humble opinion) mathematics will come to a stage that we don’t have to worry about proof, just focus on higher ideas</p>",
        "id": 568210027,
        "sender_full_name": "Anh Nguyễn",
        "timestamp": 1768483585
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"874606\">Anh Nguyễn</span> <a href=\"#narrow/channel/219941-Machine-Learning-for-Theorem-Proving/topic/Discussion.3A.20How.20will.20autoproving.20impact.20math.3F/near/568210027\">said</a>:</p>\n<blockquote>\n<p>Maybe (just my humble opinion) mathematics will come to a stage that we don’t have to worry about proof, just focus on higher ideas</p>\n</blockquote>\n<p>In other words, physics <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 568229134,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1768487550
    },
    {
        "content": "<p>I looked at your post, and have a few comments.</p>\n<ul>\n<li>Everyone is of course welcome to define things however they like, but just FYI my definition of \"autoformalization\" is not \"the act of taking an informal <strong>statement</strong> and transferring it to Lean\" (which I would call \"auto-translation\"), but rather taking the statement <em>and its natural language proof</em> and formalizing all of that in one fell swoop. (Or with periodic human intervention, which I call \"quasi-autoformalization\". This is much closer to the current workflow, and would be sufficient for my purposes.) </li>\n<li>Also, regarding \"A notable observation is that, autoformalization lacks inherent verification and cannot be fully automated\": Szegedy's counterpoint is I think very interesting to ponder. The verification he proposes is the long-term stability and success of the theory, to formally prove everything we want to be true (and not more)!</li>\n<li>The \"Singularity\" you point to and what it might mean is exactly the subject of Gowers's paper from the year 2000. (I always have to resist singing that phrase to the Conan O'Brien tune...) He discussed all of this in detail long ago, and it's worth returning there from time to time, to see how right he's been on so many other things he's said...</li>\n</ul>",
        "id": 568244563,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1768490940
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"252920\">@Alex Kontorovich</span>  I very much appreciate you taking the time and giving me comments on my post. </p>\n<ul>\n<li>I have changed the usage of autoformalization to autotranslation in my post. I do see your definitions as a better fit.</li>\n<li>I do see and appreciate the iterative aspect of Szegedy's counterpoint, which speaks for the robustness of the mathematical knowledge corpus. But the value provided of a mathematician will be in the verification of these formalized statements, making sure that as little as possible errors are introduced. Just as it currently is in respect to proofs. Especially, if we think about frontier research being done in Lean, where the \"translation\" then happens mainly from mind to formalized statement. I think partly my point here being that else we could just run it all through Autotranslation Systems and the only value provided would be to have thought of doing it for this specific problem, if it has not already been done. You I think have also talked about this point in terms of accountability, and the analogy between self driving cars and mathematicians formalizing statements.</li>\n<li>I will try to get my hands on a copy to read it in depth (I now realize I have not watched enough Conan O'Brien to know exactly what his tune is).</li>\n</ul>",
        "id": 568289504,
        "sender_full_name": "Franz Huschenbeth",
        "timestamp": 1768503284
    }
]