[
    {
        "content": "<p>Just came across a new machine learning for theorem proving paper: <a href=\"https://aclanthology.org/2023.acl-long.706.pdf\">https://aclanthology.org/2023.acl-long.706.pdf</a> published in ACL. It looks like some improvements of HyperTree Proof Search, though I haven't read it in detail yet.</p>",
        "id": 374960725,
        "sender_full_name": "Kaiyu Yang",
        "timestamp": 1689259753
    },
    {
        "content": "<p>Do you know what this means (from Section 4.1):</p>\n<blockquote>\n<p><strong>Baseline methods.</strong> ...  For the Lean formal environment, besides the original GPT-f model (Polu and Sutskever, 2020), we compare our DT-Solver with PACT (Han et al., 2021) and Expert iteration (Polu et al., 2022) ... All the baseline methods are re-implemented by ourselves since none of them releases the code.</p>\n</blockquote>\n<p>Are the authors indeed comparing their model with their own re-implementation of those other papers' models?  Is that a common approach in ML research?</p>",
        "id": 375004971,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1689268439
    },
    {
        "content": "<p>Yes, it is not unheard of and very appreciated in the cases this happens.</p>",
        "id": 375007079,
        "sender_full_name": "Jason Rute",
        "timestamp": 1689268891
    },
    {
        "content": "<p>That sounds very useful.  Did they make the code public?  I skimmed the paper and couldn't see a link.</p>",
        "id": 375008202,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1689269135
    },
    {
        "content": "<p>Do any of the authors want to comment here? Here are the ones I could find on Zulip: <span class=\"user-mention\" data-user-id=\"398687\">@Zhengying Liu</span>, <span class=\"user-mention\" data-user-id=\"466432\">@LIU Zhengying</span>, <span class=\"user-mention\" data-user-id=\"480144\">@Jianhao Shen</span></p>",
        "id": 375013130,
        "sender_full_name": "Jason Rute",
        "timestamp": 1689270214
    },
    {
        "content": "<p>I don't think the code is available right now (not sure if the authors plan to release it). Regarding re-implementing existing methods, yes, sometimes people do that. Depending on the specific method, re-implementing can be extremely difficult or even infeasible, due to various factors such as engineering efforts, private datasets, and the lack of details.</p>",
        "id": 375013610,
        "sender_full_name": "Kaiyu Yang",
        "timestamp": 1689270337
    },
    {
        "content": "<p>I appreciate people who open source their project code. We can see how the system works, the data format, and mostly the design decisions by looking at the code. This helps us reproduce results.<br>\n<span class=\"user-mention\" data-user-id=\"584504\">@Kaiyu Yang</span> Thank you very much for opensourcing the LeanDojo project.</p>",
        "id": 382467288,
        "sender_full_name": "Min-Hsien Weng",
        "timestamp": 1691371315
    }
]