[
    {
        "content": "<p>What are my options for an embedder for both Lean and natural language? The downstream task is retrieval from natural language, like LeanSearch.</p>",
        "id": 511263848,
        "sender_full_name": "Vasily Ilin",
        "timestamp": 1744233470
    },
    {
        "content": "<p>One strategy is to adopt methods similar to those used in LeanDojo's data extraction. For instance, see <code>ExtractData.lean</code> (<a href=\"https://github.com/lean-dojo/LeanDojo/blob/main/src/lean_dojo/data_extraction/ExtractData.lean\">https://github.com/lean-dojo/LeanDojo/blob/main/src/lean_dojo/data_extraction/ExtractData.lean</a>).  Note that specific code only works for older Lean versions (pre-v4.13.0). This kind of approach involves parsing Lean code to extract structural details, such as abstract syntax trees (ASTs) and theorem dependencies (<code>PremiseTrace</code>). You could then process these dependencies first to build richer context around a definition or theorem before feeding this structured representation into an LLM to generate a clear English description. (I am currently using Gemini models for similar tasks, e.g. Flash 2.0.) Once you have the English text, embedding it with a standard model provides the vectors necessary for your natural language retrieval task.</p>\n<p>(My own project, Vantage (<a href=\"https://www.vantageproject.org/\">https://www.vantageproject.org/</a>), explores the complementary challenge of autoformalization, translating English into Lean.)</p>",
        "id": 511304252,
        "sender_full_name": "Justin Asher",
        "timestamp": 1744255094
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"780541\">@Justin Asher</span> for many programming languages getting such structural details can be done with tree-sitter (<a href=\"https://tree-sitter.github.io/\">https://tree-sitter.github.io/</a>). It supports most popular programming languages, including agda. I have not looked closely enough at the lean syntax whether this is also possible, but it would be a way to connect to a much wider eco-system.</p>",
        "id": 511331813,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1744269583
    }
]