[
    {
        "content": "<p>I came across a new paper from Sanjeev Arora and team \"Goedel-Prover: A Frontier Model for Open-Source Automated Theorem Proving\". Several interesting claims. Efficient autoformalization from Numina to Lean 4. SOTA on miniF2F, etc. </p>\n<p>They claim that the code is open sourced, but I only see the testing code in the repository. Weights are available too. </p>\n<p>I don't understand example 2 in table 1, though. The informal statement looks wrong.</p>",
        "id": 499621759,
        "sender_full_name": "Eugene",
        "timestamp": 1739498640
    },
    {
        "content": "<p>Hi, thank you for your interests in our Goedel-Prover. We do not include for the training code since it is standard supervised fine-tuning and we use a standard package \"trainner from Transformer\".</p>",
        "id": 499764970,
        "sender_full_name": "Yong Lin",
        "timestamp": 1739545553
    },
    {
        "content": "<p>There is a typo in example 2 in table 1, it should be $0&lt;x&lt;1$</p>",
        "id": 499765127,
        "sender_full_name": "Yong Lin",
        "timestamp": 1739545592
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"409347\">@Eugene</span> : If you are looking for training code specific to theorem proving (single proof-step/tactic prediction), then you can check out our repository: <a href=\"https://github.com/trishullab/proof-wala\">https://github.com/trishullab/proof-wala</a> (it also comes with search capabilities that can run in parallel). Although we don't have expert iteration training which I guess was used in Goedel-Prover. I don't think there is any \"Open Source\" expert iteration training code in the context of theorem proving.</p>",
        "id": 499986460,
        "sender_full_name": "Amitayush Thakur",
        "timestamp": 1739689423
    },
    {
        "content": "<p>Has anyone been able to set up Goedel-Prover locally? Due to technical constraints, I was unable to do so, but I'm quite interested in its results and various prompts it could work with. Am I correct in assuming that the open-source version of Goedel-Prover can take any mathematical problem (that is, the problem in english, it's formalization to Lean, including the header, and name,id,etc) and attempt to solve it? What will be the outcome if Goedel-Prover cannot solve it? How is it summarized exactly in <code>compilation_summarize.json</code>?</p>",
        "id": 502019602,
        "sender_full_name": "V S",
        "timestamp": 1740568105
    }
]