[
    {
        "content": "<p>Hey I'm a newbie. What's your favorite conferences/workshops in AI4Math field? I'm thinking about Lean users workshop and Neurips. What else? <br>\n(I know, this place is for formal proof. But if you know some good \"non-formal\" events, welcome to DM me.)</p>",
        "id": 530263521,
        "sender_full_name": "Chiung-Yi Tseng",
        "timestamp": 1753247565
    },
    {
        "content": "<p>You might be interested in this: <a href=\"https://mathai2025.github.io/\">https://mathai2025.github.io/</a></p>",
        "id": 530362391,
        "sender_full_name": "Kaiyu Yang",
        "timestamp": 1753281536
    },
    {
        "content": "<p>For Lean related conferences, there is a list here: <a href=\"https://leanprover-community.github.io/events.html\">https://leanprover-community.github.io/events.html</a>. Some are online and free.  Others require travel and/or an invitation.  Some have videos and papers.  Others don't.</p>",
        "id": 530544869,
        "sender_full_name": "Jason Rute",
        "timestamp": 1753358739
    },
    {
        "content": "<p>For AI-for-math and AI-for-theorem-proving conferences/workshops.</p>\n<ul>\n<li>The standard AI conferences like neurips, icml, and iclr often have associated workshops on AI for Math.  The next is <a href=\"https://mathai2025.github.io/\">https://mathai2025.github.io/</a> (as Kaiyu said).  They used to be fringe, but now they are very well attended.  (They are expensive, but if you don't attend, you can still read the papers after they are released.)  Similarly, there are sometimes tutorials on this or related topics at the conference (not part of the workshop). </li>\n<li>AITP (<a href=\"https://aitp-conference.org/\">https://aitp-conference.org/</a>) is a classic conference series on AI for theorem proving, which is very casual.  It includes a lot of proposals, ideas, and solutions that are not big enough for a full conference paper.</li>\n<li>Harvard CMSA's <a href=\"https://cmsa.fas.harvard.edu/events-archive/category/nt/list/?tribe-bar-date=2025-06-01&amp;eventDisplay=past#:~:text=11%2F6%2F2024%20November%206,00%20pm%20(Eastern%20Time).\">New Technology in Math seminar</a> invites weekly speakers to discuss lots of things in AI and math.  It meets during the semester both at Harvard and on Zoom.  (Their webpage is hard to navigate, but the best way to get informed is to reach out to the organizer, Michael Douglas.). They also record their talks on <a href=\"https://youtube.com/playlist?list=PL0NRmB0fnLJQJ3fuIk3yVULtm6_JnQ_zI&amp;si=esriCYWAYCoKlsnL\">YouTube</a>.</li>\n<li>The Joint Math Meetings, at least this past one, but probably in the foreseeable future, has sessions on both AI for Math and sessions on Lean.</li>\n<li>There are constantly little workshops here and there about AI for math or AI for interactive theorem proving (or even AI for Lean specifically).  Some are on the Lean conference list above.  Others are announced in <a class=\"stream\" data-stream-id=\"113486\" href=\"/#narrow/channel/113486-announce\">#announce</a>.  Some are run by mathematicians.  Others by computer scientists or programming language researchers.  Others by AI researchers.  Some have a good showing of people from AI labs.  Other none.</li>\n</ul>",
        "id": 530544883,
        "sender_full_name": "Jason Rute",
        "timestamp": 1753358744
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"115715\">Jason Rute</span> <a href=\"#narrow/channel/219941-Machine-Learning-for-Theorem-Proving/topic/Good.20conferences.20and.20workshops.20to.20attend/near/530544883\">said</a>:</p>\n<blockquote>\n<p>They are expensive, but if you don't attend, you can still read the papers after they are released.)  </p>\n</blockquote>\n<p>In addition to the usual travel costs, NeurIPS requires workshop attendees to register for NeurIPS, and the pricing depends a lot on whether you're a student or academic. This year, we're exploring whether it's possible to secure a limited number of travel grants.</p>\n<p>Yeah, the video recordings will be released some time after the conference.</p>",
        "id": 530586267,
        "sender_full_name": "Kaiyu Yang",
        "timestamp": 1753369831
    }
]