[
    {
        "content": "<p><strong>PROOFWALA: Multilingual Proof Data Synthesis and Theorem-Proving</strong></p>\n<p>The PROOFWALA framework, along with our itp-interface, provides a robust and scalable environment for automated theorem proving in Lean 4 and Coq. Whether you're searching for proofs using large language models (LLMs) or generating proof datasets, our framework is designed to simplify and accelerate the entire workflow.</p>\n<p><strong>What Does the Framework Offer?</strong></p>\n<ol>\n<li><strong>itp-interface Module</strong><br>\nImplemented in Python, the itp-interface (available at <a href=\"https://github.com/trishullab/itp-interface\">GitHub</a>) acts as a unified proof environment for both Lean 4 and Coq. Here's what makes it stand out:</li>\n</ol>\n<ul>\n<li><strong>Cross-ITP Compatibility:</strong> Write your automation code once—it works seamlessly with both Lean 4 and Coq.</li>\n<li><strong>Parallel Tactic Execution:</strong> Supports parallel proof step execution across multiple instances, improving efficiency during proof searches.</li>\n<li><strong>Efficient Memory Management:</strong> Avoids known pitfalls like memory bloating while using Lean 4 REPL, ensuring reliable large-scale proof searches.</li>\n<li><strong>Bug Prevention:</strong> Fixes issues related to incorrect proofs being accepted in Lean 4 REPL proof mode (see <a href=\"https://github.com/leanprover-community/repl/issues/44\">Lean issue</a>).</li>\n<li><strong>Flexible and Scalable:</strong> Easily run parallel proof tasks across multiple nodes using Ray clusters.</li>\n<li><strong>Proof data extraction:</strong> Parallel and scalable proof-state and step pair data from Coq and Lean GitHub repositories.</li>\n<li><strong>Simple Setup:</strong></li>\n</ul>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">pip</span><span class=\"w\"> </span><span class=\"n\">install</span><span class=\"w\"> </span><span class=\"n\">itp</span><span class=\"bp\">-</span><span class=\"n\">interface</span>\n<span class=\"n\">install</span><span class=\"bp\">-</span><span class=\"n\">itp</span><span class=\"bp\">-</span><span class=\"n\">interface</span>\n</code></pre></div>\n<blockquote>\n<p>Note: No need to manually install Lean 4 or other dependencies.</p>\n</blockquote>\n<ol start=\"2\">\n<li><strong>Proof Step Generation and Search</strong><br>\nThe proof-wala tool (<a href=\"https://pypi.org/project/proof-wala/\">PyPI link</a>, <a href=\"https://github.com/trishullab/proof-wala\">GitHub Link</a>) integrates with itp-interface to provide:</li>\n</ol>\n<ul>\n<li><strong>Multilingual Proof Search</strong>: Supports parallel, multilingual proof searches for both Lean 4 and Coq.</li>\n<li><strong>Proof Tree Visualization</strong>:  Annotate and analyze proof trees generated during searches, making it suitable for reinforcement learning (RL)-style training.</li>\n<li><strong>End-to-End Automation</strong>: Automates the entire proof discovery process, from theorem input to proof generation and annotation.</li>\n</ul>\n<p><strong>Demonstration:</strong></p>\n<ul>\n<li>We used our framework to train and evaluate models on datasets sourced from several formal repositories, including Mathlib (Lean), CompCert (Coq), MathComp (Coq) , and GeoCoq (Coq). The combined multilingual dataset contains over <strong>450,000 proof-step pairs</strong> from around <strong>80,000 theorems</strong>, totaling <strong>270M tokens</strong>.</li>\n<li>The multilingual models trained using PROOFWALA and ITP interface framework have demonstrated consistent performance improvements in proof generation as compared to the monolinguals models.</li>\n<li>Checkout our full paper about how multilingual proofstep training helps here: <a href=\"https://arxiv.org/abs/2502.04671\">https://arxiv.org/abs/2502.04671</a></li>\n</ul>\n<p>This work builds on contributions from libraries like <a href=\"https://github.com/leanprover-community/repl\">Lean 4 REPL</a> and <a href=\"https://github.com/HazardousPeach/coq_serapy\">Coq Serapy</a>. We are grateful to our co-contributors <span class=\"user-mention\" data-user-id=\"644040\">@George Tsoukalas</span> , Greg Durrett, Swarat Chaudhuri, and the theorem-proving community for their valuable feedback and support.</p>\n<p>Explore our framework and tools to enhance your research and automation in formal reasoning. Feedback is always welcome!</p>",
        "id": 498890612,
        "sender_full_name": "Amitayush Thakur",
        "timestamp": 1739231726
    }
]