[
    {
        "content": "<p>Hi all,</p>\n<p>I'm not entirely sure how Zulip works, this being my first time posting something, but hopefully someone can point me in the right direction.</p>\n<p>I've been trying to use <a href=\"https://github.com/lean-dojo/LeanDojo\">LeanDojo</a> as a gym-like environment for reinforcement learning. For those unfamiliar, the idea is to apply the ideas from models such as AlphaGo to the Lean tactics system for theorem proving. This is probably a well explored avenue on this subzullip (if that is the word?), but I can't find any topics myself.</p>\n<p>My question is, given a traced version of Mathlib4 that is compatible with LeanDojo and the installed Lean4 version, I keep trying to access the theorems using the cache. I can verify that the cache is there, and that it is not corrupted, but regardless after loading the repo into memory, the code still begins retracing.</p>\n<p>Has anyone run into similar issues before? Or do people have some familiarity with LeanDojo? Before dumping a bunch of code snippets with potential mistakes, which would make this post even longer (apologies), I thought I'd ask if anyone would be able to help.</p>\n<p>Many thanks!<br>\nGerben</p>",
        "id": 540973554,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1758621487
    },
    {
        "content": "<p>The repo in question is <a href=\"https://github.com/GerbenKoopman/LeanReinforcement\">github.com/GerbenKoopman/LeanReinforcement</a>, but it is quickly growing very messy and chaotic due to much falling standing up and more falling.</p>",
        "id": 540973964,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1758621620
    },
    {
        "content": "<p>Feel free to post an issue in LeanDojo's GitHub repo. You may also want to explore whether other alternatives work for your use case, e.g., <a href=\"https://github.com/leanprover-community/repl\">https://github.com/leanprover-community/repl</a>, <a href=\"https://github.com/leanprover/Pantograph\">https://github.com/leanprover/Pantograph</a>, <a href=\"https://github.com/project-numina/kimina-lean-server\">https://github.com/project-numina/kimina-lean-server</a></p>",
        "id": 541015867,
        "sender_full_name": "Kaiyu Yang",
        "timestamp": 1758634358
    },
    {
        "content": "<p>Hi there, I'm new to Zulip as well. I tried to trace the miniF2F-lean4 repo with LeanDojo and got an error. I thought I'd bring some more attention to the issue since it's been a few days without any activity on my issue. Not sure if it's better to move it directly to the LeanDojo's GitHub repo. <a href=\"https://github.com/yangky11/miniF2F-lean4/issues/31\">https://github.com/yangky11/miniF2F-lean4/issues/31</a></p>",
        "id": 554212113,
        "sender_full_name": "Nicholas Jiang",
        "timestamp": 1762474128
    },
    {
        "content": "<p>Hi Nicholas, I've since solved my issue,  but maybe I can still help you with the error you're running into. I thought it might be related to <a href=\"https://github.com/lean-dojo/LeanDojo/issues/211\">https://github.com/lean-dojo/LeanDojo/issues/211</a>, but it looks like you're using Lean version 4.10? Regardless, the latest MiniF2F repo uses mathlib v.4.24 so that might still be it. Maybe worth trying to downgrade MiniF2F to something pre 4.12 and see if that works?</p>",
        "id": 554272896,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1762507187
    },
    {
        "content": "<p>Related: I'm not sure if leandojo automatically uses the lean version from the repo's lean-toolchain file when tracing. For the repo I was tracing it's using 4.24 now but I think it was 4.21 when I tried tracing (<a href=\"https://github.com/yangky11/miniF2F-lean4/blob/main/lean-toolchain\">https://github.com/yangky11/miniF2F-lean4/blob/main/lean-toolchain</a>)</p>",
        "id": 554333807,
        "sender_full_name": "Nicholas Jiang",
        "timestamp": 1762525167
    },
    {
        "content": "<p>Yeah exactly, but both are post-v4.12, which the issue is about. The only thing that makes me unsure is because it states to only be in tactic mode and I'm still getting my bearing in the whole TacticM stuff that Lean uses (not by statements but rather the metaprogramming used). Perhaps others can confirm if this issue is related to tracing in the first place.</p>",
        "id": 554417225,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1762550369
    }
]