[
    {
        "content": "<p>I have always been a fan of the Draft-Sketch-Prove approach, and <a href=\"https://github.com/GasStationManager/LeanTool\">LeanTool</a>'s system messages and features generally encourage the LLMs to decompose the proof task by starting with a proof sketch, and getting the goals from the sorrys (thanks for Pantograph's load_sorry). What had been missing was a good hammer tactic that can help solve some of the smaller goals. <br>\nThat's changed lately with the recent release of <a href=\"https://github.com/JOSHCLUNE/LeanHammer\">LeanHammer</a>, and other tools including Canonical, egg, grind etc coming along. </p>\n<p>To help facilitate the use of hammers by LLMs, I have added the following (very experimental) \"Sorry Hammer\" feature to LeanTool: if the LLM passes a Lean source code with <code>sorry</code>s to the tool, and choose to activate the <code>sorry_hammer</code> option of the tool call, then the tool will try to replace the first <code>sorry</code> with a hammer tactic. By default it is <code>hammer</code> from LeanHammer, but this is configurable, and can even be a list of tactics to try one by one (the list is converted to <code>first | tac_1 | tac_2 | ..</code>).</p>\n<p>LeanTool allows the LLM to iteratively refine its proof attempt: if the hammer fails, it can go back to the drawing board and try replacing the sorry with a more fine-grained proof sketch. (Right now you might need to prompt the LLMs; but if you find a prompt that works well, let me know and I can add it to the system prompt!)</p>\n<p>You can try it out by installing <a href=\"https://github.com/GasStationManager/LeanTool\">LeanTool</a>, or trying out its API server (by pointing your coding assistant to <a href=\"http://www.codeproofarena.com:8800/v1\">http://www.codeproofarena.com:8800/v1</a> as the base URL.)</p>\n<p>Let me know how it goes! Feature requests welcome. </p>\n<ul>\n<li>what combination of tactics tend to work best as hammer for your use case? </li>\n<li>rewriting with the proof from the <code>Try this</code> suggestion: for now you can prompt the LLM to do it. One could try to automate this...</li>\n</ul>",
        "id": 525806876,
        "sender_full_name": "GasStationManager",
        "timestamp": 1750897506
    },
    {
        "content": "<p>This is exciting! It seems similar functionality is available in Jetbrains RocqStar (for Rocq) <a href=\"https://arxiv.org/pdf/2505.22846\">https://arxiv.org/pdf/2505.22846</a><br>\nHowever, LeanTool makes it more convenient to give specific hints about what tactics to use.</p>",
        "id": 526047122,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1751017157
    }
]