[
    {
        "content": "<p>There is a site <a href=\"https://paperswithcode.com\" target=\"_blank\" title=\"https://paperswithcode.com\">https://paperswithcode.com</a>.  It is contains most modern ML papers, especially those with associated open source code bases.  They also maintain lists of leaderboard specifying which models are state of the art.  (Such leaderboards should be taken with a grain of salt, but at the same time I think they are quite useful in guiding the field.)</p>",
        "id": 187742321,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581218462
    },
    {
        "content": "<p>Anyway, the site is broken down by topic, and I've been, for the most part, unofficially maintaining the <a href=\"https://paperswithcode.com/task/automated-theorem-proving\" target=\"_blank\" title=\"https://paperswithcode.com/task/automated-theorem-proving\">Automated Theorem Proving Topic</a> section.  I mostly do the following:</p>\n<ul>\n<li>Add papers which haven't already been added. (Most papers are quickly added by others or by automated tools, but some get left out.)</li>\n<li>Adding links to the code for the papers.  This is really important and one of the main purposes of the site.</li>\n<li>Adding items to the leaderboards and add new leaderboards.  I think leaderboards/benchmarks/datasets are one of the best approaches to advertise theorem proving to the ML community.  However, my approach has been to only add a leaderboard if (1) it is a clear benchmark/dataset that someone could try to compete against, and (2) there have been at least two papers on that particular dataset/benchmark (so at least two data points demonstrating that others think this is a valuable metric). But that is just my approach.  It also helps if that benchmark/dataset has a well-defined name.  Since TP problems are often of the form \"prove as many theorems within time limit T,\" it is hard to sum up the benchmark in a short title if it doesn't have a well-defined name.  (One unfortunately can't add links or a description.)</li>\n</ul>",
        "id": 187742324,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581218468
    },
    {
        "content": "<p><strong>Is anyone interested in helping me maintain that part of the site?</strong>  My role isn't official, and anyone can add stuff to the site, but I think it is important that those with interest and understanding in ML and TP maintain that section.  I've been preoccupied with other stuff and haven't added anything for a few months.</p>",
        "id": 187742326,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581218477
    }
]