[
    {
        "content": "<p>Maybe this is a silly question, given that I have relatively little Lean/Mathlib experience compared to AI experience, but here goes.</p>\n<p>While debugging ML agents that use the Mathlib library for premises and as a dataset (e.g. <a href=\"https://zenodo.org/records/12740403\">LeanDojo Benchmark 4</a>), this often has to be done on an HPC cluster, as many machines can not fit the traced Mathlib in memory. Of course there are unit tests you could write, but that is quite an exercise. Ideally I would like to use a 'toy version' of Mathlib. Something that is large enough for meaningful testing, but small enough to only take ~16GB RAM tops. Does such an ML toy example of Mathlib exist? I considered going back to a very early commit, but then you get Lean version issues of course.</p>\n<p>I could try to excise large portions of files for a custom MathlibTest, or write my own, but both seem quite involved and easier said than done. I can imagine I'm missing something, such as perhaps I don't need to load all of Mathlib. If so, please let me know (and how) <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> <br>\nThanks in advance!</p>",
        "id": 558200522,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1763558452
    },
    {
        "content": "<p>Looks like you got the markdown syntax backwards on <a href=\"https://zenodo.org/records/12740403\">the URL</a> that you posted.</p>",
        "id": 558204523,
        "sender_full_name": "David Renshaw",
        "timestamp": 1763559433
    },
    {
        "content": "<p>Oh thanks for the heads-up <span class=\"user-mention\" data-user-id=\"243791\">@David Renshaw</span>, I pasted and clicked the link icon, but indeed it's backwards.</p>",
        "id": 558204678,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1763559468
    },
    {
        "content": "<p>The file at that URL is 68.1 MB. How is that taking up more than 16 GB of memory?</p>",
        "id": 558205049,
        "sender_full_name": "David Renshaw",
        "timestamp": 1763559555
    },
    {
        "content": "<p>So the file only contains the pointers to the further Mathlib environment. It has extracted theorems and proofs, but for the proof tree and premise retrieval you need Mathlib itself. An example line of the jsonl looks like this:</p>\n<p><code>{\"url\": \"https://github.com/leanprover-community/mathlib4\", \"commit\": \"29dcec074de168ac2bf835a77ef68bbe069194c5\", \"file_path\": \"Mathlib/AlgebraicGeometry/PrimeSpectrum/Basic.lean\", \"full_name\": \"PrimeSpectrum.range_comap_of_surjective\", \"start\": [750, 1], \"end\": [754, 21], \"traced_tactics\": [{\"tactic\": \"rw [\\u2190 Set.image_univ]\", \"annotated_tactic\": [\"rw [\\u2190 &lt;a&gt;Set.image_univ&lt;/a&gt;]\", [{\"full_name\": \"Set.image_univ\", \"def_path\": \"Mathlib/Data/Set/Image.lean\", \"def_pos\": [701, 9], \"def_end_pos\": [701, 19]}]]}]}</code></p>\n<p>Note the start and end values, as well as def_pos. These reference lines and columns in the Mathlib files.</p>",
        "id": 558206404,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1763559859
    },
    {
        "content": "<p>For supervised learning I guess only this 68MB file is sufficient, as you can backprop over the used tactics from Mathlib proofs, but for premise retrieval or reinforcement learning you probably want to have access to Mathlib itself. Hence the need for a 'toy version' of the dataset during testing (HPC hours are a budget, time and environmental waste).</p>",
        "id": 558206824,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1763559976
    },
    {
        "content": "<p>Are you asking for a smaller mathlib environment or a smaller mathlib training dataset?</p>",
        "id": 558223622,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1763563715
    },
    {
        "content": "<p>The first, a smaller mathlib environment. Or, if it exists, a subgraph of mathlib's proof DAG to import.</p>",
        "id": 558223915,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1763563782
    },
    {
        "content": "<p>A natural candidate would be to just use core Lean + Batteries. They still have nontrivial proofs, e.g. in <a href=\"https://github.com/leanprover-community/batteries/blob/c278d4e94fe43bc38da4966795dc0c72538e68ab/Batteries/Data/List/Lemmas.lean\">Batteries/Data/List/Lemmas.lean</a>. Curating a \"tiny Mathlib\" would necessarily be extremely subjective, and it would be hard to say what is \"worth keeping\" or not. You'll end up with plenty of cases where a 'basic' concept in math, like real numbers, ends up importing a good chunk of 'advanced' math (topology, lattice theory). If you have test problems you want to import, it will be tricky to decide what the right minimal set to include is, except for manually doing a #min_imports type thing.</p>\n<p>But just for testing that your model can load an environment, learn something, interact... Lean+Batteries should be a fine testbed</p>",
        "id": 558252567,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1763570095
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"448405\">@Alex Meiburg</span>, sounds good! This sounds like exactly what I was looking for.</p>",
        "id": 558253565,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1763570368
    },
    {
        "content": "<p>I agree that any subset would be subjective and up to interpretation of minimal, but indeed load-learn-interact seems sufficient to me.</p>",
        "id": 558253759,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1763570415
    },
    {
        "content": "<p>The Mathlib import graph is necessarily a DAG, so you can always just slice it off across any arbitrary cut to get a library that is \"small enough\".</p>",
        "id": 558319137,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1763592731
    },
    {
        "content": "<p>e.g. remove a random leaf file until it's small enough.</p>",
        "id": 558319180,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1763592756
    },
    {
        "content": "<p>I guess this is a bit of a different question, but is there an existing way to find or visualize this DAG of the current Mathlib? Not just for this, but for other applications too. How do I know which files or folders are leafs without manually looking for them in the documentation.</p>",
        "id": 558319909,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1763593151
    },
    {
        "content": "<p>I could write a program to do that but I assume that this exists and is actively maintained in a more efficient/idiomatic manner, given how central the DAG is to Mathlib.</p>",
        "id": 558320028,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1763593204
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib4_docs/mathlib.html\">https://leanprover-community.github.io/mathlib4_docs/mathlib.html</a> is a visualization</p>",
        "id": 558320527,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1763593461
    },
    {
        "content": "<p>Thanks for the help everyone</p>",
        "id": 558320644,
        "sender_full_name": "Gerben Koopman",
        "timestamp": 1763593532
    },
    {
        "content": "<p>Or you can use the <code>ImportGraph</code> package to directly write out a <code>gexf</code> XML file</p>",
        "id": 558320669,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1763593545
    }
]