[
    {
        "content": "<p>Is there a python library that can verify the correctness of a lean3 theorem? I'd like to integrate it in my autoformaliztion program.</p>",
        "id": 434496883,
        "sender_full_name": "秋天",
        "timestamp": 1713615829
    },
    {
        "content": "<p>Why aren't you using lean4?</p>",
        "id": 434501429,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1713619964
    },
    {
        "content": "<p>The two easiest ways to use Lean 3 or Lean 4 from Python are (1) by just making a Lean file and running lean as a subprocess on that file or (2) by using the Lean language server.  The latter has a light weight wrapper around it in <a href=\"https://github.com/leanprover-community/lean-client-python\">https://github.com/leanprover-community/lean-client-python</a>.  It is for Lean 3, but you could adapt it to Lean 4.  Honestly the most important part of that previous project is just to handle the asynchronous communication correctly.  The rest is just unnecessary converting the JSON API into Python types.  (Unfortunately I don’t think the Lean server protocol is well documented for either Lean 3 or Lean 4.)</p>\n<p>There are also projects like Lean-Gym (Lean 3) and Lean Dojo (Lean 3 and Lean 4) and Lean REPL (Lean 4), but these are very specific to a particular task, so may not fit your use case.  You could also use Lean’s meta programming to build your own custom interface.  <a href=\"https://github.com/siddhartha-gadgil/LeanAide\">LeanAide</a> (Lean 4) did this for autoformalization and was able to use information about Lean’s library and type checker as feedback in the autoformalization process.  But this is more work.</p>",
        "id": 434514857,
        "sender_full_name": "Jason Rute",
        "timestamp": 1713629678
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"284160\">Eric Rodriguez</span> <a href=\"#narrow/stream/219941-Machine-Learning-for-Theorem-Proving/topic/Python.20library.20for.20lean3/near/434501429\">said</a>:</p>\n<blockquote>\n<p>Why aren't you using lean4?</p>\n</blockquote>\n<p>While it is good to push people to Lean 4 I don’t think this community fully appreciates how much trouble that is for AI research.  There has been a lot of work already done in Lean 3 and many of the LLMs still spit out Lean 3 instead of Lean 4.</p>",
        "id": 434515127,
        "sender_full_name": "Jason Rute",
        "timestamp": 1713629940
    },
    {
        "content": "<p>oh  thank you so much. as some dataset is only availble in lean3 . have no choice <span aria-label=\"face in clouds\" class=\"emoji emoji-1f636-200d-1f32b\" role=\"img\" title=\"face in clouds\">:face_in_clouds:</span></p>",
        "id": 434516255,
        "sender_full_name": "秋天",
        "timestamp": 1713630968
    }
]