[
    {
        "content": "<p>Very enjoyable blog post by Terry - <a href=\"https://terrytao.wordpress.com/2025/12/08/the-story-of-erdos-problem-126/\">https://terrytao.wordpress.com/2025/12/08/the-story-of-erdos-problem-126/</a>  must read.  Also, <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/alphaevolve-on-google-cloud\">https://cloud.google.com/blog/products/ai-machine-learning/alphaevolve-on-google-cloud</a> has been released into private preview.   Soon!</p>\n<p>I actually meant this post to be an appendage to <a class=\"stream-topic\" data-stream-id=\"219941\" href=\"/#narrow/channel/219941-Machine-Learning-for-Theorem-Proving/topic/Erdos.20124.20AI.20Solution/with/562171598\">#Machine Learning for Theorem Proving &gt; Erdos 124 AI Solution</a>  Unfortunately, Zulip isn't very supportive of edits.  Strangely, I was on that thread when I posted this.  Odd UI</p>",
        "id": 562880105,
        "sender_full_name": "Deleted User 968128",
        "timestamp": 1765350618
    },
    {
        "content": "<p>I left a comment on Terry's blog, though not sure it got in, so I will post it here.</p>\n<p>Terry, this was a very inspiring read and the acceleration of community on these problems - community enabled and empowered by AI.  </p>\n<p>It was particularly fascinating to see how the Aristotle lean proof triggered the cascade of ideas to follow, despite not being not seen as particularly novel.   But I think that is the entire point and promise of what could be built around this.</p>\n<p><strong>Critically</strong> - I think there is room for a lot of AI based enhancements to TFBloom's website, integrating all external artifacts, such as the git, RAG, and all other relevant community and paper based resources.</p>\n<p>OpenAI has group chat <a href=\"https://openai.com/index/group-chats-in-chatgpt/\">https://openai.com/index/group-chats-in-chatgpt/</a> but I think this calls for something more boutique and custom built. An agentic flow that can properly <strong>cite</strong>, track, synthesize, and realtime integrate contributions from a diverse set of mathematicians.</p>\n<p>It will not just be looking to help spark ideas and solve problems, but aggressively determining possibilities for re-use in related questions. It could perhaps help prioritize mathlib coverage.</p>\n<p>Most importantly in this agent flow will be the citing capability, providing strong motivations and incentives for people to get credibly involved.</p>\n<p>The architecture of the flow should be built in a way that domain experts can enhance and customize its thinking. The idea is to take care of all the glue-code problems so experts don't need to worry about that.</p>\n<p>I really do hope you will think about reaching out to the labs to get them to help invest in something like this. Perhaps with the guarantee that they can use it as free training material they might be interested providing credits, though I'd like to think the halo effect should be value enough.</p>\n<p>At this point, there are one of two outcomes I think we can almost guarantee will happen.  Either the above will eventually get built, or ASI in math will occur making it redundant an unrequired.</p>",
        "id": 562893070,
        "sender_full_name": "Deleted User 968128",
        "timestamp": 1765354779
    },
    {
        "content": "<p>Hi Tim - I don't want to add any \"AI based enhancements\" to the site (at least not for the foreseeable future). There is clearly a lot that can be, and has been done, with such tools, but I'd like to keep the site relatively simple as a \"purely human benchmark\". </p>\n<p>For example, I am not using AI in any way to collect or transcribe the problems, and certainly not to generate 'new' Erdos-style problems. </p>\n<p>In these days when so much of online content is generated or altered with AI somehow, I'd like to do what I can to keep one small corner human. (I suspect this is also beneficial for the AIs scraping the site as well, lest they start training on their own output too much.)</p>\n<p>Many users are using AI tools in their own preferred way to help them generate solutions, which is great, but I'd like to leave this up the individuals and let the site be a clean place that the problems and any progress can be recorded.</p>\n<p>Of course there are a couple of spin-off projects that use the site (e.g. the Formalised Conjectures github), and one can imagine someone else setting up their own external site that uses AI in the way you describe. But that someone won't be me.</p>",
        "id": 562913117,
        "sender_full_name": "Thomas Bloom",
        "timestamp": 1765360141
    },
    {
        "content": "<p>I'm not thrilled with the idea of ASI making people largely redundant, but if it happens I will try to adapt.  </p>\n<p>Hopefully things will plateau and AI will stop at a place where it can just surface and connect knowledge and ideas that people generate, revealing them to each other without ego and rapidly accelerating the process of discovery.</p>\n<p>There is an intriguing opportunity in that.  Greater global collaboration, where big problems and puzzles are solved by many people working very efficiently together in open science, getting the credit they deserve for their small part in pushing the rock up the hill.  </p>\n<p>Terry illuminates it well - \"One striking feature of this story for me is how important it was to have a diverse set of people, literature, and tools to attack this problem....It was only through the combined efforts of all the contributors and their tools that all these key inputs were able to be assembled within 48 hours. It seems plausible that a more traditional effort involving just one or two mathematicians and simpler programming and literature search tools may eventually have been able to put all these pieces together, but I believe this process would have taken much longer (on the order of weeks or even months).\"</p>\n<p>It's something you learn when developing ML models: blending diverse approaches is very compelling.   It's fairly standard practice to look for a small, poorly performing, but strange model which finds answers where the others cannot.</p>",
        "id": 562932859,
        "sender_full_name": "Deleted User 968128",
        "timestamp": 1765366361
    },
    {
        "content": "<p><a href=\"https://arxiv.org/pdf/2506.19923\">https://arxiv.org/pdf/2506.19923</a>  \"PROVER AGENT: AN AGENT-BASED FRAMEWORK FOR FORMAL MATHEMATICAL PROOFS\"  might be one way to do this .. </p>\n<blockquote>\n<p>Prover Agent coordinates an informal reasoning LLM, a formal prover model, and feedback from Lean while also generating auxiliary lemmas. These auxiliary lemmas are not limited to subgoals in the formal proof but can also include special cases or potentially useful facts derived from the assumptions, which help in discovering a viable proof strategy.<br>\n..<br>\nInstead, by generating auxiliary lemmas, the agent can gradually construct an effective proof strategy in a bottom-up manner, even when the full structure is not initially apparent</p>\n</blockquote>\n<p>These auxiliary lemmas could be stored for RAG / re-use potential as well.  I think for AI to start solving in a more interesting way it needs to be more exploration and less exploitation.   This would be more expensive, but if re-use could be a byproduct might be worth it (some massaging may be required, but seems doable).</p>\n<p>What's a bit tragic with these closed source solutions coming out is that they might all be re-inventing a lot of auxiliary lemmas that could be pooled .   Reminds me a bit of the dueling italians and the cubic equation..</p>",
        "id": 563177439,
        "sender_full_name": "Deleted User 968128",
        "timestamp": 1765456958
    },
    {
        "content": "<p><a href=\"https://deepmind.google/blog/alphageometry-an-olympiad-level-ai-system-for-geometry/\">https://deepmind.google/blog/alphageometry-an-olympiad-level-ai-system-for-geometry/</a>  does something similar, but at a larger scale and I think less curated.... </p>\n<p>these folk seem kinda skeptical though:  <a href=\"https://arxiv.org/abs/2410.20274\">https://arxiv.org/abs/2410.20274</a> <a href=\"https://arxiv.org/pdf/2504.03048\">https://arxiv.org/pdf/2504.03048</a>  <a href=\"https://arxiv.org/pdf/2507.22069\">https://arxiv.org/pdf/2507.22069</a> Makes for very interesting reading... </p>\n<p>my suspicion is they are probably right, but it's a combination of poor build for re-use and poor retrieval.  I don't see a lot of research being done into former, though the latter seems better covered.</p>",
        "id": 563181216,
        "sender_full_name": "Deleted User 968128",
        "timestamp": 1765458187
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"968128\">@Tim Shephard</span> Please try harder to ensure the content you post is relevant to Lean.</p>\n<p>There is plenty of space in the web for open-ended discussion of applications of AI to mathematics. This is good (I read many of these myself) but it is also important that there are corners of the web where we try to be more focussed; in our case the focus is Lean and Mathlib.</p>",
        "id": 563228203,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1765469340
    },
    {
        "content": "<p>I mean, the papers are all about lean?  Did you read them?</p>",
        "id": 563254597,
        "sender_full_name": "Deleted User 968128",
        "timestamp": 1765476583
    },
    {
        "content": "<p>This is the single time Lean is mentioned across the four links you shared, as far I can see:<br>\n<a href=\"/user_uploads/3121/H1bnjGLpDaMogm7A1czasl4s/image.png\">image.png</a><br>\nWhy are you wasting our time?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/H1bnjGLpDaMogm7A1czasl4s/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"977x227\" src=\"/user_uploads/thumbnail/3121/H1bnjGLpDaMogm7A1czasl4s/image.png/840x560.webp\"></a></div>",
        "id": 563256316,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1765477190
    },
    {
        "content": "<p>Prover Agent is based on lean.  Library learning is a very important concept that the entire lean movement is working on.  If re-use is failing in autoformalization, it seems pretty relevant.</p>",
        "id": 563256889,
        "sender_full_name": "Deleted User 968128",
        "timestamp": 1765477387
    },
    {
        "content": "<p>It's interesting, one of the papers seem to dismiss the retrieval results because it was failing to find lemmas with the same names in the re-use library.   I guess they didn't think it counts if the LLM was using 90% of the ideas and not performing exact string matches.</p>",
        "id": 563258116,
        "sender_full_name": "Deleted User 968128",
        "timestamp": 1765477800
    }
]