[
    {
        "content": "<p>(Sorry, couldn't resist the title)</p>\n<p>I am interested in (auto)formalizations of the theoretical foundations of machine learning / AI. And I'm hoping other AI/ML researchers on this channel are interested in potential collaborations.</p>\n<p>I have created a <a href=\"https://github.com/GasStationManager/ArtificialTheorems\">github repo</a>. AI-generated / AI-assisted contributions are explicitly allowed and encouraged, with the following quality assurance:</p>\n<ul>\n<li>Formal theorem statements are vetted by human experts.</li>\n<li>Proofs are checked by secure verifiers like Comparator &amp; SafeVerify. (So far I have a script based on SafeVerify; I am very interested in getting Comparator set up as well. )</li>\n</ul>\n<p>Among its first contributions is my formalization of the classical result of the convergence of stochastic gradient descent. This includes a formalization of the Robbins-Siegmund theorem from stochastic approximation theory, which could be of independent interest.</p>\n<p>I think this could be a potential model for effective collaborations between subject-area experts and experts in Lean autoformalization. The subject-area experts only have to know enough Lean to verify the Lean theorem statements are faithful translations of the original informal theorems. For example, you are welcome to contribute formalizations of theorem statements that you'd like to see formally proved.</p>\n<p>Comments and suggestions appreciated!</p>",
        "id": 566472823,
        "sender_full_name": "GasStationManager",
        "timestamp": 1767670138
    },
    {
        "content": "<p>You might be interested in this Rocq project by my previous colleagues at IBM Research: <a href=\"https://github.com/IBM/FormalML\">https://github.com/IBM/FormalML</a></p>",
        "id": 566475700,
        "sender_full_name": "Jason Rute",
        "timestamp": 1767672816
    },
    {
        "content": "<p>Thanks for the pointer!</p>\n<p>On the Lean side, there's also the recent formalization of convergence of Q-Learning: <a href=\"https://github.com/ShangtongZhang/rl-theory-in-lean\">https://github.com/ShangtongZhang/rl-theory-in-lean</a></p>\n<p>And of generalization error bound by Radmacher complexity: <a href=\"https://github.com/auto-res/lean-rademacher\">https://github.com/auto-res/lean-rademacher</a></p>\n<p>These are by experts in the respective areas, and they appeared to have taken significant efforts to formalize. In the <a href=\"https://arxiv.org/pdf/2511.03618\">companion paper</a> of the Q-Learning result, the author mentions that LLMs were used to help with Mathlib research and to close small lemmas. I think AI could offer more in these formalization efforts; e.g. I can prove the convergence of stochastic gradient descent as a non-expert in the underlying theory (I had not even heard of the Robbins-Siegmund theorem beforehand).</p>",
        "id": 566484241,
        "sender_full_name": "GasStationManager",
        "timestamp": 1767679471
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"489369\">@Avi Shinnar</span></p>",
        "id": 566538926,
        "sender_full_name": "Jason Rute",
        "timestamp": 1767704287
    },
    {
        "content": "<p>Love what’s going on here; I have not heard of Robbins-Siegmund either and will read about it. </p>\n<p>This is something I vibe-coded a little while ago, and updated it today after seeing this post. <a href=\"https://e-vergo.github.io/LEAN_mnist/\">https://e-vergo.github.io/LEAN_mnist/</a></p>\n<p>Not sure it's exactly what you're looking for, but it's a working MLP that trains on the classic MNIST handwritten dataset, written entirely in Lean 4 (using SciLean). It achieves ~93% accuracy on the full 60K training set using a 784-&gt;128-&gt;10 dense MLP, which is pretty run of the mill.</p>\n<p>It also includes some verification work: 3 gradient correctness theorems resting on 7 axioms. The MLP does really work, but the proofs aren't about the actual floating-point implementation. Because of the Float/Real gap in Lean 4 (no Flocq equivalent), the proofs are about an abstract version over the reals.</p>\n<p>The goal was to start exploring the entire training pipeline for proof/verification opportunities. The idea is rather than focus on the neural net, treat the entire training process as the machine being studied, which includes the NN being trained. With that framing, \"What parts of the machine can we prove things about?\" was a motivating question. Data loading, backprop, results logging, everything.  It's rough around the edges, but if you and/or others are interested I can keep plugging away. As it stands, I haven't done any verification work outside of the NN itself, but that's on the to do list. The reality is that this is a lot of work and I'm not sure if it has any value.</p>\n<p>Also, I tried integrating ArtificialTheorems for the SGD convergence proofs, but hit a version mismatch (SciLean locks to Lean 4.20.1, ArtificialTheorems needs 4.23.0). Once SciLean upgrades, those convergence theorems could replace 3-4 of my axioms (I think). </p>\n<p>GitHub: <a href=\"https://github.com/e-vergo/LEAN_mnist\">https://github.com/e-vergo/LEAN_mnist</a></p>",
        "id": 566668465,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1767766402
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"988234\">@Eric Vergo</span> for sharing this! I'll take a closer look.</p>\n<p>I think formal verification of end-to-end properties of an NN system would be very useful, and especially important to AI safety; and that is why I am interested in this direction. But it is still an open problem; I think an active area of research, including from the mechanistic interpretability angle, but we currently don't know how to do this in a scalable way. </p>\n<p>My current goal with this repo is by (auto)-formalizing foundational ML theory, we build tools that will be useful towards answering these type of questions. We don't need complete coverage of undergraduate AI/ML (as if whatever definition we come up with won't become obsolete in a year). But I do think some ML theorems will stay relevant and important. </p>\n<p>Some of the stuff on my wish list include:</p>\n<ul>\n<li>universal representation theorems for deep neural nets</li>\n<li>generalization theory (there's the Radmacher complexity paper mentioned above, but more)</li>\n<li>implicit regularization (how training via SGD can achieve generalization)</li>\n<li>RL theory</li>\n<li>Bayesian learning. And perhaps building on top of that, Singular Learning Theory.</li>\n</ul>\n<p>I think looking at an MLP with the MNIST dataset is a great way to get a sense of the different components of an ML system, how they fit together, and to what extent can they be formally verified.</p>",
        "id": 567049201,
        "sender_full_name": "GasStationManager",
        "timestamp": 1767914626
    },
    {
        "content": "<p>I think the backprop work is interesting. Ultimately, what we ideally want is an auto-diff library with formal guarantees. Elsewhere on zulip there is an announcement of <a href=\"#narrow/channel/516743-computer-science/topic/JaxProof.3A.20JAX.20code.20generation.20and.20verification/with/565612343\">JaxProof</a> which looks quite interesting. </p>\n<p>But at some point we do need to formally deal with floating point and how they affect accuracy. My intuition is that a good theoretical treatment should take into account the optimization process. SGD is an algorithm that appears to be extremely robust to noise. A recent trend is to do large-scale training using low-precision number representations, while still achieving good accuracy. To what extent can this be formalized?</p>",
        "id": 567050851,
        "sender_full_name": "GasStationManager",
        "timestamp": 1767915694
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"776090\">GasStationManager</span> <a href=\"#narrow/channel/219941-Machine-Learning-for-Theorem-Proving/topic/Theorem.20Proving.20for.20Machine.20Learning/near/567050851\">said</a>:</p>\n<blockquote>\n<p>But at some point we do need to formally deal with floating point and how they affect accuracy. My intuition is that a good theoretical treatment should take into account the optimization process. SGD is an algorithm that appears to be extremely robust to noise. A recent trend is to do large-scale training using low-precision number representations, while still achieving good accuracy. To what extent can this be formalized?</p>\n</blockquote>\n<p>yes, I had thoughts in this space as well. In the limit we could study <a href=\"https://arxiv.org/pdf/2502.19008v1\">binary neural nets</a>, which may permit to being modeled in convenient ways.</p>",
        "id": 567053001,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1767917316
    },
    {
        "content": "<p>This looks like another work in this topic:  <a href=\"https://x.com/fanghui_sgra/status/2020773004113010918?s=46\">https://x.com/fanghui_sgra/status/2020773004113010918?s=46</a></p>",
        "id": 572768456,
        "sender_full_name": "Jason Rute",
        "timestamp": 1770641661
    }
]