[
    {
        "content": "<p>Does anyone know of a tool for programmatically cleaning, compressing, or otherwise optimizing proofs in Lean? This would be useful in the context of proving with LLMs, which are know to introduce redundant steps. I'm aware of the ImProver work that uses LLMs to rewrite proofs, in particular, to shorten them. But I thought that maybe we have some purely symbolic tool for that available.</p>",
        "id": 527523316,
        "sender_full_name": "Bartosz Piotrowski",
        "timestamp": 1751908394
    },
    {
        "content": "<p>unfortunately there is not a symbolic tool for proof shortening available.</p>",
        "id": 527525081,
        "sender_full_name": "Jared green",
        "timestamp": 1751909161
    },
    {
        "content": "<p>Here are two tools somewhat along these lines I've been told about before:</p>\n<ul>\n<li><a href=\"https://dl.acm.org/doi/abs/10.1145/3703595.3705877\">Tactic script optimization for <code>aesop</code></a></li>\n<li><a href=\"https://github.com/riyazahuja/ImProver\">ImProver</a> (which you mentioned)</li>\n</ul>\n<p>I would also be interested in anyone who knows things I can add to this list.</p>",
        "id": 527526699,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1751909868
    },
    {
        "content": "<p>Thanks a lot! I'll definitely check Tactic Script Optimisation, sounds relevant.</p>",
        "id": 527557379,
        "sender_full_name": "Bartosz Piotrowski",
        "timestamp": 1751920461
    },
    {
        "content": "<p>I'm currently working on this. Hopefully I'll be allowed to open-source it.</p>\n<p>I thought the Aesop stuff would generalise nicely, but now that I'm actually working on the more general problem, I'm finding that it's quite specific to Aesop's needs.</p>",
        "id": 527849420,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1752054541
    },
    {
        "content": "<p>Thank you Jannis, a general proof optimizing / cleaning tool would be definitely useful. Tell me, please, in case you are able to share something!</p>",
        "id": 527897566,
        "sender_full_name": "Bartosz Piotrowski",
        "timestamp": 1752070105
    }
]