[
    {
        "content": "<p>Something I'm working on and would love the community's feedback:</p>\n<p><a href=\"https://github.com/GasStationManager/VibeRegistry\">VibeRegistry</a>: Verified Registry of AI-Assisted Lean Proofs.<br>\n(As a nod to a certain popular thread on this zulip, y'all can call this 'slopnet' if you like...)</p>\n<p>This is a registry of external github repos of AI-generated/AI-assisted libraries of Lean proofs, and:</p>\n<ul>\n<li>does automated secure verification using SafeVerify and comparator, as part of its CI</li>\n<li>human experts can vett and sign-off on the specifications, that the Lean theorem statements match the informal statements in the literature.</li>\n</ul>\n<p>Currently contain entries for two repos: </p>\n<ul>\n<li><a href=\"https://github.com/GasStationManager/ArtificialTheorems\">https://github.com/GasStationManager/ArtificialTheorems</a></li>\n<li><a href=\"https://github.com/YuanheZ/lean-stat-learning-theory\">https://github.com/YuanheZ/lean-stat-learning-theory</a></li>\n</ul>\n<p>But certainly this is not limited to ML theory; other topics (e.g. Math, CS) are welcome! Suggested entries are appreciated, if you have / know of an autoformalized Lean library!</p>\n<p>My goal for this repo is to explore a decentralized model of building libraries. Right now, if I want to potentially use an autoformalized library, two potential pain points are: whether its definitions and theorem statements are right, and whether the proofs are valid.  This registry can hopefully serve as a trusted resource towards addressing these two concerns.</p>",
        "id": 574446530,
        "sender_full_name": "GasStationManager",
        "timestamp": 1771401720
    },
    {
        "content": "<p>Something very similar was discussed at <a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general/topic/sloplib/with/574009699\">#general &gt; sloplib</a></p>",
        "id": 574453101,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1771404080
    },
    {
        "content": "<p>What type of repos do you include/expect? Simple collections of (interdependent) Lean files? Blueprint repos? I guess it would be more probable that a reviewer signs off a blueprint repo?</p>",
        "id": 574477819,
        "sender_full_name": "Ralf Stephan",
        "timestamp": 1771411749
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"776090\">@GasStationManager</span> Did you consider using LLMs to review the statements? It's not perfect, but it can be a start.</p>",
        "id": 574974883,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1771602963
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"707242\">@Ralf Stephan</span> both blueprint repos and non blueprint repos are acceptable. I agree that blueprint makes it easier for human experts to sign off .</p>\n<p><span class=\"user-mention\" data-user-id=\"259452\">@Bas Spitters</span> interesting point. I assume the authors of repos will already asked LLMs to review the statements, hopefully before proofs are attempted. There may be value for separate LLM reviews of statements; but this may be harder to get right; I have done brief experiments in related questions, and LLMs could hallucinate much more easily. Still, a worthwhile direction to explore.</p>",
        "id": 576321896,
        "sender_full_name": "GasStationManager",
        "timestamp": 1772215402
    }
]