[
    {
        "content": "<p>Hi all, <br>\nThis week there was some discussion at the end of the lecture about people wanting to work on some projects using their new Lean skills <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span>. This thread is a good place to discuss these topics together, to see what other people are interested in and maybe team up as well. Hopefully we'll have lots of interesting ideas!</p>",
        "id": 462592039,
        "sender_full_name": "Rick de Wolf",
        "timestamp": 1723740529
    },
    {
        "content": "<p>Personally I am very interested in topics related to probability theory. More specifically I'm interested in applications to information theory and complex networks. I haven't had a chance to look into what is available in Lean at the moment, but I wouldn't mind working on implementing more basic theorems or tactics. </p>\n<p>If you're interested in this, I'd love to chat about it <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 462592430,
        "sender_full_name": "Rick de Wolf",
        "timestamp": 1723740687
    },
    {
        "content": "<p>What about formalizing the definition if AIXI?<br>\n<a href=\"https://en.wikipedia.org/wiki/AIXI\">https://en.wikipedia.org/wiki/AIXI</a><br>\nWould it be a meaningful project?</p>",
        "id": 462741035,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1723797198
    },
    {
        "content": "<p>That's an ambitious project <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span> I have experience in reinforcement learning so I would be interested in seeing where this goes! Do you have any concrete ideas for a starting point?</p>",
        "id": 462753325,
        "sender_full_name": "Rick de Wolf",
        "timestamp": 1723801912
    },
    {
        "content": "<p>I'm not sure if it's meaningful to you :) I'm personally less interested in machine learning oriented approaches these days, but if you want to see ML constructs formalized in Lean I'd say go for it!</p>",
        "id": 462753493,
        "sender_full_name": "Rick de Wolf",
        "timestamp": 1723801976
    },
    {
        "content": "<p>We’re interested in Markov chain Monte Carlo and the Metropolis Hastings algorithm. Related is the field of statistical mechanics, which connects with probability and statistics.</p>\n<p>Not sure how much these intersect with the above interests.</p>",
        "id": 462766654,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1723807491
    },
    {
        "content": "<p>I have some limited experience with MCMC algorithms, but I would potentially be interested in joining the effort :). What kind of results are you interested in formalizing?</p>",
        "id": 462777844,
        "sender_full_name": "Rick de Wolf",
        "timestamp": 1723811835
    },
    {
        "content": "<p>I'm a statistics student, and I'm formalizing an open source <a href=\"https://github.com/akp2003/prob-book\">probability book</a>. I have formalized the first chapter in Lean, and I'm currently working on the second chapter. I try not to use measure theory because the book is not based on measure theory, so I want to keep the theorems as similar as their latex version (that's why I don't use mathlib definitions on probability and instead I try to define them according to the book).<br>\nYou can formalize any parts of the book if you are interested (You can fork the project and do it in your own way or pull request, I don't know<span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>). I'm not planning to add my theorems to mathlib, but if you found any interesting results, feel free to modify and add to mathlib.</p>",
        "id": 462851153,
        "sender_full_name": "Arshak Parsa",
        "timestamp": 1723839544
    },
    {
        "content": "<p>I believe there must be a separate library for statistics theorems (called statlib, for instance<span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>)</p>",
        "id": 462851412,
        "sender_full_name": "Arshak Parsa",
        "timestamp": 1723839685
    },
    {
        "content": "<p>I'm also interested in formalizing some concepts of mathematical statistics in lean like sufficiency, unbiasedness, Fisher–Neyman factorization theorem, etc. <br>\nIt would be great to have a separate channel for statistics and probability here on zulip.</p>",
        "id": 462851562,
        "sender_full_name": "Arshak Parsa",
        "timestamp": 1723839782
    },
    {
        "content": "<p>And maybe a separate channel for lean4 related memes. I've made some memes already <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 462852125,
        "sender_full_name": "Arshak Parsa",
        "timestamp": 1723840092
    },
    {
        "content": "<p>I'm interested in topics related to Data science. From  what we have learned, I am thinking of using Lists and/or Structures as data structures for storing some data and to do something with it. But I have yet to figure how I'm going to use proofs for such a topic. <br>\nWhat ideas do you have for possible proofs or approaching the topic (Data science) in general in Lean?</p>",
        "id": 463027814,
        "sender_full_name": "Urja Kuppa",
        "timestamp": 1723920080
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"603023\">Rick de Wolf</span> <a href=\"#narrow/stream/445230-Lean-for-Scientists-and-Engineers-2024/topic/Project.20ideas/near/462777844\">said</a>:</p>\n<blockquote>\n<p>I have some limited experience with MCMC algorithms, but I would potentially be interested in joining the effort :). What kind of results are you interested in formalizing?</p>\n</blockquote>\n<p>We use MCMC (not in Lean) to simulate properties of molecules. On Tuesday, I'll be sharing about LeanMD; LeanMC would be related.</p>\n<p>The original Monte Carlo simulation was actually for a chemistry application! <br>\n<a href=\"/user_uploads/3121/-4VAftb6Dsv4MRHDFMutykqb/Metropolis53-EOS-with-fast-computing-machines.pdf\">Metropolis53-EOS-with-fast-computing-machines.pdf</a></p>",
        "id": 463074217,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1723942919
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"728975\">Arshak Parsa</span> <a href=\"#narrow/stream/445230-Lean-for-Scientists-and-Engineers-2024/topic/Project.20ideas/near/462851412\">said</a>:</p>\n<blockquote>\n<p>I believe there must be a separate library for statistics theorems (called statlib, for instance<span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>)</p>\n</blockquote>\n<p>You can certainly build your own libraries, but I suspect that integrating the work with Mathlib would make your contribution much easier for others to use and build on. </p>\n<p>That said, others have worked on formalizing whole textbooks - especially for a well-known textbook, having a parallel Lean version can be neat!</p>\n<p>For example \"How to Prove It\" has a companion \"<a href=\"https://djvelleman.github.io/HTPIwL/IntroLean.html\">How to Prove it in Lean.</a>\"</p>\n<p>Zulip discussion on that <a href=\"#narrow/stream/113489-new-members/topic/How.20to.20prove.20it.20with.20lean\">here</a>.</p>",
        "id": 463074731,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1723943462
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"728975\">Arshak Parsa</span> <a href=\"#narrow/stream/445230-Lean-for-Scientists-and-Engineers-2024/topic/Project.20ideas/near/462851153\">said</a>:</p>\n<blockquote>\n<p>I'm a statistics student, and I'm formalizing an open source <a href=\"https://github.com/akp2003/prob-book\">probability book</a>. I have formalized the first chapter in Lean, and I'm currently working on the second chapter. I try not to use measure theory because the book is not based on measure theory, so I want to keep the theorems as similar as their latex version (that's why I don't use mathlib definitions on probability and instead I try to define them according to the book).<br>\nYou can formalize any parts of the book if you are interested (You can fork the project and do it in your own way or pull request, I don't know<span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>). I'm not planning to add my theorems to mathlib, but if you found any interesting results, feel free to modify and add to mathlib.</p>\n</blockquote>\n<p>I don't know much about measure theory, but my impression is that this is the way (maybe the only way?) to properly ground statistics and probability in the axioms of mathematics. My guess is that it <em>should</em> be possible to express probability and statistics at a high level that is nonetheless grounded in the measure-theory in Mathlib, but in a way that abstracts away the tedious details so the user only interacts with familiar notions. </p>\n<p>We really struggled with calculus proofs over the last couple years, because, of course, differentiation is built on limits, but these need to be filters to make them rigorous, and so you need to understand sets... For an engineer, that's a lot to learn that's not part of one's training - it should be possible to just prove things about derivatives! But then folks like <span class=\"user-mention\" data-user-id=\"346070\">@Tomas Skrivan</span> build things like <code>fun_prop</code> which automate away the tedium, and it gets a lot easier to use. </p>\n<p>I hope we see progress along these lines in probability and statistics, which in my view suffers from a similar situation with measure theory.</p>",
        "id": 463074957,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1723943757
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"746398\">Urja Kuppa</span> <a href=\"#narrow/stream/445230-Lean-for-Scientists-and-Engineers-2024/topic/Project.20ideas/near/463027814\">said</a>:</p>\n<blockquote>\n<p>I'm interested in topics related to Data science. From  what we have learned, I am thinking of using Lists and/or Structures as data structures for storing some data and to do something with it. But I have yet to figure how I'm going to use proofs for such a topic. <br>\nWhat ideas do you have for possible proofs or approaching the topic (Data science) in general in Lean?</p>\n</blockquote>\n<p>This is a really cool idea! Could be a lot of possibilities. Hopefully the Tuesday lecture will give you some inspiration - we formalized linear regression.</p>\n<p>Keep in mind the distinction between \"proofs\" and \"calculations\" that I made early on (Lecture 2, I think?). Lean proofs don't \"solve for x\" - if you want to do that, you most likely need to write the code for the algorithm that does (but Lean can help you prove that the algorithm is correct). Also, I think the more promising projects are those that can be successful <em>without</em> needing efficient code execution / processing large amounts of data. You'll see some of our preliminary results around that on Tuesday.</p>",
        "id": 463075568,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1723944282
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/stream/445230-Lean-for-Scientists-and-Engineers-2024/topic/Project.20ideas/near/462741035\">said</a>:</p>\n<blockquote>\n<p>What about formalizing the definition if AIXI?<br>\n<a href=\"https://en.wikipedia.org/wiki/AIXI\">https://en.wikipedia.org/wiki/AIXI</a><br>\nWould it be a meaningful project?</p>\n</blockquote>\n<p>Interesting! Just learning about this now. Looks connected to reinforcement learning, but with lots of theoretical guarantees - neat project! I wonder if Lean could both <em>simulate</em> the behavior of such an agent, as well as have proofs accompanying its definition.</p>",
        "id": 463076391,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1723944839
    },
    {
        "content": "<p>For the record there is at least one alternative proposed foundation for probability theory, Shafer and Vovk's game-theoretic foundations: <a href=\"http://www.probabilityandfinance.com/2019_book/index.html\">http://www.probabilityandfinance.com/2019_book/index.html</a> .  (One can ignore the world \"finance\" in the title, which only describes some later chapters.)  This book and its predecessor have had an influence in some circles. But measure theory is the standard foundation for probability theory.  It's pervasive and imo, beautiful.  Shafer and Vovk's way is very interesting, though, allowing some generalizations of probability that are perhaps less natural with a measure-theoretic foundation. </p>\n<p>I wonder whether game-theoretic probability might more easily allow constructive definitions for probability.  This is pure speculation on my part--I don't know enough to know or even to start to think it through.  But I would guess that you have to do a lot of work in constructive math to get to basic theorems of measure theory before they can be applied to probability. Maybe game-theoretic probability would provide a more direct way of proving theorems in probability theory.  However, measure theoretic foundations of probability are well-known to lots of people. Game-theoretic probability is not, and it's very different.</p>",
        "id": 463098509,
        "sender_full_name": "mars0i",
        "timestamp": 1723956172
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"424214\">@Tyler Josephson ⚛️</span> Formalizing linear regression sounds like a very interesting project. I'll be out of town during Tuesday's lecture but I'm looking forward to watching the recording!</p>",
        "id": 463136957,
        "sender_full_name": "Rick de Wolf",
        "timestamp": 1723974128
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"617444\">@mars0i</span> That's an amazing find! I'll be adding this book to my reading list <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 463140070,
        "sender_full_name": "Rick de Wolf",
        "timestamp": 1723974941
    },
    {
        "content": "<p>It's great to see all of you being interested in topics related to probability theory, statistics, and data science. It seems like we each want to go in different directions, but I think it would be great to share progress with the others. We might be able to help each other out and learn from each other's projects since a lot of it has probability theory at its core.</p>",
        "id": 463142114,
        "sender_full_name": "Rick de Wolf",
        "timestamp": 1723976147
    },
    {
        "content": "<p>The project I am interested in is to formalize information theory based on the book <a href=\"https://onlinelibrary.wiley.com/doi/book/10.1002/047174882X\">Elements of Information Theory</a> by Cover and Thomas. Information theory involves a lot of non-measure theoretic probability theory, so I hope to improve some of Lean's probability tools along the way :). Getting some feedback on existing probability and measure theory tools would be very nice :)</p>",
        "id": 463142990,
        "sender_full_name": "Rick de Wolf",
        "timestamp": 1723976496
    },
    {
        "content": "<p>I am mostly replying because being new to a forum and not getting any reply is a bit of a let down.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"746398\">Urja Kuppa</span> <a href=\"#narrow/stream/445230-Lean-for-Scientists-and-Engineers-2024/topic/Project.20ideas/near/463027814\">said</a>:</p>\n<blockquote>\n<p>I'm interested in topics related to Data science. From what we have learned, I am thinking of using Lists and/or Structures as data structures for storing some data and to do something with it. But I have yet to figure how I'm going to use proofs for such a topic.</p>\n</blockquote>\n<p>My advice would be to just try with a simple problem and then when Lean complains try asking an LLM such as ChatGPT or Claude for help and/or asking here. You might actually be able to do some simple practical code without creating new proofs because you did not create any new structure, etc. Remember that much of the existing functions and structures already have the needed proofs.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"746398\">Urja Kuppa</span> <a href=\"#narrow/stream/445230-Lean-for-Scientists-and-Engineers-2024/topic/Project.20ideas/near/463027814\">said</a>:</p>\n<blockquote>\n<p>What ideas do you have for possible proofs or approaching the topic (Data science) in general in Lean?</p>\n</blockquote>\n<p>If that were my problem I would get some algorithms and translate them into Lean.</p>\n<p><a href=\"https://xlinux.nist.gov/dads/\">Dictionary of Algorithms and Data Structures</a><br>\n<a href=\"https://dlmf.nist.gov/\">NIST Digital Library of Mathematical Functions</a><br>\n<a href=\"http://algorist.com/algorist.html\">The Stony Brook Algorithm Repository</a><br>\nStackOverflow tag <a href=\"https://stackoverflow.com/tags/language-agnostic/info\">Language Agnostic</a> - Contains <em>Free Language Agnostic Programming Books</em></p>",
        "id": 463211422,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1724003582
    },
    {
        "content": "<p>I'm not trying to formalize anything at the moment, but a collaborator and I are exploring using dependently typed programming for writing simulations of some processes in biological evolution.  The project is at an early stage, and I'm still learning dependently typed methods.  At the moment what we've done  is in Agda, but we have been planning to rewrite it in Lean.</p>",
        "id": 463262670,
        "sender_full_name": "mars0i",
        "timestamp": 1724028002
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"746398\">@Urja Kuppa</span> I’ve been thinking about your question over the weekend:<br>\nAre you familiar with pandas in Python? What do you think about creating something like that in Lean? I don’t know if anyone has made a “DataFrame” data structure in Lean for storing tables of data along with strings for column names, but something like that could facilitate a lot of follow-on data science applications.</p>",
        "id": 463274798,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1724032763
    },
    {
        "content": "<p>The formalized linear regression we’ve implemented is also quite rudimentary - only for the y=m*x+b case, no generalization to multiple linear regression. That could be a project for someone that would be quite useful.</p>",
        "id": 463275036,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1724032871
    },
    {
        "content": "<p>Data visualization is a major part of data science. I don’t foresee that being a priority for doing in Lean since I don’t see much opportunities for proofs / formalization in that area, and there are plenty of external libraries for making aesthetic figures.</p>",
        "id": 463275235,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1724033007
    },
    {
        "content": "<p>But - it might be neat to have a figure appear in the infoview. And those making Lean for game-related applications implement various kinds of visualizations for Sudoku, Mancala, etc. - might be some prior work and people to talk to if that were a direction to go.</p>",
        "id": 463275665,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1724033236
    }
]