[
    {
        "content": "<p>As an example of a use of lean in high energy physics, I am planning on putting together an api for the anomaly cancelation conditions. These are (for the standard model of particle physics) a set of 6 diophantine equations in 18 variables, given in equations 1a-1f of <a href=\"https://arxiv.org/pdf/2006.03588.pdf\">https://arxiv.org/pdf/2006.03588.pdf</a>. The solutions of these equations are of physical interest, specifying the allowed charges particles can take under the addition of an extra U(1) gauge group to the standard mode gauge algebra.</p>\n<p>There are a number of simple known facts about these equations and variations thereof which are of interest to physicists. Formalising these equations and facts thereof seems like a good first step in the direction of formalizing aspects of high energy physics, not least because the underlying mathematics is fairly simple and very concrete.</p>\n<p>If anyone would like to get involved with this, or has other comments please let me know.</p>",
        "id": 425159456,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1709752223
    },
    {
        "content": "<p>Be careful that being very concrete is a bad thing for formalization. Abstract things are almost always easier to formalize.</p>",
        "id": 425161121,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1709752822
    },
    {
        "content": "<p>If it's any help, subtracting 3 * equation 1c from equation 1a gives you a simpler equation 1a' which could be used instead.</p>",
        "id": 425164851,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1709754088
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> What I meant by 'concrete' was that the problem is very well defined, poor choice of words on my part. But I agree that this may lead to issues. </p>\n<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> The equations are written in the way they are in that paper because of their physical origin from certain Feynman diagrams. I care less about actually formalising the solution that happens to be the subject of that paper (which I don't think the average physicist would care about), and care more about formalizing a bunch of simple facts physicists know and do care  about them and their solutions. A sort of 'baby steps of lean into high-energy physics'  project.</p>",
        "id": 425166866,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1709754743
    },
    {
        "content": "<p>I like it! This looks like an excellent problem to tackle, since the underlying math looks nice and simple (but also includes a decent amount of tedium, so there's motivation to formalize to ensure no mistakes compared to the handwritten situation). My questions: </p>\n<p>Is there motivation for computing different solutions to these equations, depending on different situations? If so, you could think about programming a verified software for doing those calculations in Lean, rather than just writing some proofs about the math.</p>\n<p>Would the relevant variables be natural numbers or integers? If they're reals, then <em>computing</em> solutions to this would become tricky, but if not, then writing executable code based on this model would be straightforward, too.</p>",
        "id": 425175333,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1709758185
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"424214\">@Tyler Josephson ⚛️</span> , thanks :). To answer your questions:</p>\n<p>1) Yes there is motivation. This has been done (using an unverified program) here : <a href=\"https://inspirehep.net/literature/1708575\">https://inspirehep.net/literature/1708575</a> (and for a very similar set of equations here: <a href=\"https://inspirehep.net/literature/1886600\">https://inspirehep.net/literature/1886600</a>). I think the only point of writing a verified version would be for demonstration purposes - although maybe this is a good enough reason in itself. </p>\n<p>2) They are integers (although one can take them to be rationals if one so chooses since the equations are homogenous).</p>",
        "id": 425178080,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1709759266
    },
    {
        "content": "<p>Sounds like a great project, then. You refer to “a very similar set of equations” - you could also consider formalizing both of them, and formally defining how they are related to one another (Is one a special case of the other? Are both specific instances of a third, more general thing?)</p>",
        "id": 425182067,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1709761065
    },
    {
        "content": "<p>Also, what did you have in mine when you say “API”?</p>",
        "id": 425182752,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1709761356
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"424214\">@Tyler Josephson ⚛️</span>  There is an injective map from solutions of one into solutions of the other, but not vice versa. And yes they are more specific instances of a more general thing. However to formalize that more general thing requires going out of the theory of diophantine equations, and integers, and into the theory of Lie algebras and their representations. It is probably worth formalizing this at some point, but maybe not the priority. </p>\n<p>Maybe my use of \"API\" is not standard. I meant a collection of all results (or as many as possible) relate to these equations, such that if at some point in the future lean takes off in the physics community, these results could be used in other proofs and definitions etc.</p>",
        "id": 425288658,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1709813182
    },
    {
        "content": "<p>FYI (in case anyone comes across this and is interested), I am working on this in this GitHub repository: <a href=\"https://github.com/jstoobysmith/Anomaly_Cancellation_in_Lean\">https://github.com/jstoobysmith/Anomaly_Cancellation_in_Lean</a></p>",
        "id": 427660644,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1710844078
    },
    {
        "content": "<p>I've moved the above repository into a more generic one for high energy physics: <a href=\"https://github.com/HEPLean/HepLean\">https://github.com/HEPLean/HepLean</a>. The aim of this repository is to be an open-source library of theorems, proofs, definitions, calculations etc from high energy physics.</p>",
        "id": 435061329,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1713903244
    },
    {
        "content": "<p>Cool!</p>",
        "id": 435062399,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1713903683
    }
]