[
    {
        "content": "<p>Hi! My name is Mario. I am leading a research group within the Max Planck Society in Germany. My work focuses on quantum physics and AI for science. I have little experience with Lean, and aside from supervising one bachelor’s thesis on <a href=\"https://mpl.mpg.de/fileadmin/user_upload/Krenn_RG/bachelor_lode_vermeulen.pdf\">quantum optics in Lean</a>, I have mainly been watching talks by Kevin Buzzard and others.</p>\n<p>Until recently, it was quite unclear to me how Lean could contribute to physics. However, after a call with <span class=\"user-mention\" data-user-id=\"424214\">@Tyler Josephson ⚛️</span> last week (who suggested I say hello here), I spent the weekend reading papers and watching <span class=\"user-mention\" data-user-id=\"653351\">@Joseph Tooby-Smith</span>’s talk.</p>\n<p>I now think there might be an incredibly exciting possibility for using these tools in physics -- namely through automated inverse deduction. Let me explain in a very simple way, and I am very curious about your thoughts.</p>\n<p>Induction is the derivation of mathematical laws from experimental data -- essentially a form of advanced curve fitting. In AI, this is sometimes called symbolic regression (examples include Planck's fitted formula for black body radiation or the Lorentz fit describing the Michelson-Morley experiment). While useful, this approach doesn’t reveal much about the underlying physics.</p>\n<p>A different way to gain scientific insight is deduction, where one starts with a set of simple assumptions and derives scientific laws. For example, Einstein’s special relativity theory derives the Lorentz transformation from the postulates of the constant speed of light and the invariance of physical laws for observers in relative motion.</p>\n<p>I saw in a paper by Tyler that derivations of laws from simpler assumptions are possible. Similarly, parts of <a href=\"https://dash.lib.harvard.edu/handle/1/38811518?show=full\">special relativity theory have been derived in Coq from five axioms</a>.<br>\nDeduction: simple assumptions -&gt; physical laws.</p>\n<p>Inverse deduction, on the other hand, would look like this:<br>\nsimple assumptions &lt;- physical laws.</p>\n<p>In other words, given physical laws, which sets of assumptions could lead to them? See one <a href=\"https://www.iqoqi-vienna.at/research/mueller-group/reconstructions-of-quantum-theory\">non-automated example in quantum physics</a>. I think, if this is possible -- even at a small scale -- it could have an enormous impact. It would mark the first time that true physical principles could be discovered in an automated way (to my knowledge, no other automated method even comes close to having the ability to achieving this).</p>\n<p>I am very curious to hear your thoughts. Thanks a lot!</p>",
        "id": 496228598,
        "sender_full_name": "Mario Krenn",
        "timestamp": 1738020216
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"297962\">@Mario Krenn</span> ! Nice to meet you! How do you envision inverse deduction being automated?<br>\nI'm also a bit confused about what you see the rules of the game being i.e. where does one stop with the <code>simple assumptions</code> e.g.  does one go all the way back to the axioms of a set - I guess not?</p>",
        "id": 496260408,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1738041881
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"297962\">Mario Krenn</span> <a href=\"#narrow/channel/395462-Natural-sciences/topic/Deduction.20of.20physical.20principles.3F/near/496228598\">said</a>:</p>\n<blockquote>\n<p>However, after a call with @Tyler Josephson <span aria-label=\"atom\" class=\"emoji emoji-269b\" role=\"img\" title=\"atom\">:atom:</span> last week (who suggested I say hello here)</p>\n</blockquote>\n<p>I also want to give a thanks to <span class=\"user-mention\" data-user-id=\"424214\">@Tyler Josephson ⚛️</span>, I had the pleasure to watch his <a href=\"#narrow/channel/113486-announce/topic/Lean.20for.20Scientists.20and.20Engineers\">Lean for Scientists and Engineers!</a> remotely and learned quite a bit; glad to see him here.</p>",
        "id": 496294116,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1738057450
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/channel/395462-Natural-sciences/topic/Deduction.20of.20physical.20principles.3F/near/496260408\">said</a>:</p>\n<blockquote>\n<p>How do you envision inverse deduction being automated?</p>\n</blockquote>\n<p>The inverse problem is a search problem, it is very related to many inverse problems in science i think. My research group's main focus for instance is on the automated design of new physics experiments, which is basically the inverse of a standard forward computation (experiment to experimental result that can be performed with simulators). There are many techniques developed for inverse problems, one can try different ones, the simplest (to show whether it works) is just to enumerate all possibilities. The crucial point is: The forward step should not make too much problems, thats a usual property of inverse problems. E.g. computing the expected physical results given an experimental setup requires \"just\" solving Maxwell/Schroedinger. In this case, the forward-step goes from axioms to equations of motions. It will be crucial to get this to work, its likely a challenging part of this idea.</p>",
        "id": 496319041,
        "sender_full_name": "Mario Krenn",
        "timestamp": 1738065864
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/channel/395462-Natural-sciences/topic/Deduction.20of.20physical.20principles.3F/near/496260408\">said</a>:</p>\n<blockquote>\n<p>I'm also a bit confused about what you see the rules of the game being i.e. where does one stop with the <code>simple assumptions</code> e.g.  does one go all the way back to the axioms of a set - I guess not?</p>\n</blockquote>\n<p>Not all the way down to axioms of math, but all the way to simple assumptions, i was very inspired by <a href=\"https://pubs.rsc.org/en/content/articlehtml/2023/dd/d3dd00077j\">Tyler's paper on chemistry</a> and his derivation of Langmuir adsorption in Lean (see assumptions in eq.(1) and (2)). In special relativity for instance, one would have as assumptions the constancy of speed of light, and the fact that one cannot distinguish in any way whether you are moving constantly or standing still (<a href=\"https://dash.lib.harvard.edu/handle/1/38811518?show=full\">the Coq paper on SRT shows one option</a>).</p>",
        "id": 496320202,
        "sender_full_name": "Mario Krenn",
        "timestamp": 1738066241
    },
    {
        "content": "<p>I have many thoughts about this, because I’ve been wondering how this might work out for a few years now.</p>\n<p>First, it’s important to recognize that Lean isn’t really made to do reasoning without a goal. In other words, science and engineering problems that involve the idea of “solve for x” are typically hard to do in Lean since you’d need to state what “x” is, and that sort of defeats the point of asking the question (for a scientist or engineer). But this is a problem being worked on in the Lean community - it goes by names like, “how can Lean be more like a computer algebra system?”</p>\n<p>The other issue is more fundamental to logic, and doesn’t depend on Lean per se. If you just ask, “here are my assumptions, what can I derive from them?”, you’ll find you can derive an infinite number of statements. Think about this paper: <a href=\"https://link.springer.com/article/10.1007/s10489-017-0954-8\">https://link.springer.com/article/10.1007/s10489-017-0954-8</a> and this one:<br>\n<a href=\"https://arxiv.org/html/2405.06677v1\">https://arxiv.org/html/2405.06677v1</a><br>\nYou might even imagine tasks like, “what if an AI started with the core of Lean and just went off, imagining new maths?” <br>\nHow would it need to be coaxed into constructing useful maths? Beautiful maths? Math libraries that are practical to use? You could do this from many starting points, as long as you ensured each was free of contradictions. </p>\n<p>The forward “automated theory construction” is about growing a complex, many-branched tree from a root, where you have a mechanism for validation at each branching point. </p>\n<p>Now, what about reversing the process? You need to grow your way backwards to the root (or perhaps, many possible roots). I can’t think of many examples of this in logic. “If and only if” goes both ways, but most of Mathlib is about defining an object and showing that it has properties — this is implication in one direction. It’s hard to imagine “state a property, then generate definitions that have that property,” but I suppose that’s what you have in mind?</p>",
        "id": 496543230,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1738155791
    },
    {
        "content": "<p>There's a version of this that has had mild success within universal algebra (where, generally, the axioms are much simpler to state than physics). First, you have someone state - or prove - <em>some</em> set of necessary and sufficient axioms A1. (\"Necessary and sufficient\" as in they are true in the theory, and imply the whole theory - the axioms could still be redundant with each other!) Then you can search for some 'minimal' set of axioms A2 that is equivalent to A1.</p>\n<p>What metric defines \"minimal\", and what form you want your axioms to take, is a bit subjective of course. You can always reduce to a single-axiom theory A1' by combining all of the axioms in A1 with a logical AND. But often there's also some kind of idea of 'expression length' or 'variable count' that maybe should be reduced.</p>\n<p>In physics, the types of relevant expressions are often much more flexible, but having an AI propose \"notably small\" basic sets of axioms by any intuitive measure would certainly be good.</p>",
        "id": 496563664,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1738161578
    },
    {
        "content": "<p>Besides GPTs, another decent example on a physical system is <a href=\"https://arxiv.org/pdf/2311.07476\">https://arxiv.org/pdf/2311.07476</a> .<br>\nFor context, since that's kind of a specialized topic:</p>\n<ul>\n<li>The relevant theory here is \"quantum circuits\"</li>\n<li>There is an obvious axiomatic interpretation of quantum circuits which is \"interpret everything as unitaries of size 2^n\", which in some sense tells you everything you'd want to know about quantum circuits.</li>\n<li>You can show that the simpler question of \"when are two quantum circuits equal?\" is actually also sufficient - if you have a theory that tells you which circuits are equal, you can also use that to prove (in a meaningful sense) everything about their output probabilities and so on. This reduces the theory in some complexity. But determining which circuits are equivalent is hard to express.</li>\n<li>Another work had established a minimal set of axioms that precisely determine when two circuits are equivalent. It was phrased in terms of ZX-calculus. ZX-calculus involves working with somewhat exotic objects that don't correspond to any physical circuits. But, you can lift all actual circuits into a \"ZX diagram\"; and they gave minimal axioms for proving which ZX diagrams are equivalent.</li>\n<li>The paper I linked (or rather, a slightly earlier paper) then finally found some axioms purely in terms of the circuits - as an equational theory - that were equivalent to the ZX calculus axioms. This was the first statement of \"circuit equivalence\" purely in terms of circuits.</li>\n<li>Then there was work to reduce and simplify those axioms, which is the actual paper I linked. They reduced the axioms in size and number, and showed that they were non-redundant (in the sense that removing any single axiom was not sound).</li>\n</ul>",
        "id": 496564486,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1738161790
    },
    {
        "content": "<p>I think a particularly interesting direction to explore, among others,  would be to use the idea of invariance under transformation as a foundational principle and to draw inspiration from reverse mathematics (<a href=\"https://plato.stanford.edu/entries/reverse-mathematics/\">https://plato.stanford.edu/entries/reverse-mathematics/</a>), potentially using physical equivalences to guide / constrain our exploration of the space of possible physical theories, much like logical equivalences (via model theory) guide the exploration of mathematical foundations in reverse mathematics: i.e. symmetry and invariance but also dualities between theories, conservation laws, and invariance under changes of representation (like coordinate or basis changes).</p>",
        "id": 496579634,
        "sender_full_name": "Matteo Cipollina",
        "timestamp": 1738165722
    },
    {
        "content": "<p>Thanks a lot <span class=\"user-mention\" data-user-id=\"424214\">@Tyler Josephson ⚛️</span>, great papers. Let me call Atotal=(A1, A2, ...) the total list of assumptions and X the physical law/equation of motion etc.</p>\n<p>I think why this is much simpler than automated proof search:<br>\n1) in physics it is usually very easy to derive equation of motions from a set of assumptions (a small number of simple algebraic steps), at least compared to mathematical proofs.<br>\n2) We know what X is (those are specific equation of motions, e.g. SRT, ART, or Schroedinger), do not need to explore any expression that follows from Atotal.</p>\n<p>What is required boils down to the <strong>forward pass</strong>:<br>\nGiven some Atotal, does X follow from it or not?</p>\n<p>If the forward pass can reasonably be automated, then there are many inverse methods that can be applied (that work externally and just use the forward pass as a tool for exploring possibilities).</p>",
        "id": 496617574,
        "sender_full_name": "Mario Krenn",
        "timestamp": 1738175136
    },
    {
        "content": "<p>The forward pass can be definitely automated if only simple logic is required. But expressing and doing proofs about Schrodinger’s equation will require higher-order logic, so no guarantees. You’d need two steps:</p>\n<p>1) ensure consistency of Atotal (avoid principle of explosion, <a href=\"https://en.m.wikipedia.org/wiki/Principle_of_explosion\">https://en.m.wikipedia.org/wiki/Principle_of_explosion</a>)<br>\n2) attempt to prove that X follows from Atotal</p>\n<p>Either step would be undecidable, but you could always try letting one of the open-source ML tools for theorem proving give it a try. </p>\n<p>I wonder if, in physics, you’ll also need to do extra work to carefully define your semantics. In a few hours I can share what I mean.</p>",
        "id": 496630374,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1738179652
    },
    {
        "content": "<p>Suppose you wanted Atotal to consist of \"classical mechanics\" (e.g. Newton's laws of motion, gravity, linear and angular momentum, derivative relationships among position, velocity, acceleration, etc.). We know we can derive the kinematic equations from this, which describe projectile motion. We can also derive equations for the motion of planets, pendulum, mass on a spring, stability of a car driving around a turn, a mass on a pulley, etc. You might imagine making some set of these things be \"X\" and show that Atotal --&gt; X, and then start your exploration of alternative versions of Atotal that might also explain X. But it's ultimately not going to be quite this simple, because you'll need to define, semantically, what a \"projectile\" is and what a \"pendulum\" is and what a \"pulley\" is and so forth. There needs to be some kind of guidance (most likely, a formal specification) around <em>what aspects of Atotal</em> are relevant in this or that situation. </p>\n<p>I don't know what that's going to look like in the situation you have in mind, but I think it's something important to think about.</p>",
        "id": 496682658,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1738204814
    },
    {
        "content": "<blockquote>\n<p>you'll need to define what a \"pendulum\" is and so forth</p>\n</blockquote>\n<p>Yeah, this is why I think working in a slightly more closed setting is good. Fix what form your <em>data</em> takes, so that the operational meaning is fixed; then look for the minimal constraints on the data to be well-behaved.</p>\n<ul>\n<li>Quantum mechanics is typically described in terms of operators and expectation values. If you boil down the axioms you need to get a 'sensible' theory, you arrive at the study of von Neumann algebras.</li>\n<li>Classical physics can be described in terms of differential equations with forces, or an action that gets minimized, or symplectic geometry. Those are different kinds of data, and each one has an operational meaning. We have corresponding ways to interconvert. The \"axioms\" are then properties the data should have, like the action should probably at least be continuous. You could also define it as the limit of quantum systems.</li>\n<li>GPTs describe both quantum and classical physics; now the data is \"preparation\" and \"transformation\" and \"observation\" probabilities. There are some common axioms all GPTs should follow. And then there are additional axioms that are known to uniquely determine quantum or classical physics (or other exotic realities).</li>\n<li>In my example above, the theory of quantum circuits is a PROP (no relation to the type theoretic <code>Prop</code>) with a standard operational interpretation: that a circuit has \"output probabilities\". It was some human ingenuity to show that the output data is in some sense redundant, and that circuit equality determined the operational semantics. Then there's a bunch of math to get minimal axioms.</li>\n</ul>\n<p>Those all kind of talk about the same problem, but they all have different starting data, so the answer is very different.</p>",
        "id": 496696356,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1738214940
    },
    {
        "content": "<p>These problems aren't unique to physics, they also apply to e.g. compiler correctness. You need some initial model of compiler behavior, and axioms on how it should behave.</p>\n<p>There are stronger and weaker models of compiler equivalence (does it have to preserve the memory layout of the heap? Of structures? Can a function be inlined away? Does it have to preserve order of syscalls, or can some commute?), the data can take different forms (\"a compiler is a function from C to assembly\" or \"a compiler optimization is a function from assembly to assembly\" or \"a compiler optimization is a function from memory layout to memory layout\"), and then there are different appropriate initial axiom sets for each combination. The initial axioms are usually the \"obvious thing\" that it should preserve x y and z, which ends up being a very long definition that requires a full explanation of how the computer operates.</p>\n<p>And then you can look for the minimal axioms that still guarantee correctness, which are indeed often much shorter.</p>",
        "id": 496697618,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1738215826
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"779253\">Matteo Cipollina</span> <a href=\"#narrow/channel/395462-Natural-sciences/topic/Deduction.20of.20physical.20principles.3F/near/496579634\">said</a>:</p>\n<blockquote>\n<p>I think a particularly interesting direction to explore, among others,  would be to use the idea of invariance under transformation as a foundational principle and to draw inspiration from reverse mathematics (<a href=\"https://plato.stanford.edu/entries/reverse-mathematics/\">https://plato.stanford.edu/entries/reverse-mathematics/</a>)</p>\n</blockquote>\n<p>This is very closely to what I would like for physics, awesome link thanks!</p>\n<p>I was looking now a bit into <span class=\"user-mention\" data-user-id=\"653351\">@Joseph Tooby-Smith</span> 's HepLean to understand the assumptions. Ideas like the CKM-Matrix are too complex, can one derive them from some simpler physical assumptions?</p>\n<p><span class=\"user-mention\" data-user-id=\"424214\">@Tyler Josephson ⚛️</span> , in your Digital Discovery paper to proof Langmuir, what were the assumptions (Atotol)? Do i understand right that you have, for instnace, as one assumption, \"assuming equlilbrium\" (for eq2). This seems to be the level of complexity of the assumptions that i hope one could also use in physics. This proof seems (by hand) rather trivial. What was the most difficult part to get it to Lean, and how far could automated theorem provers help?</p>\n<p>In the auto-search for physical principles, one would have many Atotal -- parametrized in such a way that hopefully your set is part. Then a trivial algorithm would go through all Atotal_i, and tried to derive eq(6). Very curious!!</p>",
        "id": 498221219,
        "sender_full_name": "Mario Krenn",
        "timestamp": 1738880432
    },
    {
        "content": "<p>You can find a Lean 4 version of the Langmuir proof here:</p>\n<p><a href=\"https://github.com/ATOMSLab/LFSE2024/blob/d7aa531d0fd9b8e5089dc2ae2375e069d4dab1bc/Lean%20Code/Lecture8_post_lecture.lean#L71\">https://github.com/ATOMSLab/LFSE2024/blob/d7aa531d0fd9b8e5089dc2ae2375e069d4dab1bc/Lean%20Code/Lecture8_post_lecture.lean#L71</a></p>\n<p>This shows that 9 “premises” imply the conjecture. But really, for a scientist, the 9 premises are not all equal. hK is just a definition of the equilibrium constant. hc1-hc3 are needed to get the proof around division by zero, but more meaningful constraints would require S, A, k_d, etc. to be positive or non-negative. </p>\n<p>You can see my student proved this with 4 tactics followed by a calc block. I don’t know for sure, but I highly suspect the latest ML tools for proof completion should be able to handle proofs like this. </p>\n<p>Keep in mind this is a “low-quality” proof in that only one term is actually defined outside the theorem (the function Langmuir). If you want your theory to include interconnected ideas, then the hypotheses in the theorem statement (hrad- hS_tot) as well as the function Langmuir, must be defined in some kind of definitions or structure outside this theorem, which you then invoke here.</p>",
        "id": 498256190,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1738900948
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"297962\">@Mario Krenn</span> So the assumptions underlying the CKM matrix are essentially that you have 3 families of fermions in the universe, (e.g. up-quark, charm-quark and top-quark)  obeying certain symmetry properties.</p>\n<p>No one knows for sure why we have 3 families of fermions - this is an open question but there are lots of potential solutions each relying on assumptions.</p>\n<p>Basically most of the \"assumptions\" in fundamental physics come down to naming a Lie group and the representation of particles under this Lie group.  Quantum field theory takes things from there.</p>\n<p>Quantum field theory is not perfectly well defined, but there are more attempts to formalize it which do work on very basic assumptions. You can get to topological field theories by making simple assumptions about locality etc.</p>",
        "id": 498262472,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1738905301
    },
    {
        "content": "<p>Thanks for the extra details. I am trying to understand now in general which physical/chemical derivation (equation of motion or other transformation laws) might be most suitable. What is absolutely necessary: Its a very simple proof that ATP can tackle. That's requires to use an automated forward pass for the inverse-search of the set of assumptions. Will chat with Joseph this week to understand better the HepLean axioms. Hope ot come back with more concrete ideas. Any concrete suggestions until then are much apprechiated, especially of derivations of physical laws/principles from very simple assumptions in Lean.</p>",
        "id": 498515972,
        "sender_full_name": "Mario Krenn",
        "timestamp": 1739032607
    },
    {
        "content": "<p><a href=\"https://arxiv.org/abs/2503.04772\">https://arxiv.org/abs/2503.04772</a></p>\n<p>Point something like this in the direction of physics?</p>",
        "id": 504834707,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1741698192
    },
    {
        "content": "<p>Hi Tyler, thanks for the link. There ar three points:<br>\n1) Axiom system <br>\n2) Theorems / physical laws<br>\n3) Proofs /derivations (logical connection of (1) with (2))</p>\n<p>This paper starts with a constant (1) and finds new (3). I describe to find new (1), which is physically very different.</p>",
        "id": 505710179,
        "sender_full_name": "Mario Krenn",
        "timestamp": 1741967756
    }
]