[
    {
        "content": "<p>I am interested in starting a project, as part of HepLean (<a href=\"https://github.com/HEPLean/HepLean\">https://github.com/HEPLean/HepLean</a>), towards the formalisation of Feynman diagrams. </p>\n<p>Feynman diagrams are a graph(ical) representation, used in high energy physics, of certain algebraic expressions. There are a set of rules called `Feynman rules', which allow you to go from a Feynman diagram to its corresponding algebraic expression. The Feynman rules depend on the specific physical theory under study (e.g. the Standard Model of particle physics).</p>\n<p>There are a number of mathematical ways to represent Feynman diagrams, e.g.: <br>\n<a href=\"https://arxiv.org/pdf/math/0106001\">https://arxiv.org/pdf/math/0106001</a> or (defn. 12) in <a href=\"https://arxiv.org/pdf/math/0212121\">https://arxiv.org/pdf/math/0212121</a>. </p>\n<p>Sorry this is all a bit vague, but if this sounds interesting to anyone (so much so that they want to get involved) please let me know.</p>",
        "id": 443771599,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1718026177
    },
    {
        "content": "<p>I'm just thinking about what kinds of things you could use the proof assistant for.</p>\n<p>Perhaps you could prove things like \"The three loop term in the perturbation series is between A and B\" where A and B are two rational numbers. If you could have a formal proof of that rather than a numerical calculation which might not be trusted then that would actually be a useful result. Or you could prove upper and lower bounds on physical quantities.</p>",
        "id": 445282441,
        "sender_full_name": "Mr Proof",
        "timestamp": 1718692927
    },
    {
        "content": "<p>There are examples of the sorts of things which can be formalised <a href=\"https://heplean.github.io/HepLean/docs/HepLean/FeynmanDiagrams/Basic.html\">here</a>. (Although note this is not the final version of things). </p>\n<p>A suitable target is to reproduce features of <a href=\"https://feyncalc.github.io\">FeynCalc</a>.</p>",
        "id": 445322217,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1718706075
    },
    {
        "content": "<p>The paper seems to relate these to string diagrams, in the way of monoidal categories. Is it possible that this would then use monoidal categories (along with Yumo Mizuno's widget)?</p>\n<p><a href=\"/user_uploads/3121/XJZ9IGczIFSSfPSRvT_SYlPK/Categories-for-Quantum-Theory.pdf\">Categories-for-Quantum-Theory.pdf</a></p>",
        "id": 446181567,
        "sender_full_name": "Dean Young",
        "timestamp": 1719007211
    },
    {
        "content": "<p>I would like to see the string diagram approach formalised (along with its relationship to other approaches). It is, however, not the approach I have been taking. The primary reason I am not taking this approach is that I can't see how one can extract 'symmetry factors' from it. </p>\n<p>The approach I am taking is a categorical approach in which the objects are Feynman diagrams, and the morphisms are such that the cardinality of the automorphism group of a Feynman diagram is the symmetry factor.</p>",
        "id": 446589304,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1719228251
    }
]