[
    {
        "content": "<p>I proved the general fibring identity just fine using subtraction without using characteristic 2 - should I attempt to do the same for the specific fibring identity, or just invoke char 2?</p>",
        "id": 403857297,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1700775524
    },
    {
        "content": "<p>Maybe it's useful for the next paper :-)</p>",
        "id": 403859563,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1700777431
    },
    {
        "content": "<p>I’d assume so - I’m just going to chug along with the proof, changing signs to fit constraints, unless the constraints turn out to be contradictory</p>",
        "id": 403860479,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1700778220
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"302826\">Aaron Anderson</span> <a href=\"#narrow/stream/412902-Polynomial-Freiman-Ruzsa-conjecture/topic/Fibring.20Lemmas/near/403860479\">said</a>:</p>\n<blockquote>\n<p>I’d assume so - I’m just going to chug along with the proof, changing signs to fit constraints, unless the constraints turn out to be contradictory</p>\n</blockquote>\n<p>For the general characteristic case in our future paper, we will need a p-fold version of the fibring identity (splitting a kind of \"p-fold Ruzsa distance\" of p p-tuples of random variables into the sum of p \"conditional p-fold Ruzsa distances\" plus p-1 additional  conditional mutual informations).  It's a bit complicated and in particular we are not going to use the p=2 specific fibring identity.  So there isn't much need to try to conserve generality here, and we either have to flip the signs here in the specific fibring identity, or shortly afterwards in the two use cases (in <a href=\"https://teorth.github.io/pfr/blueprint/sect0006.html#first-fibre\">first-fibre</a> and <a href=\"https://teorth.github.io/pfr/blueprint/sect0006.html#second-estimate\">second-estimate</a>), so it is very slightly better to assume characteristic 2 and flip all the signs here in the specific fibring identity.</p>\n<p>One could perhaps phrase a general version with some minus signs and then immediately state a corollary in characteristic 2 with plus signs throughout.</p>",
        "id": 403861495,
        "sender_full_name": "Terence Tao",
        "timestamp": 1700779086
    }
]