[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"657719\">@Terence Tao</span> , I'm confused by the proof of the general inequality in the blueprint. </p>\n<p>First, on line <a href=\"https://github.com/teorth/pfr/blob/a7a1dee407f3290a6b7df07df60c9910f992be63/blueprint/src/chapter/improved_exponent.tex#L101\">https://github.com/teorth/pfr/blob/a7a1dee407f3290a6b7df07df60c9910f992be63/blueprint/src/chapter/improved_exponent.tex#L101</a>, I get a bound with <code>H[X3 + X4]</code> instead of <code>H[X1 + X3]</code>, which is probably just a typo. Then, when I try to unify the bounds coming from the two different arguments, we have on the one hand <code>d[X_1+X_2;X_3+X_4]</code> coming from the first bit, and on the other hand <code>d[X_1|X_1+X_3;X_2|X_2+X_4]</code> coming from the second bit. They don't seem tailored to an application of the fibring identity <a href=\"https://github.com/teorth/pfr/blob/a7a1dee407f3290a6b7df07df60c9910f992be63/blueprint/src/chapter/fibring.tex#L49\">https://github.com/teorth/pfr/blob/a7a1dee407f3290a6b7df07df60c9910f992be63/blueprint/src/chapter/fibring.tex#L49</a>, as for this one would rather need <code>d[X_1|X_1+X_2;X_3|X_3+X_4]</code> say. Of course, this shouldn't create any issue then, because we sum over all permutations so we should get all the terms we want, but for now I don't see how to prove the general inequality as stated. Could you add a few details to clarify things?</p>",
        "id": 407447612,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1702378200
    },
    {
        "content": "<p>Oof, you are right, there are typos, but as you say in the end the modifications do seem to cancel each other out after symmetrizing.  (This is one place where formalization really shines over pen and paper!)  I was admittedly sloppy with the calculations of these lower order terms because I knew from experience that the symmetrization would deal with them anyway, but of course one needs to get it right.</p>\n<p>I just pushed an update to the blueprint to address these, it should appear in like 15 mins.</p>",
        "id": 407515530,
        "sender_full_name": "Terence Tao",
        "timestamp": 1702398540
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 407550418,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1702409686
    }
]