[
    {
        "content": "<p>The conference is now over (we still need to put the videos on youtube, but that will come soon), and it is still fresh in the memory of everyone, so now is a good time to gather some feedback. Let's use the lessons of this year to improve next year's Lean Together.<br>\nWhat would you like to change? What did you like?</p>",
        "id": 570042433,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1769419325
    },
    {
        "content": "<p>The current process was really neat (as far as I am concerned no change is required).<br>\nThanks to everyone involved! <span aria-label=\"pray\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"pray\">:pray:</span></p>",
        "id": 570070984,
        "sender_full_name": "Sébastien Boisgérault",
        "timestamp": 1769428163
    },
    {
        "content": "<p>I think it's worth having a discussion about Gather. Am I right in thinking that this was not free? There was none on Monday, then apparently there was some fuss, and then on Tuesday I showed up and met Sebastian Ullrich and had a very interesting discussion, but by Friday I logged on to gather during one of the breaks and literally nobody else showed up. So unless it's cheap, it's not entirely clear that it's value for money.  I was an organizer last year and someone said that I had paid for gather but I can't find any record of this -- did we perhaps try a free tier? If it's free then I think the current set-up is fine.</p>",
        "id": 570078357,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1769430378
    },
    {
        "content": "<p>It was not free (we had to guess a maximal number of users and paid based on that number), and indeed only very few people used it.</p>",
        "id": 570078671,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1769430466
    },
    {
        "content": "<p>By the way, we want to thank the Mathlib Initiative for paying for Gather.</p>",
        "id": 570078984,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1769430547
    },
    {
        "content": "<p>I think perhaps it's hard to guess about how much usage it would have gotten if it was used for day one -- I also was a bit surprised it wasn't free for open source projects / communities. I think to me the important bit is not Gather's funny functionality but instead that there's a place for a hallway track that isn't Zoom (where it can feel like you're shouting into an intimidating empty room) and where organically multiple groups can form.</p>",
        "id": 570085043,
        "sender_full_name": "Julian Berman",
        "timestamp": 1769432351
    },
    {
        "content": "<p>A separate topic perhaps is \"tracks\" -- I assume it might have been an explicit organizer decision to not have a \"Math track\" and a \"CS track\"? Obviously this is a great thing about this community that we have subcommunities that don't otherwise interact with each other. I think personally that not having subtracks for the conf was great but selfishly I'm interested in both topics. Perhaps for someone this isn't the case?</p>",
        "id": 570085697,
        "sender_full_name": "Julian Berman",
        "timestamp": 1769432494
    },
    {
        "content": "<p>As one of those few who made use of it, I will say that personally I got a lot of value of Gather. Having an informal space encouraged some valuable conversation that would not have happened otherwise. There's certainly a cost benefit ratio to consider, but I hope that it can continue to exist in some form.</p>\n<p>Past this, everything was very smooth both as an attendee and speaker. The researchseminars website worked very well once configured correctly. Thank you to all the organizers!</p>",
        "id": 570086210,
        "sender_full_name": "Chris Henson",
        "timestamp": 1769432614
    },
    {
        "content": "<p>Maybe next year we’ll try to have a poll before the workshop to evaluate how many people want to use GatherTown. Personally I’m so busy that I always use the breaks to catch up on my work. I had time to go to GatherTown only once and saw exactly one person there (but it was a nice chat).</p>",
        "id": 570130254,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1769443149
    },
    {
        "content": "<p>About the tracks question: this is very much by design. We try to stick to the idea of a unified Lean community meeting. Maybe we won’t be able to keep that forever as the community continues to grow. But it feels the right thing to do. It certainly requires efforts to listen to some talks that are very far away from your usual topics, but there are nice surprises when speakers work hard to be accessible. For instance I enjoyed the RISC-V talk by Julius, despite the topic being as far as you can get from my usual fundamental math stuff.</p>",
        "id": 570131270,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1769443379
    },
    {
        "content": "<p>My only feedback is: please make the video recording available ASAP!</p>",
        "id": 570200246,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1769466556
    },
    {
        "content": "<p>(I'd be happy to help with videos if I can have access to them, this time or next. Topping and tailing is probably even automatable.)</p>",
        "id": 570211218,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1769472422
    },
    {
        "content": "<p>(Aspiring to having the videos up 10 minutes after the talk is not crazy!)</p>",
        "id": 570211285,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1769472454
    },
    {
        "content": "<p>I hadn’t used Gather before, but I appreciated it as I was able to ask a question about debugging plans, as that is something that I’m especially interested in.</p>",
        "id": 570215945,
        "sender_full_name": "Richard L Ford",
        "timestamp": 1769475415
    }
]