[
    {
        "content": "<p>Discussion topic for the talk.</p>",
        "id": 569739212,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1769181073
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/rFim8cQpiUQLvk4diM0mmUV4/carleson.pdf\">Slides</a></p>",
        "id": 569743900,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1769182306
    },
    {
        "content": "<p>Are there intermediate results that you proved only for finite objects, but for which the full version would be of interest to Mathlib? Or was that restriction to finite things only done for steps that are really specific to the Carleson proof?</p>",
        "id": 569747751,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1769183316
    },
    {
        "content": "<p>In my talk I mentioned the Hardy-Littlewood maximal function which we definitely want in Mathlib, and where our non-standard version is a \"finite\" version of it.</p>\n<p>The argument with cubes and tiles is one that is made more frequently in harmonic analysis. They are sometimes called (Christ’s) dyadic cubes, and they are actually mentioned <a href=\"https://en.wikipedia.org/wiki/Dyadic_cubes#Dyadic_cubes_in_metric_spaces\">on Wikipedia</a>. <br>\nSuch a structure would probably be useful for Mathlib at some point, but even if we did a non-finite version of the argument, I think I would still write down only what is needed for this proof, which might need to be adapted/generalized to support most/all other settings where they are used.</p>",
        "id": 569753928,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1769184955
    },
    {
        "content": "<p>Ok, so the choice of going for finite means that there is more work to be done if we want to port those parts to Mathlib. I'm curious about the \"finite\" choice in general because I can see very easily what can be made worse for formalization by going to finite objects (and I was surprised that you chose that path).<br>\nYou mentioned that a measurability proof was made easier. How much easier? Are we missing tools for the general proof, or does it just need a few more steps to reduce to a countable sup before becoming easy?</p>",
        "id": 569755606,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1769185423
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"350992\">Rémy Degenne</span> <a href=\"#narrow/channel/557175-Lean-Together-2026/topic/Floris.20van.20Doorn.20-.20Lessons.20from.20the.20Carleson.20project/near/569755606\">said</a>:</p>\n<blockquote>\n<p>I can see very easily what can be made worse for formalization by going to finite objects</p>\n</blockquote>\n<p>Can you please elaborate?</p>",
        "id": 569758662,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1769186235
    },
    {
        "content": "<p>Caveat: I did not follow the Carleson project and did not look closely at the code. I'm reacting from the content of the talk and might imagine the wrong kind of finite object manipulations.</p>\n<p>I'm imagining difficulties (purely Lean difficulties, not mathematical) similar to what you can encounter if you have elements of <code>Fin n</code> and in parts of the arguments there is also <code>Fin m</code> for <code>n &lt; m</code>. Suddenly you have functions defined on one of those that can't take an argument from the other one without having to provide proofs.<br>\nI see for example that in the project there are grids with a parameter <code>S : Nat</code> which involve things in <code>Icc (-S : ℤ) S</code>. If you ever consider grids with two different S somewhere that kind of issues might appear. But perhaps it's not the case in this proof.</p>",
        "id": 569761878,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1769187185
    },
    {
        "content": "<p>For the maximal function, we currently have only proven the measurability when we use a countable family of balls: <a href=\"https://github.com/fpvandoorn/carleson/blob/ddf5d418922c1dee5ca2735dfb4e2a5f31a99018/Carleson/ToMathlib/HardyLittlewood.lean#L435\">https://github.com/fpvandoorn/carleson/blob/ddf5d418922c1dee5ca2735dfb4e2a5f31a99018/Carleson/ToMathlib/HardyLittlewood.lean#L435</a><br>\nI don't think the prove of its measurability is particularly hard for the standard function, but it would require a different proof.</p>\n<p>The grids are indexed by the integers, with the assumption that all cubes lie in <code>Icc (-S : ℤ) S</code>. <code>S</code> is fixed throughout the whole proof (except maybe in a single limiting lemma). I don't think there were any problems from annoying embeddings similar to <code>Fin n -&gt; Fin m</code> because of this choice.</p>\n<p>I agree that these choices were suboptimal. They were made before the formalization started at a time when Christoph knew the math, but didn't have experience about what was hard or easy in Lean, and I didn't know the math yet. During the formalization, I also didn't know whether using a nonstandard maximal function was necessary for the proof or not.</p>",
        "id": 569765458,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1769188199
    },
    {
        "content": "<p>Can you explain why you don't plan to upstream Carlson itself to mathlib?</p>",
        "id": 569797933,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1769200163
    },
    {
        "content": "<p>My understanding is that this is a combination of several factors:<br>\n(1) reusability: most prerequisites (e.g. the Hardy-Littlewood maximal function, the real interpolation theorem, more lemmas about integrals, ...) are clearly reusable elsewhere, and therefore obviously belong into mathlib. It's less clear if Carleson's theorem is of the same kind (and even so for the doubling metric measure spaces generalisation). It's not a pure endpoint theorem, but the motivation is weaker.<br>\n(2) practical considerations: who puts in the work? I think nobody would mind if you did, but there is <strong>a lot</strong> to do. The ~30 000 lines not in the <code>ToMathlib</code> directory are often very far from mathlib level code. Improving them would be a very large effort.</p>",
        "id": 569852555,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1769247962
    },
    {
        "content": "<p>Is the following view of the future something which has a reasonable possibility of happening: in 5 years' time someone proves an important new theorem which needs Carleson as input, someone suggests formalizing it in Lean, all of the prerequisites made it to mathlib, but the main argument is still lying rotting in the Carleson repo on v4.35 and it's completely hopeless to port it to Lean v4.87 which is where mathlib is?</p>\n<p>My understanding is that Gonthier still spends some of his time bumping the odd order proof so that it runs on today's Rocq (I heard this a few years ago so it might be a bit out of date but definitely the odd order proof compiled on a version of Coq which was released many years after the formalization was completed).</p>",
        "id": 569858817,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1769254549
    },
    {
        "content": "<p>(Odd order continues to be updated: <a href=\"https://github.com/math-comp/odd-order/releases\">https://github.com/math-comp/odd-order/releases</a> but it doesn't look like Gonthier himself has committed recently. I believe the Rocq project maintainers PR updates to major projects if they make breaking changes, though others may also be involved in long-term maintenance.)</p>",
        "id": 569878870,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1769270534
    },
    {
        "content": "<p>So somehow odd order is \"part of the ecosystem\". Can we make Carleson part of the lean ecosystem? I guess one issue is that lean/mathlib are not too worried about backwards compatibility for now, although my understanding of Leo's comments about this in his talk were that perhaps in a year or so lean will be much more stable.</p>",
        "id": 569890412,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1769276501
    },
    {
        "content": "<p>Maybe the Mathlib Initiative could be interested in investing some money to make sure such projects do not rot.</p>",
        "id": 569900806,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1769285785
    },
    {
        "content": "<p>I'm not worried about Carleson rotting. Like sphere-eversion (which to me has a reasonable chance of getting fully into mathlib... provided enough work is invested!), I can imagine a volunteer bumping the project regularly. The amount of work required is not too large right now.</p>",
        "id": 569901115,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1769286085
    },
    {
        "content": "<p>That said, tooling to automate (more) of the bump would be most welcome! (And AI could actually help here: if a proof breaks that's not mathlib-level at all, just have AI re-generate a proof. Assuming we can have both ChatGPT and our planet.)</p>",
        "id": 569901198,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1769286158
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> I'm hoping/ predicting that upgrading to newer versions can be automated. If not now already, likely with the progress in the coming years.</p>\n<p>For reference, our <a href=\"https://github.com/rocq-community/math-classes\">https://github.com/rocq-community/math-classes</a> library was written 15 years ago and still compiles with the latest version.<br>\n<a href=\"https://github.com/rocq-community/corn\">https://github.com/rocq-community/corn</a> is even older.<br>\nMaintenance is shared by the Rocq community. <a href=\"https://github.com/rocq-community/manifesto\">https://github.com/rocq-community/manifesto</a><br>\nMaybe something similar would be useful for Lean too.</p>",
        "id": 569969320,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1769362358
    }
]