[
    {
        "content": "<p>I'm in Australia, so the talks are scheduled for 1-5am for me (roughly), and I have a 1 year old, so I can't stay up all night for stuff like this any more :(</p>\n<p>Already there are some talks I would love to watch from \"last night\" though - is it likely that talk recordings on youtube or similar will be available within a day or two?</p>\n<p>Cheers.</p>",
        "id": 568943718,
        "sender_full_name": "Scott Buckley",
        "timestamp": 1768886535
    },
    {
        "content": "<p>It will take a bit of time to edit the videos and upload them to youtube, and we don't have much time to do it during the conference, so that will most likely happen afterwards.<br>\nSorry that the times are so bad for Australia!</p>",
        "id": 569007025,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1768910611
    },
    {
        "content": "<p>Would textual summaries after the talk help? We can summarize the talk immediately afterwards, maybe that plus the slides is good enough until the videos?</p>",
        "id": 569013292,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1768912620
    },
    {
        "content": "<p>Yes, please post the slides.  Even for the US west coast, the time zone situation is not very good.</p>",
        "id": 569109181,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1768936530
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"933054\">Snir Broshi</span> <a href=\"#narrow/channel/557175-Lean-Together-2026/topic/Following.20asynchronously.20.28via.20youtube.3F.29/near/569013292\">said</a>:</p>\n<blockquote>\n<p>Would textual summaries after the talk help? We can summarize the talk immediately afterwards, maybe that plus the slides is good enough until the videos?</p>\n</blockquote>\n<p>The slides would be nice! A textual summary sounds like a lot of work, I don't think it's worth doing all that, unless others need it.</p>\n<p>It's a shame that the streaming platform doesn't record the live video for later viewing.</p>",
        "id": 569126090,
        "sender_full_name": "Scott Buckley",
        "timestamp": 1768942588
    }
]