[
    {
        "content": "<p>This talk about Std took place yesterday.  I don't find that there was a topic made here for discussion.</p>\n<p>I had live-tooted the talk on Mathstodon: <a href=\"https://mathstodon.xyz/@RuchiraSDatta/115933800499643137\">https://mathstodon.xyz/@RuchiraSDatta/115933800499643137</a></p>",
        "id": 569571639,
        "sender_full_name": "Ruchira S. Datta",
        "timestamp": 1769109651
    },
    {
        "content": "<p>Pasting some of my toots.</p>\n<p><strong>Markus Himmel</strong></p>\n<p>Std.Iter allows efficient chained loops</p>\n<p>Polymorphic ranges</p>\n<p>Slices: combine a container and a range</p>\n<p>Strings redefined to be byte arrays that are valid UTF-8</p>\n<p>Improved the String API that uses C:</p>\n<ul>\n<li>use String.Slice to avoid intermediate copies</li>\n<li>polymorphic linear-time string search</li>\n<li>efficient positional operations</li>\n</ul>\n<p>New tool Grove: interactive living design document including tests and tables</p>\n<p>Check Markus Himmel's presentation on Proof Network Workshop for more</p>\n<p><strong>Sofia Rodrigues</strong></p>\n<p>Sofia Rodrigues presents on time manipulattion, concurrency, and https on top of Async</p>\n<p>Date and time library:</p>\n<p>Minutes, hours, etc are offsets and ordinals</p>\n<p>Timestamp: single point of time</p>\n<p>Duration: span of time (e.g., difference of timestamps)</p>\n<p>Calendar time represented as PlainTime, PlainDate, PlainDateTime, and ZonedDateTime</p>\n<p>Have parsing and formatting to interconvert with strings</p>\n<p>Concurrency is built on libuv, an event library that allows receiving events and callbacks</p>\n<p>Supports TCP, UDO, DNS, signals, timers, and process/system information</p>\n<p>Selectors can efficiently wait for many asynchronous events at once</p>\n<p>Uses the Async monad</p>\n<p>The Async monad has high-level combinators like concurrently, race, and Selectable</p>\n<p>Can cancel operations cooperatively using CancellationContext</p>\n<p>Works with rich communication tools</p>\n<p>Http server, based on Hyper, is built on Async using the same concurrency tools</p>\n<p>Supports http/1.1</p>\n<p>E.g., server blocks until shutdown</p>\n<p>Handler receives a request and returns a respons</p>\n<p>Not yet merged, PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/10478\">#10478</a></p>\n<p>There is an open PR for the http client; will be merged after the server</p>\n<p>The http server is currently documented inside the module</p>\n<p>Std has both tutorials and a reference manual, though both are a bit behind</p>",
        "id": 569572545,
        "sender_full_name": "Ruchira S. Datta",
        "timestamp": 1769109994
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260921\">@Markus Himmel</span> I'm sorry if this has been asked before: Is Grove currently something that is only internal to the FRO? Or is it something that (in practice) anyone can explore/use?</p>",
        "id": 569696911,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1769169149
    },
    {
        "content": "<p>It's a similar situation to where Verso was 1.5 years or so ago: theoretically, everything is there for anyone to use it, but at the moment we're not investing anything into documentation or supporting external users before we have hardened the tool enough ourselves.</p>",
        "id": 569705994,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1769172271
    },
    {
        "content": "<p>I hope that sometime this year we will be able to officially release it together with a nice tour of everything it can do and instructions on how to set up and use it.</p>",
        "id": 569706230,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1769172335
    },
    {
        "content": "<p>Great - many thanks! Looking forward to it.</p>",
        "id": 569706816,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1769172517
    },
    {
        "content": "<p>Me too. I believe I told you in person already (in Orsay, last September) - but for certain well-chosen corners of mathlib, I believe this can be quite useful.</p>",
        "id": 569708290,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1769172937
    }
]