[
    {
        "content": "<p>Unfortunately, we got rejected from CPP. Below are the comments from the peer review.</p>",
        "id": 555583255,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1763125817
    },
    {
        "content": "<h3>Paper summary</h3>\n<p>The Paper present a formalization in Lean4/Mathlib of composition direction of Seymour's Theorem for regular matroids. Recall that matroids are a combinatorial abstraction of the notion of independence (as in linear independence in vector spaces, algebraic independence over a field or acyclicity in graph). Seymour’s Regular Matroid Decomposition Theorem says that each regular matroid can be obtained from graphic matroids, their duals, and copies of R10 by taking 1-, 2-, and 3-sums. They only proove the composition direction stating that matroid constructed as above are regular.</p>\n<p>The main difficulty to formalize such broad abstractions as matroids is that they are several equivalent definition which may rely or not on some finiteness assumption. Hence the authors start the paper by making a case for their choice of approach: They choose to follow a less general one that avoid using too much of not yet formalized graph theory. In return it requires proof to go across three levels of abstraction (matrices, standard representation matrices, and binary matroids in general).</p>\n<h3>Comments for authors</h3>\n<p>The paper is well written and present a substantial formalization effort a large part of which deserve to be integrated in Mathlib. The technical choices are clearly discussed. Moreover the authors take care of giving some feedback and advice about Lean Mathlib and the aesop tactic (in appendix).</p>\n<p>However, aside the choice of the mathematical approach, translating the definition into formal one seems to be relatively straightforward, with few genuinely novel or challenging aspects beyond the usual dependent type issues (e.g., handling matrix dimensions in block matrices). Also it is far from being the first formalization in matroid theory. As such, the paper offers only incremental progress rather than a significant new contribution. Taken together, the work does not reach the level of originality or depth expected for acceptance.</p>\n<p>We also have a few suggestions concerning the presentation: it is quite technical with a lot of repetition in the presented code that could be abbreviated (see eg: Set.drop?, Matrix.toMatrixDropUnionDrop, standardReprSum3 or the three identical Matroid.IsSum?of.isRegular theorems). On the other hand the reader not specialist of matroids, may have difficulty to follow the logical progression of the paper. I would strongly recommend the following changes:</p>\n<ul>\n<li>The authors seem to assume that the reader is familiar with the notion of 1-, 2-, 3-sums. They should give a broad intuitive idea of what they are right at the beginning of the introduction.</li>\n<li>The author should insert couple of paragraph in the introduction explaining the structure of the paper as well as his logical progression</li>\n<li>at the beginning of each section, the author should add a little paragraph recalling the reader where he is in this logical progression.</li>\n</ul>",
        "id": 555583313,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1763125834
    },
    {
        "content": "<h3>Paper summary</h3>\n<p>This paper presents a formalization of the composition (forward) direction of Seymour's decomposition theorem for regular matroids in Lean 4. This direction proves the structural property that any 1-, 2-, and 3-sum of two regular matroids is a regular matroid.</p>\n<p>This new library establishes formal definitions and proves properties for a range of necessary concepts, including totally unimodular matrices (some of which were contributed to Mathlib), vector matroids and their standard representations, the definition of regular matroids via totally unimodular representations, and the 1-, 2-, and 3-sum operations.</p>\n<p>Using this, the authors provide a machine-checked proof of the composition direction. An interesting aspect of this formalization is its generality: the proof holds for matroids that have finite rank but may possess infinite ground sets. In addition to proving the composition direction, the authors also provide a formal statement of the corresponding decomposition direction (that all regular matroids can be decomposed into graphic, cographic, and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>R</mi><mn>10</mn></mrow><annotation encoding=\"application/x-tex\">R10</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.00773em;\">R</span><span class=\"mord\">10</span></span></span></span> matroids) to complete the formal statement of Seymour's theorem.</p>\n<h3>Comments for authors</h3>\n<p>The paper is an interesting read, and describes the key definitions and main statements for the theorem in question. The \"trusted code\" is presented clearly. The pictures of matrices are nice and helpful also! For me, there are some balances which I think were not struck quite right, however.</p>\n<ul>\n<li>The definition of regular matroid presented here is not the typical one given, which I was somewhat surprised to see. More surprising is that this distinction and alternate definition was not explicitly mentioned, and I would have liked to see comments on why this particular definition was chosen, as opposed to the usual \"representable over any field\" version: it's a nontrivial theorem that they're the same! Consulting Truemper, I see that perhaps this was simply due to following the source very closely, and arguably therefore this is covered around line 235, but a difference in definition for a word which is mentioned in the title is a big enough difference to deserve some more detail.</li>\n<li>The paper spends much time on definitions, and much less time on the difficulties (or lack thereof) of formalising the theorem itself. It is nice to display these definitions, but I would have liked to see quite a bit more detail in Section 11. For instance, line 1134 writes that the proof for 1-sums is nearly identical to the source, but a (sketch) proof of what that is could have added to the presentation here. And a sketch proof of the titular theorem also seems worth mentioning. For 3-sums, a high level description of the differences between the informal and formalized proof is given, but it is tricky to contextualise this without referencing (or already knowing) the informal proof; and a slightly less high level description would also be interesting to read. More generally, I'd like to know if there are any insights gained from this formalization that could be applicable elsewhere.</li>\n<li>Relatedly, it seems there is little discussion of the design choices made when writing some of the definitions. For instance, matrixSum1 is a function, while Matroid.IsSum1of is a predicate, but why was standardReprSum1 chosen to be a (partial) function too? As it's partial, it seems more natural to use a predicate, which checks the precondition too. Lots of time is taken to detail the definitions, so I would like to read the authors' thoughts on what they learnt (and any wrong steps) taken towards getting these ones.</li>\n</ul>\n<p>Minor comments:</p>\n<ul>\n<li>Giving a summary of the structure of the paper near the end of the introduction would be valuable for signposting.</li>\n<li>Around line 190, explicitly mentioning Oxley and Truemper would be nice here, to avoid the reader jumping to the references.</li>\n<li>Around line 290, there's a slight ambiguity in the informal descriptions: where exactly is B2 quantified in (iii)? A little thought or foreknowledge reveals the answer, but I think a nicer way to present this would be to declare the word <em>base</em>, then define <em>independence</em>, then write the base axioms with reference to the notion of independence (closer to how Mathlib does it: using indep to define the maximality axiom)</li>\n<li>When defining independence, there's also a slight ambiguity: does \"any base\" mean for all bases, or for some base? Again, an experienced reader will know the answer, but some readers may be encountering matroids for the first time here!</li>\n<li>The choice of variable names is unfortunate in this section, the informal version sometimes uses different letters from the formal version, meaning we're left with many, many different letters around: M, E, B, X, I, J, alpha, P, Y. It may be worth looking for some overlap if it can be found here.</li>\n<li>Around line 360, it may be worth explicitly mentioning that m,n are arbitrary (finite) types, not necessarily natural numbers: some readers expect matrices to be indexed by naturals! This is referenced again around line 808. This may also give you the opportunity to recall what Fin is, and why it's relevant to your formalisation (you mention Fin 2 and Fin 3 fairly often later)</li>\n<li>Certain variables are declared repeatedly, most notably <code>{𝛼 : Type*}</code> and <code>[DecidableEq 𝛼]</code>. Consider omitting these, or mentioning them only once near the start, to save you space and to save the reader the overhead (a kind of LaTeX-<code>variable</code>!). You may also consider ignoring DecidableEq assumptions altogether in the presentation, especially since at no point is the computability aspect mentioned in your discussion.</li>\n<li>Line 432: how does this differ from Subtype.toSum?</li>\n<li>Line 510: The source [12] only mentions the standard representation once, so giving an informal description of what it is here would help a lot: you write \"standard representation matrix B\", but this isn't a well-known concept to most readers of papers in this journal! More generally, [12] is a big reference and it's used often, so for points like this which are specific, writing something like [12, p32] or [12, Sec 3.2] is quite a bit more useful.</li>\n<li>Line 591, \"as it would be hard to verify that total unimodularity is preserved in our prior approach.\" I'd very much like to know why this would be hard! In particular, I'm more interested in this than getting another reminder that <code>{𝛼 R : Type*} [DecidableEq 𝛼]</code>.</li>\n<li>Line 860: mentioning the dimension of D0 explicitly would be useful.</li>\n<li>Section 10 overall gives me quite a lot of code, some of which is quite repetitive. I'm not sure that the contents of the definition of <code>Matrix.toMatrixDropUnionDrop</code>, for instance, is all that valuable: perhaps a link to the full definition together with the informal description and a summary could have sufficed. Or, if there's a particular point you'd like to stress which is made by this definition, you should explain it more explicitly.</li>\n</ul>",
        "id": 555583395,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1763125861
    },
    {
        "content": "<h3>Paper summary</h3>\n<p>This paper formalizes the statement of Seymour's matroid decomposition theorem in Lean and proves the composition direction (that 1-, 2-, and 3-sums of regular matroids are regular). The authors have developed supporting formalizations around totally unimodular matrices, vector and regular matroids, standard representations, and the 1-, 2-, and 3-sums of vector matroids. The formalization builds upon the <code>Matroid</code> library in Mathlib.</p>\n<p>It presents proof-engineering ideas that helped simplify the formalization compared to existing proofs, avoiding the combinatorics of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">Δ</mi></mrow><annotation encoding=\"application/x-tex\">Δ</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord\">Δ</span></span></span></span>-sums and re-signings by introducing a \"canonical\" signing.</p>\n<p>The supplementary materials appear to be accurate formalizations of the presented material. It is structured and appears to be reusable for future work toward proving the full theorem.</p>\n<h3>Comments for authors</h3>\n<p>This formalization work is a notable milestone and appears to be valuable for future developments toward a full proof of Seymour's decomposition theorem. At the same time, the paper currently reads more like a technical companion to the formalization rather than an articulation of the mathematical or formal-methods contributions. Much of the exposition describes what was implemented, with comparatively little attention to why the result is interesting, what conceptual or engineering challenges arose, or what was learned that could transfer to other formalizations.</p>\n<p>Below are some suggestions to help strengthen the paper in a revision:</p>\n<ul>\n<li>State the main theorem precisely. The theorem is given informally, but the paper does not present a clear mathematical formulation of the composition directed being formalized. An exact statement would help clarify the scope of the formalization. An example of the ambiguity is that the full matroid decomposition appears to be, <code>Matroid.RankFinite.isRegular_iff_isGood</code>, and the composition direction of it is <code>Matroid.IsGood.isRegular</code>, which not only shows the regularity of 1-, 2-, and 3-sums of regular matroids (as shown in the paper), but the regularity of graphic matroids (proved in the code), and of cographic matroids (stubbed out with <code>sorry</code>). A clear statement of the theorem in the paper would help prevent confusion.</li>\n<li>A stronger narrative of the mathematics of the theorem would help motivate why formalizing the theorem is difficult or interesting. The paper mentions some applications of the theorem, but it would help to understand what is important about regular matroids. Furthermore, a description of what structural phenomena that the various sums capture would be elucidating.</li>\n<li>A discussion of the decomposition direction, even if only qualitative. The paper hints that this is the natural next step, but a section outlining what remains to be formalized, what obstacles are expected, and how the current formalization positions that work would be beneficial to the work.</li>\n<li>The narrative around \"compromises\" can be a discussion of reasonable scoping decisions, rather than weaknesses. This can also help with the clarity of the rest of the presentation; for example, the paper could add the assumption that matroids have finite ground sets, and whatever generalizes to the <em>infinite matroids</em> of Bruhn et al. (the <code>Matroid</code> in Mathlib) can be briefly mentioned in a short section.</li>\n<li>Relatedly, reflect more on design choices and trade-offs. Section 2 briefly compares Oxley vs Truemper as foundations but does not analyze the consequences to future developments. It explains the immediate convenience, but not the appropriateness, or the potential design tradeoffs. The brief sentence about experiments in proving equivalences being hard could be expanded upon to paint a picture of what was hard.</li>\n<li>Differentiate routine formalizations from novel ideas. Sections 4-10 contain many code listings, but it's not clear what required new mathematical ideas, formalization ideas, or design choices. For example, in section 7 it is unclear whether totally unimodular signings are a new idea that simplified the formalization or if they are a direct formalization from the literature.</li>\n<li>Make novelty more explicit relative to prior work. The related work section is detailed but largely descriptive. It leaves it to the reader to determine the novelty of the formalization.</li>\n<li>Trim low-level implementation details. The <code>Decidable</code> class appears frequently in excerpts, but without explanation. If these are only required to interface with Mathlib, a brief comment suffices and could be omitted, since they distract from the conceptual presentation. If these are required to enable proof by reflection, that is worth explaining as well.</li>\n<li>I noticed in the code that R10's regularity uses a proof by reflection. That is potentially interesting for CPP, yet it does not appear in the paper. If it is omitted because it does not appear in the paper's formulation of the composition direction, consider still highlighting it as it may interest readers.</li>\n</ul>\n<p>Small comments:</p>\n<ul>\n<li>345 and elsewhere: \"infinite matroid\" vs \"infinite ground set\" is somewhat confusing. My understanding is that <em>infinite matroid</em> is a specific axiomatization of matroids from Bruhn et al., and it might be misunderstood by readers.</li>\n<li>361: Citing Schönfinkel (1924) for currying feels out of place. Multi-argument functions are standard in Lean and not specific to matrices.</li>\n<li>407 and elsewhere: Avoiding the set-&gt;type coercion and using <code>Set.Elem</code> directly is unusual and might merit explanation.</li>\n<li>226: \"graph theory which is not supported in Mathlib\" could be phrased more carefully, since Mathlib has graph theory, but perhaps not the specific graph theory needed for [9]/[12].</li>\n<li>1229: Typo, <code>Matroid.IsRegular.isGood_of_rankFinite</code> instead of <code>Matroid.IsRegular.isGood</code>.</li>\n</ul>",
        "id": 555583572,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1763125913
    },
    {
        "content": "<p>Interesting comments, thanks for posting, good to know what's generally expected!</p>",
        "id": 555588486,
        "sender_full_name": "Evgenia Karunus",
        "timestamp": 1763127229
    },
    {
        "content": "<p>I am confused by the fact that the first reviewer wrote</p>\n<p>\"Also it is far from being the first formalization in matroid theory. As such, the paper offers only incremental progress rather than a significant new contribution. Taken together, the work does not reach the level of originality or depth expected for acceptance.\"</p>\n<p>but then the same reviewer added a comment:</p>\n<p>\"The consensus among the referees is that the paper’s rejection stemmed not from its (quite good and substantial) formalization, but from shortcomings in its presentation. Too few research outcomes are presented here, as opposed to merely describing the implementation. One would like to see reflection on what was difficult, novel, or what conceptual insights were gained. We all believe that with significant restructuring, it could become a strong paper. Therefore we encourage the author to resubmit, maybe with work toward the full theorem (which is admittedly more difficult).\"</p>",
        "id": 555723131,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1763191738
    },
    {
        "content": "<p>I think they implied that the conceptually interesting stuff should be described verbally in a paper, because it's hard/impossible to determine what the novelty is by skimming the code.</p>",
        "id": 555724743,
        "sender_full_name": "Evgenia Karunus",
        "timestamp": 1763192894
    },
    {
        "content": "<p>Meaning - the easy-to-find novelty could be \"this is a first formalization of matroid theory\", which it isn't.<br>\nAnother easy-to-find novelty could be \"translating the definitions into formal definitions\", which also doesn't work because that part seemed straightforward.</p>\n<p>So they need a verbal description of what was conceptually interesting and why, because their immediate guesses didn't work.</p>",
        "id": 555724756,
        "sender_full_name": "Evgenia Karunus",
        "timestamp": 1763192911
    },
    {
        "content": "<p>In addition, after carefully reading the reviewers's comments yesterday several times, I feel they are also implicitly asking the questions, \"Who is the audience for this paper? Who are the readers you are writing for?\"</p>",
        "id": 558469114,
        "sender_full_name": "Alex Nelson",
        "timestamp": 1763654508
    },
    {
        "content": "<p>Oh yeah, we were keeping it implicit. In my Ph.D. thesis, which is more long-winded, I extensively talk about who the intended audience is, but in the paper, we kept it implicit. We did, however, have an internal document answering this question; unfortunately, I cannot find it now. From what I remember, we all agreed on writing for a reader who knows Lean but doesn't know what a matroid is. I think the only exception is the appendix, in which we write for the authors of the tools we were using.</p>",
        "id": 558472726,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1763655367
    },
    {
        "content": "<p>How well do you think the article spoke to that audience? And do you think it was a suitable audience for the CPP?</p>",
        "id": 558564827,
        "sender_full_name": "Alex Nelson",
        "timestamp": 1763690849
    },
    {
        "content": "<p>I don't know. Do you have a suggestion?</p>",
        "id": 558607607,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1763715318
    },
    {
        "content": "<p>Well, I will be frank: when I joined the project, I thought the paper was written for matroid theorists who were already pretty competent at using some proof assistant (not necessarily Lean, and not necessarily based on CoC/dependent-types).</p>",
        "id": 560194027,
        "sender_full_name": "Alex Nelson",
        "timestamp": 1764086530
    },
    {
        "content": "<p>But looking at the paper again (with the benefit of some time passing since I last looked at it), I really can't shake the feeling that there are several different audiences being spoken to, consequently none of them are adequately addressed.</p>",
        "id": 560194319,
        "sender_full_name": "Alex Nelson",
        "timestamp": 1764086605
    },
    {
        "content": "<p>After taking a step back and rereading the comments, I understand the criticism as follows...</p>\n<p>There is huge disconnect between what I wanted to write and what the reviewers wanted to read (and, of course, there is also some disconnect between what I wanted to write and what we wrote in the end, but this gap seems much less important).</p>\n<p>From my point of view, I saw our contributions divided into two levels, with the primary level being infinitely more important than the secondary level.</p>\n<p>Primary contributions:</p>\n<ul>\n<li>the definitions</li>\n<li>the theorem statements</li>\n<li>there exists a <code>sorry</code>-free proof (the only thing about the proof that matters is what <code>#print axioms</code> shows)</li>\n</ul>\n<p>Secondary contributions:</p>\n<ul>\n<li>what the proof looks like</li>\n<li>what we learned from it</li>\n<li>what we could have done differently</li>\n</ul>\n<p>My plan was to cover the primary contributions as perfectly as possible, and bring up the secondary contributions only if some space remains.</p>\n<p>However, the reviewers had completely different perspective! They would say something like:<br>\n\"OK, there are some definitions, good, there are some theorems, good. However, all of it is in the code. Give me something that isn't written in the code!\"</p>\n<p>From the reviewers' perspective, the goal of writing the paper was not to summarize the project for somebody who doesn't open the repository, but to provide some surplus value to somebody who opens the repository and has the paper next to it. And we didn't provide enough of those \"extras\".</p>",
        "id": 560434709,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1764175137
    },
    {
        "content": "<p>Put differently, we were answering this question:<br>\n\"What is objectively true about our project?\"<br>\nWhile doing so, we neglected this question:<br>\n\"What is interesting about our project?\"</p>\n<p>With the new perspective, our new manuscript should go much further into \"what is interesting\" and \"what was challenging\".</p>\n<p>That said, I am probably the worst person from the entire team to elaborate on \"what is interesting\" and \"what was challenging\".<br>\nThere wasn't a single moment in the project when I would be approaching it as \"let's learn what is easy in Lean and what is surprisingly hard to formalize\".<br>\nEvery single time, I was approaching the project as \"let me create a <code>sorry</code>-free proof, no matter the cost\".<br>\nOf course, I could reflect on what was hard for me, but every time something was harder than I expected it to be, I don't know if it was harder than I expected because it was inherently hard, because Lean made it hard, or because I chose a wrong approach.<br>\nFor example, I can confidently say that proving <code>standardReprSum3_hasTuSigning</code> was hard for me, but I cannot say why it was hard (and I definitely cannot say whether it would be similarly hard for a different person).</p>\n<p>Hopefully, other contributors can reflect on \"what was hard\" better and provide a better insight into \"what is interesting\".</p>",
        "id": 560439714,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1764176516
    },
    {
        "content": "<p>In retrospect, the way the paper is written makes most of the text more suitable for a thesis than for a conference paper. In my thesis, I mostly play hide-the-pain Harold: I talk about the results, not about the struggles on the way there. In a thesis, the author needs more to be accurate than to be competitive.</p>\n<p>Unfortunately, it seems that for a successful paper, we need to be somewhat boastful; it isn't enough to plainly say what we did, as we did in our paper. The question remains who will be the person to elaborate on \"what is interesting\" and \"what was challenging\" for the new version. Shortening should come later, once we know how much new content we need to accommodate.</p>",
        "id": 564893492,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1766322237
    },
    {
        "content": "<p>One more comment: I like to write papers as if I were presenting a product. In contrast, the reviewers would probably prefer if it was written as a case study how we made the product.</p>\n<p>Do you have the same impression?</p>",
        "id": 568754624,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1768814606
    },
    {
        "content": "<p>For me, when I write a math paper, I usually prefer to clearly explain the results, much like you do. However, in the case of our paper, I don’t think it contains fundamentally new theoretical results. Rather, it might be more appropriate to document what can happen during the process of manual formalization, and what kinds of issues and design choices need to be considered in order to make our implementation compatible with existing libraries. I wonder if this is what the reviewers had in mind as well.</p>",
        "id": 569884561,
        "sender_full_name": "Byung-Hak Hwang",
        "timestamp": 1769271678
    },
    {
        "content": "<p>I get the second part of your message. But aren't math papers supposed to contain proofs? I thought that only formalization papers have the luxury of being able to explain results without explaining proofs, as those proofs are provided elsewhere.</p>",
        "id": 569896997,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769282428
    },
    {
        "content": "<p>I agree with your point. In math papers, the proofs are at the core of the paper, whereas in formalization, I see the product itself as the central contribution. Still, I think we should ask what a reader can actually gain from this paper. Simply presenting our implementation seems more suitable for a well-organized GitHub repository. For a paper submitted to a journal or a conference, it may be more important to reflect on what we learned through this project, and what readers can learn from it. For that reason, I suspect this is what the reviewers were getting at with their request.</p>",
        "id": 570021475,
        "sender_full_name": "Byung-Hak Hwang",
        "timestamp": 1769411323
    },
    {
        "content": "<p>Since you seem to be on the same page as the reviewers, do you have concrete suggestions what to write in the paper?</p>",
        "id": 570102092,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769436703
    },
    {
        "content": "<p>Another point in favor of NOT documenting the project in our paper is that our repository contains a summary in <code>Seymour.lean</code> by which we already do more for documenting our code that most projects do.</p>\n<p>That said, I suggest first focusing for on what we WANT to say, and only then I would discuss what will be removed from the paper (depending on how much over the page limit will the combination of old and new content together be).</p>",
        "id": 570311757,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769518256
    },
    {
        "content": "<p>Some info about the process (as opposed to the result, which reviewers seem not to be interested in) can be found in our status updates here:<br>\n<a href=\"https://github.com/Ivan-Sergeyev/seymour/tree/main/slides\">https://github.com/Ivan-Sergeyev/seymour/tree/main/slides</a></p>",
        "id": 570485470,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769585540
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/channel/498634-Seymour/topic/Comments.20from.20peer.20review/near/570102092\">말함</a>:</p>\n<blockquote>\n<p>Since you seem to be on the same page as the reviewers, do you have concrete suggestions what to write in the paper?</p>\n</blockquote>\n<p>Sorry for the late reply. Although I may not be the right person to suggest an outline for the paper since I’m not fully aware of all the details of the entire development process, I’ll try my best.</p>",
        "id": 571292716,
        "sender_full_name": "Byung-Hak Hwang",
        "timestamp": 1769957790
    },
    {
        "content": "<p>I will be on vacation for the next three days, but I will be able to keep replying today. Before <span class=\"user-mention\" data-user-id=\"729071\">@Byung-Hak Hwang</span> makes changes, could <span class=\"user-mention\" data-user-id=\"985790\">@Cameron Rampell</span> open a PR with the changes he suggests?</p>",
        "id": 571293138,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769958199
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"729071\">Byung-Hak Hwang</span> <a href=\"#narrow/channel/498634-Seymour/topic/Comments.20from.20peer.20review/near/571292716\">said</a>:</p>\n<blockquote>\n<p>suggest an outline for the paper</p>\n</blockquote>\n<p>Or are you willing to outline a new paper from scratch? <span class=\"user-mention\" data-user-id=\"985790\">@Cameron Rampell</span> has already given up on the idea of writing an entirely new paper afaik.</p>",
        "id": 571295729,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769960296
    },
    {
        "content": "<p>I pushed my contributions for the paper on Github (which I probably should have opened in a new pull request). Could you make sure it compiles? I didn't have all the packages necessary to compile the code locally, so I just went about blindly editing LaTeX files instead.</p>",
        "id": 571309106,
        "sender_full_name": "Cameron Rampell",
        "timestamp": 1769973156
    },
    {
        "content": "<p>Indeed, it should be at least three different PRs. If you don't know how to open several PRs, I can always just copypaste selected files from your PR, but you will not appear in the commit history.</p>",
        "id": 571311123,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769975328
    },
    {
        "content": "<p>I'm fine with that if it's easier for all of us.</p>",
        "id": 571311145,
        "sender_full_name": "Cameron Rampell",
        "timestamp": 1769975345
    },
    {
        "content": "<p>As for changes to the paper, which is perhaps the most urgent thing to discuss, I disagree with<br>\n\\section{Proof Outline and Design Choices}<br>\nsince</p>\n<ul>\n<li>Definitions and statements have not appeared yet. There is no proof to outline.</li>\n<li>Design choices should probably be discussed throughout. Of course, the main design choices can already come here.</li>\n</ul>\n<p>Once you change the section title, we can discuss what should be expanded.</p>",
        "id": 571311481,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769975717
    },
    {
        "content": "<p>As for the other changes, I think that ⊕₂ and ⊕₃ are too much of notation abuse, since the 2-sum and the 3-sum are relations, not functions. Interestingly, the 1-sum is a function, but you don't write such notation there.</p>",
        "id": 571311665,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769975883
    },
    {
        "content": "<p>Do you think we can simply relocate the proof outline after we have defined everything? I suppose I can easily fix the notational stuff too.</p>",
        "id": 571311818,
        "sender_full_name": "Cameron Rampell",
        "timestamp": 1769976015
    },
    {
        "content": "<p>I don't really know but my impression is that the reviewers would have preferred some kind of overall outline before the definitions.</p>",
        "id": 571311903,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769976084
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"985790\">Cameron Rampell</span> <a href=\"#narrow/channel/498634-Seymour/topic/Comments.20from.20peer.20review/near/571311145\">said</a>:</p>\n<blockquote>\n<p>I'm fine with that if it's easier for all of us.</p>\n</blockquote>\n<p>Certainly not for <em>all</em> of us, but I am willing to manually update the files.</p>",
        "id": 571312048,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769976244
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/channel/498634-Seymour/topic/Comments.20from.20peer.20review/near/571311665\">said</a>:</p>\n<blockquote>\n<p>As for the other changes, I think that ⊕₂ and ⊕₃ are too much of notation abuse, since the 2-sum and the 3-sum are relations, not functions. Interestingly, the 1-sum is a function, but you don't write such notation there.</p>\n</blockquote>\n<p>On the other hand, I really like your description of the 2-sum and the 3-sum in prose. Could the sentences be perhaps a bit modified so that the reader knows that we illustrate what those notions mean for graphs? I am not sure if the reader implicitly understands that your description is not general for all pairs of (binary) matroids.</p>",
        "id": 571312282,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769976439
    },
    {
        "content": "<p>Could I just insert something like \"we describe what this operation looks like in the graphical case: one joins two graphs along a single common edge, then deletes that edge from the combined graph\"?</p>",
        "id": 571312636,
        "sender_full_name": "Cameron Rampell",
        "timestamp": 1769976736
    },
    {
        "content": "<p>Sounds good. Do you think we will be able to accompany the prose with images?<br>\n<a class=\"stream-topic\" data-stream-id=\"498634\" href=\"/#narrow/channel/498634-Seymour/topic/Pictures.20for.20the.20paper/with/571311960\">#Seymour &gt; Pictures for the paper</a></p>",
        "id": 571312711,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769976818
    },
    {
        "content": "<p>Sure, I think I can easily reproduce those images in TikZ.</p>",
        "id": 571312744,
        "sender_full_name": "Cameron Rampell",
        "timestamp": 1769976852
    },
    {
        "content": "<p>Another big thing to discuss is what to do about the \"side-quest results\" that are mentioned in our paper (I am talking about lemmas like <code>Matrix.exists_standardRepr_isBase</code> which we didn't need in any proof but we decided to provide them for the sake of creating a useful library). Currently we cite them verbatim and, on top of that, we describe them shortly in prose. We can...</p>\n<ul>\n<li>keep them verbatim</li>\n<li>state them in some kind of symbolic informalism (perhaps similar to blueprint)</li>\n<li>keep only the prose (i.e., mention them but not state them)</li>\n<li>remove all side quests from the paper</li>\n</ul>\n<p>I have no idea what would be best.</p>",
        "id": 571313153,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1769977292
    },
    {
        "content": "<p>Over the past few days my computer was broken down. I’ll first take a look at Cameron’s PR.</p>",
        "id": 572390706,
        "sender_full_name": "Byung-Hak Hwang",
        "timestamp": 1770388119
    },
    {
        "content": "<p>It seems neither of you want to rewrite the paper from scratch. I think it would be useful to look through papers published in ITP and CPP to get a better sense of the expected style and how similar results are presented. Do you know of any ITP or CPP papers that are similar in spirit to our project?</p>",
        "id": 572390837,
        "sender_full_name": "Byung-Hak Hwang",
        "timestamp": 1770388154
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"729071\">Byung-Hak Hwang</span> <a href=\"#narrow/channel/498634-Seymour/topic/Comments.20from.20peer.20review/near/572390837\">said</a>:</p>\n<blockquote>\n<p>It seems neither of you want to rewrite the paper from scratch.</p>\n</blockquote>\n<p>Yeah, sorry. Apart from the 3-day vacation I took, I have been too busy with finishing my Ph.D..</p>",
        "id": 572449604,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770405712
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"729071\">Byung-Hak Hwang</span> <a href=\"#narrow/channel/498634-Seymour/topic/Comments.20from.20peer.20review/near/572390837\">said</a>:</p>\n<blockquote>\n<p>Do you know of any ITP or CPP papers that are similar in spirit to our project?</p>\n</blockquote>\n<p>Similar in spirit as in \"presenting mathematical results, not a paper on metatheory, not a paper about tooling\" ?</p>\n<p>If you mean it this broadly, then circa a half of recent ITP papers is similar in spirit.</p>",
        "id": 572449957,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770405846
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/channel/498634-Seymour/topic/Comments.20from.20peer.20review/near/555583572\">said</a>:</p>\n<blockquote>\n<ul>\n<li>I noticed in the code that R10's regularity uses a proof by reflection. That is potentially interesting for CPP, yet it does not appear in the paper. If it is omitted because it does not appear in the paper's formulation of the composition direction, consider still highlighting it as it may interest readers.<br>\n</li>\n</ul>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"767695\">@Tristan Figueroa-Reid</span> <br>\nWould you have time to write a very short section about proving regularity of R10, which you implemented?</p>",
        "id": 572538842,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770476393
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"729071\">Byung-Hak Hwang</span> <a href=\"#narrow/channel/498634-Seymour/topic/Comments.20from.20peer.20review/near/572390837\">said</a>:</p>\n<blockquote>\n<p>Do you know of any ITP or CPP papers that are similar in spirit to our project?</p>\n</blockquote>\n<p>You can have a look at a very new distinguished paper:<br>\n<a href=\"https://arxiv.org/pdf/2509.04922\">https://arxiv.org/pdf/2509.04922</a></p>",
        "id": 572558357,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770489726
    },
    {
        "content": "<blockquote>\n<p>Would you have time to write a very short section about proving regularity of R10, which you implemented?</p>\n</blockquote>\n<p>[Have there been any changes in the place where I should write this?]</p>",
        "id": 572704534,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1770625317
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"767695\">Tristan Figueroa-Reid</span> <a href=\"#narrow/channel/498634-Seymour/topic/Comments.20from.20peer.20review/near/572704534\">said</a>:</p>\n<blockquote>\n<p>[Have there been any changes in the place where I should write this?]</p>\n</blockquote>\n<p>Overleaf doesn't want to compile such a large document anymore, unless we get the paid subscription. Hence I suggest we continue here:<br>\n<a href=\"https://github.com/Ivan-Sergeyev/seymour/tree/main/paper\">https://github.com/Ivan-Sergeyev/seymour/tree/main/paper</a></p>",
        "id": 572706443,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770625860
    },
    {
        "content": "<p>Or do you <span class=\"user-mention\" data-user-id=\"985790\">@Cameron Rampell</span> want to take it to Overleaf now that the writing is in your hands? I don't know whether the compilation-time issue persists after switching to the LIPICS template.</p>",
        "id": 573722621,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770982898
    },
    {
        "content": "<p>Quick question. Is anyone currently working on revisions?</p>",
        "id": 573788650,
        "sender_full_name": "Byung-Hak Hwang",
        "timestamp": 1771001956
    },
    {
        "content": "<p>I am not working on revisions. I will just write up a few paragraphs (or rather adapt from my thesis) about a certain design decision, and it will be up to yall whether to include it or not.</p>",
        "id": 573811612,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1771009277
    },
    {
        "content": "<p>Here.<br>\n<a href=\"/user_uploads/3121/pyVA5AyhRTP-dfJwS1zdiyb_/toMatrixDropUnionDropInternal.txt\">toMatrixDropUnionDropInternal.txt</a></p>",
        "id": 573888467,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1771068144
    }
]