[
    {
        "content": "<p>I've just added in mathlib 4's definition of a matroid to the paper. Does this indentation look okay? How about the fact that I removed all of the comments explaining these definitions?<br>\n<a href=\"/user_uploads/3121/uTFMHWgncdl9a3dQHDJ6b509/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/uTFMHWgncdl9a3dQHDJ6b509/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"390x439\" src=\"/user_uploads/thumbnail/3121/uTFMHWgncdl9a3dQHDJ6b509/image.png/840x560.webp\"></a></div><p>Additionally, how do I add ⦃ and ⦄ into Latex as unicode characters (right now they are appearing as boxes ￿ )?</p>\n<p><span class=\"user-mention\" data-user-id=\"417654\">@Martin Dvořák</span> <span class=\"user-mention\" data-user-id=\"709805\">@Ivan S.</span> Any opinions?</p>",
        "id": 531915328,
        "sender_full_name": "Mark Sandey",
        "timestamp": 1753904067
    },
    {
        "content": "<p>Your indentation is nearly perfect; don't worry about it; it is really hard to format code when the column is so narrow; I will adjust it.</p>\n<p>It is also good that you removed the comments — the text before and the text after the code is the comment.</p>\n<p>As for ⦃ and ⦄ I will try.</p>\n<p>The real question is whether <code>Matroid</code> or <code>IndepMatroid</code> or both should be shown and whether <code>Matroid</code> or <code>IndepMatroid</code> or both should be discussed.</p>",
        "id": 532011497,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1753950445
    },
    {
        "content": "<p>FYI, we moved the part about Matroids and Mathlib to a newly created section called Preliminaries. Can you please continue there? Ivan will write Introduction — it will come before Preliminaries and it will be more general.</p>",
        "id": 532065575,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1753966098
    },
    {
        "content": "<p>I recommend starting with an outline. Think about questions like:</p>\n<ul>\n<li>What is this section about? What is its role or funciton within the document?</li>\n<li>What do we want to communicate here?</li>\n<li>What is the list of things we want to mention or share here?</li>\n</ul>\n<p>Once you believe you know the answer to these questions, write them down as a bullet point list. Start with general answers and broad descriptions as top-level bullets. Then get more specific by adding one more layer for each bullet. You can recurse until you're happy with the level of detail, and you can easily notice if you're going too deep.</p>\n<p>Once you're done, check if the list makes sense and actually addresses the points above. Re-organize it to follow a logical order.</p>\n<p>Usually you don't need more than 2-3 levels in your outline. If you're using more, then the structure might be overly complicated, or you might be already describing sentence-level detail. If it's the first case, try to re-think and simplify the structure. If it's the second, either take a step back and thinking about the higher level structure and ideas, or go with the flow and continue to write sentences if you already have a clear idea for what you want to say.</p>",
        "id": 532083490,
        "sender_full_name": "Ivan S.",
        "timestamp": 1753970630
    },
    {
        "content": "<p>You can look at an example of an outline I created in \"materials/Outline.md\", or check an earlier version of a section that I worked on that contains a list of bullet points in an <code>itemize</code> environment.</p>",
        "id": 532083965,
        "sender_full_name": "Ivan S.",
        "timestamp": 1753970729
    }
]