[
    {
        "content": "<p>Chapman University in Orange, California, USA, is hiring doctoral students and postdoctoral fellows through two different programs (see below). Applicants for either program will be selecting their desired mentors, and I am seeking a doctoral student and/or postdoctoral fellow.</p>\n<p>You're invited to consider applying if you are interested to work with me on at least one of the following topics, or a related one:</p>\n<ul>\n<li>logical and mathematical methods in computer science (in particular: category theory, type theory, or programming language theory)</li>\n<li>logical, categorical, or synthetic aspects of homotopy theory, topology, and geometry</li>\n<li>proof assistants and formalization of mathematics</li>\n<li>AI and machine learning for automated reasoning and theorem proving</li>\n<li>verification and formal methods in software engineering</li>\n</ul>\n<p>If you're interested in applying, please reach out to me via: <a href=\"mailto:jweinberger@chapman.edu\">jweinberger@chapman.edu</a><br>\n<strong>1) INFORMATION ON THE DOCTORAL POSITION (MPP PROGRAM)</strong></p>\n<p>Chapman University's graduate program in Mathematics, Philosophy, and Physics (MPP) is looking for graduate students. The degree awarded upon completion of this research-focused graduate program is Doctor of Science (DSc), equivalent to a Doctor of Philosophy (PhD). All areas of math, philosophy, and physics are welcome, but an interdiscplinary perspective is encouraged. <strong>A Master's degree is required but you are invited to apply if you are currently a Master's student.</strong><br>\n<strong>Deadline for full fellowship consideration: January 15, 2026</strong><br>\n<strong>Please apply via the Graduate Application on the MPP website (<a href=\"http://www.chapman.edu/mpp\">www.chapman.edu/mpp</a>).</strong><br>\n<strong>Important links:</strong></p>\n<ul>\n<li>How to apply: <a href=\"https://www.chapman.edu/admission/graduate/apply/how-to-apply.aspx\">https://www.chapman.edu/admission/graduate/apply/how-to-apply.aspx</a></li>\n<li>Virtual open house info sessions RSVP on January 9: <a href=\"https://go.chapman.edu/portal/is-mpp\">https://go.chapman.edu/portal/is-mpp</a></li>\n<li>MPP program website: <a href=\"https://www.chapman.edu/scst/graduate/dsci-mpp.aspx\">https://www.chapman.edu/scst/graduate/dsci-mpp.aspx</a></li>\n<li>Program structure and curriculum: <a href=\"https://catalog.chapman.edu/preview_program.php?catoid=57&amp;poid=12060&amp;hl=%22MPP%22&amp;returnto=search\">https://catalog.chapman.edu/preview_program.php?catoid=57&amp;poid=12060&amp;hl=%22MPP%22&amp;returnto=search</a></li>\n</ul>\n<p><strong>2) INFORMATION ON THE POSTDOCTORAL POSITION (GCI PROGRAM)</strong></p>\n<p>Chapman University's Grand Challenges Initative (GCI) is offering postdoctoral fellow positions. Fellows in the program gain valuable experience by:</p>\n<ul>\n<li>Teaching critical thinking, foundational problem solving, and communication skills to our first- and second-year STEM students</li>\n<li>Conducting research with a faculty mentor</li>\n<li>Being involved in a community of fellows and a world-class postdoctoral mentorship program and that is leading to great results. Past fellows have a history of moving on to faculty positions.</li>\n</ul>\n<p>Conditions of the job:</p>\n<ul>\n<li>Approximately 70% of time is dedicated to research and 30% to teaching.* Appointments will begin in late summer 2026 for one year with up to two years of extension contingent on performance.</li>\n<li>\n<p>Fellows joining our community are offered a competitive annual salary ($70,304), benefits, annual research support ($5,000), and personalized professional development in teaching and research.<br>\n<strong>Please read the full description and apply at:</strong> <a href=\"https://apply.interfolio.com/176832\">https://apply.interfolio.com/176832</a><br>\n<strong>File review will commence on January 21, 2026</strong><br>\n<strong>Important links:</strong></p>\n</li>\n<li>\n<p>GCI Team: <a href=\"https://www.chapman.edu/about/our-home/keck-center/gci/fellows.aspx\">https://www.chapman.edu/about/our-home/keck-center/gci/fellows.aspx</a></p>\n</li>\n<li>Article on GCI mentorship: <a href=\"https://blogs.chapman.edu/gci/2022/07/21/grand-challenges-initiative-program-highlighted-in-science/\">https://blogs.chapman.edu/gci/2022/07/21/grand-challenges-initiative-program-highlighted-in-science/</a></li>\n</ul>",
        "id": 566375504,
        "sender_full_name": "Jonathan Weinberger",
        "timestamp": 1767625800
    }
]