[
    {
        "content": "<p>This job add was posted today: <a href=\"https://www.mathjobs.org/jobs/HCM/IRU\">https://www.mathjobs.org/jobs/HCM/IRU</a><br>\nThe goal is to find an excellent candidate that will be member of the computer science department in Bonn, and will together with my group form the interdisciplinary research unit of formal mathematics in Bonn. <br>\nThe full text of the job ad is below. Please contact me if you have any questions.</p>\n<hr>\n<p>The cluster of excellence <strong>Hausdorff Center for Mathematics (HCM)</strong> at the <strong>University of Bonn</strong> brings together researchers in mathematics and its applications. Together with the <strong>Department of Computer Science</strong>, the center invites applications for a<br>\n<strong>W2 Professorship in Formal Mathematics with a focus on Automated Theorem Proving</strong></p>\n<p>This is a temporary W2-Professorship for a period of five years.</p>\n<p>We are looking for promising early-career researchers holding a doctoral degree, who are developing their own research agenda and who have already demonstrated scientific excellence and independence by publications in the field of automated theorem proving. We seek candidates with international research experience at the interface between mathematics and computer science. The candidate will have a reduced teaching load but is expected to contribute to our teaching programs. Very good didactic skills are required and teaching experience will be a plus. German language skills are not required. The candidate hired will become member of the HCM and the Department of Computer Science.</p>\n<p>The University of Bonn actively supports diversity and equal opportunities. The University of Bonn has been certified as a family-friendly university and offers a dual career-service. Its aim is to increase the proportion of women in those fields in which women are underrepresented and to place a special focus on promoting their careers. Therefore, the university specifically requests applications from suitably qualified women. Applications will be handled in accordance with the Equal Opportunities Act of North Rhine-Westphalia. Applications from suitably qualified people with severe disabilities that have already been verified or from people with an equivalent status will be particularly welcomed.</p>\n<p>The general conditions of employment are according to ยง 36 of the Higher Education Act of North Rhine-Westphalia (Hochschulgesetz des Landes Nordrhein-Westfalen).</p>\n<p>For information about the financial benefits, dual career options or family support options the HCM can offer, please contact the managing director Dr. Magdalena Balcerak Jackson (<a href=\"mailto:magdalena.balcerakjackson@hcm.uni-bonn.de\">magdalena.balcerakjackson@hcm.uni-bonn.de</a>).</p>\n<p>Applications are requested by March 9, 2025, through the application web portal of the University of Bonn (<a href=\"https://berufungsportal.uni-bonn.de/\">https://berufungsportal.uni-bonn.de</a>).</p>",
        "id": 496528302,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1738150879
    },
    {
        "content": "<p>Due to a low number of applications, we have extended the application deadline until April 23rd <del>(even though we've taken down the Mathjobs ad)</del>. <br>\nIf you still want to apply, go to the following link and create an account:<br>\n<a href=\"https://berufungsportal.uni-bonn.de/applicationDetail.do?action=edit&amp;actionCat=create&amp;applicationType=1&amp;procedureId=194\">https://berufungsportal.uni-bonn.de/applicationDetail.do?action=edit&amp;actionCat=create&amp;applicationType=1&amp;procedureId=194</a></p>",
        "id": 508754833,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1743168464
    },
    {
        "content": "<p>FYI: mathjobs has completely fallen over</p>",
        "id": 508756902,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1743169053
    }
]