[
    {
        "content": "<p>Join me (<a href=\"https://grosser.science\">https://grosser.science</a>) on the quest to formalize the LLVM/MLIR ecosystem. I am looking for future PhD students with interests in Lean and formal methods. If you enjoy working on open-source and like to collaborate globally this position might be for you.</p>\n<p>We have 5 funded positions via <a href=\"https://www.cl.cam.ac.uk/research/cascade/\">CASCADE</a> (where we also invite Lean enthusiasts to apply).  Cambridge additionally offers every year numerous fellowships which you are put forward to automatically.</p>\n<p>Drop me a message on zulip in case this sparks your interest!</p>\n<p>Apply before December 3rd to maximize your chance for funding.</p>\n<p>Further information: <a href=\"https://grosser.science/#join\">https://grosser.science/#join</a></p>\n<p>Some of the recent work we did:</p>\n<ul>\n<li>Lean<ul>\n<li>Automatic Translation of Authoritative RISCV Semantics (and others) to Lean: <a href=\"https://github.com/opencompl/sail-riscv-lean\">https://github.com/opencompl/sail-riscv-lean</a></li>\n<li>Lean-MLIR (<a href=\"https://github.com/opencompl/lean-mlir\">https://github.com/opencompl/lean-mlir</a>)</li>\n<li>Decision Procedures for Lean's <code>BitVec</code><ul>\n<li><a href=\"https://grosser.science/pub/10.1145/3763148/\">Certified Decision Procedures for Width-Independent Bitvector Predicates</a></li>\n<li><a href=\"https://grosser.science/pub/10.1145/3763167/\">Interactive Bitvector Reasoning using Verified Bit-Blasting</a> - <code>Henrik (Lean FRO) implemented bv_decide</code></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>MLIR<ul>\n<li><a href=\"https://grosser.science/pub/10.1145/3729309/\">First-Class Verification Dialects for MLIR</a> </li>\n<li>Hardware Design Automation at <a href=\"https://circt.llvm.org\">https://circt.llvm.org</a></li>\n<li><a href=\"https://grosser.science/pub/lopoukhinemultilevelcompilerbackend2025/\">ISA level Dialects</a></li>\n</ul>\n</li>\n</ul>\n<p>After having contributed to building some of the key foundations, we are now looking forward to bring more automated verification into the LLVM ecosystem.</p>\n<p>Cambridge has a lively Lean and Formal Methods community, an excellent Tech Scene, is close to London for big city vibes, and otherwise. Our department host the SAIL is specification language (Peter Sewell, ...), the Cheri microarchitecture (Robert Watson,  Simon Moore...),  the opentitan root-of-trust (Rob Mullins via LowRisc), Isabelle (Larry Paulson). Our AI researchers in CARAMEL (<a href=\"https://caraml-group.github.io/\">https://caraml-group.github.io/</a>) have various lines of work around Lean.</p>",
        "id": 548102796,
        "sender_full_name": "Tobias Grosser",
        "timestamp": 1761900178
    }
]