[
    {
        "content": "<p>We’re assembling a small group of Lean 4 / mathlib specialists to support an upcoming project with Invisible, an AI company working with leading organizations to improve advanced reasoning models.</p>\n<p>This role focuses on formal reasoning and machine-checked proofs in Lean 4—closer to proof engineering and formal verification than application development. Your work will directly influence how AI systems learn to reason about mathematics and logic.</p>\n<p>Ideal background</p>\n<ul>\n<li>Master's, PhD (in progress or recent), or PostDoc experience in pure mathematics</li>\n<li>Bachelor's or Master's, in progress or complete</li>\n<li>Strong foundation in probability, analysis, topology, or category theory</li>\n<li>Comfort with topics such as convergence theorems, functional analysis, measure theory, or homological/category-theoretic concepts</li>\n<li>Clear, explicit communication of proof strategies and reasoning</li>\n</ul>\n<p>Details</p>\n<ul>\n<li>Remote, freelance, project-based (can be done alongside other work)</li>\n<li>Pay range: $35–$65 USD/hour, depending on experience and location</li>\n</ul>\n<p>If you know others with strong Lean or formal methods experience, feel free to share this opportunity.<br>\nApply at: <a href=\"https://job-boards.eu.greenhouse.io/agency/jobs/4737130101?gh_src=ga1gabg2teu\">https://job-boards.eu.greenhouse.io/agency/jobs/4737130101?gh_src=ga1gabg2teu</a></p>\n<p>If you have any questions, please reach out, to me.</p>",
        "id": 566696672,
        "sender_full_name": "Luis Cordova",
        "timestamp": 1767779742
    },
    {
        "content": "<p>Do you want expertise in <em>all</em> the listed areas?</p>",
        "id": 566698690,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1767780365
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"330967\">@Wrenna Robson</span> No, it is just some of the areas that can be worked on. Mainly once in the project you will work in the area, that is your strengths. However, their will be the opportunity to explore all areas of Math but will be able to work on what your expertise is in.</p>",
        "id": 566699362,
        "sender_full_name": "Luis Cordova",
        "timestamp": 1767780598
    },
    {
        "content": "<p>I should add that we are unable to hire from some countries, so if you are unable to apply for that reason, please keep in mind it isn't a reflection of your skills or expertise.</p>",
        "id": 566700471,
        "sender_full_name": "Luis Cordova",
        "timestamp": 1767780994
    },
    {
        "content": "<p>Not looking for freelance work myself.</p>",
        "id": 566721760,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1767788326
    },
    {
        "content": "<p>All good, thanks for the update.</p>",
        "id": 566725047,
        "sender_full_name": "Luis Cordova",
        "timestamp": 1767789629
    },
    {
        "content": "<p>We have changed this to include anyone with a Bachelor's or Master's, in progress or complete</p>",
        "id": 568029213,
        "sender_full_name": "Luis Cordova",
        "timestamp": 1768408210
    }
]