[
    {
        "content": "<p>Hi all, </p>\n<p>Following on from <a href=\"#narrow/stream/284757-job-postings/topic/Student.20Researcher.20Program.20at.20Google.20Deepmind/near/416835779\">my previous post</a>, there is another opportunity to work with me and my colleagues at Google DeepMind. Some of you will remember, and have participated, in a previous study we indirectly ran. There were obvious limitations to that style of data collection, and so now we’re looking to hire a group of Lean enthusiasts more directly; to help us with translation, writing proofs, and more.</p>\n<p>This will be a part time flexible opportunity, so you can work from home and on your own schedule. We’re looking for folks who can provide at least 2 days (16 hours) per week and to start ASAP. You’ll also be connected as a group to be able to discuss problems, and will have access to our internal tools, which we hope will be much easier to use.</p>\n<p>If you’re interested, please email your CV and a description of your experience with Lean to <a href=\"mailto:gdm-maths@google.com?subject=Lean+opportunities+@+GDM\">gdm-maths@google.com</a>. </p>\n<p>If you have already emailed with your interest in the student researcher program in response to <a href=\"#narrow/stream/284757-job-postings/topic/Student.20Researcher.20Program.20at.20Google.20Deepmind/near/416835779\">my previous post</a>, it’s important to note that we are not hiring through that route anymore. If you’ve applied for that position and are interested in this one as well, please re-apply by emailing the above!</p>",
        "id": 424067600,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1709226683
    },
    {
        "content": "<p>Thanks for sharing! For how long would this opportunity be? Is that also flexible? To whom should I address the email?</p>",
        "id": 424074900,
        "sender_full_name": "Benedikt Peterseim",
        "timestamp": 1709228850
    },
    {
        "content": "<p>It would be for around 3 months, but with potential to extend beyond that.</p>",
        "id": 424614842,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1709545857
    },
    {
        "content": "<p>FYI, I've been informed that China (including Hong Kong) is not a possible remote work location. I've asked for a full allowlist or disallowlist but have not been given one. According to Wikipedia, Google DeepMind has presence in UK, France, Germany, US and Canada, so those locations (and the European Union) are probably okay.</p>",
        "id": 424645370,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1709556384
    },
    {
        "content": "<p>Is this opportunity just for students and postdocs?</p>",
        "id": 425686234,
        "sender_full_name": "Kevin Cheung",
        "timestamp": 1709990764
    },
    {
        "content": "<p>No, there is no such restriction from our end; though if anything, students may be less eligible as some universities do not permit 2 days of paid work alongside studies.</p>",
        "id": 425686520,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1709991019
    },
    {
        "content": "<p>What’s the deadline for submitting applications for this position?</p>",
        "id": 425732089,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1710032678
    }
]