[
    {
        "content": "<p>Hello Everyone!  </p>\n<p>This is a competitive job opportunity that gives you a chance at changing the world.  I was going to ask for feedback on Lean for Teaching, but what I’m really looking for is partnerships, and so I’m posting here on “Job Postings”. </p>\n<p><strong><em>Who am I?</em></strong></p>\n<p>I am a bridge builder, aiming to connect the islands of human knowledge to form a cohesive landscape of understanding. I’m passionate about mathematical physics and education technology, always driven by a desire for unification. My goals are to help lift the curtain of the great veil and to guide anyone in the world to the most profound STEM insights.</p>\n<p><strong><em>Entrepreneurial Goal Description</em></strong></p>\n<p>To create a global education platform (called Gyde) that centralizes educational services.  The initial market is top mathematics researchers.</p>\n<p><strong><em>Company Values</em></strong></p>\n<p>Scholars and knowledge.  The platform will champion and celebrate academics and the perspective that the beauty in STEM is a form of art.</p>\n<p><strong><em>Company Mission</em></strong></p>\n<p>Vertical and horizontal STEM growth.  Gyde aims to increase STEM knowledge accessible to humans by funding STEM R&amp;D.  Conversely, Gyde aims to increase humans accessibility to STEM knowledge by funding world-wide education.</p>\n<p><strong><em>Relevance to “Lean for Mathlib”</em></strong></p>\n<p>I believe content on the platform can funnel users to contribute to formalizing mathematics.  I also believe that proof verifiers can find optimal learning routes and teaching methods by assessing students.  For the second belief to be realizable, a latex to formalized math converter might need to be automated, making this an important goal.</p>\n<p><strong><em>Who I’m looking for?</em></strong></p>\n<p>I seek not a pathfinder, but a trailblazer; one who will not follow where the path may lead, but go where there is no path and leave a trail.  I seek someone who shares my values and desire to bring new horizons within reach. </p>\n<p>I value expertise over experience, and seek someone to build an insanely great product.  In particular, I seek someone with expertise in full-stack development, machine learning, and Lean, along with an entrepreneurial spirit.  Since the platform will reserve the majority portion of company ownership for contributing academics, the expected skill level is significant, but due to the scarcity of these skills, possessing a couple and a drive to learn is highly valued.</p>\n<p>If this sounds like you, I invite you to reach out, and I can ensure you a Gyde prototype demonstration.  A UCLA Statistics professor with a Harvard PhD will serve as the machine learning consultant for the product.  If we believe in you, I can offer you $75,000 per year (for now) and equal vested stakes as a cofounder.  Ideally, you live in, or can relocate to, California, Italy, the UK, or an area near a top-ranked university in mathematics or physics. </p>\n<p>Thank you for considering this opportunity.  Please feel free to email me (<a href=\"mailto:jony.gyde@gmail.com\">jony.gyde@gmail.com</a>) with relevant portfolios or resumes, and an explanation as to why you want to impact mathematical education or edTech in general.</p>\n<p>Best Regards,</p>\n<p>Jony Vale</p>\n<ul>\n<li>(Co?) Founder, Gyde</li>\n<li>Co-Founder, HermesGO</li>\n<li>Mathematics BS, UCLA</li>\n<li><a href=\"mailto:jony.gyde@gmail.com\">jony.gyde@gmail.com</a></li>\n</ul>",
        "id": 384075333,
        "sender_full_name": "Jony Vale",
        "timestamp": 1691782352
    },
    {
        "content": "<p><a href=\"#narrow/stream/284757-job-postings/topic/Gyde/near/384075333\">A message</a> was moved here from <a class=\"stream-topic\" data-stream-id=\"284757\" href=\"/#narrow/stream/284757-job-postings/topic/Refactorings.20for.20Lean.20code\">#job postings &gt; Refactorings for Lean code</a> by <span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span>.</p>",
        "id": 384092088,
        "sender_full_name": "Notification Bot",
        "timestamp": 1691787608
    }
]