[
    {
        "content": "<p>Hi, I was asked to advertise the following positions which may be of interest (the latter mentions proof assistants explicitly):</p>\n<blockquote>\n<p>Tenure-track assistant professorship in foundations of computer science with a focus on logic and automated reasoning (application deadline Jan 8)</p>\n<p>The Department of Computer Science at Lund University invites applications for a tenure-track assistant professorship in the foundations of computer science with a focus on logic and automated reasoning.</p>\n<p>The assistant professor will be working at the Department of Computer Science, where research into the foundations of computer science is conducted by professors Susanna de Rezende and Jakob Nordstrom. Jakob Nordstrom leads the research group Mathematical Insights into Algorithms for Optimization (<a href=\"https://jakobnordstrom.se/miao-group\">https://jakobnordstrom.se/miao-group</a>), which is also active at the University of Copenhagen. The research has a unique profile in that it spans a wide range of questions from the theoretical, mathematical foundations of efficient computation all the way to state-of-the-art practical algorithms for real-world problems. This creates a very special environment, where the research projects do not only go deep into different theoretical and applied topics, but where different lines of research cross-fertilise each other and unexpected and exciting synergies often arise.</p>\n<p>This position focuses on algorithms for foundational problems within logic, automated reasoning, and combinatorial optimization. This includes design and implementation of algorithms for computational problems within Boolean satisfiability (SAT) solving, constraint programming, mixed integer linear programming, and/or satisfiability modulo theories (SMT) solving. In addition to algorithm construction, another topic of interest is to develop a scientific understanding of the practical performance of automated reasoning algorithms, and to investigate relations between empirical observations and theoretical results in algorithm analysis and computational complexity theory. Yet another related area concerns methods of ensuring that algorithms compute provably correct results, which can be used to develop trustworthy solvers for automated reasoning and combinatorial optimization.</p>\n<p>The application deadline is January 8, 2025. See <a href=\"https://jakobnordstrom.se/openings/AsstProf-Lund-250108.html\">https://jakobnordstrom.se/openings/AsstProf-Lund-250108.html</a> for more information and instructions how to apply. Informal enquiries are welcome and may be sent to <a href=\"mailto:jakob.nordstrom@cs.lth.se\">jakob.nordstrom@cs.lth.se</a>.</p>\n<p>Jakob Nordström, Professor<br>\nUniversity of Copenhagen and Lund University<br>\nPhone: +46 70 742 21 98<br>\n<a href=\"https://jakobnordstrom.se\">https://jakobnordstrom.se</a></p>\n<hr>\n<p>I'm looking for talented PostDocs to join the CertiFOX team. You will work on an exciting project in which we will bring certifying algorithms (proof logging) from low-level languages (such as SAT, where this approach is notoriously succesful) to high-level modelling languages. The grand goal we will work towards is to get end-to-end guarantees of correctness of runs of combinatorial optimization engines, all the way from human-readable input specifications to the produced answers.</p>\n<p>I'm looking in particular for people with experience either in combinatorial optimization algorithms, or in using proof assistants.<br>\nIf this triggers your scientific curiosity, have a look at the project webpage: <a href=\"https://bartbogaerts.eu/projects/CertiFOX\">https://bartbogaerts.eu/projects/CertiFOX</a></p>\n<p>Interested cadidates can apply at <a href=\"https://www.kuleuven.be/personeel/jobsite/jobs/60411819?hl=nl&amp;lang=nl\">https://www.kuleuven.be/personeel/jobsite/jobs/60411819?hl=nl&amp;lang=nl</a></p>\n<p>Don't hesitate to send me an e-mail if you have any questions.</p>\n<hr>\n<p>Prof. Bart Bogaerts<br>\nDeclarative Languages and Artificial Intelligence section<br>\nDepartment of Computer Science<br>\nKU Leuven<br>\nCelestijnenlaan 200A, room 01.14<br>\nB-3001 Heverlee</p>\n</blockquote>",
        "id": 484621977,
        "sender_full_name": "Yong Kiam",
        "timestamp": 1732669677
    }
]