[
    {
        "content": "<p>Heinrich Heine University D端sseldorf is seeking two full-time postdocs within the project ADAM: Anticipating the Digital Age of Mathematics.  The core aim of the project is to develop, test and publish online resources that provide an introduction to the lean proof assistant.  Suitable candidates will have a PhD in mathematics or a related area, experience in formalized mathematics and strong programming skills, and display a keen willingness to engage and<br>\ncollaborate with students and staff across a range of subjects including mathematics, computer sciences and linguistics.</p>\n<p>The positions are currently available for two years starting from October 2022.  They are payed on the E13 scale and come with very limited regular teaching duties.</p>\n<p>D端sseldorf is the capital of Nordrhein-Westfalen, the most populous German state, with a very cosmopolitan atmosphere and diverse neighbourhoods.  It has an international airport and excellent direct rail connections to Amsterdam, Brussels, Paris and Berlin. </p>\n<p>Interested candidates are encouraged to contact me (via zulip or &lt;<a href=\"mailto:marcus.zibrowius@hhu.de\">marcus.zibrowius@hhu.de</a>&gt;) or Prof. Immanuel Halupczok (&lt;<a href=\"mailto:immanuel.halupczok@hhu.de\">immanuel.halupczok@hhu.de</a>&gt;) for more information.  Full applications should be sent to &lt;<a href=\"mailto:marcus.zibrowius@hhu.de\">marcus.zibrowius@hhu.de</a>&gt; and include a cover letter, CV and a contact for a potential letter of reference.  There is no formal application deadline, but all applications received by 10 July<br>\n2022 are guaranteed to be considered.</p>",
        "id": 286546759,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1655502475
    },
    {
        "content": "<p>We are seeking to fill a short-term postdoc position at D端sseldorf, from  March to September 2024, within the <a href=\"http://hhu-adam.github.io/\">ADAM project</a>.  Our focus is the further development of <a href=\"https://adam.math.hhu.de/\">Lean Games</a> like the Natural Number Game, both in terms of the underlying software and in terms of game content.  Over the past year, we have reimplemented the <a href=\"https://lean.math.hhu.de/\">Lean Web Editor</a> to work with Lean 4, reimplemented and redesigned the <a href=\"https://github.com/leanprover-community/lean4game\">Lean Game Engine</a> (based on a Lean 4 prototype by Patrick Massot), and drafted a new game based on typical undergraduate exercises in traditional courses.</p>\n<p>The ideal candidate would bring experience from some of the following areas into the project:</p>\n<ul>\n<li>formalization of mathematics (ideally analysis, ideally Lean)</li>\n<li>JavaScript / TypeScript / React</li>\n<li>C/C++ to WebAssembly compilation</li>\n<li>functional programming (ideally Lean)</li>\n<li>web server administration</li>\n<li>web design/graphic design</li>\n</ul>\n<p>For a rundown of the technical side of the project, the current development status, and unbiased opinions on work and life in D端sseldorf, you can contact <span class=\"user-mention\" data-user-id=\"129120\">@Alexander Bentkamp</span> and <span class=\"user-mention\" data-user-id=\"385895\">@Jon Eugster</span>.   For more details on the position itself and the application procedure, please contact me directly via Zulip or via &lt;<a href=\"mailto:marcus.zibrowius@hhu.de\">marcus.zibrowius@hhu.de</a>&gt; .  The position comes with no teaching duties.</p>",
        "id": 388056074,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1693383998
    }
]