[
    {
        "content": "<p>You might have noticed that half a year ago, we had carefully written curated release notes with the lean releases, but more recently opted for something simpler (a roughly ordered list of PRs), as we at the FRO couldn’t quite justify the effort that went into editing the release notes, when there are always more pressing things to do.</p>\n<p>But I think it’s a pity, and a loss for our users, who now have a harder time figuring out what’s exciting (new features!) or important (breaking changes!) about the new release. So I’d like to see if it works to involve the community here, as an experiment.</p>\n<p>So I am looking for a volunteer who is interested to volunteer being the “lean release notes editor”. This would entail taking something like <a href=\"https://github.com/leanprover/lean4/releases/tag/v4.15.0\">https://github.com/leanprover/lean4/releases/tag/v4.15.0</a> into something more like <a href=\"https://github.com/leanprover/lean4/releases/tag/v4.8.0\">https://github.com/leanprover/lean4/releases/tag/v4.8.0</a> or even <a href=\"https://lean-lang.org/blog/2024-8-1-lean-4100/\">https://lean-lang.org/blog/2024-8-1-lean-4100/</a>.  Another good inspiration might be the “summary of changes” at <a href=\"https://coq.inria.fr/doc/V8.20.0/refman/changes.html#summary-of-changes\">https://coq.inria.fr/doc/V8.20.0/refman/changes.html#summary-of-changes</a></p>\n<p>So once per month, go through the list of changes, order them appropriately, identify the highlights and most important changes, and write a section about them. I’m looking for someone who can do that reliably, regularly, within a few days (or update a draft continuously throughout the month, as you prefer)  and needs little hand-holding.</p>\n<p>The main perks are:</p>\n<ul>\n<li><em>You</em> get to learn about <em>all</em> the lean changes, not just the interesting ones, so others don’t have to :)</li>\n<li>You’ll be credited with writing these, of course.</li>\n</ul>\n<p>Please send me a Direct Message if you are interested (don’t respond publicly, as there can be only one), maybe with a pointer to technical writing (blog posts, papers) that you have done before.</p>\n<p>(Discussion thread at <a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general/topic/Lean.20release.20notes.20editor.20volunteer\">#general &gt; Lean release notes editor volunteer</a> )</p>",
        "id": 494998803,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1737450153
    }
]