[
    {
        "content": "<p>This is a followup to my my annoucement of a month ago (<a href=\"#narrow/channel/284757-job-postings/topic/Possible.20permanent.20position.20at.20CNRS.20in.202026\">https://leanprover.zulipchat.com/#narrow/channel/284757-job-postings/topic/Possible.20permanent.20position.20at.20CNRS.20in.202026</a>), but I can't change the title anymore so I decided to make a new annoucement for clarity.</p>\n<p>The CNRS is opening a permanent junior position (\"chargé de recherche\") in its 2026 hiring campaign reserved for people doing formalization and/or AI for mathematics, with a preference for formalization. This is a permanent position with no teaching duties, based at a French university. </p>\n<p>Applications are now open, the application website is there: <br>\n<a href=\"https://carrieres.cnrs.fr/en/external-competitions-for-researchers-m-f/\">https://carrieres.cnrs.fr/en/external-competitions-for-researchers-m-f/</a>, <br>\nto start the actual application process go there:<br>\n<a href=\"https://concourschercheurs2026.dsi.cnrs.fr/accueil.php?langue=uk\">https://concourschercheurs2026.dsi.cnrs.fr/accueil.php?langue=uk</a><br>\nThe last page has a link to a guide for candidates. The guide doesn't answer all questions, but it is still useful to read it.</p>\n<p>Some important technical information:</p>\n<ul>\n<li>The deadline for applications is <strong>January 12 at 13h Paris time</strong>. This is strictly enforced. You can modify an already uploaded application as long as you do it before the deadline, so I advise you to upload applications early.</li>\n<li>Letters of recommendation: This year, all letters of support must be submitted via a link that becomes available to you after you create your candidate account. Do not send any letters directly to me or to any other member of the committee, we will not consider them. The deadline to submit letters is also January 12 at 13h, it is also strictly enforced. </li>\n<li>The competition number is \"01/03\" for the formalization position. Please check it carefully, if you make a mistake and discover it after the application deadline, then there is nothing we can do. Competition \"01/02\" is the general competition for junior positions in mathematics, you are welcome to apply there too (there is no downside to doing so). Competition \"01/04\" is for positions who will (very very probably) be located in Angers, Cergy, Clermont-Ferrand or Nancy, you should only apply if you're willing to work in one of these places.</li>\n</ul>\n<p>Calendar:</p>\n<ul>\n<li>Deadline for applications (again): January 12, 13h Paris time.</li>\n<li>The meeting to determine the list of interviewees will take place on February 23-25. The list will be posted shortly after that on our website: <a href=\"https://cn.math.cnrs.fr/\">https://cn.math.cnrs.fr/</a></li>\n<li>Interviews will be on April 7. They can take place by zoom if you are living in a foreign country, or cannot attend physically for health reasons (in the latter case, you will be asked for a medical certificate). We typically interview 4-5 people per position, and interviews last 15-20 minutes. In the following days, we will make a list of \"admissible\" candidates and post it on our website (<a href=\"https://cn.math.cnrs.fr/\">https://cn.math.cnrs.fr/</a>). This is usually the list of people who get hired, however there is another jury that is allowed to change it.</li>\n<li>The other jury meets on June 29 and makes the final list.</li>\n</ul>\n<p>Since the CNRS applications process has some idiosyncrasies, I will answer here some questions that people have often asked me:</p>\n<ul>\n<li>Q: What should the CV look like? A: Keep it short, 3 pages is enough. Diplomas, positions occupied, publications, preprints (be nice to the committee and put them in a separate category from publications), most important research talks, any other relevant professional experience.</li>\n<li>Q: Who is on the committee? A: In practice, it will be a subset of these people: <a href=\"https://www.cnrs.fr/comitenational/contact/annuaire.php?inst=01\">https://www.cnrs.fr/comitenational/contact/annuaire.php?inst=01</a></li>\n<li>Q: The application asks for a report on past research and a research proposal, how long should these be? A: There is no length limit, but 8-10 pages (plus references) for each is a good length. We have a lot of applications to read, but we want to get some details of your research.</li>\n<li>Q: Are there age or nationality conditions? A: No.</li>\n<li>Q: Do I need to speak French? A: No. You can do the whole process (including the interview) in English.</li>\n<li>Q: Do I need a PhD to apply? A: Technically, no. If you don't have a PhD, the committee will first decide whether you're eligible to apply or not; the criterion is whether you have produced research work equivalent to a PhD. (The most common case is if you have a defense date that is known, but after the application deadline. Then you can still try applying; last year we hired somebody who was in that situation.)</li>\n<li>Q: What about letters of recommendation? A: They are not required, but they can help, so I would advise you to get them. There is no upper or lower limit on the number of letters,  a reasonable number is 2-3. It is better to get letters from people who know your research well.</li>\n<li>Q: Do I need a letter of support from a French department head? A: No. It is a good idea to contact people in France to tell them that you will apply and ask to be sent to their department, but it is not the committee's task to decide where new hires are sent.</li>\n</ul>\n<p>Here is a blog post from a computer scientist about what it is like to work at CNRS and how the application process works:<br>\n<a href=\"https://dominik-peters.de/blog/apply-to-cnrs/\">https://dominik-peters.de/blog/apply-to-cnrs/</a><br>\nHere is another post about how to prepare a CNRS application:<br>\n<a href=\"https://www.astroconcours.fr/2024/12/22/composition-cnrs-dossier.html\">https://www.astroconcours.fr/2024/12/22/composition-cnrs-dossier.html</a><br>\nAnd here is the FAQ on the CNRS's website:<br>\n<a href=\"https://carrieres.cnrs.fr/en/concours-faq/\">https://carrieres.cnrs.fr/en/concours-faq/</a></p>\n<p>Feel free to ask questions in this thread. Please note that, as the president of the hiring committee, I am not allowed to give personalized advice to candidates during the selection process.</p>",
        "id": 563553478,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1765570163
    }
]