[
    {
        "content": "<p><a href=\"https://workingat.vu.nl/ad/phd-position-number-theory-and-formalization/70lg5t\">https://workingat.vu.nl/ad/phd-position-number-theory-and-formalization/70lg5t</a></p>\n<p>The Department of Mathematics of Vrije Universiteit Amsterdam welcomes applications for a fully-funded, 4-year PhD position in Number Theory and Formalization. Supervised by me in collaboration with others at the Math and CS departments. The (prefered) starting date is 1 September or earlier. The application deadline is 29 March.</p>",
        "id": 273515591,
        "sender_full_name": "Sander Dahmen",
        "timestamp": 1646065677
    },
    {
        "content": "<p><a href=\"https://www.few.vu.nl/~sdn249/vacancy.html\">https://www.few.vu.nl/~sdn249/vacancy.html</a></p>\n<p>There is a fully-funded 4-year PhD position available at the Department of Mathematics of Vrije Universiteit Amsterdam. The PhD research will focus on Number Theory and Formalization, in particular on formalizing aspects of algorithms and their output related to modular forms computations. It will be supervised by me (daily supervisor) and <span class=\"user-mention\" data-user-id=\"110172\">@Assia Mahboubi</span>. The preferred starting date is 1 September 2025. The recruitment process will continue until the position is filled; it's advised to apply by Pi Day (i.e. March 14; which is admittedly quite short notice) <a href=\"https://deposibus.silecs.info/appel\">here</a>. Interested candidates are welcome to contact me via <a href=\"mailto:s.r.dahmen@vu.nl\">s.r.dahmen@vu.nl</a> or Zulip DM.</p>\n<p>Note that this position is part of the EU-funded MSCA Doctoral Network COGENT (Cohomology, Geometry, Explicit Number Theory), which contains <a href=\"https://euraxess.ec.europa.eu/jobs/314933\">13 PhD vacancies</a>. One other position involving (some) formalization is DC5: Homological perturbation theory for Hochschild cohomology and applications.</p>",
        "id": 503855794,
        "sender_full_name": "Sander Dahmen",
        "timestamp": 1741283715
    }
]