[
    {
        "content": "<p>We are jointly advertising for several open PhD and postdoc positions in PL/FM at the <a href=\"https://www.ntu.edu.sg/scse\">School of Computer Science and Engineering</a>, <a href=\"https://www.ntu.edu.sg/\">Nanyang Technological University (NTU), Singapore</a>.</p>\n<p>PhD positions are fully funded, and will be for the January 2025 or August 2025 intake at SCSE, NTU.</p>\n<p>Details of the postdoctoral positions vary, but they are open to candidates with PhD-level qualifications in a range of topics in PL/FM. Please see below for further information on individual openings; interested candidates should contact us directly.</p>\n<p>Luke Ong, Professor</p>\n<p>We invite motivated and well-qualified candidates to work on Bayesian Statistical Probabilistic Programming, as part of a research programme funded by the National Research Foundation, Singapore.</p>\n<p>The appointees will work in the Probabilistic Programming Lab, where research is carried out on a wide range of topics, especially in the interface of programming languages, machine learning, and Bayesian statistics, but also in allied areas in semantics of computation, formal methods and verification, and in logic and algorithms.</p>\n<p>Bayesian Statistical Probabilistic Programming lies in the interface of programming languages, machine learning, and Bayesian statistics. These positions will suit researchers with expertise in one (or more) of the three areas, and are interested and committed to collaborating with experts in the other areas.</p>\n<p>Further details are available at <a href=\"https://www3.ntu.edu.sg/home/luke.ong/Vacancies/phd.html\">https://www3.ntu.edu.sg/home/luke.ong/Vacancies/phd.html</a></p>\n<p>Yang Liu, Professor</p>\n<p>I have fully-funded PhD positions available for PL/SE/Security on web3 security (smart contract and runtime monitoring), AV security and robustness, and Large Language Model (LLM) applications: applying LLM for FM (specification/property generation, proof automation), LLM for security (vulnerability detection via static analysis or fuzzing, vulnerability repair), LLM for SE (multi-agent software development), LLM security (prompt injection, jailbreak, defence against LLM attacks).</p>\n<p>website: <a href=\"https://personal.ntu.edu.sg/yangliu/\">https://personal.ntu.edu.sg/yangliu/</a></p>\n<p>contact: <a href=\"mailto:yangliu@ntu.edu.sg\">yangliu@ntu.edu.sg</a></p>\n<p>Conrad Watt, Assistant Professor</p>\n<p>I have fully-funded PhD positions available for PL research, broadly construed, related to the WebAssembly programming language and virtual machine. A successful applicant will have the opportunity to work closely with WebAssembly's industrial standards body and inform the future direction of the language.</p>\n<p>I am also looking to recruit postdocs with experience in mechanised theorem proving and programming language semantics, to work on advanced extensions and applications of the WasmCert-Isabelle mechanisation of WebAssembly and related artefacts. A key theme of this work will be driving industrial adoption of verified artefacts - for example, see <a href=\"https://dl.acm.org/doi/abs/10.1145/3591224\">https://dl.acm.org/doi/abs/10.1145/3591224</a>. Experience with Isabelle/HOL would be highly desirable. Funding is available for up to 4 years of full-time employment.</p>\n<p>website: <a href=\"http://conrad-watt.github.io\">conrad-watt.github.io</a></p>\n<p>contact: <a href=\"mailto:conrad.watt@ntu.edu.sg\">conrad.watt@ntu.edu.sg</a></p>\n<p>Yong Kiam Tan, (incoming) Assistant Professor</p>\n<p>I am interested in applications of deductive verification and interactive theorem proving in automated reasoning, compilers (CakeML), randomized algorithms, hybrid systems, and cryptography. I am recruiting up to three PhD students and three postdocs for these topics under a new Singapore NRF fellowship project.</p>\n<p>Please visit <a href=\"https://tanyongkiam.github.io/advert.html\">https://tanyongkiam.github.io/advert.html</a> for contact and other details.</p>\n<p>Conrad and Yong Kiam would also like to draw attention to A*STAR's graduate scholarships (<a href=\"https://www.a-star.edu.sg/Scholarships/for-graduate-studies/overview\">https://www.a-star.edu.sg/Scholarships/for-graduate-studies/overview</a>). These competitive national awards offer enhanced support for exceptional PhD applicants, who we would jointly supervise in a project related to the intersection of WebAssembly and CakeML. Please contact us for more details.</p>",
        "id": 432416590,
        "sender_full_name": "Yong Kiam",
        "timestamp": 1712729676
    }
]