[
    {
        "content": "<p>Dear all,</p>\n<p><span class=\"user-mention\" data-user-id=\"130384\">@Riccardo Brasca</span>  and myself have funding for a PhD position starting in Autumn 2026:</p>\n<ul>\n<li>it is a PhD specifically in formalisation. We are looking for someone interested in arithmetic geometry and number theory: two options would be to work either on Tate thesis or on non-archimedean functional analysis and arithmetic applications, but other options can be discussed;</li>\n<li>the candidate will be based in Saint-Étienne (whose Math department is joint with Lyon, which is very close and where the formalisation community is quite active), and will be expected to travel to Paris on a regular basis;</li>\n<li>it's a 3 years fellowship without teaching. Most likely there is the possibility of a fourth year extension, with teaching in the fourth year.</li>\n<li>Speaking French is not required, but France it's France, and for everyday life it's a good idea to learn some French at some moment.</li>\n</ul>\n<p>To apply, please send your CV and a motivation letter at <a href=\"mailto:filippo.nuccio@univ-st-etienne.fr\">filippo.nuccio@univ-st-etienne.fr</a> and <a href=\"mailto:riccardo.brasca@gmail.com\">riccardo.brasca@gmail.com</a></p>\n<p>We expect applications to arrive by <strong>January 31st</strong> and to select our candidates by <strong>February 15th</strong>.</p>\n<p>Riccardo and Filippo</p>",
        "id": 553564046,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1762248660
    },
    {
        "content": "<p>Is there a link to a job ad?</p>",
        "id": 553584979,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1762254725
    },
    {
        "content": "<p>No, there is no official \"job ad\": this is part of a fellowship we obtained and we're thus entitled to pick our candidate without any official \"opening\" at our universities.</p>",
        "id": 553585383,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1762254786
    },
    {
        "content": "<p>Let me remind here that with <span class=\"user-mention\" data-user-id=\"130384\">@Riccardo Brasca</span> we're accepting candidatures for the PhD position advertised above, and that the deadline is approaching.</p>",
        "id": 568452807,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1768575212
    }
]