[
    {
        "content": "<p><strong>Context</strong>: Proof systems, automated or interactive, have increasing applications in education, industry and research. Although interoperability is a very important property in engineering and computer science to reduce development costs, it is poorly developed within proof systems. This greatly hinders the democratization of those tools and the formalization of advanced mathematical results. One way to improve interoperability is to develop translations between systems. But for translated definitions and theorems to be readily usable, the translated types and functions must be aligned with those already used in the target systems. To this end, it is necessary to prove that a type or a function can be substituted by another one. However, for this to be correct, one needs to show that the two types are indeed isomorphic and that the two functions are indeed equal. This project aims at developing tools to automate this kind of proofs as much as possible.</p>\n<p><strong>Goal:</strong> The goal of this project is to make the existing translations of libraries of mathematical definitions and proofs from one system to the other directly usable by the users of the target systems, by proving the equivalence of the various definitions of the same mathematical notions, and developing proof tactics to automate those proofs as much as possible. As a concrete benchmark, the candidate will start by the translation in Lean of the HOL-Light library on real and complex analysis, which contains more than 20,000 theorems.</p>\n<p><strong>Place:</strong> <a href=\"https://deducteam.gitlabpages.inria.fr/\">Deducteam</a>, <a href=\"https://lmf.cnrs.fr/\">LMF</a>, <a href=\"https://ens-paris-saclay.fr/\">ENS Paris Saclay</a>, France</p>\n<p><strong>Supervisors:</strong> <a href=\"https://blanqui.gitlabpages.inria.fr/\">Frédéric Blanqui</a> and <a href=\"https://www.imo.universite-paris-saclay.fr/~patrick.massot/\">Patrick Massot</a></p>\n<p>Find more details on <a href=\"https://blanqui.gitlabpages.inria.fr/equiv.html\">https://blanqui.gitlabpages.inria.fr/equiv.html</a>.</p>\n<p><strong>Application deadline: July 27</strong>.</p>\n<p>For any question, please contact me.</p>",
        "id": 526399741,
        "sender_full_name": "Frédéric Blanqui",
        "timestamp": 1751289444
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"113486\" href=\"/#narrow/channel/113486-announce/topic/PhD.20grant.20available.20on.20function.20or.20type.20equivalence.20in.20Lean\">#announce &gt; PhD grant available on function or type equivalence in Lean</a> by <span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span>.</p>",
        "id": 526400001,
        "sender_full_name": "Notification Bot",
        "timestamp": 1751289508
    }
]