[
    {
        "content": "<p>Dear Lean community,</p>\n<p>I am posting to announce that the CNRS is considering opening a permanent junior position (\"chargé de recherche\") in its 2026 hiring campaign reserved for people doing formalization and/or AI for mathematics, with a preference for formalization. This is not 100% certain yet because it needs to be validated by the CNRS's administrative committee, however there is a pretty good chance that it will happen.</p>\n<p>I am the head of the CNRS hiring committee in mathematics, and I was authorized to make that announcement by the director of the CNRS math institute, as we want to attract as many strong candidates as possible.</p>\n<p>This would be a permanent research-only position, based at a French university. There is no need to speak any French to apply and be successful. It is meant for younger researchers who already have a PhD: last year, people who were hired for CR positions were between PhD + 0 years and PhD + 6 years.</p>\n<p>If all goes well, applications will open in early December 2025 and close in early January 2026, so if you are interested, you should start preparing your application, thinking about how you will get your PhD diploma translated to French, and contacting potential host departments in France now. </p>\n<p>Here is a blog post from a computer scientist about what it is like to work at CNRS and how the application process works:<br>\n<a href=\"https://dominik-peters.de/blog/apply-to-cnrs/\">https://dominik-peters.de/blog/apply-to-cnrs/</a><br>\nHere is another post about how to prepare a CNRS application:<br>\n<a href=\"https://www.astroconcours.fr/2024/12/22/composition-cnrs-dossier.html\">https://www.astroconcours.fr/2024/12/22/composition-cnrs-dossier.html</a><br>\nAnd here is the FAQ on the CNRS's website:<br>\n<a href=\"https://carrieres.cnrs.fr/en/concours-faq/\">https://carrieres.cnrs.fr/en/concours-faq/</a></p>\n<p>I will post official links to the application website and the candidate guide when the process actually starts.</p>\n<p>Something else: if you have questions about the hiring process, please read the guides before asking, and then ask here so everybody can benefit from the answers. If you DM me about this, I will ignore you. <span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 554117831,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1762442308
    }
]