[
    {
        "content": "<p>Dear all,</p>\n<p>As part of a US funded project, we have an exciting opportunity for a PostDoc in<br>\nthe Security and Trust of Advanced Systems Group at the University of Exeter<br>\n(UK) to work applying formal methods to enterprise systems:</p>\n<p>We will use formal methods (e.g., model checking, SMT solving, interactive<br>\ntheorem proving), to analyze business-process-driven (enterprise) systems (e.g.,<br>\nbusiness logic and workflows described a BPMN models). A particular focus will<br>\nbe the analysis of complex compositions of workflows within one organization as<br>\nwell as across multiple organizations.</p>\n<p>In particular, we will develop novel techniques to detect faults and<br>\nvulnerabilities (that can be exploited by both internal and external attackers)<br>\nin complex business-process-driven systems, contributing to protecting critical<br>\nworkflows such as manufacturing or logistics.</p>\n<p>In such environments, attackers can exploit such faults and vulnerabilities to<br>\ncause all kinds of harm such as direct financial losses or causing the<br>\nproduction of safety or security critical products to stop. Overall, the project<br>\naims to develop automated techniques for assessing the risk of business process<br>\nor workflows as well as finding and mitigating such attacks.</p>\n<p>This is a unique opportunity for somebody wanting to use/apply formal methods to<br>\nthe security of large enterprise systems.</p>\n<p>More information and application details can be found at:</p>\n<ul>\n<li>&lt;<a href=\"https://jobs.exeter.ac.uk/hrpr_webrecruitment/wrd/run/etrec179gf.open?WVID=171839ediw&amp;LANG=USA&amp;VACANCY_ID=386422ijTy\">https://jobs.exeter.ac.uk/hrpr_webrecruitment/wrd/run/etrec179gf.open?WVID=171839ediw&amp;LANG=USA&amp;VACANCY_ID=386422ijTy</a>&gt;</li>\n</ul>\n<p>Application deadline is the 18th of April 2024. Please contact <a href=\"mailto:a.brucker@exeter.ac.uk\">me</a> for more details.</p>\n<p>Best,<br>\n Achim</p>",
        "id": 430025480,
        "sender_full_name": "Achim Brucker",
        "timestamp": 1711617574
    }
]