[
    {
        "content": "<p><strong>Project Description:</strong></p>\n<p>We are seeking a highly-motivated Postdoctoral Fellow to join our team for the DARPA Bus-based Local Attack Detection and Elimination (BLADE) program, a groundbreaking collaborative project between UNC Charlotte, Electric Power Research Institute (EPRI) and NVIDIA, to secure critical hardware bus systems. This position will lead the formal methods and verification thrust, focusing on providing mathematical assurances for the security of bus-based communications.<br>\n<strong>Key Responsibilities:</strong></p>\n<ul>\n<li>\n<p>Formally model and verify the correctness of “Forensic Observation Data” (FODs) to ensure they accurately detect specified vulnerabilities.</p>\n</li>\n<li>\n<p>Investigate and define formal models of formal security properties of the PCIe bus and NVIDIA’s DPU, CPU, and NIC for the purposes of security.</p>\n</li>\n<li>\n<p>Explore the use of high-assurance languages and toolchains for the implementation of a verified validation engine.</p>\n</li>\n<li>\n<p>Collaborate closely with our systems and cybersecurity teams to integrate formal analysis and verified components into the broader project.</p>\n</li>\n<li>\n<p>Publish research in top-tier security and formal methods conferences and journals.</p>\n</li>\n</ul>\n<p><strong>Required Qualifications:</strong></p>\n<ul>\n<li>\n<p>A Ph.D. (or anticipated completion) in Computer Science or a related field.</p>\n</li>\n<li>\n<p>A strong research background in formal methods, with demonstrated experience in model checking, theorem proving, or formal specification.</p>\n</li>\n<li>\n<p>An interest in applying formal methods to real-world systems and security challenges.</p>\n</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>\n<p>Direct experience with formal specification and verification tools (e.g., Lean, TLA+, Coq, SMT solvers, etc.) is strongly preferred.</p>\n</li>\n<li>\n<p>Familiarity with high-assurance languages or provably-correct software development.</p>\n</li>\n<li>\n<p>Knowledge of low-level hardware protocols (e.g., PCIe), computer architecture, or systems security.</p>\n</li>\n<li>\n<p>Understanding of vulnerability analysis or anomaly detection.</p>\n</li>\n</ul>\n<p><strong>To apply,</strong> please submit the following materials to Dr. Meera Sridhar (<a href=\"mailto:msridhar@charlotte.edu\">msridhar@charlotte.edu</a>):</p>\n<ol>\n<li>\n<p>A Curriculum Vitae (CV).</p>\n</li>\n<li>\n<p>A cover letter detailing your specific experience with formal methods tools and your interest in systems security.</p>\n</li>\n<li>\n<p>Contact information for three professional references.</p>\n</li>\n<li>\n<p>One or two representative publications (preferably on formal verification or security).</p>\n</li>\n</ol>",
        "id": 562828673,
        "sender_full_name": "Meera Sridhar",
        "timestamp": 1765325640
    }
]