[
    {
        "content": "<p>I am looking for a candidate for a postdoc to <strong>formalize machine learning algorithms in Lean</strong> and eventually explore the use of AI to design algorithms and prove theoretical guarantees about them. The starting goal will be to formalize bandit algorithms.<br>\nThe desired start date is January 2026 and the position is funded for 18 months. The work will take place in the <a href=\"https://team.inria.fr/scool/\">Scool team</a> at the <a href=\"https://www.inria.fr/en/inria-centre-university-lille\">Inria centre at the University of Lille</a>, France, under my supervision. The funding includes money to attend conferences, and the position does not involve any teaching.</p>\n<p>The goal of the project is to implement a type of machine learning algorithms called stochastic bandits <a href=\"https://tor-lattimore.com/downloads/book/book.pdf\">[Lattimore, Szepesvari, 2020]</a> in Lean, as well as the tools needed to run them on simulated environments, and prove their theoretical performance guarantees. The project should also be open to outside contributions and part of the job of the postdoc will be to manage the public project (maintain a blueprint, review PRs, etc.).<br>\nI am looking for a candidate with experience with Lean, and familiar with the mathematical concepts that can be found in the probability theory part of Mathlib, since stochastic bandits, like a large part of machine learning, models the interaction of the algorithm and its environment in a probabilistic way.<br>\nKnowledge of machine learning or even bandits would be appreciated, but is not essential.</p>\n<p>The official offer will be open in a few weeks on Inria's dedicated job website, and the candidates will have to apply through that website. I'll update this announcement when the job offer is there. <br>\nIn the meantime, please feel free to send me a message on this zulip for more information.</p>",
        "id": 528038725,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1752140194
    },
    {
        "content": "<p>The postdoc offer is online: please apply at <a href=\"https://recrutement.inria.fr/public/classic/fr/offres/2025-09199\">https://recrutement.inria.fr/public/classic/fr/offres/2025-09199</a></p>",
        "id": 533032543,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1754461563
    },
    {
        "content": "<p>I forgot to mention the application deadline: it's in two days, September 5.</p>",
        "id": 537428635,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1756889198
    },
    {
        "content": "<p>This position is still open. If you are interested in formalizing machine learning theory in Lean, send me a DM.</p>",
        "id": 544688887,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1760430675
    }
]