[
    {
        "content": "<p>We invite applications for a postdoctoral position in the Department of Mathematical and Statistical Sciences at the University of Alberta, starting in the 2025-2026 academic year. This position is part of a collaboration involving researchers from Canada, the Netherlands, and Japan, which focuses on the formalization of arithmetic geometry and anabelian geometry, using the Lean4 proof assistant. The Successful candidate will be expected to work toward the formalization of research-level mathematics in these areas, as relevant toward the overall project. This position will be supervised by <span class=\"user-mention\" data-user-id=\"243562\">@Adam Topaz</span> at the University of Alberta, but will also involve close collaboration with the other members of this international project.</p>\n<p>This is a two-year position which is expected to start in July 2025. There is a possibility of extension for this position beyond two years, subject to the candidate's performance and the availability of funds. Teaching may also be part of this position, although this is not a requirement.</p>\n<p>Candidates must hold a PhD at the time of appointment. They should have research experience in arithmetic geometry, and familiarity with topics related to anabelian geometry, including \\'etale and tempered fundamental groups, \\'etale and Galois cohomology, ramification theory, class field theory, etc. As the formalization of research-level mathematics using Lean4 is expected in this position, candidates who do not have significant experience with formalization using Lean4 are expected to either gain such experience before the time of appointment or to spend the first few months of the position doing so intensively.</p>\n<p>The review of applications will start on Nov. 1st, 2024, and will last until the position is filled. Any questions related to this position should be sent to <span class=\"user-mention\" data-user-id=\"243562\">@Adam Topaz</span> .</p>\n<p>Applicants should submit the following information:</p>\n<ul>\n<li>A cover letter, indicating the candidate's suitability for this position based on the criteria mentioned above.</li>\n<li>A CV, including a publication list.</li>\n<li>A research statement.</li>\n<li>Three references commenting on the candidate's research ability and potential.</li>\n</ul>\n<p>Applications for this position may be submitted at the associated <a href=\"https://www.mathjobs.org/jobs/list/25119\">mathjobs posting</a>.</p>",
        "id": 468939333,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1725925307
    }
]