[
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>\n</code></pre></div>\n\n<p>Postdoctoral Fellow: Formal Methods for Hardware-Level Security (DARPA BLADE)</p>\n<p>Location: University of North Carolina Charlotte</p>\n<p>Position Type: Full-time Postdoctoral Researcher</p>\n<p>Duration: 2-year term, with possibility of extension   </p>\n<p>Project Description:</p>\n<p>We are seeking a highly-motivated Postdoctoral Fellow to join our team for the DARPA Bus-based</p>\n<p>Local Attack Detection and Elimination (BLADE) program, a groundbreaking collaborative project</p>\n<p>between UNC Charlotte, Electric Power Research Institute (EPRI) and NVIDIA, to secure critical</p>\n<p>hardware bus systems. This position will lead the formal methods and verification thrust, focusing</p>\n<p>on providing mathematical assurances for the security of bus-based communications.</p>\n<p>Key Responsibilities:</p>\n<p>●</p>\n<p>Formally model and verify the correctness of \"Forensic Observation Data\" (FODs) to ensure</p>\n<p>they accurately detect specified vulnerabilities.</p>\n<p>●</p>\n<p>Investigate and define formal models of formal security properties of the PCIe bus and</p>\n<p>NVIDIA’s DPU, CPU, and NIC for the purposes of security.</p>\n<p>●</p>\n<p>Explore the use of high-assurance languages and toolchains for the implementation of a</p>\n<p>verified validation engine.</p>\n<p>●</p>\n<p>Collaborate closely with our systems and cybersecurity teams to integrate formal analysis and</p>\n<p>verified components into the broader project.</p>\n<p>●</p>\n<p>Publish research in top-tier security and formal methods conferences and journals.</p>\n<p>Required Qualifications:</p>\n<p>●</p>\n<p>A Ph.D. (or anticipated completion) in Computer Science or a related field.</p>\n<p>●</p>\n<p>A strong research background in formal methods, with demonstrated experience in model</p>\n<p>checking, theorem proving, or formal specification.</p>\n<p>●</p>\n<p>An interest in applying formal methods to real-world systems and security challenges.</p>\n<p>Preferred Qualifications:</p>\n<p>●</p>\n<p>Direct experience with formal specification and verification tools (e.g., Lean, TLA+, Coq, SMT</p>\n<p>solvers, etc.) is strongly preferred.</p>\n<p>●</p>\n<p>Familiarity with high-assurance languages or provably-correct software development.</p>\n<p>●</p>\n<p>Knowledge of low-level hardware protocols (e.g., PCIe), computer architecture, or systems</p>\n<p>security.</p>\n<p>●</p>\n<p>Understanding of vulnerability analysis or anomaly detection.</p>\n<p>To apply, please submit the following materials to Dr. Meera Sridhar (<a href=\"mailto:msridhar@charlotte.edu\">msridhar@charlotte.edu</a>):</p>\n<p>1.</p>\n<p>2.</p>\n<p>A Curriculum Vitae (CV).</p>\n<p>A cover letter detailing your specific experience with formal methods tools and your interest in</p>\n<p>systems security.</p>\n<ol start=\"3\">\n<li>\n<ol start=\"4\">\n<li>Contact information for three professional references.</li>\n</ol>\n</li>\n</ol>\n<p>One or two representative publications (preferably on formal verification or security).</p>",
        "id": 567777580,
        "sender_full_name": "Meera Sridhar",
        "timestamp": 1768314406
    }
]