[
    {
        "content": "<p>Hey all,</p>\n<p>We are hiring formal verification engineers to work with other teams at Nethermind as well as external customers to fulfil a wide range of formal verification needs within the web3 ecosystem, including the verification of zero-knowledge circuits, as well as Ethereum and Starknet smart contracts. We're looking for team players, with a keen eye for detail and strong problem-solving skills.<br>\nResponsibilities:</p>\n<ul>\n<li>Work with other teams and external customers to design formal specifications of languages, compilers, smart contracts, etc...</li>\n<li>Produce clean and efficient specifications based on documentation and communications with stakeholders.</li>\n<li>Use a proof assistant to prove a wide array of different properties of these specifications.</li>\n<li>Extract property testers and formally verified utilities from these specifications.</li>\n<li>Recommend and execute improvements.</li>\n<li>Create technical documentation for reference and reporting.</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>Background in computer science.</li>\n<li>Background in formal language semantics and verification. Particularly knowledge of Hoare and Temporal logic.</li>\n<li>Strong background in functional programming and proof assistants, preferably Lean 4.</li>\n<li>Ability and desire to learn new programming languages and understand their specification e.g. Cairo, Solidity, Yul, ZK DSLs, EVM bytecode, etc...</li>\n<li>Knowledge of compilers.</li>\n<li>Understanding of theoretical computer science: Turing Machines, Complexity, etc…</li>\n<li>Experience with software design and development.</li>\n<li>Strong reasoning skills.</li>\n<li>Excellent communication skills.</li>\n<li>\n<p>Good English.<br>\nPerks and benefits:</p>\n</li>\n<li>\n<p>Fully remote</p>\n</li>\n<li>Flexible working hours</li>\n<li>Plus equity</li>\n</ul>\n<p>Contact us here: <a href=\"https://grnh.se/3c75d602teu\">https://grnh.se/3c75d602teu</a></p>",
        "id": 389633854,
        "sender_full_name": "Julian Sutherland",
        "timestamp": 1694085831
    }
]