[
    {
        "content": "<p>Within the <a href=\"https://www.aalto.fi/en/aalto-science-institute/aalto-science-institute-asci-internship-programme\">internship programme</a> of the Aalto Science Institute, we have a call for two interns of BSc or MSc level to summer projects on formalization of mathematics in Lean (specifically small topics in probability and analysis). These are topics numbered 4201 and 4202 in the <a href=\"https://www.aalto.fi/en/aalto-science-institute/asci-summer-research-program-2022-project-list\">list of internship projects</a>.</p>\n<p>If you are interested, you can ask me for more details!</p>\n<p>Further advertisement:</p>\n<ul>\n<li>The AScI intership program arranges social events, day-trips, help with housing, etc.</li>\n<li>We are organizing an ICM satellite on <a href=\"https://icm2022.org/probability-and-mathematical-physics\">Probability and Mathematical Physics</a> in Helsinki just before the ICM itself. The summer interns also get to participate and help in the organization.</li>\n<li>There's a direct train from Helsinki to Saint Petersburg, if you plan to spend your summer vacation at the <a href=\"https://icm2022.org/index\">ICM</a>! (...to hear Kevin's talk, of course <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span>)</li>\n</ul>",
        "id": 266169959,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1640609301
    },
    {
        "content": "<p>In the summer of 2023 we will again have formalization internships at Aalto University. The arrangements are mostly similar to the above (except no ICM satellites this year <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span> --- which probably means less conference organization and more formalization).</p>\n<p>The precise formalization topics are to be selected in due time with the interns' interests and preferences taken into account, but probability and analysis are priorities, because I feel like those areas would particularly benefit from an increased number of contributors. (Also the interns would essentially be a part of our mathematical physics group, where most research topics have a probability / analysis / representation theory flavor.)</p>\n<p>Link to the official internship programme info:<br>\n<a href=\"https://www.aalto.fi/en/open-positions/aalto-science-institute-asci-international-summer-research-programme-2023\">https://www.aalto.fi/en/open-positions/aalto-science-institute-asci-international-summer-research-programme-2023</a></p>\n<p>Link to FAQ:<br>\n<a href=\"https://www.aalto.fi/en/aalto-science-institute-asci/how-to-apply-to-the-asci-international-summer-research-programme\">https://www.aalto.fi/en/aalto-science-institute-asci/how-to-apply-to-the-asci-international-summer-research-programme</a></p>\n<p>I'll be happy to answer any questions for example on this Zulip!</p>",
        "id": 320647483,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1673427058
    },
    {
        "content": "<p>In the summer of 2024 we will again have a formalization internship at Aalto University. The arrangements are mostly similar to the last two years, described in this same thread.</p>\n<p>The precise formalization topics are to be selected in due time with the interns' interests and preferences taken into account, but probability, analysis, and some algebra are priorities, because I feel like those areas would particularly benefit from an increased number of contributors. (Also the interns would essentially be a part of our mathematical physics group, where most research topics have a probability / analysis / representation theory flavor.)</p>\n<p>This year we were supposed to do a bit of coordination/collaboration with a CS professor, too, but I unfortunately don't find his summer project on the internship topics list at the moment. If it works out, that should be a bonus: there might be one more intern doing Lean and there might be some cooler metaprogramming components. If not, the default model will be just being a part of the mathematical physics group and working on some math formalization.</p>\n<p>Link to the official internship programme info: (<em>4301 is the number of the formalization project</em>)<br>\n<a href=\"https://www.aalto.fi/en/aalto-science-institute-asci/asci-international-summer-research-program-2024-project-list\">https://www.aalto.fi/en/aalto-science-institute-asci/asci-international-summer-research-program-2024-project-list</a></p>\n<p>Link to general information about the AScI internship programme:<br>\n<a href=\"https://www.aalto.fi/en/aalto-science-institute-asci/aalto-science-institute-international-summer-research-programme\">https://www.aalto.fi/en/aalto-science-institute-asci/aalto-science-institute-international-summer-research-programme</a></p>\n<p>I'll be happy to answer any questions for example on this Zulip!</p>",
        "id": 410572566,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1703969792
    },
    {
        "content": "<p>Greetings! May I ask who the CS professor is or more specifically what their research interests are?</p>",
        "id": 410576449,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1703974194
    },
    {
        "content": "<p>I should be a bit careful about saying a lot about the CS part before I have more information. I will try to find out about the status, and I can perhaps say something more in private. </p>\n<p>The current public information seems to be that no such CS-side formalization project is listed in the AScI summer internships call. On the other hand, the application period opens only on January 2, so there is a chance we will still see an update (at least some projects seem to have been added to the list at different times).</p>\n<p>But at least the math formalization internship exists again this year.</p>",
        "id": 410579141,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1703977321
    },
    {
        "content": "<p>Is there a strict requirement that applicants be currently enrolled in a bachelor's or master's? I'm a couple years our of my bachelor's but quite interested!</p>",
        "id": 410719588,
        "sender_full_name": "Malcolm Langfield",
        "timestamp": 1704112298
    },
    {
        "content": "<p>FWIW, I spent an amazing summer working with Kalle at Aalto, and I would recommend it to everyone with or without experience in Lean. The whole team at Aalto is wonderful, and there’s a lot of interns on campus during the summer so there’s always someone to have a drink with. And last but not least, the salary is quite high (at least by French standards for internships), and there are enough vacations to enjoy Finnish summer, which is great if you’re like me and think that 30°C is too much <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 410745721,
        "sender_full_name": "Anatole Dedecker",
        "timestamp": 1704135535
    },
    {
        "content": "<p>I would love to apply but 12 weeks is quite long <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span></p>",
        "id": 410746040,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1704135774
    },
    {
        "content": "<p>Jason Ying also had a great time at Aalto, and I think a lot of what he did there ended up in mathlib</p>",
        "id": 410753514,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1704141484
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"373986\">@Kalle Kytölä</span> is there some flexibility on the length? (Would 11 weeks for example be ok)</p>",
        "id": 410856053,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1704206869
    },
    {
        "content": "<p>Obviously you'll have to discuss the length with Kalle, but just as a data point I spent only 9 weeks in Finland last summer. Of course it depends on the experience one has in Lean, from what I saw this summer 12 weeks is a good length for beginners to do something meaningful, but there's absolutely no doubt that Yaël wouldn't need that much time <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 410860808,
        "sender_full_name": "Anatole Dedecker",
        "timestamp": 1704208560
    },
    {
        "content": "<p>Sorry everyone for responding with such a delay! As an excuse, I had a particularly hectic week (with conference organization and a research visitor on top of the more usual things like a large undergraduate course starting on Monday).</p>",
        "id": 411534927,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1704571421
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"462544\">@Malcolm Langfield</span>: The most common situation is interns being BSc or MSc students, but I don't think there is any strict rule for this. The actual official answer would be an administrative matter --- could you ask directly about your eligibility via <code>asci-interns@aalto.fi</code> with the specifics of your situation? Less officially, my own goal is to try to offer something meaningful and in some ways research related (carrying out some project independently, participating in research group activities, attending conferences and/or helping organize them, ...) for a short period of time to talented young people who are likely pursuing a research career (I believe the benefits both to the research community and to the interns themselves are the clearest in such a situation). The most common applicants are students, but I can totally see that there could be different individual circumstances, so as long as the official eligibility criteria are satisfied, I will be happy to consider all applicants!</p>",
        "id": 411534997,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1704571493
    },
    {
        "content": "<p>Regarding the length, there can be some flexibility, but there are also some compelling reasons to try to stick to the default (June-August). Among the reasons to stick to the default are: AScI joint activities (including get-to-know-each-other meetings and final poster presentation sessions etc.), collaboration with other interns, and the supervisor's own semester and summer schedules.</p>\n<p>I have so far had two interns who had way more experience on formalization than I do: <span class=\"user-mention silent\" data-user-id=\"268315\">Anatole Dedecker</span> and <span class=\"user-mention silent\" data-user-id=\"243312\">Jason KY.</span>. In these cases, the supervision aspect was trivialized: I could just give them basically total freedom and trust that meaningful things will come out. In addition they were both superb at teaching both me and the other interns and in fact yet others in the group and at the department about formalization. I was very lucky to have them! (This is not to take away anything from the other amazing interns I have had, but just to emphasize that there are rare but existing cases where the intern has the most experience on formalization and the relevant math and becomes the teacher to others, and the project can be completely unsupervised. The amount of flexibility is very different in such cases.)</p>\n<p>I am super happy there are strong people interested in this. The hopefully fair principle I have in any case is to wait until seeing all applications before considering any particularities, including specifics of duration. Anyone can include their preferred and/or possible schedules in the application. These are ultimately a matter of what we agree in interviews and work contract. In most cases I expect to have a preference for interns who are able to work for June-August, but there can be some exceptions (especially with people who already have significant Lean contributions).</p>",
        "id": 411535697,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1704572239
    },
    {
        "content": "<p>(I also know already beforehand that I will most likely only be able to recruit <code>1</code> of the applicants, and there will again probably be more strong applicants than that, so I will feel bad. But I try to comfort myself with <code>1&gt;0</code>.)</p>",
        "id": 411536138,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1704572662
    }
]