[
    {
        "content": "<p>I am interested in formalizing a quantum information theory paper. I could only find <a href=\"https://github.com/duckki/lean-quantum/\">https://github.com/duckki/lean-quantum/</a>, which happens to be in Lean3 (would highly prefer Lean4).</p>",
        "id": 462982659,
        "sender_full_name": "Monish",
        "timestamp": 1723901474
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"448405\">@Alex Meiburg</span> or <span class=\"user-mention\" data-user-id=\"311453\">@Frédéric Dupuis</span> can probably point you to more recent material</p>",
        "id": 463038040,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1723923686
    },
    {
        "content": "<p>I have written down a few things at <a href=\"https://github.com/Timeroot/Lean-QuantumInfo\">https://github.com/Timeroot/Lean-QuantumInfo</a></p>\n<p>As long as you're content with everything being finite dimensional! :)</p>",
        "id": 463040955,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1723924818
    },
    {
        "content": "<p>Actually hmm that repo is a bit out of date, I should commit and push what I have locally</p>",
        "id": 463041075,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1723924843
    },
    {
        "content": "<p>There seem to be a bunch of  <code>sorry</code>s sprinkled everywhere. Do they correspond to the TODOs in the Mark Wilde document?</p>",
        "id": 463042284,
        "sender_full_name": "Monish",
        "timestamp": 1723925375
    },
    {
        "content": "<p>They should. Yes, getting solid definitions down has proved enough work, even without proving many propositions. :/</p>",
        "id": 463042449,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1723925451
    },
    {
        "content": "<p>Oh, I mean in the definitions. For example: <a href=\"https://github.com/Timeroot/Lean-QuantumInfo/blob/main/QuantumInfo/Finite/CPTPMap.lean#L20C1-L22C8\">https://github.com/Timeroot/Lean-QuantumInfo/blob/main/QuantumInfo/Finite/CPTPMap.lean#L20C1-L22C8</a></p>",
        "id": 463042770,
        "sender_full_name": "Monish",
        "timestamp": 1723925617
    },
    {
        "content": "<p>or am I misunderstanding something?</p>\n<p>(I must add that I have not used Lean all that much)</p>",
        "id": 463043449,
        "sender_full_name": "Monish",
        "timestamp": 1723925940
    },
    {
        "content": "<p>Yes, even a number of definitions are \"sorryed\" out. Which, depending on your goals, might make this an unsuitable starting point for you</p>",
        "id": 463044508,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1723926411
    },
    {
        "content": "<p>I've been working on writing down the LSD theorem. That would be a big milestone for me personally. </p>\n<p>What kind of result are you hoping to prove?</p>",
        "id": 463044627,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1723926480
    },
    {
        "content": "<p>I am happy to contribute to help bring it up to speed. I haven't decided on a paper yet (the attempt being part of a course project)</p>",
        "id": 463045555,
        "sender_full_name": "Monish",
        "timestamp": 1723927131
    },
    {
        "content": "<p>Hi! Unfortunately we're not at the point yet where we can formalize a typical quantum information paper. To get an idea of where we are currently, we just recently got the continuous functional calculus in mathlib, which lets us apply functions to operators, and we're now formalizing things like real powers of positive operators (see e.g. <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CFC.rpow#doc\">docs#CFC.rpow</a>, which landed in mathlib yesterday). We don't have CP maps yet; they should be within reach once <a href=\"https://github.com/leanprover-community/mathlib4/pull/15277\">#15277</a> lands.</p>\n<p>Things like the LSD theorem are still pretty far away. Defining the von Neumann entropy, conditional entropy and mutual information and proving their basic properties requires things like the operator monotonicity of the log, which in turn relies on integral representations of real powers (which I'm currently working on), etc. We'll get there though!</p>",
        "id": 463050563,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1723929970
    },
    {
        "content": "<p>Yes, what Frédéric said is definitely true, formalizing a full theorem is far away. I admit that things like the continuous functional calculus are well beyond my ken. And, I should clarify that when I say \"writing down the LSD theorem\", I in fact mean that merely _stating_ the theorem (where the relevant definitions are all filled in without sorrys) would be a milestone for me, not necessarily _proving_ it.</p>\n<p>Just to set expectations, neither of our projects have any mention of \"qubits\", \"gates\", \"circuits\", \"fermions\", \"bosons\", \"Gaussian states\", and so on. The Mathlib attitude towards development is that generally such things would come _after_ defining things like Hilbert spaces and states and operations and so on.</p>\n<p>Of course, for the more applied QI theorist, they might be content to just start outright with their own definitions of Gaussian states as (say) PSD matrices with certain attributes, without necessarily linking them to Hilbert spaces or CPTP maps. For instance, the Lean 3 repository that you linked, the No Cloning theorem the is stated in fairly 'direct' language: <a href=\"https://github.com/duckki/lean-quantum/blob/160cabcbd22bf24819b72930f56578e23b109a27/src/theorems/no-cloning.lean#L57\">https://github.com/duckki/lean-quantum/blob/160cabcbd22bf24819b72930f56578e23b109a27/src/theorems/no-cloning.lean#L57</a> It can be read as a purely linear algebraic result, without needing to reference anything physical. Depending on your goals, this might be totally fine.</p>\n<p>The downside is that if someone then wants a slightly different version of the theorem, it becomes a totally different statement. (\"What if I want to allow non-unitary maps -- a general CPTP map?\" / \"What if I don't just care about qubits, and I want a different system?\" / \"What if I want the version where s could be a mixed state?\" / \"What I let the unitary use ancillas?\" / \"What if I actually want to prove that there exists an epsilon &gt; 0 so that I can't clone with fidelity 1-epsilon, that is, not only is perfect cloning impossible, but even arbitrarily-close-to-perfect cloning is impossible?\") These would require a substantial work to prove separately. If your no-cloning theorem is \"linked\" to the rest of quantum theory, then most of these would follow immediately from this special case of the no-cloning theorem, by combining it with other general facts of quantum theory. (Respectively: \"Your CPTP map could get purified to a unitary.\" / \"If it was true on some other system, it would be true on qubits too\" / \"The ancillas won't help, because that just gives another CPTP map.\" / \"The set of CPTP operations is topologically closed, so arbitrarily-close-to-perfect cloning would imply perfect cloning.\")</p>",
        "id": 463058134,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1723935090
    },
    {
        "content": "<p>You might have already been aware of all that but I wanted to spell it out just to be clear :)</p>",
        "id": 463058197,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1723935109
    },
    {
        "content": "<p>Actually, I just noticed now -- that <code>no_cloning_1</code> is a fairly incorrect formalization, because there is no requirement that <code>s</code> is unit-norm. There is an even more trivial contradiction where you take <code>s</code> to be any vector of norm 2, and then since the unitary U preserves norm, it is of course not going to hold that <code>U ⬝ (s ⊗ |0⟩) = s ⊗ s</code>.</p>\n<p>Maybe that's a slight lesson about the risks of just going with your own \"simple\" definitions... :)</p>",
        "id": 463058583,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1723935224
    },
    {
        "content": "<p>There's another Lean4 repo around somewhere that is trying to do QIT, and that had a very similar problem with stating no cloning!</p>",
        "id": 463065179,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1723938773
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"448405\">Alex Meiburg</span> <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/Library.20for.20formalising.20Quantum.20Information.20Theory/near/463058583\">said</a>:</p>\n<blockquote>\n<p>Maybe that's a slight lesson about the risks of just going with your own \"simple\" definitions... :)</p>\n</blockquote>\n<p>I think that's a lesson about the risks of going with a definition without building some API for it. It's very easy to have bugs in definitions, Lean won't catch them for you. But once you start proving lemmas about it, if the definition is wrong, chances are that you'll notice the problem sooner or later.</p>",
        "id": 463094925,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1723953911
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"311453\">Frédéric Dupuis</span> <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/Library.20for.20formalising.20Quantum.20Information.20Theory/near/463050563\">said</a>:</p>\n<blockquote>\n<p>Things like the LSD theorem are still pretty far away. Defining the von Neumann entropy, conditional entropy and mutual information and proving their basic properties requires things like the operator monotonicity of the log, which in turn relies on integral representations of real powers (which I'm currently working on), etc. We'll get there though!</p>\n</blockquote>\n<p>That sounds good! This is far outside my mathematical grasp, so I will be a happy bystander. Will wait till the relevant support is added before trying it out :)</p>",
        "id": 463171395,
        "sender_full_name": "Monish",
        "timestamp": 1723987236
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"448405\">Alex Meiburg</span> <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/Library.20for.20formalising.20Quantum.20Information.20Theory/near/463058197\">said</a>:</p>\n<blockquote>\n<p>You might have already been aware of all that but I wanted to spell it out just to be clear :)</p>\n</blockquote>\n<p>No, to be very honest. I guessed that there would be gaps because of missing formalization, but I didn't know it would be this extreme (some of your statements still go over my head). Thanks for clearing it all up!</p>",
        "id": 463171758,
        "sender_full_name": "Monish",
        "timestamp": 1723987330
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"743887\">Monish</span> has marked this topic as resolved.</p>",
        "id": 463171835,
        "sender_full_name": "Notification Bot",
        "timestamp": 1723987358
    }
]