[
    {
        "content": "<p>Is the order extension principle in mathlib ? This is the statement that says that every partial order can be extended to a linear order. (There is also an essentially equivalent statement saying that every preorder can be extended to a total preorder having the same antisymmetrization relation.) I am aware of <a href=\"https://leanprover-community.github.io/mathlib_docs/order/extension/well.html\">https://leanprover-community.github.io/mathlib_docs/order/extension/well.html</a>, where a well-founded partial order is extended to a well-order, but this is a different statement.</p>\n<p>Okay, to be honest, I am mostly working with finite sets so every relation is well-founded, but I am curious about the order extension principle all the same.</p>",
        "id": 357350980,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1683736670
    },
    {
        "content": "<p>Is <a href=\"https://leanprover-community.github.io/mathlib_docs/find/linear_extension\">docs#linear_extension</a> what you are looking for?</p>",
        "id": 357351345,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1683736783
    },
    {
        "content": "<p>(the file is short and contains <a href=\"https://leanprover-community.github.io/mathlib_docs/find/extend_partial_order\">docs#extend_partial_order</a>)</p>",
        "id": 357351692,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1683736865
    },
    {
        "content": "<p>Yes, that's it, thank you !</p>",
        "id": 357352108,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1683736988
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"318709\">Sophie Morel</span> has marked this topic as resolved.</p>",
        "id": 357352129,
        "sender_full_name": "Notification Bot",
        "timestamp": 1683736999
    },
    {
        "content": "<p>Yes, we have Szpilrajn, the well-order extension principle, and the library extension principle if you need it (me)</p>",
        "id": 357357247,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1683738433
    },
    {
        "content": "<p>I also needed the fact that you can extend the partial order to a linear order while preserving a fixed lower set, but I just finished writing a proof of that. (In Lean4, yay ! I hated Lean4 at first, but it took me less than an hour of coding to warm up to it and I have now decided that it is easier to use than Lean3.)</p>",
        "id": 357370618,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1683742240
    },
    {
        "content": "<p>Oh nice! I guess that's basically the same proof as Szpilrajn?</p>",
        "id": 357372703,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1683742819
    },
    {
        "content": "<p>You can redo the same proof using Zorn's lemma (just make sure that the elements of the lower set stay smaller than the others when adding a pair of comparable elements to the partial order), or you can do like me and cheat: use Szpilrajn's theorem once on the lower set s (with the restriction of the partial order), use it again on the complement of s, take the lexicographic sum of the two linear orders you get, and you're done !<br>\nAnd then, since I don't care about instances and I really like all my orders to be on the same type, I pulled this linear order back to the original type using the canonical map. Shame on me.</p>",
        "id": 357379635,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1683744730
    }
]