[
    {
        "content": "<p>I’ve heard in talks that there’s ways to make Lean support alternative targets for compilation. How does this work? Are there examples?</p>",
        "id": 466969557,
        "sender_full_name": "Philogy",
        "timestamp": 1725287477
    },
    {
        "content": "<p>What do you mean by targets here</p>",
        "id": 466969630,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1725287499
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"395550\">Henrik Böving</span> <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/Examples.20of.20custom.20Lean.20targets/near/466969630\">said</a>:</p>\n<blockquote>\n<p>What do you mean by targets here</p>\n</blockquote>\n<p>Ability to write an alternative backend for Lean compilation e.g. Lean -&gt; JVM or Lean -&gt; my custom ISA</p>",
        "id": 466974081,
        "sender_full_name": "Philogy",
        "timestamp": 1725288444
    },
    {
        "content": "<p>You can do that if you really want but it would invoke quite a lot of non trivial modifications to the compiler</p>",
        "id": 466975461,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1725288760
    },
    {
        "content": "<p>Wasn't there something about an LLVM compiler?</p>",
        "id": 467005509,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1725296970
    },
    {
        "content": "<p>Sure, that took a lot of non trivial modifications to the compiler.</p>",
        "id": 467005709,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1725297040
    },
    {
        "content": "<p>Yes, but maybe that could be used to compile to other targets</p>",
        "id": 467005990,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1725297154
    },
    {
        "content": "<p>Well Lean already compiles to C so there is no target that LLVM is going to give you in addition to that. Additionally if you are targeting a different platform than the currently supported ones you'd have to also port the Lean runtime which again, is a lot of non trivial changes to the compiler code base.</p>",
        "id": 467006408,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1725297310
    },
    {
        "content": "<p>I'm just looking to output code for a different platform, it's fine if the compiler itself only runs on existing platforms. I've been curious whether lean could target the EVM as its program verification capabilities would be very useful in the world of smart contracts</p>",
        "id": 467011521,
        "sender_full_name": "Philogy",
        "timestamp": 1725299061
    },
    {
        "content": "<p>The programs that Lean produces inherently rely on the runtime for doing almost everything. The code that we generate is essentially almost exclusively calls to runtime functions + branching over their result. If you can compile the runtime on your target and you can compile C to your target it's going to work, otherwise you'll have to put in non trivial amounts of effort.</p>",
        "id": 467012293,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1725299278
    },
    {
        "content": "<p>Besides, there is no need to compile Lean code itself to EVM to make use of Lean's verification capabilities in an EVM context, there are several ways to use Lean to verify code that runs on EVM including but not limited to differential fuzzing, embedding other languages into Lean and verifying the code there, implementing a compiler yourself in Lean, directly importing EVM bytecode and reasoning about it etc.</p>",
        "id": 467013233,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1725299535
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"739332\">Philogy</span> has marked this topic as resolved.</p>",
        "id": 467547057,
        "sender_full_name": "Notification Bot",
        "timestamp": 1725458484
    }
]