[
    {
        "content": "<p>sorry for the basic question, I can delete if needed , but I'm looking through the mathlib docs and unless I'm missing  something, I can only see ways to get the full image of a functor, nothing built-in to get a category where all objects AND all morphisms have preimages.</p>",
        "id": 486719804,
        "sender_full_name": "Leucocholia",
        "timestamp": 1733619195
    },
    {
        "content": "<p>This is a fine question and the right channel for it. But it seems to me that the concept of image is evil, which might be a reason to avoid it, so perhaps that's why it's not there. More precisely, the essential image of a functor is a better-behaved concept in category theory, and if you're throwing in new objects which are isomorphic to objects in the image in more than one way then you won't know exactly which morphisms to throw in.</p>",
        "id": 486720553,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1733619854
    },
    {
        "content": "<p>Fair enough. More specifically, I was defining the class <code>MetaCat</code> as a category C along with a functor F such that every morphism extends to an endofunctor (so <code>F : C -&gt; Cat</code> and <code>h : ∀c : C, F.obj c = C</code>), and trying to define a special case of that where the image of F can be extended to also be in <code>MetaCat</code>. Is there a nice way to do this?</p>",
        "id": 486721327,
        "sender_full_name": "Leucocholia",
        "timestamp": 1733620599
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"753379\">Leucocholia</span> has marked this topic as resolved.</p>",
        "id": 486732866,
        "sender_full_name": "Notification Bot",
        "timestamp": 1733631828
    },
    {
        "content": "<p>Using <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/CategoryTheory/EssentialImage.html#CategoryTheory.Functor.objPreimage\">https://leanprover-community.github.io/mathlib4_docs/Mathlib/CategoryTheory/EssentialImage.html#CategoryTheory.Functor.objPreimage</a> you can get an essential primage of an essentially surjective functor. We also have the fact that the functor you get to a given functor’s essential image is essentially surjective</p>",
        "id": 486774943,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1733668684
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/CategoryTheory/EssentialImage.html#CategoryTheory.Functor.EssSurj.toEssImage\">https://leanprover-community.github.io/mathlib4_docs/Mathlib/CategoryTheory/EssentialImage.html#CategoryTheory.Functor.EssSurj.toEssImage</a></p>",
        "id": 486775024,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1733668725
    },
    {
        "content": "<p>Concerning defining <code>MetaCat</code>, it would be helpful to know the intended application. Instead of defining a functor to <code>Cat</code> (which is evil in the sense that Cat is really a bicategory) you could just associate an endofunctor of C to any morphism in C and go from there, I.e. don’t pass via Cat.</p>",
        "id": 486775401,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1733669027
    }
]