[
    {
        "content": "<p>Is there a library that has a theory for sets (as in <code>abbrev Set A := A -&gt; Prop</code>) outside of mathlib? It's not that hard to roll my own, but it's somewhat annoying to have to redo this in every non-mathlib project that needs sets.</p>",
        "id": 523968492,
        "sender_full_name": "Markus de Medeiros",
        "timestamp": 1749828608
    },
    {
        "content": "<p>No, suggest you use mathlib instead</p>",
        "id": 523969079,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1749828829
    },
    {
        "content": "<p>Okay, thanks. I don't want to add such a big dependency for such a small thing so I'll just redo it.</p>",
        "id": 523969236,
        "sender_full_name": "Markus de Medeiros",
        "timestamp": 1749828889
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"721721\">Markus de Medeiros</span> has marked this topic as resolved.</p>",
        "id": 523969273,
        "sender_full_name": "Notification Bot",
        "timestamp": 1749828904
    },
    {
        "content": "<p>In the panel discussion today at Big Proof one of the maintainers said that plans are afoot to enable downstream projects to only depend on parts of mathlib, so hopefully your workaround is only a temporary one.</p>",
        "id": 523985853,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1749835261
    },
    {
        "content": "<p>If this is for Iris I think Mario wants to keep its dependencies minimal and not add mathlib</p>",
        "id": 524006444,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749844689
    },
    {
        "content": "<p>It is already possible to depend on Mathlib but download only part of it; Patrick's wording said it was going to be much easier, not that it was going to be possible.</p>",
        "id": 524009623,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1749846323
    },
    {
        "content": "<p>Let's consider also the possibility of <code>mathlib-sets</code> / <code>mathlib-order</code> / <code>mathlib-basic-algebra</code> etc bubbling off the top of Mathlib (presumably staying in the same repo, but as a distinct lake libraries).</p>",
        "id": 524023926,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1749855742
    },
    {
        "content": "<p>To a downstream user, what benefit does splitting the lake library have?</p>",
        "id": 524051903,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1749892350
    },
    {
        "content": "<p>(my understanding is that the main effect is internal, in that it forces no dependency cycles along that boundary)</p>",
        "id": 524051936,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1749892388
    },
    {
        "content": "<p>Yes, enforces clearer dependencies, but it also enables the choice to split it out entirely later, thereby releasing downstream users from needing to require Mathlib itself.</p>",
        "id": 524107643,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1749967379
    }
]