[
    {
        "content": "<p>There is a definition of <code>TM2ComputableInPolyTime</code> for <code>TM2</code>. Also, there is a proof that <code>TM0, TM1, TM2</code> emulate each other and hence they are computationally equivalent. However, a proof showing a polynomial equivalence in a sense they emulate each other in polynomial number of steps wrt the input size seem missing. For instance showing <code>3-neighborhhod Cellular automaton</code> computation can be mutually emulated by <code>TM</code> in polynomial time would be easier for <code>TM0</code> than for <code>TM2</code>. But the polynomial computability for <code>TM0</code> may not be defined. Likely I am missing something. Is there a proof of polynomial equivalence between these <code>TM</code>s?</p>",
        "id": 513185295,
        "sender_full_name": "Roman Bacik",
        "timestamp": 1745080464
    },
    {
        "content": "<p>It seems plausible that this is missing; this part of the library doesn't see a lot of development</p>",
        "id": 513186144,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1745081066
    },
    {
        "content": "<p>It should be reasonably straightforward to state what \"computes in polynomial time\" means for TM0, TM1, TM2 because they all use the same interface of a state and step function</p>",
        "id": 513192531,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1745085957
    },
    {
        "content": "<p>The simulations are also written to be polynomial reductions, but this is not proved (at the time the definition did not exist)</p>",
        "id": 513192613,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1745085998
    },
    {
        "content": "<p>I see, thank you very much for your insight.</p>",
        "id": 513227299,
        "sender_full_name": "Roman Bacik",
        "timestamp": 1745115916
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"374005\">Roman Bacik</span> has marked this topic as resolved.</p>",
        "id": 513227313,
        "sender_full_name": "Notification Bot",
        "timestamp": 1745115928
    }
]