[
    {
        "content": "<p>In a proof I'm working on, I have a point x in a first-countable, locally path-connected space and want to obtain a sequence of nested path-connected neighbourhoods that form a basis at that point. Mathematically, this is easy: pick any countable neighbourhood basis, turn it into a nested sequence by taking partial intersections, and then make those path-connected by  restricting to a path component each. I could probably do this construction from scratch, but still wondered if there is some API to make the process easier.</p>",
        "id": 484985704,
        "sender_full_name": "Ben Eltschig",
        "timestamp": 1732827485
    },
    {
        "content": "<p>To my surprise, I didn't find anything about neighbourhood bases as nested sequences in mathlib at all. <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=FirstCountableTopology#doc\">docs#FirstCountableTopology</a> doesn't have a lot of API, and is defined in terms of <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Filter.IsCountablyGenerated#doc\">docs#Filter.IsCountablyGenerated</a>; for that, I couldn't find any helpful API either. I also know of <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=partialSups#doc\">docs#partialSups</a> and <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Set.Accumulate#doc\">docs#Set.Accumulate</a> which seem relevant, but couldn't find infimum/intersection counterparts.</p>",
        "id": 484985713,
        "sender_full_name": "Ben Eltschig",
        "timestamp": 1732827490
    },
    {
        "content": "<p>Is there something I'm missing, or have sequences of neighbourhoods like that just not come up a lot of mathlib? And what even would be the best way of stating the lemma that first-countable locally path-connected spaces admit sequences of nested path-connected neighbourhoods like I want?</p>",
        "id": 484985907,
        "sender_full_name": "Ben Eltschig",
        "timestamp": 1732827608
    },
    {
        "content": "<p>I just found <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Filter.exists_antitone_basis#doc\">docs#Filter.exists_antitone_basis</a>, which seems pretty close to what I need; I didn't think of searching for the keyword antitone earlier. I'll try using it in my proof tomorrow and see how it goes.</p>",
        "id": 485022762,
        "sender_full_name": "Ben Eltschig",
        "timestamp": 1732856867
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"646363\">Ben Eltschig</span> has marked this topic as resolved.</p>",
        "id": 485031796,
        "sender_full_name": "Notification Bot",
        "timestamp": 1732862794
    }
]