[
    {
        "content": "<p>Hi, all,</p>\n<p>I am hoping someone can help me in my exploration of pre-existing code for the topics below that I am interested in.</p>\n<p>I am trying to find the code we have for these things, even if it consists of partial progress:</p>\n<p>1) Singular homology and cohomology of topological spaces or ``SSet''<br>\n2) Cohomology classes and singular cohomology with integral coefficients<br>\n3) Derivations, Connections, and the tangent bundle <br>\n4) De Rham cohomology<br>\n5) Line bundles and divisors for smooth manifolds and complex varieties</p>\n<p>It's a lot to ask these together, but a unifying goal is Chern-Weil theory.</p>",
        "id": 421373892,
        "sender_full_name": "Dean Young",
        "timestamp": 1707889115
    },
    {
        "content": "<p>I think 1,2,3 exist for some value of \"exist\". (Maybe not \"connections\", though)</p>",
        "id": 421376212,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1707890773
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span>  thanks for this. It would be nice if you knew anything about DR cohomology and divisors specifically not being in here...  I can be more specific if need-be- I wanted perhaps that DR cohomology matches singular cohomology with coefficients in ℝ for a smooth manifold, and also the definition of Weil and Cartier divisors or something similar, as well as the definition of a bundle or a fiber bundle.</p>",
        "id": 421393684,
        "sender_full_name": "Dean Young",
        "timestamp": 1707899314
    },
    {
        "content": "<p>I believe Heather and Floris worked on De Rham at Banff, but it was in Lean 3</p>",
        "id": 421393961,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1707899417
    },
    {
        "content": "<p>Also, from context, I think that the two mentions of de Rham cohomology are different topics.</p>",
        "id": 421395191,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1707899929
    },
    {
        "content": "<p>Even if you set the bar lower, to say Krull dimension, you still find very little in mathlib...</p>",
        "id": 421395192,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1707899929
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span>  (4) just says De Rham cohomology though. What was there besides that DR cohomology matches singular cohomology?</p>",
        "id": 421395934,
        "sender_full_name": "Ron Z",
        "timestamp": 1707900213
    },
    {
        "content": "<p>I think that 4 refers to algebraic de Rham cohomology (for algebraic varieties), while I think that Yaël's comment refers to de Rham cohomology for smooth manifolds.</p>",
        "id": 421396263,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1707900340
    },
    {
        "content": "<p>But, as I said, I'm going from context alone, so I could very easily be wrong.</p>",
        "id": 421396449,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1707900406
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> sorry,  I should have been more specific here. Smooth manifolds is what I want. I don't know much about algebraic DR cohomology but I do enjoy a certain insight about the \"free abelian group object\". I'm mostly interested in spaces and manifolds.</p>",
        "id": 421396796,
        "sender_full_name": "Dean Young",
        "timestamp": 1707900549
    },
    {
        "content": "<p>Ok, so I see how I misread the context!  Yaël's comment is then very appropriate!  My comments would relate more to algebraic de Rham cohomology.  In particular, I do not think that a development of Krull dimension would be especially beneficial for the de Rham cohomology pertinent to this thread!</p>",
        "id": 421435443,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1707914139
    },
    {
        "content": "<p>It’s really funny that there is a world where the default meaning of “de Rham cohomology” is “algebraic de Rham cohomology” instead of “actual de Rham cohomology”.</p>",
        "id": 421482007,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1707927604
    },
    {
        "content": "<p>Indeed, here is another shocker: for some people \"function\" does not mean \"polynomial\".</p>",
        "id": 421483397,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1707927984
    },
    {
        "content": "<p>\"Riemann-Roch theorem\" is also two different theorems, with the two communities both commonly referring to their one as \"the\" RR theorem (and the proof that they're related involves GAGA which is harder than the proof of either of the Riemann-Roch theorems)</p>",
        "id": 421522595,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1707940848
    },
    {
        "content": "<p>I've mentioned a \"Riemann-Roch race\" before, where the algebraic and analytic people both try and prove their version and we see who gets there first. We could also have a de Rham cohomology race; I think that both definitions are close.</p>",
        "id": 421523011,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1707940988
    },
    {
        "content": "<p>In both cases history of maths has a very clear answer.</p>",
        "id": 421523197,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1707941051
    },
    {
        "content": "<p>Yes, you analytic guys are old and out of date and our modern algebraic definitions specialise to yours and are far more general</p>",
        "id": 421523627,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1707941216
    },
    {
        "content": "<p>This could even be true now with condensed mathematics, who knows?</p>",
        "id": 421524176,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1707941416
    },
    {
        "content": "<p>I think it's true. Except that it isn't called algebraic geometry by the authors, but analytic geometry. So I guess that still counts as a win for the analytic guys?</p>",
        "id": 421524355,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1707941495
    },
    {
        "content": "<p>Are all analytic guys now happy with animated condensed rings?</p>",
        "id": 421525673,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1707942003
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 421598367,
        "sender_full_name": "Dean Young",
        "timestamp": 1707983616
    }
]