[
    {
        "content": "<p>Is there really mathlib stuff for class field theory? It looks like there’s a few things for basic number fields, unit groups, etc but many other parts don’t seem flushed out.</p>",
        "id": 390554824,
        "sender_full_name": "Steven Rossi",
        "timestamp": 1694535621
    },
    {
        "content": "<p>We don't have class field theory in mathlib, but there are several people working on it, or on closely related problems. Do you need it for a specific goal or are you interested in proving it?</p>",
        "id": 390555144,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1694535740
    },
    {
        "content": "<p>Im interested in proving it if it doesn’t exist. Most of what I do is computational CFT, so it’d be nice to have in mathlib.</p>",
        "id": 390555610,
        "sender_full_name": "Steven Rossi",
        "timestamp": 1694535926
    },
    {
        "content": "<p>One of the main persons to talk to is <span class=\"user-mention\" data-user-id=\"406490\">@María Inés de Frutos Fernández</span></p>",
        "id": 390555878,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1694536021
    },
    {
        "content": "<p>Great thanks, I just saw her papers on the topic, definitely what I’m looking for</p>",
        "id": 390557360,
        "sender_full_name": "Steven Rossi",
        "timestamp": 1694536549
    },
    {
        "content": "<p>I am working with <span class=\"user-mention\" data-user-id=\"300245\">@Filippo A. E. Nuccio</span> towards a formalization of local class field theory. So far, we have formalized some of the fundamental theory of local fields (and more generally, of fields complete with respect to a discrete valuation). Our work so far is available at <a href=\"https://github.com/mariainesdff/local_class_field_theory\">this repository</a>. In previous work, I also formalized the ring of adeles (much of that formalization project is now available in mathlib, see for instance <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=DedekindDomain.finiteAdeleRing#doc\">docs#DedekindDomain.finiteAdeleRing</a>).</p>",
        "id": 390557546,
        "sender_full_name": "María Inés de Frutos Fernández",
        "timestamp": 1694536606
    },
    {
        "content": "<p>Someone called Richard Hill, who is not on this Zulip but is going to be teaching a lean course at UCL and is in contact with me, is interested in formalising the global aspects. Last time we talked about this he said he had given an elementary proof of the main results in his PhD thesis via a proof which used no analysis and reduced the question to Kummer theory. I think everything is in place to start formalising Kummer theory a la Birch's paper in Cassels-Froehlich.</p>",
        "id": 390558098,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1694536839
    },
    {
        "content": "<p>In some sense we're working through Cassels-Froehlich (Anne Baanen and their team have done much of the local and global theory, Maria Ines has done adeles, Amelia Livingston has done group cohomology and profinite cohomology, the FLT-regular crowd have done cyclotomic fields, and IIRC Kummer theory is the next topic in the book.)</p>",
        "id": 390558374,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1694536958
    },
    {
        "content": "<p>Not all of everything is done in the previous chapters but my gut feeling is that enough is done to do all the Kummer theory section in Birch's paper.</p>",
        "id": 390558559,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1694537038
    },
    {
        "content": "<p>Ah well I don’t want to step on anybody’s toes for the global and local stuff, but I’ll definitely take a look at Birch’s paper</p>",
        "id": 390559103,
        "sender_full_name": "Steven Rossi",
        "timestamp": 1694537235
    },
    {
        "content": "<p>Believe me there is a huge amount to do before we get to class field theory, and it's not called stepping on anyone's toes, it's called collaboration :-)</p>",
        "id": 390565246,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1694539614
    }
]