[
    {
        "content": "<p>We don't, by any chance, already have a tool that I can run on a file in two mathlib branches and that shows me where the proof states on the respective branches differ?<br>\n(I fear this question can be considered rhetorical)</p>",
        "id": 463351354,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1724058053
    },
    {
        "content": "<p>Leaff is supposed to do that.  Searching for it, might yield some results!  (I'm on mobile)</p>",
        "id": 463351512,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1724058112
    },
    {
        "content": "<p>Joachim, are you trying to debug proofs? I would suggest opening a second copy of mathlib (eg in gitpod) and having a second monitor. I don't know of a better solution currently <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span></p>",
        "id": 463352072,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1724058318
    },
    {
        "content": "<p>Leaff seems to diff changes to the environment, not the proof states within the file.</p>",
        "id": 463352089,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1724058323
    },
    {
        "content": "<p>That’s what I expected, Yaël, but just checking. I wonder if such a tool becomes not too hard to build with verso underneath, but not today :-)</p>",
        "id": 463352281,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1724058378
    },
    {
        "content": "<p>I wonder if this can be done in neovim (cc <span class=\"user-mention\" data-user-id=\"321696\">@Julian Berman</span>). We can certainly open different mathlib clones/worktrees in different panes. Will they get their own lsp and their own infoviews? And can we then run the vimdiff tool on the two infoviews?</p>",
        "id": 463353623,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1724058798
    },
    {
        "content": "<p>If it's one specific proof you want to look at yeah then what you suggest is doable -- you open two tabs (because we don't have per window infoviews yet but we do have per tabpage ones) and then enable diff mode on the two infoview windows and vim will diff their contents already. If this sounds like what you're looking for I can write up better instructions if that's not specific enough.</p>",
        "id": 463386226,
        "sender_full_name": "Julian Berman",
        "timestamp": 1724069659
    },
    {
        "content": "<p>For now switching branches or using gitpod suffices, thanks!</p>",
        "id": 463387122,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1724069988
    }
]