[
    {
        "content": "<p>I'm looking for the conditional variance of a random variable according to a sigma-subalgebra. Searching through mathlib, I notice that in fact we don't have the usual variance of a non-<em>real-valued</em> random variable. Indeed, <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=ProbabilityTheory.variance#doc\">docs#ProbabilityTheory.variance</a> only works for <code>X : Ω → ℝ</code>.</p>",
        "id": 494299902,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1737099860
    },
    {
        "content": "<p>That's correct: we don't have a specific definition for the conditional variance (but it's not hard to define with existing tools), and we have only variance of real random variables.</p>",
        "id": 494302537,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1737101081
    },
    {
        "content": "<p>I'm somewhat confused as to why we only have variance of real-valued random variables. The definition straightforwardly generalises to a normed space-valued random variable. Am I missing something? Was this simplification done for usability? (eg to use <code>X ^ 2</code> instead of <code>fun ω ↦ ‖X ω‖ ^ 2</code>). Was this an oversight?</p>",
        "id": 494302839,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1737101211
    },
    {
        "content": "<p>In R^n the useful object is the covariance matrix and the matrix you get for cov(X,X) is sometimes called variance, and then there are several notions of real valued variance used in different places: trace of the covariance matrix (what you get with your def) or determinant of that matrix.</p>",
        "id": 494304399,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1737101802
    },
    {
        "content": "<p>It's not absolutely clear that your generalization should be the one with name variance.</p>",
        "id": 494304506,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1737101851
    },
    {
        "content": "<p>Okay I see. Wouldn't it be fine to do this generalisation anyway, since it has the same type as the variance of a real-valued random variable, and add a disclaimer that there are other kinds of variances?</p>",
        "id": 494308776,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1737103294
    },
    {
        "content": "<p>I think it would be better just to define covariance directly instead of generalizing variance to non-real valued RVs.</p>",
        "id": 494310137,
        "sender_full_name": "Kexing Ying",
        "timestamp": 1737103717
    },
    {
        "content": "<p>There was a small discussion about this <a href=\"https://github.com/leanprover-community/mathlib3/pull/13912#discussion_r863952831\">here</a></p>",
        "id": 494310335,
        "sender_full_name": "Kexing Ying",
        "timestamp": 1737103790
    }
]