[
    {
        "content": "<p>I noticed that we have definition for cosets, but do we have definitions and APIs about two-sided cosets like <code>aRb</code> for <code>a, b</code> in <code>R</code>? Btw this is for the criterion for morita equivalence between <code>R</code> and <code>S</code> iff exist <code>n : ℕ</code> and a full idempotent <code>e</code> in <code>R</code> such that <code>S ≃+* eMₙ(R)e</code>.</p>",
        "id": 494512464,
        "sender_full_name": "Edison Xie",
        "timestamp": 1737202011
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/20531\">#20531</a></p>",
        "id": 494512766,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1737202247
    },
    {
        "content": "<p>You can write the double coset <code>aRb</code> as <code>a •&gt; R &lt;• b</code> using <code>open scoped RightActions</code></p>",
        "id": 494513816,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1737202803
    },
    {
        "content": "<p>thanks and also do we have definitions for full idempotent, i.e <code>ReR =R</code>?</p>",
        "id": 494514619,
        "sender_full_name": "Edison Xie",
        "timestamp": 1737203425
    },
    {
        "content": "<p><del>\"Coset\" would not quite make sense in a semiring.</del> ReR=R could be phrased as the TwoSidedIdeal generated by e is \\top. (But I think TwoSidedIdeal should not be defined to be RingCon, but rather Ideal+IsTwoSided to accommodate semirings.) Eventually I'd like to generalize materials on Morita equivalence to semirings following <a href=\"https://www.researchgate.net/profile/T-Nam/publication/267068798_Morita_equivalence_and_homological_characterization_of_semirings/links/55c1738e08ae9289a09d06b7/Morita-equivalence-and-homological-characterization-of-semirings.pdf\">this paper</a>.</p>",
        "id": 494525289,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1737211488
    },
    {
        "content": "<p>Ok thanks! Do you wanna make PRs about other idempotents?</p>",
        "id": 494525843,
        "sender_full_name": "Edison Xie",
        "timestamp": 1737211918
    },
    {
        "content": "<p>What are the \"other idempotents\"?<br>\nI'm not actively working on Morita equivalence at the moment. For the semiring version I'd at least need to introduce SemimoduleCat that takes an AddCommMonoid instead of AddCommGroup. And I'd need to generalize materials around AddCon, finite presentation and flatness to be able to work comfortably with (semi)modules over semirings. I do have plans to revive my PR on tensor products over noncommutative semirings, because that offers an important viewpoint towards Morita equivalence.<br>\nMore on dobule cosets: they are called <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Doset.doset#doc\">docs#Doset.doset</a> in mathlib, but they are of the form HaK, not of the form aHb, and they are only defined when you have a (multiplicative) group (in which case you have a decomposition of the whole group into disjoint double cosets). I should say it's the lack of multiplicative inverse, rather than additive inverse, that is the reason why the Doset API isn't appropriate here (certainly not for aRb, but also not for ReR). However aRb is also used in the definition of a prime ideal over noncommutative (semi)rings, so it would be appropriate to define it as a AddSubmonoid/group.</p>",
        "id": 494527469,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1737213337
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/0E0ZK-rv8wTv-Q7OzmOPuYwX/Screenshot-2025-01-19-at-08.12.40.png\">Screenshot 2025-01-19 at 08.12.40.png</a><br>\nOther idempotents like this page shows?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/0E0ZK-rv8wTv-Q7OzmOPuYwX/Screenshot-2025-01-19-at-08.12.40.png\" title=\"Screenshot 2025-01-19 at 08.12.40.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1895x922\" src=\"/user_uploads/thumbnail/3121/0E0ZK-rv8wTv-Q7OzmOPuYwX/Screenshot-2025-01-19-at-08.12.40.png/840x560.webp\"></a></div>",
        "id": 494618758,
        "sender_full_name": "Edison Xie",
        "timestamp": 1737274423
    },
    {
        "content": "<p>Edison you mean \"predicates on idempotents\" not \"other idempotents\". Junyan why do you care so much about advanced algebra over semirings? Is there an application you have in mind?</p>",
        "id": 494639465,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1737291363
    },
    {
        "content": "<p>The paper <em><a href=\"https://arxiv.org/pdf/2405.18645\">Facets of module theory over semirings</a></em> talks about an algebraic number theory application on page 5. It also develops the theory of faithfully flat descent <br>\nand shows results like GL_n isn't flat over Nat. Of course the tropical school is also major enterprise.</p>\n<p>I think proofs that generalize are more \"correct\" and are what mathlib should epitomize, especially if they are not much more difficult. That said, it's not my intention to block anyone from developing the theory only for Rings, especially given that many infrastructure for Semirings are not there. But keeping the generalization in mind would help you choose proofs that generalize most easily.</p>\n<p>In the context of Morita equivalence, It's interesting to think whether certain properties of modules are categorical; it turns out many still are over a semiring. I was unsure for some days about projectivity (which is defined to mean lifting property w.r.t. surjective linear maps, not all epimorphisms, since w.r.t. non-surjective linear maps like the inclusion Nat -&gt; Int, even free modules do not satisfy the lifting property), but then <a href=\"https://www.researchgate.net/profile/T-Nam/publication/267068798_Morita_equivalence_and_homological_characterization_of_semirings/links/55c1738e08ae9289a09d06b7/Morita-equivalence-and-homological-characterization-of-semirings.pdf\">the paper on Morita equivalence</a> points out that surjections agree with regular epimorphisms (which I guess is common knowledge since I recall seeing it before after being reminded by the paper). Finite presentation is characterized by Hom(M,-) preserving all directed colimits, and finite generation is characterized by preserving directed colimits of monomorphisms (=injective linear maps). It's still true that finitely presented flat modules are projective, and finitely generated projective modules are finitely presented, but they may not be Zariski-locally free over a comm. semiring. The current definition <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Module.FinitePresentation#doc\">docs#Module.FinitePresentation</a> is unfortunately wrong over a semiring for the purpose of these statements.</p>",
        "id": 494642396,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1737293774
    }
]