[
    {
        "content": "<p>Hi, has the decomposition theorem for graded modules over a PID been implemented into mathlib? <a href=\"https://en.wikipedia.org/wiki/Structure_theorem_for_finitely_generated_modules_over_a_principal_ideal_domain\">Here</a> is the wikipedia reference of the theorem I am talking about. I could only find a couple of files that deal with graded modules at all, so I assume it is still to do.</p>",
        "id": 448652351,
        "sender_full_name": "VayusElytra",
        "timestamp": 1719938039
    },
    {
        "content": "<p>I see nothing specific about graded modules in that article. Am I missing something?</p>",
        "id": 448660474,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1719940455
    },
    {
        "content": "<p>I <em>think</em> this wikipedia article is the correct thing to ask about. The literature I am following along is a little ambiguous; one paper refers to a \"fundamental theorem for finitely generated modules over a graded principal ideal domains\" (that it does not state), another as \"the structure theorem for finitely-generated graded modules over a principal ideal domain\" - changing which object is graded. To complicate the matter further, this same source includes a reference to Hungerford's Algebra, P.225, Theorem 6.12, which is a decomposition theorem for modules over PIDs... that features no talk of graded objects at all. </p>\n<p>I think for now, let's ignore grading and talk about the decomposition theorem from this Wikipedia article. If it isn't implemented into mathlib yet, then surely any potentially more complex results with an additional grading hypothesis won't be either. My apologies for the confusion.</p>",
        "id": 448672167,
        "sender_full_name": "VayusElytra",
        "timestamp": 1719943759
    },
    {
        "content": "<p>We have the structure theorem for fg modules over a PID and I don't know what statement we're talking about when it comes to adding a grading</p>",
        "id": 448673262,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1719944007
    },
    {
        "content": "<p>Thank you! <br>\nAs for the grading: this passage from \"Topology for Computing\" by Zomorodian clears up the confusion: <br>\n<a href=\"/user_uploads/3121/6x6JGDZFXFoQUZ55MnhSWcOn/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/6x6JGDZFXFoQUZ55MnhSWcOn/image.png\" title=\"image.png\"><img src=\"/user_uploads/3121/6x6JGDZFXFoQUZ55MnhSWcOn/image.png\"></a></div>",
        "id": 448675460,
        "sender_full_name": "VayusElytra",
        "timestamp": 1719944674
    }
]