[
    {
        "content": "<p>Hi,everyone. I want to define convex quadrilateral.Can I define it on a two-dimensional plane?</p>",
        "id": 539774214,
        "sender_full_name": "yulia wang",
        "timestamp": 1758030515
    },
    {
        "content": "<p>What do you want to do with it?</p>",
        "id": 539777263,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1758031209
    },
    {
        "content": "<p>I want to formalize IMO problems and complete the proofs.</p>",
        "id": 539779414,
        "sender_full_name": "yulia wang",
        "timestamp": 1758031733
    },
    {
        "content": "<p>The definition of convex quadrilaterals is used in some IMO geometry problems.</p>",
        "id": 539779613,
        "sender_full_name": "yulia wang",
        "timestamp": 1758031781
    },
    {
        "content": "<p><a class=\"message-link\" href=\"/#narrow/channel/467461-Proofs-from-the-book/topic/Amsterdam/near/482264865\">#Proofs from the book &gt; Amsterdam @ 💬</a> has my suggestions for how API for polygons should be set up. There are lots of different ways you might define convex polygons; obviously the API should include proofs that as many definitions are you can think of are all equivalent to each other. For example, a convex polygon is one with at least three vertices and where for every two consecutive vertices, all others are strictly on the same side of their affine span. Or it's one with at least three vertices and where for every three vertices in the same cyclic order, the obvious determinant (in terms of basis vectors for the two-dimensional affine subspace spanned by the vertices) has the same sign. Or it's one with at least three vertices and where every subset of four vertices in cyclic order is convex.</p>\n<p>What's less clear to me is how to define <em>weakly</em> convex polygons (ones that allow repeated vertices and vertices in the middle of edges), without also allowing edges to repeatedly go back and forth along the same line segment which doesn't fit with an intuitive informal notion of weakly convex polygons. But since informal problems with convex polygons are most likely to mean <em>strictly</em> convex, this seems less important.</p>",
        "id": 539909088,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1758067090
    },
    {
        "content": "<p>I would argue there are two separate definitions of \"polygon\" in use in mathematics:</p>\n<ul>\n<li>A cyclically ordered set of points</li>\n<li>A two-dimensional convex polytope</li>\n</ul>\n<p>The latter should be relatively straightforward to convert into the former. The opposite conversion is quite more difficult. The Jordan curve theorem tells you that if the polygon is simple (no edges intersect outside of the vertices), then there's a well-defined interior and exterior. A weakly convex polygon is then a polygon (1st definition) whose interior is convex, and a convex polygon is one where moreover every vertex is a vertex of the closure of its interior.</p>",
        "id": 539910130,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1758067911
    },
    {
        "content": "<p>Now I suspect this discussion is mostly moot. In my experience solving IMO geometry problems, very few of them actually need any convexity hypotheses. They're mostly just there to avoid mentions of directed angles, or to make the drawings more uniform to the graders' convenience.</p>",
        "id": 539910160,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1758067954
    }
]