[
    {
        "content": "<p>I've been looking at formalizations of Modal Logic, however the most relevant ones I can find are some papers using Lean3 (Notably the ones by Bruno Bentzen 2021, Jiatu Li 2020, &amp; especially Paula Neeley 2021).</p>\n<p>From what I can tell, Paula Neeley's formalization of DEL was in MathLib. I believe Mathlib was then converted into Lean4, however I can't find it in there.</p>\n<p>The only Lean4 logic I've found so far is <a href=\"https://github.com/FormalizedFormalLogic/Foundation\">https://github.com/FormalizedFormalLogic/Foundation</a>, though I can't tell if this is in Mathlib since I'm still pretty new. This also doesn't cover S5 etc as far as I can tell.</p>\n<p>I.e. If I want to use DEL will I need to expand on the above work / translate the Lean3 works into Lean4? I'm fine with doing so I just want to make sure I'm not doing unnecessary work.</p>",
        "id": 479476368,
        "sender_full_name": "Ward",
        "timestamp": 1730207797
    },
    {
        "content": "<p>Paula Neeley's thesis does not mention that their formalisation was upstreamed to mathlib. And indeed I don't remember such an upstreaming ever has happened.</p>",
        "id": 479488564,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1730210318
    },
    {
        "content": "<p>FormalizedFormalLogic's authors have tried to upstream their project to mathlib, but this has kind of stalled because of a mismatch with mathlib's philosophy of having very general and reusable objects</p>",
        "id": 479488936,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1730210422
    },
    {
        "content": "<p>I hope we will resolve this so that we can get their project in mathlib. But it's a lot of effort</p>",
        "id": 479489004,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1730210444
    },
    {
        "content": "<p>Ah I think I made the assumption based on her giving a presentation at the LeanTogether2021, but I'm not even sure how to find whether or not something is in Mathlib.</p>\n<p>On the other-hand, I remember Jiatu Li giving a presentation where he believed Bruno Bentzen's work to be in MathLib, but again Idk how to check for that and he could've been mistaken.</p>",
        "id": 479489657,
        "sender_full_name": "Ward",
        "timestamp": 1730210641
    },
    {
        "content": "<p>We have plenty of tools to search mathib. My favorite is <a href=\"https://leanprover-community.github.io/mathlib4_docs\">#docs</a>, but it requires you to know the name of the lemma/def you are looking for. Else you can use <a href=\"https://loogle.lean-lang.org/\">#loogle</a>, #moogle or #leansearch</p>",
        "id": 479490823,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1730210981
    },
    {
        "content": "<p>(Can someone add the last two to the linkifier?)</p>",
        "id": 479490884,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1730211002
    },
    {
        "content": "<p><a href=\"https://www.moogle.ai/\">#moogle</a> <a href=\"https://leansearch.net/\">#leansearch</a></p>",
        "id": 479584143,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1730246099
    },
    {
        "content": "<p>We probably should have a bot for both of those!</p>",
        "id": 479584168,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1730246116
    }
]