[
    {
        "content": "<p>Hello. Hope you're all well. Very newbie question here. I'm looking into constructing a 3d model of a house and wanting to learn more lean4. So I'm wondering if there's code for simple euclidean geometry in 3 dimensions and, if that's true, what's the closest thing in lean4 for defining 3d shapes and objects with the hope of exporting these objects to a format that can be understood by freecad and blender.</p>",
        "id": 530471142,
        "sender_full_name": "Ricardo",
        "timestamp": 1753329470
    },
    {
        "content": "<p>Lean &amp; blender/cad... that's an unexpected combo to me. Sorry I don't have an answer but I am interested to see ideas here</p>",
        "id": 530537574,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1753357074
    },
    {
        "content": "<p>I once wrote python code constructing coordinates of a regular dodecahedron and then imported this code into Blender, took the convex hull and then 3D printed the result. The python code had a bunch of <code>sqrt(5)</code>s in which of course were computed as <code>Float</code>s. The thing about Lean is that one might imagine that all the Euclidean geom stuff we have will naturally sit over <code>Real</code> and might well be noncomputable so one would need a map from <code>Real</code> to <code>Float</code> plus ways to compute its value on whatever one is using in <code>Real</code>.</p>",
        "id": 530641780,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1753389147
    },
    {
        "content": "<p>Yes, I understand. The map would be something like \"get a computable Real that can be represented as a Float and is epsilon-close to this (possibly noncomputable) Real\". Not sure if it's always possible to know if such a computable Real exists.</p>\n<p>I was thinking though more in the line of a geometry library working directly with Floats.</p>",
        "id": 530657756,
        "sender_full_name": "Ricardo",
        "timestamp": 1753396478
    },
    {
        "content": "<p>Because one basically can't prove any theorem using Floats, such library is probably no better than a computational library in any programming language<br>\nPerhaps one with computable rational/constructible/algebraic numbers would be more useful?</p>",
        "id": 530660587,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1753398086
    },
    {
        "content": "<p>No better than a computational library in any programming language is good enough already. Plus I think some things could be proved anyway with Floats. Computable rationals/constructible/algebraic numbers would all be good too.</p>",
        "id": 530678267,
        "sender_full_name": "Ricardo",
        "timestamp": 1753408776
    }
]