[
    {
        "content": "<p>Is there code for perverse sheaves, or other geometric representation theory topics like the affine Grassmannian and affine flag variety of an algebraic group?</p>",
        "id": 408409918,
        "sender_full_name": "Andrea Bourque",
        "timestamp": 1702789990
    },
    {
        "content": "<p>Sadly not!</p>",
        "id": 408411755,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1702791968
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110524\">Scott Morrison</span> are you interested in developing it? Or know anyone else who is interested in developing it? </p>\n<p>And/or do you know what kinds of things would need to be developed first? I.e. one would need derived categories and the notions of constructibility for perverse sheaves. And I don't know how much of algebraic groups have been developed, but the affine Gr and Fl are ind-varieties, so that might pose a challenge.</p>",
        "id": 408411920,
        "sender_full_name": "Andrea Bourque",
        "timestamp": 1702792178
    },
    {
        "content": "<p>I'm certainly not going to be doing this. But it would be fun. :-)</p>\n<p><span class=\"user-mention\" data-user-id=\"459699\">@Joël Riou</span> is the one to say how much of derived categories we have. (I think: we don't have them yet, but should be very close.)</p>\n<p>Sadly algebraic groups have not even been defined, and ind-varieties I think have <em>many</em> steps missing before even the definition.</p>",
        "id": 408413853,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1702793975
    },
    {
        "content": "<p>I think we need varieties before ind-varieties. We have schemes but nobody ever specialised to schemes of finite type over a field</p>",
        "id": 408421462,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1702800985
    },
    {
        "content": "<p>The triangulated structure on the homotopy category of cochain complexes shall soon be in mathlib (<a href=\"https://github.com/leanprover-community/mathlib4/pull/9032\">#9032</a>). It will take slightly more time to PR my code for the derived category. On a branch, I have code for t-structures (including the fact that the heart of a t-structure is an abelian category).</p>\n<p>In order to obtain the derived category, I will need the more general localization theorem for triangulated categories. One of the technical steps will be that the localization of an additive category <code>C</code> with respect to a suitable class of morphism is still additive, and for that I shall incidentaly use notions of \"(abelian) group objects\" in a category, which would also be useful in order to define group schemes as group objects in the category of schemes.</p>",
        "id": 408435200,
        "sender_full_name": "Joël Riou",
        "timestamp": 1702812806
    },
    {
        "content": "<p>Algebraic groups are something we're going to have to come to terms with at some point but I still don't know the best way to define them, or more generally how best to do group schemes. There are several different ways of thinking about them but we'll need to choose one. I need finite flat group schemes for Fermat so this will come up sooner rather than later</p>",
        "id": 408438865,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1702816389
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/geometric.20representation.20theory/near/408421462\">said</a>:</p>\n<blockquote>\n<p>I think we need varieties before ind-varieties. We have schemes but nobody ever specialised to schemes of finite type over a field</p>\n</blockquote>\n<p>Surprising</p>",
        "id": 408468580,
        "sender_full_name": "Andrea Bourque",
        "timestamp": 1702837959
    },
    {
        "content": "<p>It's just a matter of getting someone to do it. Natural targets would be a basic theory of curves (including relations to valuations on the function field) and a theory of dimension of a variety. But nobody needed these for any project so far so nobody did them. I have PhD students working on dimension theory</p>",
        "id": 408473540,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1702840564
    },
    {
        "content": "<p>Fair enough. If I was more comfortable with AG and had more time on my hands, I would try it.</p>",
        "id": 408486954,
        "sender_full_name": "Andrea Bourque",
        "timestamp": 1702853432
    },
    {
        "content": "<p>Mathlib recently got <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Coalgebra#doc\">docs#Coalgebra</a> and people has tried Hopf algebras <a href=\"#narrow/stream/116395-maths/topic/Coalgebras.2Fbialgebras.2FHopf.20algebras/near/338740279\">before</a>. So I guess we are not that far from <em>affine</em> algebraic groups?</p>",
        "id": 408513386,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1702868216
    },
    {
        "content": "<p>Well we're not that far from some definition which is equivalent to affine group schemes, but there will still be some glue to get the word scheme involved, and some finiteness issues before we have affine algebraic groups. And then it will still be a challenge to construct the algebraic group associated to an elliptic curve. For Fermat I was going to just deal with all of this in an ad hoc way because I only need results for inner forms of GL(2) and for finite (hence affine) group schemes</p>",
        "id": 408566787,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1702890982
    }
]