[
    {
        "content": "<p>Has someone formalized internal categories? I could not find them on mathlib. I need them for a project, I'd be happy to formalize it but wanted to check if anyone has already done it.</p>",
        "id": 521138839,
        "sender_full_name": "Sina Hazratpour",
        "timestamp": 1748539848
    },
    {
        "content": "<p>I'd love to know if and when you find out or do it yourself.</p>",
        "id": 521194596,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1748565299
    },
    {
        "content": "<p>What sort of ambient categories are you thinking of working in? Finitely complete? More general?</p>",
        "id": 521194639,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1748565333
    },
    {
        "content": "<p>For my project, I was thinking of finitely complete categories as ambient categories. One source where internal categories are developed extensively is Street's \"Categories in categories, and size matters\": <a href=\"http://maths.mq.edu.au/~street/Cicasm.pdf\">http://maths.mq.edu.au/~street/Cicasm.pdf</a></p>\n<p>There is also the view of internal categories as monads in the bicategory of spans, but also the ambient category is finitely complete.</p>\n<p>What do you have in mind as the more general framework? like</p>",
        "id": 521245538,
        "sender_full_name": "Sina Hazratpour",
        "timestamp": 1748593409
    },
    {
        "content": "<p>For Mathlib, you really shouldn't assume finite completeness, as you'd not cover Lie groupoids.  Definition 3.1 of <a href=\"http://www.tac.mta.ca/tac/volumes/30/55/30-55abs.html\">http://www.tac.mta.ca/tac/volumes/30/55/30-55abs.html</a> is a hint for the groupoid case. But it works more generally. </p>\n<p>Ehresmann's sketched structures (finite limit sketches, here, or LE sketches) is another viewpoint. <br>\nInstead of giving objects of objects and morphisms, you also give the object of composable pairs together with a proof this is a pullback as needed (and an object for composable triples - cf section 4.9 of <a href=\"http://www.tac.mta.ca/tac/reprints/articles/12/tr12abs.html\">http://www.tac.mta.ca/tac/reprints/articles/12/tr12abs.html</a>).  And then for cases where you can construct things as <em>a</em> pullback, you get it for free.</p>\n<p>I think Borceaux's Handbook and Johnstone's Elephant do a bit more on internal categories on top of Street's paper.</p>",
        "id": 521300021,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1748612483
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"130272\">@David Michael Roberts</span> Thanks for the references. <br>\nThe definition you suggested is indeed more general than the one when we assume finite completeness, and it makes sense to aim for formalizing the more general definition.</p>",
        "id": 521341969,
        "sender_full_name": "Sina Hazratpour",
        "timestamp": 1748626317
    },
    {
        "content": "<p>There's also <a href=\"https://arxiv.org/abs/1101.2363\">https://arxiv.org/abs/1101.2363</a>, if I may.</p>",
        "id": 521412990,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1748671642
    },
    {
        "content": "<p>I made an attempt 5 years ago here: <a href=\"https://github.com/b-mehta/topos/blob/3e659c47be27494ceb4460be9a1236902aa388ee/src/internal_category.lean\">https://github.com/b-mehta/topos/blob/3e659c47be27494ceb4460be9a1236902aa388ee/src/internal_category.lean</a>, but a lot has changed in mathlib since then! Looking at this code, I took the approach of Ehresmann as mentioned above, without finite completeness, but I only recall reading the Elephant at the time (it was a while ago though, so my memory of this is hazy!)</p>",
        "id": 521471502,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1748721162
    },
    {
        "content": "<p>Thanks for sharing this <span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span> . <br>\nUnless i don't read it correctly, it seem in the line 14 you do assume finite completeness. <br>\n<a href=\"https://github.com/b-mehta/topos/blob/3e659c47be27494ceb4460be9a1236902aa388ee/src/internal_category.lean#L14\">https://github.com/b-mehta/topos/blob/3e659c47be27494ceb4460be9a1236902aa388ee/src/internal_category.lean#L14</a><br>\ni guess the only pullback we need is that of <code>src</code> and <code>tgt</code>, so can make that part of the data of the internal category structure. <br>\nAlso, perhaps similar to the internal monoids in mathlib4, internal categories can be a <code>class</code> rather than <code>structure</code>.</p>",
        "id": 521477193,
        "sender_full_name": "Sina Hazratpour",
        "timestamp": 1748726350
    },
    {
        "content": "<p>Oops, you're correct, I linked the wrong version! That version does indeed assume finite completeness and have objects of objects and morphisms and not composable pairs. The one I was thinking about is here: <a href=\"https://github.com/b-mehta/topos/blob/master/src/internal_category.lean\">https://github.com/b-mehta/topos/blob/master/src/internal_category.lean</a> So it looks like I tried both approaches!</p>",
        "id": 521477875,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1748726872
    },
    {
        "content": "<p>Internal categories can be taken to have 13 dependent summands not counting the extra entries for the existence of pullbacks and the entries used to pull back <code>src</code> and <code>tgt</code>.</p>\n<p>The same dependent-summand-count idea gives 6 entries for an internal presheaf, such as the one defined in chapter 7 of Janelidze &amp; Borceux ' s monograph Galois Theories. Including the internal category this entails 13 + 6 = 19. An internal natural transformation should have 4, and an internal functor has 6 (though the count there is not the same as the six in the internal presheaf).</p>\n<p><span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span> Did you make any of these as well? It wouldn't be a bad idea to package these. </p>\n<p>An endofunction <code>Cat → Cat</code> ensues from the approach in which no finite limits are assumed to exist, and in which internal functor is added to the considerations, since internal functors make an internal category (a cartesian closed one).</p>\n<p>For the internal presheaf that twocategory problem isn't there: <code>(X : Cat )→ (C : InternalCategory X) → Cat</code> for the category of internal presheaves with internal presheaf morphisms (4 dependent summands).</p>",
        "id": 522913361,
        "sender_full_name": "pro-Lie stabilizer",
        "timestamp": 1749323608
    }
]