[
    {
        "content": "<p>The .olean's of Mathlib itself,  along with its dependencies is more than 6GB, which is almost unacceptable in my scenario. However I only require a small part of Mathlib, and many of the imports can be well stripped. (Why would I ever need these linters defined in Mathlib.Init, especially at runtime? Plus, as long as proof bodies are ignored while building oleans, the imports of Mathlib.Tactic is most of the times useless.) Therefore, I believe including just part of Mathlib (for example only the Data part) in the project is feasible and can save me a lot of space, but I wonder if there is already a solution for this?</p>",
        "id": 556889056,
        "sender_full_name": "Shin Gen",
        "timestamp": 1763399851
    },
    {
        "content": "<p>the module system in 4.25 is aiming to address this somewhat</p>",
        "id": 556889227,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1763399902
    },
    {
        "content": "<p>Ah, I haven't found a changelog of Mathlib but it's relieving to hear that it is adopting a module system.</p>",
        "id": 556891926,
        "sender_full_name": "Shin Gen",
        "timestamp": 1763400661
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"989795\">@Shin Gen</span>, you might have to clarify what you mean by \"include\".</p>\n<ul>\n<li>You don't have to <code>import Mathlib</code>, you can just <code>import Mathlib.Foo.Bar</code>, or whatever you need.</li>\n<li>You don't need to download the entire cache, you can run <code>lake exe cache get Mathlib.Foo.Bar</code> to only retrieve parts of it.</li>\n</ul>\n<p>(and the module system will enable \"including\" even less, as noted above).</p>",
        "id": 556950148,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1763422321
    },
    {
        "content": "<p>\"You don't need to download the entire cache\" that's what I actually mean, thank you.</p>",
        "id": 556966476,
        "sender_full_name": "Shin Gen",
        "timestamp": 1763432683
    }
]