[
    {
        "content": "<p>Is there a (mv) power series version of  <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Algebra/Polynomial/Expand.html#Polynomial.expand_char\">Polynomial.expand_char</a> or has anyone already done this? (I don't find <code>MvPolynomial.expand_char</code> in mathlib, it can be easily proved by current API). If not, I was wondering whether I could claim I will work on this since I would need it in my project. Also I am not sure whether it is useful to build the function <code>expand</code> for (mv) power series (not sure someone has already done this). If it is useful to define it, I could also do it. Thanks in advance!</p>",
        "id": 564061014,
        "sender_full_name": "Wenrong Zou",
        "timestamp": 1765896864
    },
    {
        "content": "<p>Probably it's missing. In general the API for polynomials is much more complete than the one for power series.</p>\n<p>If you decide to contribute it, feel free to ping me for review on your PR. And it would be great if you could follow the Polynomial API as inspiration.</p>",
        "id": 564063577,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1765897409
    },
    {
        "content": "<p>Thank you for your comment. I would try to do it and PR it in the next few days. I would follow the style in Polynomial. Thanks!</p>",
        "id": 564083749,
        "sender_full_name": "Wenrong Zou",
        "timestamp": 1765902284
    },
    {
        "content": "<p>Note to future self: Unify all of these</p>",
        "id": 564097119,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1765905965
    },
    {
        "content": "<p>Thank you for your advice! But currently, my idea to do this for (mv) power series is to do truncation first and use the result for (mv) polynomial, since we cannot do induction for (mv) power series. I am not sure whether there is a better way to do this. So somehow we need to the result for polynomial to prove the result for power series.</p>",
        "id": 564098710,
        "sender_full_name": "Wenrong Zou",
        "timestamp": 1765906480
    }
]