[
    {
        "content": "<p>Do we have iterated derivatives between manifolds? We seem to have <code>iterated_fderiv</code> and <code>iterated_deriv</code> but I can't find anything else. Also, while I'm here, is there a <code>deriv</code> version of <code>iterated_fderiv_tsum</code>? (I can't find them, but I'm also very bad at finding things in mathlib).</p>",
        "id": 328439713,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1676631703
    },
    {
        "content": "<p>Iterated derivatives of maps between manifolds don't really make sense in general (and that's why we don't have them in mathlib): if <code>f</code> is a function between two manifolds, then the second derivative of <code>f</code> at a point <code>x</code> (as a bilinear map on the tangent space at <code>x</code>) is canonical only when the first derivative of <code>f</code> at <code>x</code> vanishes. If you want a general definition, you will need a connection on the tangent bundle (probably with some good properties).</p>",
        "id": 328506057,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1676649852
    },
    {
        "content": "<p>OK fair enough, that's a good point. I guess I was thinking of this for the specific case I have in mind, where I have a function on the complex upper half plane (to the complex numbers) and I want to take its iterated derivative, but I cant use <code>iterated_deriv</code> or <code>iterated_fderiv</code> since my domain isnt a field</p>",
        "id": 328510222,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1676650887
    },
    {
        "content": "<p>I can do the trick of extending by zero, but thats  annoying to work with</p>",
        "id": 328510410,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1676650932
    },
    {
        "content": "<p>It's usually harder to work with a partial function than a function extended by 0. For this reason, we extend many functions in mathlib with 0, even though they \"should\" be partial functions (operations like division, integrals, derivatives, ...).</p>",
        "id": 328578314,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1676674583
    },
    {
        "content": "<p>When I first defined modular forms, in order to say they were holomorphic I just extended by zero outside the upper half plane and used 'differentiable_on', but this wasn't very nice to use, since I kept having to ensure I was on the upper half plane for things to work and morally it was the wrong definition to use. Which is why the current definition uses 'mdifferentiable'. </p>\n<p>In this case I just want to take an identity on the upper half plane and  differentiate it n-times. So maybe it won't be that bad extending by zero, but it feels like that sort of thing that one could do with 'mderiv' in this setting.</p>",
        "id": 328641620,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1676716884
    }
]