[
    {
        "content": "<p>Hi all, I am an undergraduate student learning Lean in one of my <a href=\"https://math.iisc.ac.in/~gadgil/proofs-and-programs-2025/\">classes</a>. I am thinking of ideas for my course project (the requirements being that it should be doable in 40-50 days and useful to the lean community) and I am wondering if <em>formalizing linear temporal logic</em> would be a good idea.</p>\n<p>I am aware of three such (and more or less unmaintained) Lean 3 projects, but none of them seem to have a Lean 4 port.</p>\n<ol>\n<li><a href=\"https://github.com/unitb/temporal-logic\">https://github.com/unitb/temporal-logic</a></li>\n<li><a href=\"https://github.com/loganrjmurphy/lean-temporal\">https://github.com/loganrjmurphy/lean-temporal</a></li>\n<li><a href=\"https://github.com/James-Oswald/linear-temporal-logic\">https://github.com/James-Oswald/linear-temporal-logic</a></li>\n</ol>\n<p>The first one also includes several results, like those in chapter 5 of the <a href=\"https://web.eecs.umich.edu/~movaghar/Principles%20of%20Model%20Checking-Book-2008.pdf\">Model-checking book</a> by Baier and Katoen. I am also planning to prove some of these results as part of my project (and if given time, I may extend my work beyond LTL to CTL).</p>\n<p><strong>My question to the lean Zulip community</strong> is whether any similar project for Lean 4 exists or is underway, and whether there are any specific results/features that I would be recommended to focus on. </p>\n<p>Additionally, any references that I should check would be very useful! Thanks so much for your time :)</p>",
        "id": 502849271,
        "sender_full_name": "Mrigank Pawagi",
        "timestamp": 1740914050
    },
    {
        "content": "<p>A grad student and I at UC Santa Cruz have a formalization underway for LTL, but it's not public yet. We're mostly focused on a library to use LTL for applications rather than a library to study LTL itself, though we're working on a bit of that too.</p>\n<p>It seems possible that we'd both be approaching LTL somewhat differently, so it's possible that some overlap between projects is fine. Happy to talk about this with you and <span class=\"user-mention\" data-user-id=\"266304\">@Siddhartha Gadgil</span>.</p>\n<p>We're not doing CTL.</p>",
        "id": 502881048,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1740936096
    },
    {
        "content": "<p>I am working on a variant of CTL, but this has nothing to do with setting up the theory of LTL (not yet anyway). I do think that searching this zulip for either \"LTL\" or \"CTL\" will yield some interesting results since as far back as 2023 I recall people asking this question. The basic theory shouldn't be too hard, though I have no idea how difficult it is to formalise closure under complementation of Buchi automata.</p>",
        "id": 502896570,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1740946724
    },
    {
        "content": "<p>I found another nice implementation at <a href=\"https://github.com/GaloisInc/lean-protocol-support/tree/master/galois/temporal\">https://github.com/GaloisInc/lean-protocol-support/tree/master/galois/temporal</a> (but this is also Lean 3). This is all I could find on the Zulip chat besides the 3 projects I listed before. </p>\n<p>Thanks <span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> for your response. I understand that you may not be able to share a lot of details at this moment, but it would be very helpful if you could provide some pointers on the scope of your project and therefore possible directions for me. </p>\n<p>Thanks <span class=\"user-mention\" data-user-id=\"466334\">@Shreyas Srinivas</span>! I think I will stick to LTL and try proving some automata-related results rather than working on CTL.</p>",
        "id": 503028363,
        "sender_full_name": "Mrigank Pawagi",
        "timestamp": 1741009090
    },
    {
        "content": "<p>Hi, a small update from my side: I started working on this project and have made some progress. For now, I am done with my \"course project,\" but I plan to work more on this after the semester. At some point, I will make a post on this Zulip server to share the project broadly with people here. You can check it out at <a href=\"https://github.com/mrigankpawagi/LeanearTemporalLogic\">https://github.com/mrigankpawagi/LeanearTemporalLogic</a> (the README has a detailed description of the state of the project). Thanks again!</p>",
        "id": 510669938,
        "sender_full_name": "Mrigank Pawagi",
        "timestamp": 1744032367
    },
    {
        "content": "<p>Just one comment - it is good to have some easy theorems that check the correctness of definitions</p>",
        "id": 510684473,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1744035331
    },
    {
        "content": "<p>Sure, I will incorporate that – thanks!</p>",
        "id": 510697623,
        "sender_full_name": "Mrigank Pawagi",
        "timestamp": 1744038327
    },
    {
        "content": "<p>Can't stop my inner pedant: lemmae is not a standard plural of lemma - that would be lemmas or lemmata :)</p>",
        "id": 510712646,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1744042161
    },
    {
        "content": "<p>I remember my spell checker giving me red squiggly lines under \"lemmae\" and I thinking why the spell checker does not know this word! But yes you're right; I will fix that — thanks!</p>",
        "id": 510713260,
        "sender_full_name": "Mrigank Pawagi",
        "timestamp": 1744042328
    }
]