[
    {
        "content": "<p>Is there a way to _remove_ a set of lemmas from a simp in one batch? A negative simp set, essentially?</p>\n<p>I ask because specifically, there are a solid two to four ways for <code>simp</code> to get from an applied categorical composition (expression of the form <code>Hom.hom (f ≫ g) x</code>) in <code>TopCat</code> to a sequence of applied homs (<code>Hom.hom g (Hom.hom f x)</code>). This almost never works is and is almost never what I want; it could theoretically be patched by sufficient <code>elementwise</code>/<code>_apply</code> lemmas but those almost always seem to get hung up on definitional equalities or discrimination tree details so that they don't trigger as simp lemmas, so I find myself typing a whole lot of <code>simp [-ConcreteCategory.comp_apply, -TopCat.hom_comp, -ContinuousMap.comp_apply]</code>...</p>\n<p>(It might also be a good idea to just de-simp some of these lemmas, but they mostly exist for decent reasons and it's only this unfortunate intersection of use cases where they go wrong, is my feeling.)</p>",
        "id": 537170301,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1756759675
    },
    {
        "content": "<p>(Actually, maybe just making <code>ConcreteCategory.comp_apply</code> a <code>simp↑</code> lemma, so that it tries to simplify on the categorical level first, <em>then</em> tries to simplify elementwise? Or a simproc that tries to go back and forth until it doesn't make progress, maybe?)</p>",
        "id": 537170664,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1756759924
    },
    {
        "content": "<p>Assuming that there are legitimate reasons for the lemmas to be <code>simp</code>, I think the best solution is a <code>local attribute [-simp]</code>.</p>",
        "id": 537171043,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1756760219
    },
    {
        "content": "<p>Had to do something similar with <code>WithTop.coe_add</code> and <code>WithTop.coe_mul</code> once. Both are perfectly legitimate <code>simp</code> lemmas, but I was using them in a context where I only cared about the ordering on my <code>WithTop (R[X])</code> type and not the arithmetic, so they were firing on my polynomials and giving me nonsense expressions.</p>",
        "id": 537171446,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1756760490
    }
]