[
    {
        "content": "<p>When <code>R</code> is a domain, the iterated Laurent series ring <code>R((X))((Y))</code> has an additive valuation taking values in <code>WithTop (ℤ ×ₗ ℤ)</code> (<a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=HahnSeries.addVal#doc\">docs#HahnSeries.addVal</a> modulo <a href=\"https://github.com/leanprover-community/mathlib4/pull/10781\">#10781</a>).  However, if <code>R</code> has zero divisors, then we only have a weak version of multiplicativity, since the product of nonzero leading terms can vanish.  We have a suitable weakening of multiplicativity in the context of seminorms of rings, but there, the values are restricted to non-negative reals.  Is there interest in a \"least common generalization\", i.e., either a generalization of the values taken by seminorms, or an inequality in the multiplicativity condition for valuations?</p>",
        "id": 435479856,
        "sender_full_name": "Scott Carnahan",
        "timestamp": 1714085928
    },
    {
        "content": "<p>The valuations used in the theory of adic spaces/perfectoid spaces can be higher rank but they need to satisfy the strong version of multiplicativity, which might be one reason that we have things set up as they are now. In particular I don't think we can change the definition to allow submultiplicativity because we need the version as stated. I don't really understand your example in some sense. If you're just computing the order of vanishing then maybe implicitly you're putting a norm on R with |0|=0 and |r|=1 for r nonzero and for me it feels like that's a bit weird because that's a poorly-behaved norm already, even before we start talking about laurent series. Are these higher rank seminorms actually useful anywhere? Note that we have the degree of a polynomial and that's also not well-behaved for the same reason but we just made an API for degree of a polynomial rather than introducing a new abstraction.</p>",
        "id": 435486043,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714090551
    },
    {
        "content": "<p>Thank you for thinking about it.  I don't have a concrete application in mind - I was asking out of curiosity.</p>",
        "id": 435525497,
        "sender_full_name": "Scott Carnahan",
        "timestamp": 1714114614
    }
]