[
    {
        "content": "<p>One can extend Lean's parser with <code>syntax</code> commands. I wonder if there is a function that would allow us to run these parsers defined through <code>syntax</code> on external files, so if for instance I embed a DSL in Lean, I'm able to use this same parser to parse external files.</p>",
        "id": 538596349,
        "sender_full_name": "Ayhon",
        "timestamp": 1757493610
    },
    {
        "content": "<p>Yes, it's possible to run parsers on files or strings.</p>\n<p>It's easiest to do at compile time (e.g. define a command that loads an external file and parses it, creating some top-level declarations that you can make use of later in the file).</p>\n<p>It's possible to create compiled executables that parse at run time too, but then you need a way to make all the parser descriptions be available. One way is to embed Lean and load your module to create an environment object with all the loaded parsers. Another approach is to turn those parsers into equivalent compiled code; for that see <span class=\"user-mention\" data-user-id=\"315577\">@Mac Malone</span>'s <a href=\"https://github.com/tydeu/lean4-partax\">Partax</a> library. I haven't used it myself, but it's a solid concept.</p>",
        "id": 538690315,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1757520367
    },
    {
        "content": "<p>I talked today with Ulrich in the Lean Office Hours and he recommended I look into<br>\n<a href=\"https://github.com/leanprover/lean4/blob/e96467f5002618cb7057a58f3b2b5552d0eb3d2e/src/Lean/Parser/Module.lean#L202-L204\"><code>testParseFile</code></a> and <a href=\"https://github.com/leanprover/lean4/blob/e96467f5002618cb7057a58f3b2b5552d0eb3d2e/src/Lean/Environment.lean#L2099\"><code>importModules</code></a> to generate an environment where the parsers are loaded. He did also mention some other library going on a different direction, but I didn't get a name, so thank you for sending it my way! So far I don't need anything too professional, so just having a way to actually parse at runtime file would suffice. I'll look into Partax though, it seems interesting</p>",
        "id": 538696750,
        "sender_full_name": "Ayhon",
        "timestamp": 1757522367
    },
    {
        "content": "<p>Just to check, what does \"at run time\" mean to you? In a compiled application? Or while compiling a Lean file? The second one is the easier one, what I called \"at compile time\".</p>",
        "id": 538699973,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1757523497
    },
    {
        "content": "<p>At run time to me means that I can give the parsing function a variable with a file path, instead of using a string literal. That is, a compiled application is able to use the function to parse an arbitrary file</p>",
        "id": 538702536,
        "sender_full_name": "Ayhon",
        "timestamp": 1757524370
    },
    {
        "content": "<p>There's also <a href=\"https://leanprover-community.github.io/mathlib4_docs/Lean/Parser/Extension.html#Lean.Parser.runParserCategory\">Lean.Parser.runParserCategory</a> if you want to read from a string, and you can even specify syntax category.</p>",
        "id": 538907815,
        "sender_full_name": "Jakub Nowak",
        "timestamp": 1757609887
    },
    {
        "content": "<p>But you still need to create Environment which I didn't find out how to do.</p>",
        "id": 538907932,
        "sender_full_name": "Jakub Nowak",
        "timestamp": 1757609930
    },
    {
        "content": "<p>Or you can run it inside macro, in which case you just get access to current environment. But it means that the input will be parsed in you current environment with all the declarations. Depending on what you want to do, maybe it's not a problem though.</p>",
        "id": 538908205,
        "sender_full_name": "Jakub Nowak",
        "timestamp": 1757610027
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"870257\">@Jakub Nowak</span> Getting an environment is indeed the tricky part if the goal is creating a compiled executable. You need the executable to include Lean itself, then build an environment by importing the appropriate modules. This is what Ayhon is going for.</p>\n<p>Your suggestions would work for things done at compile time (i.e. running parsers while evaluating commands while Lean is compiling a file).</p>",
        "id": 538913101,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1757611878
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"870257\">Jakub Nowak</span> <a href=\"#narrow/channel/217875-Is-there-code-for-X.3F/topic/Parsing.20external.20file.20with.20Lean.20.60syntax.60.20parsers/near/538907932\">said</a>:</p>\n<blockquote>\n<p>But you still need to create Environment which I didn't find out how to do.</p>\n</blockquote>\n<p>This was answered to me by Sebastian Ulrich, he said there's an <code>importModules</code> function which I could use. I haven't figure out how to use it yet, but it seems like it's implementation is in the C++ side of Lean, according to GitHub code search. I need to spend some time into it</p>",
        "id": 538929501,
        "sender_full_name": "Ayhon",
        "timestamp": 1757618589
    },
    {
        "content": "<p>Otherwise, <code>Partax</code> may be a good replacement, looking at the README it seems promising and not difficult to use.</p>",
        "id": 538929625,
        "sender_full_name": "Ayhon",
        "timestamp": 1757618630
    },
    {
        "content": "<p>You could try taking something like <a href=\"https://github.com/leanprover-community/repl\">https://github.com/leanprover-community/repl</a> and stripping out everything you don't need. I mention it because it's an example of a compiled program that imports modules and manipulates an environment. Make sure to take note of <code>supportInterpreter</code> in the lakefile.</p>\n<p>If <code>Partax</code> works, then that's simpler, since you can create a self-contained executable. No need to distribute your executable with compiled oleans, etc.</p>",
        "id": 538933892,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1757620483
    },
    {
        "content": "<p>Is this related to <a class=\"stream-topic\" data-stream-id=\"217875\" href=\"/#narrow/channel/217875-Is-there-code-for-X.3F/topic/get.20Parser.20from.20Lean/with/531841630\">#Is there code for X? &gt; get Parser from Lean</a>  ?<br>\nPartax is what I need?</p>",
        "id": 538959762,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1757635925
    }
]