[
    {
        "content": "<p>Hi <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> I've been working on a data structure that I've found useful called <code>DisjointSetMap</code>, and I'm curious whether a) something like this already exists in Mathlib, and b) whether it would be a welcome contribution.</p>\n<p><strong>What it is:</strong> A <code>DisjointSetMap k v</code> is a finite collection of pairwise-disjoint nonempty <code>Finset k</code>s, each associated with a value of type <code>v</code>. Mathematically, it's a <em>partial labeled partition</em>: a partition of some finite subset of <code>k</code> where each equivalence class carries a label. Lookup is by element — given <code>key : k</code>, the map finds which partition contains <code>key</code> and returns the associated value.</p>\n<p><strong>How it relates to existing Mathlib structures:</strong></p>\n<ul>\n<li><code>Finpartition</code> partitions a <em>specific</em> finset with no values attached. This structure is a <em>partial</em> partition (doesn't need to cover a fixed set) and each part carries a value.</li>\n<li><code>AList</code>/<code>Finmap</code> map individual keys to values. This maps sets of keys to shared values, with a disjointness invariant.</li>\n<li><code>IndexedPartition</code> works with <code>Set</code>, not <code>Finset</code>, and has no separate value type.</li>\n</ul>\n<p><strong>API surface:</strong></p>\n<ul>\n<li><code>empty</code>, <code>singleton</code>, <code>support</code>, <code>lookup</code>, <code>lookupPart</code></li>\n<li><code>insert</code> (fresh singleton key), <code>erase</code> (remove entire partition containing a key)</li>\n<li><code>mapValues</code> (apply a function to all values)</li>\n<li><code>insertMerging</code> — the distinctive operation: insert a set of keys with a value, automatically merging with any overlapping existing partitions</li>\n</ul>\n<p><strong>Implementation:</strong> List-based (like <code>AList</code>), could be lifted to <code>Multiset</code> for extensional equality (like <code>Finmap</code>).</p>\n<p>Full source: <a href=\"https://gist.github.com/Arrow7000/821b13c0bffe119cd13025610469a554\">https://gist.github.com/Arrow7000/821b13c0bffe119cd13025610469a554</a></p>\n<p>I'd appreciate any feedback on:</p>\n<ol>\n<li>Does this already exist somewhere I haven't looked?</li>\n<li>Would this be in scope for Mathlib? (I realize it's somewhat CS-flavored, but so are <code>AList</code> and <code>Finmap</code>.)</li>\n<li>If so, any suggestions on naming? \"Disjoint set map\" is the CS name; mathematically it's probably closer to a \"partial labeled partition\" or \"valued partial partition\"?</li>\n</ol>\n<p>Thanks <span aria-label=\"folded hands\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"folded hands\">:folded_hands:</span></p>",
        "id": 574018491,
        "sender_full_name": "aron",
        "timestamp": 1771201218
    },
    {
        "content": "<p>Does it have a mathematical application? From what you've said so far I don't see it being in scope for Mathlib.</p>",
        "id": 574080211,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1771238515
    },
    {
        "content": "<p>Ok that makes sense. What about the stdlib? Possibly in a similar place to <code>HashSet</code> or <code>HashMap</code>?</p>\n<p>It's sort of in an in-between place because it's not really a mathematical data structure, it's more geared towards programming. But unlike <code>HashSet</code> and <code>HashMap</code> it's not written for runtime efficiency but for ease of proving. Similarly to e.g. <code>AList</code>s. Is there a place for such data structures in the stdlib?</p>",
        "id": 574082704,
        "sender_full_name": "aron",
        "timestamp": 1771239310
    },
    {
        "content": "<p>Is there any application?</p>",
        "id": 574106568,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1771247516
    },
    {
        "content": "<p>Well yeah it's a useful data structure <br>\n<a href=\"https://en.wikipedia.org/wiki/Disjoint-set_data_structure\">https://en.wikipedia.org/wiki/Disjoint-set_data_structure</a></p>",
        "id": 574108278,
        "sender_full_name": "aron",
        "timestamp": 1771248117
    },
    {
        "content": "<p>I have not looked at your code yet, but based on your wiki link I think <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Batteries.UnionFind#doc\">docs#Batteries.UnionFind</a> might be related.</p>",
        "id": 574108694,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1771248261
    }
]