[
    {
        "content": "<p>I've recently finished working through most of Mathematics in Lean as fun personal study, and I'd like to begin contributing to mathlib. Like many others, I am drawn to the 100 theorems list, so I'd like my contributions to be oriented towards formalizing one of the remaining ones. From a relatively cursory search, I see little discussion of Pick's Theorem in the Zulip and few of the relevant objects defined in mathlib. Is anyone working on Pick's Theorem? If so, what would be the most valuable way for me to start helping to formalize it? If not, would it be appropriate for me to just start defining relevant objects and building up lemmas to try to eventually PR to mathlib?</p>",
        "id": 566008423,
        "sender_full_name": "A. M. Berns",
        "timestamp": 1767314954
    },
    {
        "content": "<p>There may not be much discussion of Pick's theorem, but there <em>is</em> various past discussion of how to define polygons (one of those informal concepts that can end up meaning many different formal things). Once you have a good definition of polygons, you can then link it to measure theory for the area.</p>",
        "id": 566008669,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767315394
    },
    {
        "content": "<p><a class=\"message-link\" href=\"/#narrow/channel/467461-Proofs-from-the-book/topic/Amsterdam/near/482264865\">#Proofs from the book &gt; Amsterdam @ 游눫</a> has my suggestions for how API for polygons should be set up.</p>",
        "id": 566008721,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767315472
    },
    {
        "content": "<p>As for areas, there are various past discussions of how it would make sense in general to use 2-dimensional Hausdorff measure for areas (so you can talk about areas of surfaces, or relate the volume of a tetrahedron to the area of a face without needing to move back and forth between spaces and subspaces). And, consequently, of Hausdorff measure normalization since the definition we have doesn't match Lebesgue measure when using the Euclidean metric (it does when using the sup metric). <em>But</em> for an intrinsically two-dimensional leaf result such as Pick's theorem, it's probably reasonable enough to use Lebesgue measure directly rather than getting into the Hausdorff measure issues. And since Pick is explicitly about lattice polygons, it's probably also reasonable to do it directly in <code>EuclideanSpace</code> rather than an arbitrary affine space for a real inner product space, in which case you don't run into the issue of not having the appropriate instances for <code>volume</code> on an affine space.</p>",
        "id": 566009232,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767315816
    },
    {
        "content": "<p>Though for defining a general concept of \"area of a polygon\", the Hausdorff measure definition would be the desirable one to be meaningful for a polygon whose vertices are coplanar but where the ambient space is of more than two dimensions.</p>",
        "id": 566009411,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767316054
    },
    {
        "content": "<p>Thank you for the replies! To confirm I'm reading you right, it would be at least a productive start to define polygons very minimally, but then work essentially exclusively in EuclideanSpace and with the simpler Lebesgue version of area and start defining basic properties and building up basic theorems about specifically polygons in <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi mathvariant=\"double-struck\">R</mi><mn>2</mn></msup></mrow><annotation encoding=\"application/x-tex\">\\R^2</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8141em;\"></span><span class=\"mord\"><span class=\"mord mathbb\">R</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8141em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">2</span></span></span></span></span></span></span></span></span></span></span>?</p>",
        "id": 566009515,
        "sender_full_name": "A. M. Berns",
        "timestamp": 1767316247
    },
    {
        "content": "<p>Yes. I think using <code>EuclideanSpace</code> makes sense for those geometry results that explicitly refer to coordinates, which includes Pick's theorem since it's about polygons with integer vertex coordinates (whereas geometry results not involving coordinates belong in a more general affine space context). And I expect the main results needed about areas to be (a) the area of a triangle with integer vertices not containing any integer points except for its vertices is always 1/2 and (b) that joining two polygons with disjoint interiors along their shared edges adds their areas - which should be straightforward to transfer from one measure to another once you have a lemma that the two measures agree. (Probably plus lots of small API lemmas I haven't thought of.)</p>",
        "id": 566009721,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767316596
    },
    {
        "content": "<p>When building up basic lemmas / definitions about polygons (you probably need a lot that don't mention area at all), at least consider what the actual requirements for each result are - don't restrict the ambient space to the Euclidean plane for lemmas that don't need it.</p>",
        "id": 566009755,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767316680
    },
    {
        "content": "<p>I feel like it's going to be really painful to try and deal with areas of polygons without having the Jordan curve theorem.</p>",
        "id": 566191613,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1767492660
    },
    {
        "content": "<p>It is possible to define the area of a polygon independently of any topological constraints, via the shoelace formula. This also gives semi-sensible results for non-simple polygons. But of course, proving that this matches the Lebesgue measure of the interior of a simple polygon is another thing entirely.</p>",
        "id": 566191674,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1767492744
    },
    {
        "content": "<p>(In fact, it's even possible to define the volume of a general polytope without regards for topology. I did that in this <a href=\"https://polytope.miraheze.org/wiki/Blog:Volume_(reprise)\">random blog post</a> two years ago.)</p>",
        "id": 566191764,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1767492870
    },
    {
        "content": "<p>Map the polygon to the affine subspace spanned by the vertices (in the general case where the vertices are coplanar but the ambient space is possibly of higher dimension), take the union of the bounded connected components of the complement of the boundary of the polygon, and take the area of that. That's a mathematically at least somewhat reasonable definition, and it doesn't depend on the Jordan curve theorem to write down the definition, just to turn \"union of the bounded connected components\" into \"the single bounded connected component (whose boundary is the boundary of the polygon)\".</p>",
        "id": 566192246,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767493692
    },
    {
        "content": "<p>Of course then you need to figure out how to go between such a definition based on Lebesgue measure and whatever is most convenient for proving Pick's theorem (or any other result about areas you want to prove).</p>",
        "id": 566192454,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767494035
    },
    {
        "content": "<p>Do note that the shoelace formula doesn't match the \"union of bounded connected components\" formula in the case of most non-simple polygons. Shoelace counts the area of each region depending on its winding number.</p>",
        "id": 566192606,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1767494317
    },
    {
        "content": "<p>For a non-planar polygon, the shoelace formula can be used to give you a multivector-valued result, though that's probably nothing more than a mathematical curiosity.</p>",
        "id": 566192710,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1767494523
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"266253\">Joseph Myers</span> <a href=\"#narrow/channel/217875-Is-there-code-for-X.3F/topic/Pick's.20Theorem/near/566192246\">said</a>:</p>\n<blockquote>\n<p>Map the polygon to the affine subspace spanned by the vertices (in the general case where the vertices are coplanar but the ambient space is possibly of higher dimension), take the union of the bounded connected components of the complement of the boundary of the polygon, and take the area of that. That's a mathematically at least somewhat reasonable definition, and it doesn't depend on the Jordan curve theorem to write down the definition, just to turn \"union of the bounded connected components\" into \"the single bounded connected component (whose boundary is the boundary of the polygon)\".</p>\n</blockquote>\n<p>This won't match the shoelace formula, to be clear. Shoelace is the same as the integral of the winding number of the curve with respect to P, over all points P in the plane. That is to say, some regions will be counted more than once, or zero times, or a negative amount of times. Meanwhile your approach just counts every point once or zero times.</p>",
        "id": 570414598,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1769545184
    },
    {
        "content": "<p><a href=\"https://arxiv.org/abs/2405.01793v1\">Pick's theorem was recently formalized in Isabelle/HOL.</a> You could try looking at how they approached it.</p>",
        "id": 570441304,
        "sender_full_name": "James E Hanson",
        "timestamp": 1769556095
    },
    {
        "content": "<p>Shoelace gives signed area, and requires a choice of orientation (of a two-dimensional space containing the vertices) to determine the sign. The topological approach gives unsigned area (and Pick definitely seems to be about unsigned area). Proving that, for a simple polygon, unsigned area is the absolute value of signed area probably has a lot of overlap with proving the polygonal Jordan curve theorem.</p>",
        "id": 570441369,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1769556133
    }
]