[
    {
        "content": "<p>Hey, I want to formalize results from reverse mathematics and I have been stuck at the problem of controlling what quantifiers can a logical formula have. Of course I could just define a deep embedding of the logic I am formalizing, so using String for variable names and writing code for binding quantifiers to variables etc., but I still hope I could use Lean's (or other prover's) mechanisms to reason about variable names etc. But Lean's prop doesn't allow us to narrow our reasoning to only logical formulas which have no quantifiers (open formulas), or have only universal quantifiers, or they only have a block of existential quantifiers, then a block of universal quantifiers and then no further quantifiers etc. </p>\n<p>One idea I had was to define a type ExistentialFormula (String varname) (OpenFormula formula) := Exists varname such that formula(varname). But it requires me to formalize 'OpenFormula' and I just can't get around it. Do you have any idea how to take a subset of Prop, which doesn't allow quantification? Thanks! :)</p>",
        "id": 516624774,
        "sender_full_name": "Paweł Balawender",
        "timestamp": 1746610748
    },
    {
        "content": "<p>Depending on what exactly you want to formalize, you can take a look at <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=FirstOrder.Language.BoundedFormula.IsQF#doc\">docs#FirstOrder.Language.BoundedFormula.IsQF</a> (the deep embedding you talk about has already been done in some sense)</p>",
        "id": 516629333,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1746611959
    },
    {
        "content": "<p>Otherwise, I'm fairly confindent you will not be able to state any meta-theore about <code>Prop</code> of the kind you'd need.</p>",
        "id": 516629769,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1746612027
    },
    {
        "content": "<p>Wow! it even accepts Language as an argument, which is what I need. This look really promising, thank you!</p>",
        "id": 516629988,
        "sender_full_name": "Paweł Balawender",
        "timestamp": 1746612066
    }
]