[
    {
        "content": "<p>I'm taking an algebra class and I'd like to set about mechanizing some of the theorems we're covering in class and on homeworks and such in Lean. These are usually already in Mathlib. Is there any way to tell Mathlib \"I want to re-prove this theorem, so don't let me use it or anything that depends on it?\"</p>\n<p>Ideally I'd like to be able to use things like <code>simp</code> and <code>simp?</code> and what not. Right now I've just been porting over my paper proofs to Lean, to make sure I don't have any circularity, but I'd like to try out using Lean for <em>writing</em> the proofs, too. </p>\n<p>Are there any features for non-circularity like this that exist already? Do you all have any advice on how to best approach re-mechanizing existing proofs? I was considering taking an approach like what Tao's Analysis does, but this commits me to mechanizing (or at least formulating) <em>everything</em> we cover in the course and I don't know if I'll be able to do all of that in my spare time.</p>",
        "id": 540325619,
        "sender_full_name": "JJ",
        "timestamp": 1758232071
    },
    {
        "content": "<p>well it's an exercise to yourself and you could just not use some of the theorems</p>",
        "id": 540326015,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1758232204
    },
    {
        "content": "<p>The problem is that other theorems can depend on the theorem I am proving, and I might accidentally use them. It's fairly easy (though still a pain) to avoid using <em>exactly</em> what I am proving.</p>",
        "id": 540326042,
        "sender_full_name": "JJ",
        "timestamp": 1758232223
    },
    {
        "content": "<p>you could also not <code>import Mathlib</code> but rather import some parts</p>",
        "id": 540326098,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1758232257
    },
    {
        "content": "<p>well <code>simp?</code> tells you what theorems you're using</p>",
        "id": 540326135,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1758232282
    },
    {
        "content": "<p>Yes, I'm aware <span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 540326163,
        "sender_full_name": "JJ",
        "timestamp": 1758232310
    },
    {
        "content": "<p>(hm. maybe i should have posted this in <a class=\"stream\" data-stream-id=\"113489\" href=\"/#narrow/channel/113489-new-members\">#new members</a> or <a class=\"stream\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general\">#general</a> ?)</p>",
        "id": 540328878,
        "sender_full_name": "JJ",
        "timestamp": 1758233068
    },
    {
        "content": "<p>Unfortunately, no, there's no good way to avoid transitive dependencies on a lemma like that. You can remove individual lemmas from the <code>simp</code> pool by using <code>attribute [-simp]</code>, but otherwise, I don't think so.</p>",
        "id": 540683110,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1758486965
    },
    {
        "content": "<p>Not a good and systematic way, but you can always check that the Mathlib lemma you want to use doesn't exist with the set of files that you have imported.</p>",
        "id": 540740179,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1758530184
    },
    {
        "content": "<blockquote>\n<p>I was considering taking an approach like what Tao's Analysis does, but this commits me to mechanizing (or at least formulating) <em>everything</em></p>\n</blockquote>\n<p>It works reasonably well in Tao's Analysis (though there are exceptions like absolute value for some reason is imported from mathlib). Technically, you just need the nearest definition to the theorem you are doing, e.g. if you want to prove something about reals, you can build custom reals from sequences of mathlib rationals (you don't necessarily need custom rationals).</p>",
        "id": 540913122,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1758588908
    }
]