[
    {
        "content": "<p>I've heard people mention Aristotle, Gauss, and maybe a few other ones? Which ones do people use? What is their availability for the public / how did you get access?</p>",
        "id": 540488896,
        "sender_full_name": "Ryan Smith",
        "timestamp": 1758297713
    },
    {
        "content": "<p>I have been wondering about this too. I use GitHub copilot in VsCode and Claude by copy / paste. I am interested in try some of these fancier tools but also not interested in super-experimental ones (should be better than copilot auto completion to be worth it)</p>",
        "id": 540539288,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1758319978
    },
    {
        "content": "<p>Btw, most frustrating thing about Claude is how often it hallucinates mathlib theorem names.</p>",
        "id": 540539396,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1758320062
    },
    {
        "content": "<p>I tried Copilot via VSCode but found that I usually end up accepting an autocompletion and then deleting and rewriting most of it myself, so I went back to typing up theorems by hand the old-fashioned way since Copilot wasn't really saving me any time overall</p>",
        "id": 540539822,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1758320428
    },
    {
        "content": "<p>when I have a math question I go to AI to ask the answer and it gives me a wrong proof/counterexample and I point out a mistake and it gives me another wrong response and usually after about 10 iterations it's got something correct or I give up and try thinking on my own or asking a human or looking on mathstackexchange or something else</p>",
        "id": 540539962,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1758320543
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"816344\">Aaron Liu</span> <a href=\"#narrow/channel/217875-Is-there-code-for-X.3F/topic/Publicly.20available.20assistants.20for.20lean/near/540539822\">said</a>:</p>\n<blockquote>\n<p>I tried Copilot via VSCode but found that I usually end up accepting an autocompletion and then deleting and rewriting most of it myself, so I went back to typing up theorems by hand the old-fashioned way since Copilot wasn't really saving me any time overall</p>\n</blockquote>\n<p>Just curious, do you delete it and rewrite it mostly to golf it, or is it because it isn't even close to compiling the right term correctly?</p>",
        "id": 540555955,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1758339135
    },
    {
        "content": "<p>I don't remember</p>",
        "id": 540556126,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1758339360
    },
    {
        "content": "<p>I think it was probably both</p>",
        "id": 540556136,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1758339365
    },
    {
        "content": "<p>I refuse to use Copilot out of spite</p>",
        "id": 540622161,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1758415516
    },
    {
        "content": "<ol>\n<li>I just use Cursor and delete .gitignore so the agent reads mathlib. With the gpt-5 model it works well enough to make me more productive</li>\n<li>No model can help you if you're weak at Lean. If you are weak at Lean, practice more</li>\n</ol>",
        "id": 540635451,
        "sender_full_name": "(deleted)",
        "timestamp": 1758435480
    },
    {
        "content": "<p>To be good at Lean conceptual understanding isn't enough you need a thoroughly rewired brain :)) AI agents are slow, you should use them when you're busy doing something else, for example eating, going out with friends, watching a movie</p>",
        "id": 540635526,
        "sender_full_name": "(deleted)",
        "timestamp": 1758435603
    },
    {
        "content": "<p>And you should use remote desktop so you can babysit the agent when you're on your phone</p>",
        "id": 540635543,
        "sender_full_name": "(deleted)",
        "timestamp": 1758435618
    },
    {
        "content": "<p>With proper use you can double your productivity</p>",
        "id": 540635587,
        "sender_full_name": "(deleted)",
        "timestamp": 1758435684
    },
    {
        "content": "<p>Remember to delete .gitignore and specifically tell the agent to look into the .lake folder. This is very important. And if your computer is slow get a better computer. AI agents don't like slow computers</p>",
        "id": 540635739,
        "sender_full_name": "(deleted)",
        "timestamp": 1758435841
    },
    {
        "content": "<p>Cursor's autocomplete remains way better than Copliot's.</p>",
        "id": 540651753,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1758454651
    },
    {
        "content": "<p>With sufficiently prompting Claude code in --dangerously-skip-permissions mode can do some nontrivial things. It guesses theorem names a lot but can usually find the correct one after it reads the diagnostics and starts grepping in Mathlib.</p>",
        "id": 540651845,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1758454771
    },
    {
        "content": "<p>I've found the chat interfaces in copilot and cursor much less capable than Claude Code. I've had occasional good results from Codex, but haven't yet tried the in-IDE version.</p>",
        "id": 540651920,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1758454872
    }
]