[
    {
        "content": "<p>Support for singular value decomposition in LEAN. I am trying to utilize LEAN to formalize the infrastructure needed to do proofs for Quantum. Is there support for singular value decomposition in Lean, and has anyone worked with the formalization of quantum in LEAN?</p>",
        "id": 514746832,
        "sender_full_name": "Jam Kabeer Ali Khan",
        "timestamp": 1745827537
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"742900\">@Jam Kabeer Ali Khan</span> ! Can you be a bit more descriptive about what you mean by 'Quantum'? We have things related to quantum mechanics in <a href=\"https://github.com/HEPLean/PhysLean\">PhysLean</a>, but I'm not sure if this is what you mean.</p>",
        "id": 514755624,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1745830019
    },
    {
        "content": "<p>Regarding SVD there was at one point this: <a href=\"https://github.com/leanprover-community/mathlib4/pull/6042\">#6042</a>, <br>\nand related discussion at: <a class=\"stream-topic\" data-stream-id=\"144837\" href=\"/#narrow/channel/144837-PR-reviews/topic/PR.20.236042.20Singular.20Value.20Decomposition/with/377430276\">#PR reviews &gt; PR #6042 Singular Value Decomposition</a></p>",
        "id": 514756402,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1745830249
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"653351\">@Joseph Tooby-Smith</span>, yes sure. So, I need to formalize some notion of predicates, in a logic, which are density operators in Hilbert spaces, but using extended positive reals for eigenvalues in the spectral decomposition. What I am trying to understand is whether there is enough support in Lean to formalize this. So, I am looking for the infrastructure for this formalization. Here is a reference in Coq for things I need: <a href=\"https://github.com/coq-quantum/CoqQ/blob/main/src/quantum.v\">quantum.v</a>, and <a href=\"https://github.com/coq-quantum/CoqQ/blob/main/src/svd.v\">svd.v</a> (both files have some docs on top to give u a basic idea). In summary, I need the notion of projections, density operators, Hilbert spaces, etc. Thanks for the help! Apologize if I am not clear enough, and lemme know if u need more context.</p>",
        "id": 514762221,
        "sender_full_name": "Jam Kabeer Ali Khan",
        "timestamp": 1745831817
    },
    {
        "content": "<p>Ok, thanks for your explanation. This makes sense to me (although I can't open the second file you linked to).<br>\nMathlib has Hilbert spaces, and it would not surprise me if someone had defined density operators somewhere in Lean, but I am not sure of any places of the top of my head.</p>\n<p>This is something which would be nice to have in PhysLean at some point, so if you'd be interested in contributing there, that would be great :).</p>",
        "id": 514764553,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1745832404
    },
    {
        "content": "<p>Oh, I fixed the link. Yes, we found Hilbert spaces in Mathlib, and so far, couldn't find much related to the density operators. Yes, we plan to add this to MathLib or PhysLean if we decide to go for Lean instead of Coq, but so far it seems we need the notion of singular value decomposition for spectral decomposition and this Coq has for now.</p>",
        "id": 514766865,
        "sender_full_name": "Jam Kabeer Ali Khan",
        "timestamp": 1745833020
    },
    {
        "content": "<p>Do you need this in finite or infinite dimensional spaces?</p>",
        "id": 514807403,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1745845161
    },
    {
        "content": "<p>This is finite dimensional</p>",
        "id": 514807468,
        "sender_full_name": "Jam Kabeer Ali Khan",
        "timestamp": 1745845178
    },
    {
        "content": "<p>In that case, I recommend resurrecting <a href=\"https://github.com/leanprover-community/mathlib4/pull/6042\">#6042</a></p>",
        "id": 514832135,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1745851147
    },
    {
        "content": "<p><a href=\"https://github.com/Timeroot/Lean-QuantumInfo\">https://github.com/Timeroot/Lean-QuantumInfo</a><br>\nhas density operators, spectra of states, unitary decomposition, some things about CPTP maps</p>",
        "id": 514863591,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1745859840
    },
    {
        "content": "<p>I don't know how you can have \"extended positive reals for eigenvalues\" in a density operator in a finite-dimensional space, given that they (presumably) need to add to 1 - or in some versions that I've seen, a trace in the interval [0,1].</p>",
        "id": 514863919,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1745859934
    },
    {
        "content": "<p>Actually, you say SVD, but for quantum mechanics you should (typically?) only need the eigenvalue decomposition, which is already there in Mathlib.</p>",
        "id": 514864286,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1745860029
    }
]