[
    {
        "content": "<p>I am searching theorems to prove that S-integers of fraction fields of Dedekind domains are Dedekind domains. <br>\nI have read the file <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/RingTheory/DedekindDomain/SInteger\">docs#SInteger</a>, but I don't find theorems related to this proposition. Does it already exist in Mathlib somewhere or it can be proved by theorems in Mathlib ?</p>",
        "id": 385943751,
        "sender_full_name": "Yelong Hua",
        "timestamp": 1692373054
    },
    {
        "content": "<p>Yeah, I don't think anything happened there since <a href=\"https://github.com/leanprover-community/mathlib/pull/15646\">!3#15646</a>, so that's all mathlib knows about them. Maybe <span class=\"user-mention\" data-user-id=\"406490\">@María Inés de Frutos Fernández</span> or <span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> know more</p>",
        "id": 385944784,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1692373496
    },
    {
        "content": "<p>Mathlib knows that a localization of a Dedekind domain is Dedekind <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=IsLocalization.isDedekindDomain#doc\">docs#IsLocalization.isDedekindDomain</a> However, it hasn't been proven yet that the S-integers are a localization, see <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/Intersection.20of.20localisations/near/302879610\">thread</a></p>",
        "id": 385945137,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1692373640
    },
    {
        "content": "<p>CC <span class=\"user-mention\" data-user-id=\"464700\">@David Ang</span></p>",
        "id": 385946619,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1692374235
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224323\">@Junyan Xu</span> do you plan to PR your proof of <code>mem_integers_of_valuation_le_one</code>? I haven't been following this for a while</p>",
        "id": 385947120,
        "sender_full_name": "David Ang",
        "timestamp": 1692374424
    },
    {
        "content": "<p>Originally the S-integer file was meant to be API for Dirichlet's S-unit theorem, but seems like <span class=\"user-mention\" data-user-id=\"488648\">@Xavier Roblot</span> have proved Dirichlet's (empty)-unit theorem without needing this. I currently have no plans to prove that the S-integers are a Dedekind domain, but it's certainly nice to have it in this file.</p>",
        "id": 385947555,
        "sender_full_name": "David Ang",
        "timestamp": 1692374570
    },
    {
        "content": "<blockquote>\n<p>do you plan to PR your proof of mem_integers_of_valuation_le_one?</p>\n</blockquote>\n<p>I think It would make more sense to PR together with the localization result. I hadn't tried much but I felt (as I mentioned in the thread) it's unnecessarily complicated to work with factorization into ideals which might make it hard to make progress, so I proposed some refactorings but didn't actually proceed to do them.</p>",
        "id": 385948094,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1692374746
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"224323\">Junyan Xu</span> <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/S-integers.20of.20a.20Dedekind.20domain.20is.20also.20a.20Dedekind.20domain/near/385945137\">said</a>:</p>\n<blockquote>\n<p>Mathlib knows that a localization of a Dedekind domain is Dedekind <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=IsLocalization.isDedekindDomain#doc\">docs#IsLocalization.isDedekindDomain</a> However, it hasn't been proven yet that the S-integers are a localization, see <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/Intersection.20of.20localisations/near/302879610\">thread</a></p>\n</blockquote>\n<p>Sorry, my math is not very good. Is S-integers really a localization? I only know this holds over number fields and I'm not aware of the situation for general Dedekind domains.</p>",
        "id": 385951302,
        "sender_full_name": "Yelong Hua",
        "timestamp": 1692376049
    },
    {
        "content": "<p>Hmm, you have a good point. I think it doesn't even hold over number fields. In the linked thread I have a statement that goes the other way: any localization of a Dedekind domain coincides with the S-integers for some S. <del>But to go the other way, e.g. when S consists of a single non-principal prime, is impossible.</del> (Edit: Oh sorry it's actually okay since a prime in a number field is of finite order in the class group.) From a geometric point of view, the spectrum of the S-integers in this case is just the spectrum of the original Dedekind domain minus a point, so it's just an open subscheme so it will remain regular if the original spectrum is. If we prove <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=IsDedekindDomainDvr#doc\">docs#IsDedekindDomainDvr</a> is equivalent to <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=IsDedekindDomain#doc\">docs#IsDedekindDomain</a>, we should be able to produce the result you want via this route, but maybe a more direct proof is quicker.</p>",
        "id": 385960251,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1692380034
    },
    {
        "content": "<p>Hmm if S is infinite I think the S-integers are probably not finitely generated over the original Dedekind domain and not noetherian so not a Dedekind domain. If S is finite then it's probably noetherian (what's a short proof?) and then we can use <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=isDedekindDomainInv_iff#doc\">docs#isDedekindDomainInv_iff</a> and show that all nonzero fractional ideals in the S-integers are invertible. Any fractional ideal in the S-integers is finitely generated by noetherianity, so they generate a fractional ideal in the original Dedekind domain, and the fractional ideal in the S-integers generated by the inverse of this fractional ideal will be the inverse of the original fractional ideal.</p>",
        "id": 385969487,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1692384239
    },
    {
        "content": "<p>Thanks for your reply. I only want to consider the case when S is finite. Regarding the first approach, I feel that it's not easy to show that the localization of S-integers at each prime ideal is the same as the localization of the original ring. As for the second approach, the <a href=\"https://en.wikipedia.org/wiki/Krull%E2%80%93Akizuki_theorem\">Krull–Akizuki theorem</a> can establish the Noetherian property of S-integers. Are there any theorems related to the Krull–Akizuki theorem in Mathlib?</p>",
        "id": 386029120,
        "sender_full_name": "Yelong Hua",
        "timestamp": 1692411920
    },
    {
        "content": "<p>Oh I actually <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/Intersection.20of.20localisations/near/310744963\">mentioned Krull-Akizuki back then</a> but I totally forgot what it's about. So the ring of S-integers is still noetherian even if S is infinite, and my argument above should show it's Dedekind. I feel it's my math that is not very good <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> I should have considered the simplest example Z, in which if you invert infinitely many primes the result is not f.g. over Z but still a localization hence noetherian and Dedekind.</p>\n<p>I think no one has done Krull-Akizuki yet, and the proof looks nontrivial and might be hard for a new contributor, but I'd offer my support if anyone choose to do it! An important application is to show the integral closure of a Dedekind domain in a finite extension of its fraction field is Dedekind, which has been proven for separable extensions in mathlib (<a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=integralClosure.isDedekindDomain#doc\">docs#integralClosure.isDedekindDomain</a>), but I just found it <a href=\"#narrow/stream/116395-maths/topic/Dedekind.20domains/near/207746488\">may have also been done in the inseparable case</a>. Let me confirm with <span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span> : was it really done? If yes then there's one less motivation for Krull-Akizuki unfortunately ...</p>",
        "id": 386045333,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1692421320
    },
    {
        "content": "<p>I suspect only the separable case has been done. But even if it hasn't, Krull Akizuki gives a nice uniform proof that doesn't require the case split.</p>",
        "id": 386136516,
        "sender_full_name": "Thomas Browning",
        "timestamp": 1692471379
    },
    {
        "content": "<p>I've not thought this through so excuse my ignorance. For a general Dedekind domain if S contains one prime P whose Frobenius has infinite order then you can talk about the subring of S-integers in the field of fractions but is this a localisation ring-theoretically?</p>",
        "id": 386208617,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1692527255
    },
    {
        "content": "<p>Oh I see -- then the S-integers are just the integers again :-) You are localising at the set of divisors of P^n but this set only contains units</p>",
        "id": 386208720,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1692527343
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"224323\">Junyan Xu</span> <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/S-integers.20of.20a.20Dedekind.20domain.20is.20also.20a.20Dedekind.20domain/near/386045333\">said</a>:</p>\n<blockquote>\n<p>An important application is to show the integral closure of a Dedekind domain in a finite extension of its fraction field is Dedekind, which has been proven for separable extensions in mathlib (<a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=integralClosure.isDedekindDomain#doc\">docs#integralClosure.isDedekindDomain</a>), but I just found it <a href=\"#narrow/stream/116395-maths/topic/Dedekind.20domains/near/207746488\">may have also been done in the inseparable case</a>. Let me confirm with <span class=\"user-mention silent\" data-user-id=\"238446\">Anne Baanen</span> : was it really done? If yes then there's one less motivation for Krull-Akizuki unfortunately ...</p>\n</blockquote>\n<p>We have only done the separable case, so Krull-Akizuki is still going to be very useful :)</p>",
        "id": 386331664,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1692606112
    }
]