[
    {
        "content": "<p>I'm interested in implementing some computational geometry algorithms (like polygon union and intersection or determining whether a point is in a polygon) and proving their correctness. To do so, I need basic primitives like adding a vector to a point, comparing the distances between points, sorting line segments by angle, determining which side of a line a point is on, and so on.</p>\n<p>Since I care about computation, everything needs to be decidable (and ideally, fast!). I also want to parameterize on the ground field so that I can have coordinates in $\\Q[\\sqrt{2}}$ for example.</p>\n<p>The linear algebra and euclidean geometry machinery in mathlib seems too heavy for this task (but maybe not?). These primitives shouldn't be too hard to implement by hand, just representing a point as a pair of coordinates, but I'm imagining that the proofs might require machinery that would be tedious and/or difficult to implement.</p>\n<p>Any suggestions on how I should proceed? Are there simple 2D geometry libraries that I could use?</p>",
        "id": 427989398,
        "sender_full_name": "Michael George",
        "timestamp": 1710958189
    },
    {
        "content": "<p>Hey!</p>\n<blockquote>\n<p>The linear algebra and euclidean geometry machinery in mathlib seems too heavy for this task</p>\n</blockquote>\n<p>I don't think so, at least for the basic operations. You can use <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=AddTorsor#doc\">docs#AddTorsor</a> to add vectors to points and that will be computationally nice and all. Sorting lines by angles will be annoying and noncomputable) with the mathlib machinery though, so you'll have to do that yourself.</p>\n<blockquote>\n<p>Are there simple 2D geometry libraries that I could use?</p>\n</blockquote>\n<p>Not really, no. There's the very general geometry development in mathlib and then some axiomatic geometry developments outside it, like geolean which is meant to be a port of geocoq.</p>",
        "id": 428021214,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1710971390
    },
    {
        "content": "<p>Where is <em>geolean</em>? I could not find it with a google search</p>",
        "id": 428041413,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1710983571
    },
    {
        "content": "<p>See eg <a href=\"#narrow/stream/116395-maths/topic/tarski.20axiom.20geometry/near/391771428\">https://leanprover.zulipchat.com/#narrow/stream/116395-maths/topic/tarski.20axiom.20geometry/near/391771428</a></p>",
        "id": 428076254,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1711009179
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"479299\">@Jovan Gerbscheid</span> because I'm sure you will find this interesting</p>",
        "id": 428083281,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1711012030
    },
    {
        "content": "<p>I haven't dabbled into computational geometry myself, just geometry proving without a model.</p>",
        "id": 428241164,
        "sender_full_name": "Jovan Gerbscheid",
        "timestamp": 1711068075
    }
]