[
    {
        "content": "<p>My name is Felix and I'm a PhD Student at the University of Zurich . I've been interested in formal proof verification for some time now and since I currently have some free time, I am planning to (or at least try to) formalise some results in etale cohomology. I'm reaching out because I was hoping you could point me in the right direction regarding what is already formalised and where to start.</p>",
        "id": 545509098,
        "sender_full_name": "Felix Sefzig",
        "timestamp": 1760688930
    },
    {
        "content": "<p>I think one interesting question is whether we are already at the state where we can give some mathematically correct but completely impractical definition of etale cohomology (\"derive this functor on this site\"), at least for torsion coefficients (unless we want to go proetale from day 1, which is also a question worth talking about). What is the most useful definition if one wants to e.g. compute cohomology of a curve?</p>",
        "id": 545510329,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1760689345
    },
    {
        "content": "<p>Definitions are a very delicate part of formalization. Currently one proposal for the definition of elliptic curve over a scheme is \"base can be covered by affines over which the curve is Proj(y^2z+a1xyz+...+a6z^3=0)\", which is mathematically correct and will make representability theorems (modular curves) much easier, and also avoids having to prove Riemann-Roch! Ultimately the definition \"doesn't matter\" because you prove all definitions give the same answer, but when making basic API (i.e. on the journey to prove the equivalence) the definition matters a lot.</p>",
        "id": 545510871,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1760689510
    },
    {
        "content": "<p>Hello! Good to see more people interested in this topic! This has been asked multiple times before on this Zulip. One thread is here, with a demo on what is currently possible: <a class=\"message-link\" href=\"/#narrow/channel/335062-homology/topic/.C3.89tale.20cohomology/near/535049378\">#homology &gt; Étale cohomology @ 💬</a>.  The short answer is: yes we have all the definitions to write down a group that is the étale cohomology of an étale sheaf.</p>\n<p>A nice next step would be to write down any (interesting) short exact sequence of étale sheafs. The blocker for this is that we don't have any étale sheafs yet. A few possible sources of étale sheafs:</p>\n<ul>\n<li>fpqc is subcanonical: this is done if you piece together things from the <a href=\"https://github.com/chrisflav/proetale\">proetale</a> repository and work by <span class=\"user-mention\" data-user-id=\"425065\">@Yong-Gyu Choi</span>. This is on the PR queue, but things just take time to get in.</li>\n<li>quasi coherent sheafs induce étale sheafs: This is very far from done, because we still have no good API for quasi-coherent sheafs (details in the thread I linked to above). This will eventually need faithfully flat descent, of which a reasonable chunk is in <a href=\"https://github.com/leanprover-community/mathlib4/pull/24434\">#24434</a>.</li>\n<li>locally constant sheafs: this needs sheafification on the small étale site, which is in <a href=\"https://github.com/leanprover-community/mathlib4/pull/19462\">#19462</a>.</li>\n</ul>\n<p>For the proétale site of things, <span class=\"user-mention\" data-user-id=\"611077\">@Jiang Jiedong</span> and I are working on proétale cohomology at the moment (<a href=\"https://github.com/chrisflav/proetale\">https://github.com/chrisflav/proetale</a>). We are working (literally right now) on expanding the blueprint quite a bit, so there are many easy commutative algebra tasks I could point you to if you are interested in that.</p>",
        "id": 545538743,
        "sender_full_name": "Christian Merten",
        "timestamp": 1760698246
    },
    {
        "content": "<p>Generally, we are still missing many important ingredients on étale morphisms. Some that come to my mind right now are:</p>\n<ul>\n<li>étale is locally standard étale (we have étale is locally standard smooth of rel. dim 0)</li>\n<li>flat + unramified implies étale (this should go via \"smooth = flat + smooth on fibres\")</li>\n<li>smooth over a field implies regular</li>\n<li>(strictly) Henselian rings, Henselisation</li>\n</ul>\n<p>If you are interested in any of these, please let me know. There is material on all of these topics spread over the review queue, blocked PRs, the <a href=\"https://github.com/chrisflav/pi1\">Pi1</a> repository and the <a href=\"https://github.com/chrisflav/proetale\">proetale</a> repository, so I can give more detailed instructions if you tell me what you are interested in.</p>\n<p>I can also suggest something more \"sheafy\" if you are more interested in that.</p>",
        "id": 545539965,
        "sender_full_name": "Christian Merten",
        "timestamp": 1760698638
    },
    {
        "content": "<p>Dear Christian, <br>\nthanks for the quick reply,  sounds really exciting!  I would definitely be interested in working on a sheafy project, and then work out the commutative algebra as needed. What did you have in mind?</p>",
        "id": 545582808,
        "sender_full_name": "Felix Sefzig",
        "timestamp": 1760711636
    },
    {
        "content": "<p>If you are willing to assume for now that the étale site is subcanonical (as I said above, this should be available in mathlib in the not-so distant future), you could do Kummer theory, i.e., define the Kummer sequence and show it is an exact sequence of étale sheafs if <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> is invertible.<br>\nI believe this would be quite doable and fun.</p>\n<p>Some other doable and sheafy topics that come to my mind are:</p>\n<ul>\n<li>Show the small étale site of a scheme has enough points: You could start by defining étale neighbourhoods and the stalk functor associated to a geometric point of the base scheme. Then you would have to show that an étale sheaf is zero if and only if all stalks are zero.</li>\n<li>Show the category of abelian sheafs on the classifying site of a pro-finite group <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>G</mi></mrow><annotation encoding=\"application/x-tex\">G</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\">G</span></span></span></span> is equivalent to discrete <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>G</mi></mrow><annotation encoding=\"application/x-tex\">G</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\">G</span></span></span></span>-modules. This would eventually lead to showing a comparison between Galois cohomology and étale cohomology.</li>\n</ul>",
        "id": 546067176,
        "sender_full_name": "Christian Merten",
        "timestamp": 1760986112
    }
]