[
    {
        "content": "<p>Is there anything in Mathlib or well known elsewhere creating a structure for representing common card games, esp. trick taking games, and anything with the game theory of such games?</p>",
        "id": 475686874,
        "sender_full_name": "Anthony Peterson",
        "timestamp": 1728426616
    },
    {
        "content": "<p>Out of curiosity, what would be an example of a Theorem about trick taking games?</p>",
        "id": 475696811,
        "sender_full_name": "Bjørn Kjos-Hanssen",
        "timestamp": 1728432661
    },
    {
        "content": "<p>I want to do some proofs about Euchre because it's a simpler 24 card game, and I grew up playing it in Michigan (and I'm going to try a version with only A-Q cards and 3 cards in each hand).</p>\n<p>There's some very simple theorems you can state, if you consider the value of a node to be the Net of our score - their score (in any 4 player team game, like Euchre or bridge).</p>\n<p>In Euchre, you can swap colors between Black and Red in a situation, and the net score remains the same (up card or trump would be swapped as well). </p>\n<p>You can also swap within colors in Euchre (spades for clubs, or hearts for diamonds), and get the same score. In bridge you can't swap within colors because it affects the majors / minors.</p>\n<p>Player positions only matter relative to the dealer, you can rotate north, south, east, west and the dealer position together and nothing changes.</p>\n<p>The only other exact proofs I can think of, is stuff like: with Left Bower and another trump, you are guaranteed to be able to take at least one trick, and prevent your opponents from getting 5 or a loner.</p>\n<p>There's some more interesting stuff I'd like to prove, that's more probabilistic. I've played players with lifetime experience where they can look at just the information they have and deduce a lot about the situation. It would be interesting to do some probabilistic stuff in team trick-taking games.</p>\n<p>I want to get a good data structure for the hands &amp; overall situation. Obviously, there can't be duplicate cards in a situation, its a permutation.</p>\n<p>In normal Euchre, you have 4 five card hands, and an up card for 21 cards in a situation, and then 3 remaining cards that are face down and never part of play. In my idea of a 3-trick Euchre, you'd have 4 three card hands, plus a up card for 13 cards, plus 3 face down cards.</p>",
        "id": 475699612,
        "sender_full_name": "Anthony Peterson",
        "timestamp": 1728434642
    }
]