[
    {
        "content": "<p>Hi! Is there code to handle unbounded operators? I know there is some basic definitions and theorems (LinearPMap), but particularly, the kind of unbounded operators used in Quantum Mechanics, (essentially) self-adjoint operators in dense domains. I would like to work with these, and be able to mix with other bounded operators in a relatively confortable way. These kind of operators have nice results like real eigenvalues, etc...<br>\nThanks!</p>",
        "id": 538408409,
        "sender_full_name": "Izan Beltran",
        "timestamp": 1757415707
    },
    {
        "content": "<p>We have examples of unbounded operations in PhysLean for quantum mechanics here: <a href=\"https://github.com/HEPLean/PhysLean/tree/master/PhysLean/QuantumMechanics/OneDimension/Operators\">https://github.com/HEPLean/PhysLean/tree/master/PhysLean/QuantumMechanics/OneDimension/Operators</a></p>",
        "id": 538408949,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1757415869
    },
    {
        "content": "<p><code>LinearPMap</code> is the right thing. It still misses a lot, because I stopped working on it, but I was more or less going through a book on spectral theory of unbounded operators and translating it to Lean. I think the adjoint was implemented for <code>LinearPMap</code>, but I could be wrong or it never made it into mathlib.</p>",
        "id": 538570444,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1757482400
    },
    {
        "content": "<p>On the other hand, for a lot of things it might be easier working with operators defined on a smaller space that is dense in L^2, probably the best thing we have at the moment is the Schwartz space.</p>",
        "id": 538570873,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1757482746
    },
    {
        "content": "<p>The problem with the unbounded operators is that you have to check the domains if you want to do arithmetic. I forgot what kind of statement I wanted to prove, but it was some identity involving addition and composition, and it was insanely tedious to get formalized.</p>",
        "id": 538570874,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1757482746
    },
    {
        "content": "<p>Ok, I am not imagining things and self-adjointness did make it in: <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Analysis/InnerProductSpace/LinearPMap.html#LinearPMap.isSelfAdjoint_def\">LinearPMap.isSelfAdjoint_def</a></p>",
        "id": 538588014,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1757490917
    }
]