[
    {
        "content": "<p>I was just wondering if there already existed good tooling to bump old Lean4 versions to the current one. A lot of the simple deprecations and errors can be simply replaced, but for harder theorems you have to update more, so I'm not surprised that there's not much online. Does anyone know of any good tooling for it though?</p>",
        "id": 537368619,
        "sender_full_name": "agniv",
        "timestamp": 1756849382
    },
    {
        "content": "<p>Unfortunately no, there is no automatic tooling. I find it vey helpful to only bump one version at a time, which helps localize problems. (e.g. prepare the PR updating the toolchain as a succession of commits, each advancing the toolchain and dependencies by one Lean version).</p>\n<p>There are some ideas about making this easier, but not yet in the form of tools.</p>",
        "id": 537374526,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756852972
    },
    {
        "content": "<p>honestly I only know how to do it manually. </p>\n<p>check the latest lean version (not necessary) with <code> elan show</code> then update elan <code> elan update </code> then you update your lake toolchain file <code>lake update </code> and that's about it.</p>",
        "id": 537374616,
        "sender_full_name": "Oscar Matemb ⚛️",
        "timestamp": 1756853051
    },
    {
        "content": "<p>More precisely, I recommend:</p>\n<ul>\n<li>advance <code>lean-toolchain</code> to the next version</li>\n<li>check in your lakefile.lean and lakefile.toml to make sure all dependencies are \"pinned\" to a commit or tag that is compatible with that toolchain (for Mathlib, Batteries, Aesop, etc, there is always a tag called e.g. <code>v4.22.0</code>, which is guaranteed to be compatible with that toolchain version)</li>\n<li>run <code>lake update</code></li>\n<li>run <code>lake build &amp;&amp; lake test</code> to fix any errors and warnings</li>\n<li>commit, and proceed to the next version.</li>\n</ul>",
        "id": 537374790,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756853191
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span> is it advisable to this oftenly for every local or remote mathlib project? Also, pinning dependencies to the toolchain for that version to keep it safe from getting lost?</p>",
        "id": 537375198,
        "sender_full_name": "Oscar Matemb ⚛️",
        "timestamp": 1756853504
    },
    {
        "content": "<p>Yes. I would suggest that if you ever intend to run <code>lake update</code> in your project (and you should!) then you should always be using \"pinned\" dependencies (i.e. pointing to a particular tag, rather than a branch).</p>",
        "id": 537379902,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756857314
    },
    {
        "content": "<p>Are there plans to make deprecations auto-replacing like the <code>simp [unused]</code> linter is?</p>",
        "id": 537383133,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1756860144
    },
    {
        "content": "<p>I don't think it's currently on anyone's TODO list. A PR from a contributor, or an issue explaining what is blocking implementation, would be much appreciated.</p>",
        "id": 537383341,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756860287
    },
    {
        "content": "<p>CC <span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> for the current state of helpful tools for bumping</p>",
        "id": 537407772,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756880494
    },
    {
        "content": "<p>I wrote an <code>update_deprecation</code> tool, but it was never used and I don't think that it works anymore.</p>",
        "id": 537409080,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1756881245
    },
    {
        "content": "<p>I may take this project up again, but probably not before a couple of weeks or so.</p>",
        "id": 537409179,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1756881300
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> could I see the tool? it sounds good!</p>",
        "id": 537517806,
        "sender_full_name": "agniv",
        "timestamp": 1756918171
    }
]