[
    {
        "content": "<p>Does there exist any formalization of the Whitney Extension theorem?  I'm mainly looking for the simplest 1-d case: given a smooth function on the non-negative reals (smooth on positive, with one-sided derivatives of all orders and those derivatives have limits at 0), it can be extended to a smooth function on all of R.</p>",
        "id": 560475215,
        "sender_full_name": "Matthew Cushman",
        "timestamp": 1764190712
    },
    {
        "content": "<p>CC <span class=\"user-mention\" data-user-id=\"214703\">@Yury G. Kudryashov</span> in case you also thought about this. (I know you formalised \"baby Whitney embedding\", and that the full version requires Sard's theorem.)</p>",
        "id": 560479404,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1764192670
    },
    {
        "content": "<p>Searching zulip turns up almost nothing: this was discussed, but AFAICT nobody ever worked on this.</p>",
        "id": 560480010,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1764192931
    },
    {
        "content": "<p>It would be nice to have. (If the proof is not much harder in n-dimenions, going straight for that would be nice.)</p>",
        "id": 560480074,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1764192958
    },
    {
        "content": "<p>This question is about Whitney extension thm, not Whitney embedding thm.</p>",
        "id": 561301124,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1764635613
    },
    {
        "content": "<p>For dimension one, I think that we should add (if we don't have it yet) a theorem saying that you can achieve any Taylor series you want.</p>",
        "id": 561301233,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1764635678
    },
    {
        "content": "<p>Makes sense, this is what I am thinking of doing as well (afaict it’s not in mathlib yet)</p>",
        "id": 561304346,
        "sender_full_name": "Matthew Cushman",
        "timestamp": 1764637424
    },
    {
        "content": "<p>AFAIR, <span class=\"user-mention\" data-user-id=\"657719\">@Terence Tao</span> recently mentioned Whitney Extension Theorem in another thread. What's the current set of best theorems in this direction? How long are the proofs?</p>",
        "id": 561309593,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1764639919
    }
]