[
    {
        "content": "<p>Hi everyone,</p>\n<p>I've been working on adding Lean 4 support to <a href=\"https://github.com/dependabot/dependabot-core\">Dependabot</a>, GitHub's automated dependency update service. The implementation is ready and a PR is open:</p>\n<p><a href=\"https://github.com/dependabot/dependabot-core/pull/13787\">https://github.com/dependabot/dependabot-core/pull/13787</a></p>\n<p><strong>What this would enable:</strong></p>\n<ul>\n<li>Automatic PRs to update your <code>lean-toolchain</code> file when new Lean versions are released</li>\n<li>Keep Lean projects up to date with minimal manual effort</li>\n<li>Works with GitHub's security and version update features</li>\n</ul>\n<p><strong>Current scope:</strong><br>\nThis initial version focuses on Lean toolchain updates only. It reads <code>lean-toolchain</code> and checks for new Lean releases. It does not (yet) handle Mathlib, CSLib, or other Lake dependencies — <code>lake-manifest.json</code>, <code>lakefile.toml</code>, and <code>lakefile.lean</code> aren't consulted in this version.</p>\n<p><strong>What's needed to move forward:</strong><br>\nThe Dependabot team supports a lot of languages and ecosystems, and they've found that community-maintained ecosystems work best when there's genuine community interest. They're (understandably) trying to avoid adding support for an ecosystem where there's only tepid interest, or where a single maintainer might disappear and leave them holding the bag. They currently have 3 community-maintained ecosystems and are asking for some community buy-in before merging this PR.</p>\n<p><strong>What I'm looking for:</strong><br>\nI'm happy to take the lead here and handle any bugs or maintenance tasks that come up from upstream. What I'm really looking for is a second pair of eyes — someone to help review changes and sanity-check things occasionally.</p>\n<p>Note that Dependabot is written in Ruby, so familiarity with Ruby would be helpful (though the Lean-specific logic is fairly straightforward).</p>\n<p>If you're interested in helping out, or just want to express interest in having Dependabot support for Lean, please comment on the PR or reply here. Even just a \"+1\" on the PR helps show the Dependabot team that there's community interest.</p>\n<p>Thanks!</p>",
        "id": 564090106,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1765903954
    },
    {
        "content": "<p>I do like the idea of having Dependabot understand Lean4.</p>\n<p>But isn't dependabot making suggestions to update the lean-toolchain, without also checking what needs to be done with lake dependencies, just going to cause pain to users?</p>\n<p>I would be happy if the logic just said \"if there are any library dependencies at all, I don't know what to do, so will be silent\".</p>",
        "id": 564137483,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1765921138
    },
    {
        "content": "<p>I also quite like the idea of Dependabot support for Lean4 and agree with Kim's comments on the current PR.</p>\n<p>As the maintainer of Lake and someone with signfiicant past experience with Ruby, this is something of great interest to me. However, I likely cannot give this a proper look until the new year. I suspect the timing may also be a general problem with gathering support for this now (e.g., the review of the PR was similarly delayed).</p>",
        "id": 564160986,
        "sender_full_name": "Mac Malone",
        "timestamp": 1765936761
    },
    {
        "content": "<p>Nice. I also like this idea quite a lot. We are using home-grown scripts to update to lean-nightlies. Dependabot seems like a great idea. Is there a way to try the dependabot script on our project before it is merged? I would be happy to give it a try.</p>",
        "id": 564194728,
        "sender_full_name": "Tobias Grosser",
        "timestamp": 1765960090
    },
    {
        "content": "<p>I really need this and I'm willing to help.</p>",
        "id": 564349273,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1766008552
    },
    {
        "content": "<p>Thanks for the feedback! It sounds like I'm not the only one who might benefit from this. I wonder if we might want to migrate the functionality contained in <a href=\"https://github.com/leanprover-community/lean-update\">lean-update</a> to Dependabot.</p>\n<p>I'd love it if there could be something like <a href=\"https://docs.npmjs.com/cli/v8/commands/npm-outdated\"><code>npm outdated</code></a> for Lean. In the Node.js world, this is a tool that fetches the state of one's dependencies and tells you what could be updated if one were to do <code>npm update</code>, without taking any further action. As far as I know, there's currently no such thing. Maybe we could add some equivalent functionality to <code>lake update</code> via, say, a <code>--dry-run</code> flag? Or we could add a new <code>outdated</code> command to <code>lake</code> that with a bit more functionality.</p>",
        "id": 565141786,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1766490105
    },
    {
        "content": "<p>I've <a href=\"https://github.com/leanprover-community/lean-update/issues/207\">pinged</a> the maintainers of the <code>lean-update</code> GitHub Action to get some more feedback.</p>",
        "id": 565142865,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1766490651
    },
    {
        "content": "<p>Quick update: after playing around with <a href=\"https://github.com/leanprover-community/lean-update\">lean-update</a>, I was inspired to extend my Dependabot PR , which only handled <code>lean-toolchain</code>, to handle <code>lake-manifest.json</code>, too. Thus, Dependabot can track and update Lake package dependencies, not just Lean compiler version updates.</p>\n<p>PR is here: <a href=\"https://github.com/dependabot/dependabot-core/pull/13787\">https://github.com/dependabot/dependabot-core/pull/13787</a></p>",
        "id": 565184697,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1766508017
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"754512\">@Jesse Alama</span> Hi. I’m the maintainer of lean-update. First, thank you for letting me know about this. I’m glad to hear that someone else is interested in automatically updating in Lean projects. I hope your project goes well.</p>",
        "id": 565239695,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1766549764
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"754512\">@Jesse Alama</span> </p>\n<p>It seems that you are looking for someone to become a maintainer of Lean Dependabot. Unfortunately, I can’t help with that. I’m currently starting a large-scale refactor of lean-update, and I’m planning to work on adding new features to it. Because of this, I don’t have the time. And I don’t think I’m qualified since I don’t have any knowledge of Ruby.</p>",
        "id": 565240227,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1766550434
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"754512\">@Jesse Alama</span></p>\n<p>If lean-update were to become unnecessary in the future thanks to Lean Dependabot, that would be welcome news for me as well. However, I suspect there are some differences in what can be done with a custome GitHub Action versus Dependabot, and I intend to continue maintaining lean-update.</p>",
        "id": 565240388,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1766550609
    },
    {
        "content": "<p>By the way, to achieve something like npm outdated in Lean, Im wondering whether it would be sufficient to pass -wfail as an argument to lake build. What do you think?</p>",
        "id": 565241710,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1766551852
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"626349\">Asei Inoue</span> <a href=\"#narrow/channel/536994-ecosystem-infrastructure/topic/Dependabot.20support.20for.20Lean.20-.20call.20for.20co-maintainers/near/565240227\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"754512\">Jesse Alama</span> </p>\n<p>It seems that you are looking for someone to become a maintainer of Lean Dependabot. Unfortunately, I can’t help with that. I’m currently starting a large-scale refactor of lean-update, and I’m planning to work on adding new features to it. Because of this, I don’t have the time. And I don’t think I’m qualified since I don’t have any knowledge of Ruby.</p>\n</blockquote>\n<p>Looking forward to seeing the new lean-update work! I wonder if, given lean-update, something like Dependabot might be redundant. I agree that a custom GitHub Action gives one more freedom to add Lean-specific functionality and may well be a better solution.</p>\n<p><span class=\"user-mention\" data-user-id=\"122318\">@Tobias Grosser</span> Could any of your custom scripts could be at least partially handled by the <code>lean-update</code> action?</p>",
        "id": 567105209,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1767952591
    },
    {
        "content": "<p>At the moment, the lean-update action does not support updating to nightly versions at all. I was not aware that there was a need for such functionality. I have the desire to support it.</p>",
        "id": 567110308,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1767954188
    },
    {
        "content": "<p>Nice, that would be cool indeed.</p>",
        "id": 567118951,
        "sender_full_name": "Tobias Grosser",
        "timestamp": 1767957080
    },
    {
        "content": "<p>You can see the use of our scripts in <a href=\"https://github.com/opencompl/veir\">https://github.com/opencompl/veir</a>. I would be happy to beta-test lean-update.</p>",
        "id": 567119020,
        "sender_full_name": "Tobias Grosser",
        "timestamp": 1767957107
    }
]