[
    {
        "content": "<p>Discussion thread for <a class=\"stream-topic\" data-stream-id=\"113486\" href=\"/#narrow/channel/113486-announce/topic/Side-by-side.20blueprint.20-.20Experience.20prototype/with/572055679\">#announce &gt; Side-by-side blueprint - Experience prototype</a></p>",
        "id": 572055744,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1770264606
    },
    {
        "content": "<p>I see you are putting this on a website. Is it possible to instead have this as a vscode extension or in the lean infoview? The one most annoying thing for me is how long it takes to build the blueprint, only to realise you've missed a dependency...</p>",
        "id": 572070760,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1770273578
    },
    {
        "content": "<p>You can serve it locally, where it builds much faster. (That's what I typically do with PNT+ and RealAnalysisGame projects.)</p>",
        "id": 572183935,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1770306205
    },
    {
        "content": "<p>Yes, but I couldn't easily do this until recently due to gitpod wiping out any local config when restarting a workspace. Now that I use the uni's big computer, it shouldn't be so much of an issue anymore</p>",
        "id": 572184611,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1770306343
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/channel/536994-ecosystem-infrastructure/topic/Discussion.20thread.20-.20Side.20by.20Side.20blueprint/near/572070760\">said</a>:</p>\n<blockquote>\n<p>I see you are putting this on a website. Is it possible to instead have this as a vscode extension or in the lean infoview? The one most annoying thing for me is how long it takes to build the blueprint, only to realise you've missed a dependency...</p>\n</blockquote>\n<p>Displaying things in the info view seems like a great idea that I had not considered. It's a bit tight on space though, what were you imagining? showing the rendered Latex of he declaration you're in?</p>\n<p>I set up some basic caching, although it's still a bit brittle (and dep. graph change triggers a complete rebuild).  I will work on it a bit more this evening. Here are the preliminary results. I expect that they won't get much better than this, but there is still a bit of work to do on making sure it doesn't break. (this is from the first and only successful run)</p>\n<p><a href=\"/user_uploads/3121/OZqg6lZnLHo60l-jdo0kW-2P/Screenshot-2026-02-05-at-6.46.26PM.png\">Screenshot 2026-02-05 at 6.46.26 PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/OZqg6lZnLHo60l-jdo0kW-2P/Screenshot-2026-02-05-at-6.46.26PM.png\" title=\"Screenshot 2026-02-05 at 6.46.26 PM.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"750x170\" src=\"/user_uploads/thumbnail/3121/OZqg6lZnLHo60l-jdo0kW-2P/Screenshot-2026-02-05-at-6.46.26PM.png/840x560.webp\"></a></div><p>Also I thought about doing a VSCode extension, but could not decide on how I wanted to do it. There are a lot of design decisions to be made in terms of where the lean and latex go, and where the rendered content gets displayed. I decided to opt out and just display it via html because that seemed to be pretty popular with the original leanblueprint and I figured people would not want to change workflows that much. In principle there is nothing stoping us from doing both.</p>",
        "id": 572271370,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1770336447
    },
    {
        "content": "<p>My idea having it in vscode is simply to avoid switching back and forth many times between vscode and my browser. The infoview ultimately is just displayed html, so you could simply strip down your page slightly (so that it fits on a narrow window, and display it in vscode</p>",
        "id": 572304119,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1770360700
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/channel/536994-ecosystem-infrastructure/topic/Discussion.20thread.20-.20Side.20by.20Side.20blueprint/near/572304119\">said</a>:</p>\n<blockquote>\n<p>My idea having it in vscode is simply to avoid switching back and forth many times between vscode and my browser. The infoview ultimately is just displayed html, so you could simply strip down your page slightly (so that it fits on a narrow window, and display it in vscode</p>\n</blockquote>\n<p>Ok, after playing around with things for a bit I was able to put this together (it's mostly spaghetti code, but it works). The big technical change was moving  some of the 'dressing' upstream to allow for things like:</p>\n<ul>\n<li>Latex that is captured in the blueprint attribute is now live rendered in the infoview</li>\n<li>Displaying the colored status indicator dot in the infoview</li>\n<li>Building and serving the side-by-side blueprint in VSCode</li>\n<li>Better cache management</li>\n</ul>\n<p>It's still fragile and unoptimized with obvious formatting bugs, which I plan to fix. But before going through the effort of doing that I wanted to share and get people's feedback. Video and beauty shots below; let me know what you think.</p>\n<p><a href=\"/user_uploads/3121/lyU0msxY88NcullfkZtoVcTO/Screenshot-2026-02-09-at-9.46.42AM.png\">Screenshot 2026-02-09 at 9.46.42 AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/lyU0msxY88NcullfkZtoVcTO/Screenshot-2026-02-09-at-9.46.42AM.png\" title=\"Screenshot 2026-02-09 at 9.46.42 AM.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"3436x1928\" src=\"/user_uploads/thumbnail/3121/lyU0msxY88NcullfkZtoVcTO/Screenshot-2026-02-09-at-9.46.42AM.png/840x560.webp\"></a></div><p><a href=\"/user_uploads/3121/FhRnHro9YWUO-nicQOzkJV7T/Screenshot-2026-02-09-at-9.59.56AM.png\">Screenshot 2026-02-09 at 9.59.56 AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/FhRnHro9YWUO-nicQOzkJV7T/Screenshot-2026-02-09-at-9.59.56AM.png\" title=\"Screenshot 2026-02-09 at 9.59.56 AM.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"3436x1928\" src=\"/user_uploads/thumbnail/3121/FhRnHro9YWUO-nicQOzkJV7T/Screenshot-2026-02-09-at-9.59.56AM.png/840x560.webp\"></a></div><p><a href=\"https://www.youtube.com/watch?v=2NbDpH2au3g\">https://www.youtube.com/watch?v=2NbDpH2au3g</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"2NbDpH2au3g\" href=\"https://www.youtube.com/watch?v=2NbDpH2au3g\"><img src=\"https://uploads.zulipusercontent.net/df34c1654fc8afe486f5ddfde6ca4567e6783721/68747470733a2f2f692e7974696d672e636f6d2f76692f324e6244704832617533672f6d7164656661756c742e6a7067\"></a></div>",
        "id": 572806331,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1770649596
    },
    {
        "content": "<p>That looks really cool!</p>",
        "id": 572811118,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1770650719
    },
    {
        "content": "<p>That looks great! Is it much harder to support blueprints written in tex?</p>",
        "id": 572820951,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1770652832
    },
    {
        "content": "<p>Also, I'm unsure what the <code>above</code> and <code>below</code> fields are for</p>",
        "id": 572821094,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1770652859
    },
    {
        "content": "<p>Thanks for the kind words! I'll address your points while explaining things in a bit more detail.</p>\n<ul>\n<li>\"Nodes\" contain all of the mathematical content and  are tied 1-1 to individual declarations in lean files. This includes the dressed content, which is generated during elab. This is mirrored in the code by having all of the relevant content defined inside the @[blueprint] attribute using options. This is a fundamental change from the original leanblueprint (which used a tex file for everything) and the PNT project, which used leanarchitect to store some content in the attribute, and some at the end of the file using comments with custom delimiters. </li>\n<li>Even though most of the content is now in the attributes, there are still <a href=\"https://github.com/e-vergo/General_Crystallographic_Restriction/tree/main/blueprint/src\">tex files governing the layout as well as a limited amount of content in the blueprint and/or paper</a>. These define things like chapters, titles, sections, as well as what content gets pulled from the node and displayed. There are many different ways to have the user store the lean/latex together, and this is only one of them. I am very open to doing this differently. </li>\n<li>Doing all of this in verso instead of tex is the right long term solution for many reasons, but I wanted to use tex files because. 1) It's the devil I know and allows me to prototype fast 2) It's more flexible and has off the shelf tooling for a lot of things 3) It enables the following: Lets say a mathematician unfamiliar with lean wants to formalize some work of theirs. They can then copy/paste the latex into blueprint attributes one by one, providing a more structured formalization UX. It will never be perfectly smooth of course, but giving newer users something familiar to anchor themselves to may be helpful. </li>\n<li>The above/below fields in the attribute are meant to capture additional expository content that is not directly part of the declaration in lean. This allows for more coherent documents that are more than just a list of declarations. This wouldn't be included in, say, mathlib entries, but it would be useful for people creating pedagogical works. <a href=\"https://e-vergo.github.io/General_Crystallographic_Restriction/the-crystallographic-restriction.html#lem-minpoly-dvd-prod-cyclotomic\">Example.</a></li>\n</ul>\n<p><a href=\"/user_uploads/3121/g4_rAhufTSKaVgQ2A6zjP4q-/Screenshot-2026-02-11-at-10.06.55AM.png\">Screenshot 2026-02-11 at 10.06.55 AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/g4_rAhufTSKaVgQ2A6zjP4q-/Screenshot-2026-02-11-at-10.06.55AM.png\" title=\"Screenshot 2026-02-11 at 10.06.55 AM.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"2650x1206\" src=\"/user_uploads/thumbnail/3121/g4_rAhufTSKaVgQ2A6zjP4q-/Screenshot-2026-02-11-at-10.06.55AM.png/840x560.webp\"></a></div><p>Other random thoughts:</p>\n<ul>\n<li>I'd like to support images/figures/plots. This shouldn't be too hard to make work and I think it could offer a lot to the experience/product</li>\n<li>Alex K. suggested that we make tex a first class citizen in the lean file. To start, I was thinking that we add latex syntax highlighting. If we have the latex in the blueprint attribute we should be able to pass it to a dedicated latex syntax highlighting tool and display it as if it were real tex</li>\n<li>The VSCode extension is a natural fit for the emerging agentic AI ecosystem.  Claude Code, VSCode forks like cursor and windsurf, and many other AI tools use VSCode as their main interaction point with humans and code . Should we be designing these tools for use by humans/agentic ai/both?</li>\n<li>Placing all of the relevant mathematical English just above the corresponding lean in the file sets one up very well for auto formalization efforts. We could also have a small, highly dedicated llm that generates lean declarations off blueprint attributes with these options. One could imagine a highly-specialized LLM that only does this task running locally on your machine. Note how the data set that would be used to train this model grows over time, and how we will always have a perfectly clean signal about which generations were correct and which were not. This means that over time you will accumulate an ever-growing data set to train the next iteration of the model on, which gives you a better tool, which then helps you generate more data, ...  lather, rinse repeat.</li>\n</ul>",
        "id": 573312334,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1770822499
    },
    {
        "content": "<p>I am afraid in practice it isn't really the case that a blueprint item corresponds to a single mean declaration. It's oftentimes one-to-many, or one-to-none</p>",
        "id": 573356705,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1770833354
    }
]