[
    {
        "content": "<p>@Wojciech Nawrocki is <a href=\"https://github.com/leanprover-community/mathlib4/pull/3583\">!4#3583</a> marked WIP for a good reason? I would love to see this in mathlib so I can start experimenting with it.</p>",
        "id": 358263490,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1684072526
    },
    {
        "content": "<p>Sorry, this is probably my fault. I would really like it in too, but I had complained a bit about the user interface issues (weird command to enable the widget, and then not particularly discoverable how to use the widget).</p>\n<p>However I think I was mistaken, and the right steps here are to get it in, as I'm pretty certain we want it, and then improve UX as people actually want to use it.</p>",
        "id": 358358282,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1684127360
    },
    {
        "content": "<p>Objections to merging in 3...2...1... / the next couple of days, should be expressed somewhere soon!</p>",
        "id": 358358283,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1684127360
    },
    {
        "content": "<p>I agree with that strategy. Let's merge it, use it for a bit, and improve UX inspired by those experiences.</p>",
        "id": 358361902,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1684129320
    },
    {
        "content": "<p>Random idea for a further usage of such a widget (inspired by <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> 's description of a <a href=\"#narrow/stream/116395-maths/topic/Autogenerating.20parts.20of.20.60calc.60s/near/358252081\">wishlist</a> for a relational congruence widget): it would be neat to have drag-and-drop from the commutative diagram widget to the Lean file. When I did a tiny bit of category theory last summer, I remember it sometimes being laborious to write (or even remember) the full name of an object or morphism. If the widget can show the diagram, I can probably see at a glance which objects / arrows I have to prove things about, and it would be neat to be able to click on them directly and get their name in the proof.</p>",
        "id": 358494392,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1684164618
    },
    {
        "content": "<p>Is that actually just achievable via copy-and-paste from a label in the displayed commutative diagram?</p>",
        "id": 358574393,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1684186059
    },
    {
        "content": "<p>That would work fine too yes! I think any term that can be selected in the infoview can also be copy-pasted(?)</p>",
        "id": 358623958,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1684214241
    },
    {
        "content": "<p>Hi! Yes, the WIP is mostly due to Scott's objections.. which I absolutely agree with! The main issue is that there is no way to say 'I want to see commutative diagrams in every proof in this file', and beyond that there is some awkwardness in the UX. I can make a stopgap fix to the awkwardness ASAP if you'd like to merge, but the global widget-toggle will need a larger PR to core that's on my TODO list.</p>",
        "id": 358634869,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1684218963
    },
    {
        "content": "<p>I guess you shouldn't do anything in the short term if it will mean more work in the long term. My enthusiasm for having something merged so I can play with it can be taken with a pinch of salt if it will cause strictly more work behind the scenes</p>",
        "id": 358660378,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1684226882
    }
]