[
    {
        "content": "<p>This is my first time porting an entire file and I'm trying to port <code>AlgebraicGeometry.EllipticCurve.Weierstrass</code> in <a href=\"https://github.com/leanprover-community/mathlib4/pull/5294\">!4#5294</a>. I encountered multiple issues and solved most of them but still need some help. I added a few porting notes but here are the main ones:</p>\n<ul>\n<li><code>CoordinateRing</code> used to be a <code>def</code> with <code>derive [inhabited, comm_ring]</code>, but the corresponding <code>deriving Inhabited, CommRing</code> doesn't work, and I had to replace it with an <code>abbrev</code>. This might cause the same slowness problem mentioned in the <code>class_group.mk</code> topic in <a class=\"stream\" data-stream-id=\"116395\" href=\"/#narrow/stream/116395-maths\">#maths</a>, which is not present in this file but will show up in the future <code>AlgebraicGeometry.EllipticCurve.Point</code> file. I'm not sure how to add the <code>local attribute</code> as mentioned in the comments so I can't say if this is fine.</li>\n<li><code>quotientXYIdealEquiv</code> is a series of three algebra equivalences linked by <code>trans</code> that gives a deterministic timeout. I tried separating it into three <code>def</code>s but the first one required ~800k heartbeats to compile, and I can't get the second one to compile at all.</li>\n<li><code>./scripts/fix-lints.py</code> seems to be broken for me locally, and upon inspecting manually I don't know how to fix many of the linter problems. For instance, the linter tells me that the <code>simps</code> tag in <code>variableChange</code> and <code>baseChange</code> should be <code>simps!</code>, but <code>simps!</code> doesn't generate lemmas like <code>variableChange_Δ'</code>, which I needed to prove <code>variableChange_j</code>.</li>\n</ul>",
        "id": 368375057,
        "sender_full_name": "David Ang",
        "timestamp": 1687386983
    },
    {
        "content": "<p>fix-lints only fixes a very small set of linter issues</p>",
        "id": 368388402,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1687394788
    }
]