[
    {
        "content": "<p>Is there a mathlib style policy on this matter?</p>",
        "id": 438115793,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1715440766
    },
    {
        "content": "<p>Not yet, but the idea is to reserve <code>theorem</code> for named results in the mathematical literature, and call everything <code>lemma</code></p>",
        "id": 438115992,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1715440971
    },
    {
        "content": "<p>Before enforcing this, we need to replace all mathport-induced <code>theorem</code> with <code>lemma</code>, and we're putting that off until we have a good programmatic solution</p>",
        "id": 438116013,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1715441005
    },
    {
        "content": "<p>Alternatively, we could just use one keyword and not have to argue which results should use which keywords</p>",
        "id": 438116118,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1715441113
    },
    {
        "content": "<p>Based on those two responses, it seems that the intention might not be so clear-cut. Could some maintainers perhaps weigh in on this? When making PRs, it would be nice to have an official source indicating best practice, even if it's not enforced. </p>\n<p>Note that it is difficult to search for an answer to this question on Zulip.</p>",
        "id": 438116284,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1715441296
    },
    {
        "content": "<p>AFAIK, we don't have any official policy yet.</p>",
        "id": 438117946,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1715443134
    },
    {
        "content": "<p>There's no official policy (and what Yaël says is <em>an</em> idea that has been suggested, though a reasonable one). My own preference is that <code>theorem</code> is reserved for what you feel is an important result in the theory. Almost all of mathlib consists of <code>lemma</code>s.</p>\n<p>One of the things that didn't get ported when going from Lean 3 was which results were lemmas. I believe there's still some thought to try to port that eventually...</p>",
        "id": 438118786,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1715444103
    },
    {
        "content": "<p>I have a script that replaces every <code>theorem</code> with <code>lemma</code>.  I could adapt it to replace every \"<code>theorem</code> with no doc string\" to <code>lemma</code>.  However, this rots very fast and I would only run it if it were certainly merged soon...</p>",
        "id": 438118993,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1715444364
    },
    {
        "content": "<p>I could also write a linter that would enforce the \"theorem must have a doc string\".</p>",
        "id": 438119015,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1715444399
    },
    {
        "content": "<p>It looks like we never made a decision, but I found the thread from September that was the last discussion about this, and somewhere in it was <a href=\"#narrow/stream/287929-mathlib4/topic/lemma.20vs.20theorem/near/391687553\">a poll</a> that showed there was support to keep <code>theorem</code> for important results and to require that it have a docstring.</p>",
        "id": 438119107,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1715444466
    },
    {
        "content": "<p>I like the sound of that enforced dosctring approach, or less stringently, the use of the keywords that aligns with the way mathematicians talk. </p>\n<p>Sometimes though, as a contributor, it is just nice to be told what to do, and not to encounter differing views via PR suggestions (I'm not referring to anything specific recently, but I think I have had comments in the past suggesting <code>lemma -&gt; theorem</code> for tiny results). Can I take it from this discussion that if I use 'lemma' and 'theorem' as if I were writing a paper, I won't meet any resistance?</p>",
        "id": 438119249,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1715444635
    },
    {
        "content": "<p>Not from me in any case :)</p>",
        "id": 438119527,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1715444948
    },
    {
        "content": "<p>Note if you pick \"theorem\" but don't add a docstring, then it may be auto-replaced with <code>lemma</code> in future</p>",
        "id": 438174063,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1715508482
    },
    {
        "content": "<p>I know that there are some strong views in favour and against the presence of <code>lemma</code> in mathlib.  I am personally in favour.</p>\n<p>In the meantime, I wrote a linter that warns against doc-less <code>theorem</code>s in mathlib: <a href=\"https://github.com/leanprover-community/mathlib4/pull/12869\">#12869</a>.</p>\n<p>You can see its effect in <a href=\"https://github.com/leanprover-community/mathlib4/pull/12863\">#12863</a>.</p>\n<p>Note that the replacements <code>theorem</code> to <code>lemma</code> were guided by actually parsing the lean syntax.  In particular, no doc-string or comment has been affected by the change.</p>",
        "id": 438548122,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1715683303
    }
]