[
    {
        "content": "<p>In a comment on <a href=\"https://github.com/leanprover-community/mathlib4/pull/11214\">#11214</a>, <span class=\"user-mention\" data-user-id=\"389019\">@Chris Birkbeck</span> suggested to factor out some of the repeatedly used arguments into a <code>variable</code> declaration. I'm inclined to not do that (there are not many arguments, and they are explicit in some declarations and implicit in others), but I would like to know if there are some agreed-upon style guidelines on when to use <code>variable</code>s and when not to. I think one point (also from a comment on a recent PR) is:</p>\n<ul>\n<li>Do not put assumptions (arguments whose type is a <code>Prop</code>) in a <code>variable</code>declaration.<br>\n(Rationale: the statement is obfuscated if the assumptions are not visible).</li>\n</ul>\n<p>Are there more considerations one should keep in mind?</p>",
        "id": 425503092,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1709898755
    },
    {
        "content": "<p>Do you know that you can do <code>variable (assumption)</code>/<code>variable {assumption}</code> to change implicitness of an argument?</p>",
        "id": 425503223,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1709898810
    },
    {
        "content": "<p>Yes. But having to switch between explicit and implicit repeatedly defeats the purpose of the <code>variable</code> declaration to some extent.</p>",
        "id": 425503407,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1709898873
    },
    {
        "content": "<p>Sorry maybe I wasn't clear, I just meant use it in all the places you have it implicit, since it was showing up in several places and just leave it in the explicit ones. But it was just a thought, I don't really have strong feelings either way.</p>",
        "id": 425503585,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1709898962
    },
    {
        "content": "<p>In the concrete case, I think that the trade-off is pointing fairly clearly toward not using <code>variable</code>. It would not make the file shorter (the arguments fit on the same line as the lemma name), but a bit harder to read (in particular if <code>f</code>, <code>s</code> etc. are mentioned sometimes (when explict) and sometimes not).</p>\n<p>This will look different when  one can avoid having to list half a dozen typeclass arguments each time.</p>",
        "id": 425505056,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1709899513
    },
    {
        "content": "<p>Also, try to use <code>variable</code> only in a situation where the variables really should be part of the signature of the declaration: unless you are careful, lean may use some \"unused\" ones.</p>",
        "id": 425536627,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1709910393
    }
]