[
    {
        "content": "<p>On my PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/30648\">#30648</a>, the \"lint and suggest\" CI step fails (repeatedly), but there doesn't seem to be any actual failure message in the CI output that I can see; just \"Error: Process completed with exit code 1\" at the end.</p>\n<p>(I'm confused what's going on with this PR altogether. Riccardo bors-merged it earlier today; but when I checked back on it several hours later to see why bors hadn't completed, there was a warning saying \"merge conflict\". Hitting the auto-merge-master button did not show any actual git conflicts, but since then, it has consistently failed CI with this linting error.)</p>",
        "id": 559044114,
        "sender_full_name": "David Loeffler",
        "timestamp": 1763990835
    },
    {
        "content": "<p>I believe the bors result \"conflict\" means \"there was a conflict merging all the PRs in this bors match\" (i.e., this is not about your PR but about its interaction with the other PRs in the batch). That said, I agree the bors error could and should be more telling here.</p>",
        "id": 559044833,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1763991019
    },
    {
        "content": "<p>The CI error itself seems to be in the \"install reviewdog\" step, i.e. it's unrelated to your PR. If retrying does not fix it, please make noise in a separate zulip thread!</p>",
        "id": 559045026,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1763991076
    },
    {
        "content": "<p>There's an ongoing issue at GitHub which is probably related: <a class=\"message-link\" href=\"/#narrow/channel/116290-rss/topic/GitHub.20Status.20-.20Incident.20History/near/559044792\">#rss &gt; GitHub Status - Incident History @ 💬</a></p>",
        "id": 559050290,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1763992441
    },
    {
        "content": "<p>It seems to work again now, so maybe the GitHub issue was indeed the cause, thanks!</p>\n<p>Could some kind maintainer put <a href=\"https://github.com/leanprover-community/mathlib4/pull/30648\">#30648</a> back on the queue? (It got automatically un-queued when I merged master.)</p>",
        "id": 559053464,
        "sender_full_name": "David Loeffler",
        "timestamp": 1763993174
    }
]