[
    {
        "content": "<p>Hi! I have some results in domain theory formalised, which started out of some coursework I'd done at Imperial College. It directly extends work from this thread, which considers (directed) complete partial orders (dcpo):<br>\n<a href=\"#narrow/channel/287929-mathlib4/topic/.3E.20complete.20partial.20order.20and.20domain.20theory.20formalization\">#mathlib4 &gt; &gt; complete partial order and domain theory formalization</a> </p>\n<p>I have some additional results from taking a Scott Topology over an algebraic dcpo. Specifically I show that a Scott Tolopgy across an algebraic dcpo is Sober, according to Proposition 2.2.7 and Definition 7.2.3 from <a href=\"https://achimjungbham.github.io/pub/papers/handy1.pdf\">Abramsky and Jung</a>. I was wondering if this is appropriate to add to mathlib. I have <a href=\"https://github.com/edwin1729/semantics/tree/master/Semantics\">2 files of 200</a> lines each currently (they are in rough shape and need quite a bit of refactoring), to prove this result. I'm also not sure if the proof I used is available in the handbook above, as I followed closely <a href=\"https://alyata.github.io/documents/duality_domain_theory.pdf\">this work</a> proving Proposition 3.5.3 from it.</p>\n<p>I primarily wanted to know if this can make it into mathlib, in which case I would invest time in making my work cleaner, and conform to mathlib conventions.<br>\nWould be happy explain why this is interesting or answer any other questions!</p>",
        "id": 536106158,
        "sender_full_name": "Edwin Fernando",
        "timestamp": 1756154968
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"373192\">@Christopher Hoskin</span> is perhaps the person to ask here, as the author of some of the related material in Mathlib.</p>",
        "id": 536133890,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756170080
    },
    {
        "content": "<p>I should say that I don't actually know anything about domain theory as such - my interest in these topologies comes from the lattice of M-ideals in a Banach space. It sounds to me as if <span class=\"user-mention\" data-user-id=\"951712\">@Edwin Fernando</span> 's results would be of interest.</p>\n<p>Gierz et al Chapter 2, Corollary 1.12 and Corollary 1.15 may be of interest here?</p>",
        "id": 536300618,
        "sender_full_name": "Christopher Hoskin",
        "timestamp": 1756236995
    },
    {
        "content": "<p>After you've pointed it out I see that there are a lot of related results that may be proven. But I think the current work is already quite large for a PR. So I think I'll proceed with making a PR and see what feedback I get!</p>",
        "id": 536359313,
        "sender_full_name": "Edwin Fernando",
        "timestamp": 1756278655
    },
    {
        "content": "<p>I've made 2 PRs for this project! <a href=\"https://github.com/leanprover-community/mathlib4/pull/31662\">1</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/31670\">2</a>.</p>",
        "id": 556627765,
        "sender_full_name": "Edwin Fernando",
        "timestamp": 1763234068
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/31662\">#31662</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/31670\">#31670</a></p>",
        "id": 556627971,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1763234274
    }
]