[
    {
        "content": "<p>A new automation has just been merged into master: automatic detection of files that increase \"a lot\" transitive imports (a 2% overall).</p>\n<p>The PR summary shows which files triggered the bot and the <code>large-import</code> label is added to the PR.  This is just for information: nothing <em>really</em> fails because of this.</p>\n<p>If you later push a change that reduces transitive imports below the 2% threshold, the script removes the label.</p>",
        "id": 474219690,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727854570
    },
    {
        "content": "<p>As with all automation, there are likely to be hiccups and unexpected/unintended behaviour: please report these!</p>",
        "id": 474219839,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727854619
    },
    {
        "content": "<p>Here is a first, unintended and welcome, consequence of the label: <a href=\"https://github.com/leanprover-community/mathlib4/pull/17352\">#17352</a>.</p>",
        "id": 474223230,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727855563
    },
    {
        "content": "<p>I'll record here a feature/bug that this automation has: it reports large import changes in <em>modified</em> files, not in unmodified ones.</p>",
        "id": 474250524,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727863246
    },
    {
        "content": "<p>So the percentage reported is over the imports of all modified files?</p>",
        "id": 474257762,
        "sender_full_name": "Jakob von Raumer",
        "timestamp": 1727865868
    },
    {
        "content": "<p>Yes, a non-modified file may have a relative import change that is larger than 2% and the script would not detect that.</p>",
        "id": 474258140,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727866009
    },
    {
        "content": "<p>More in detail, the import summary report has two parts, the first shows the import summary for the modified files, the other, always hidden in a collapsible tab, has a report of the import changes for all files, modified or not.  The <code>large-import</code> script uses the data of the first list, not the second.</p>",
        "id": 474258665,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727866205
    },
    {
        "content": "<p>Is that possible? Surely a non-modified file has at most as many new imports as the sum of its imports, and if none of them has been flagged, then they all have &lt; 2% new imports, so the non-modified file also has &lt; 2% new imports.</p>",
        "id": 474258771,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1727866252
    },
    {
        "content": "<p>Well, <em>some</em> file will be flagged, but not <em>all</em> files will.</p>",
        "id": 474258930,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727866321
    },
    {
        "content": "<p>That is why it is a feature/bug: it tells you where the problem originates concisely, but does not tell you how far it extends.</p>",
        "id": 474259632,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727866550
    },
    {
        "content": "<p>The reason for pointing this out is that I extracted one of the modifications in a PR that was flagged and, on its own, it did not change imports.  So, once that non-flagged PR will get merged, one of the files that were flagged will disappear (but one will stay!) and I would not have known to look at the separately PRed file.</p>",
        "id": 474260100,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727866673
    }
]