[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/24252\">#24252</a>, <span class=\"user-mention\" data-user-id=\"459699\">@Joël Riou</span> is asking for an extension of <code>reassoc</code> that would also generates <code>_assoc</code> lemma for equality of isomorphisms (with <code>≫</code> replaced by <code>≪≫</code>).  That would be nice to have, but the most naive attempt runs into the dumb issue that <code>CategoryTheory.Iso</code> imports <code>Tactic.CategoryTheory.reassoc</code> (in fact, it’s its only import). I am not sure what would be the best course of action to take. Here are a few ideas:</p>\n<ol>\n<li>The easiest in terms of implementation would probably be a <code>reassoc_iso</code> attribute, with a <code>iso_reassoc_of%</code> term elab, defined in a separate file in the <code>Tactic.CategoryTheory</code> folder, but this is probably a form of tech debt as this makes yet an other attribute to remember, document and maintain, and is a bit unsatisfying.</li>\n<li>We could split <code>CategoryTheory.Iso</code> to have something that only defines the bare minimum (Isos + their transitivity), and have <code>CategoryTheory.reassoc</code> imports this \"stage 0\". This leads to code fragmentation.</li>\n<li>I don’t know enough meta code to know if it is possible to \"update\" the behaviour of an attribute. If this is possible, then we could write the \"extension\" in a new file in the tactic folder, and calling reassoc on equality of isomorphisms would work as long as said file is imported.</li>\n</ol>\n<p>On a side note, if we go down the road of updating \"morphisms\" tactics for isomorphisms, then perhaps we should also consider having <code>slice_lhs</code> work on strings of compositions of isomorphisms (currently, it does not work).</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span>  who wrote the original <code>reassoc</code> code and has maybe considered this already.</p>",
        "id": 513445232,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1745258570
    },
    {
        "content": "<p>yes, (3) is possible. An example of this is <code>ring1</code> (which <a href=\"https://github.com/leanprover-community/mathlib4/blob/32998106f5c17a8b3e9ed1142b0fd8d10308d301/Mathlib/Tactic/Ring/Basic.lean#L1193-L1198\">declares</a> a basic <code>ring</code> stub that calls <code>ring1</code>) and <code>ring_nf</code> (which <a href=\"https://github.com/leanprover-community/mathlib4/blob/32998106f5c17a8b3e9ed1142b0fd8d10308d301/Mathlib/Tactic/Ring/RingNF.lean#L165-L168\">updates</a> the <code>ring</code> stub to try <code>ring_nf</code> on failure)</p>",
        "id": 513448990,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1745260145
    },
    {
        "content": "<p>I have a working prototype (really just a copypasta of the <code>reassoc</code> code) that acts as the usual reassoc for equality of morphisms and acts differently for equalities of isos, but it looks like <code>registerBuiltinAttribute</code> complains if I try to re-register <code>reassoc</code> with an updated behaviour. I know too little about the attribute system to get this to work. Is there any documentation somewhere that I can read to get my head around this?</p>",
        "id": 513667164,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1745343177
    },
    {
        "content": "<p>I made the code available <a href=\"https://github.com/leanprover-community/mathlib4/blob/robin-carlier/reassoc_iso/Mathlib/Tactic/CategoryTheory/IsoReassoc.lean\">here</a> if someone wants to have a look. It is currently called <code>iso_reassoc</code> due to the problem mentioned above.</p>",
        "id": 513671900,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1745344815
    },
    {
        "content": "<p>You should not re-register the attribute. Instead the attribute's behavior on <code>add</code> should call a stub with overridden behavior as in the <code>ring</code> example</p>",
        "id": 513735930,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1745360075
    },
    {
        "content": "<p>Right, I had not understood that by \"stub\" you mean reference, and that what you were trying to show me is the use of <code>IO.mkRef</code>, it works now ! <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span> <br>\nTime for some cleaning up and test writing, and the PR will come soon.</p>",
        "id": 513787223,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1745390161
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/24303\">#24303</a>.</p>",
        "id": 513796238,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1745393520
    }
]