[
    {
        "content": "<p>In the course of debugging a tactic proof, I've sometimes had to stare at the infoview while commenting a line of code in and out, watching how the infoview changed. This was a little difficult in cases with huge proof states or hidden instance/implicit arguments.</p>\n<p>Inspired by working on <code>fail_if_no_progress</code>, I thought it could be useful to have a tactic which could show you the difference actually made by running a tactic, e.g. <code>what_changed? simp</code>. (This also came up with <code>fail_of_no_progress</code> itself—occasionally I'd wonder \"wait, how did it make progress?\")</p>\n<p>The structure is mostly there as of <a href=\"https://github.com/leanprover-community/mathlib4/pull/3757\">#3757</a>; the machinery just needs to be tweaked, and I have some ideas on how to do it. v1 would just report the first encountered change, but v2 could actually try to \"diff\" the structures and be a bit more clever about how it reported the differences. (I'd also introduce <code>fail_if_no_progress?</code> which reported what progress it made (in v1 style) when it did make progress.)</p>\n<p>Would this be desirable and/or worth it? I'd be happy to start working on it. :) Or, I could work on something else if someone knows of some other metaprogramming task which would be more useful.</p>",
        "id": 374576032,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1689159707
    },
    {
        "content": "<p>I for one would love to have such a tactic.</p>",
        "id": 374581103,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1689160791
    },
    {
        "content": "<p>But we already have color-coded goal view diffs, right?</p>\n<p>I know that Yael is color-blind, so I agree that it is good to have different ways to access that info. What I'm saying is that most of the work should already been done somewhere</p>",
        "id": 374581571,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1689160891
    },
    {
        "content": "<p>It was done in <a href=\"https://github.com/leanprover/lean4/pull/1610\">https://github.com/leanprover/lean4/pull/1610</a> and <a href=\"https://github.com/leanprover/vscode-lean4/pull/251\">https://github.com/leanprover/vscode-lean4/pull/251</a></p>",
        "id": 374581845,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1689160954
    },
    {
        "content": "<p>Oh, right, nice! And thanks for the links! I was wondering if this would involve building an <code>Expr</code>-diff-er from scratch or not... :) This will make things a lot simpler.</p>",
        "id": 374590593,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1689162884
    },
    {
        "content": "<blockquote>\n<p>I know that Yael is color-blind, [...]</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> Do you have any preferences for more readable colors?  Does the github diff colorscheme work for you?</p>",
        "id": 374692520,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1689182334
    }
]