[
    {
        "content": "<p>The lemma <code>Bicategory.whisker_exchange</code> is not a simp lemma. I don't quite understand this, as to me it does not seem to conflict with the simp normal-form that is described in <code>Bicategory/Basic</code>. However I trust that the people who implemented realized that this is a bad idea to have as a simp lemma for whatever reason.</p>\n<p>However, whenever a bicategory instance is added, one must show <code>whisker_exchange</code>. So for automation this is somewhat unfortunate. In simple cases (when the bicategory is constructed from another already existing one), <code>whisker_exchange</code> will be something like <code>ext; simp; exact whisker_exchange _ _</code> where <code>whisker_exchange</code> gets applied for that other bicategory. It would be nice to have this automated. So I'm wondering, do people think it would be a good idea to add <code>whisker_exchange</code> as an unsafe aesop rule? I don't have much experience with <code>aesop</code> though, so I can't really tell if this is a bad idea or not (and it seems to me that there are 0 unsafe aesop rules added in the category theory library... So maybe this is a sign I'm trying to do something shady).</p>",
        "id": 558800091,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1763802860
    },
    {
        "content": "<p>and in case people don't see obvious issues with this, I can try adding it to the bicategory library and run bench to see what happens.</p>",
        "id": 558800137,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1763802916
    },
    {
        "content": "<p>This was discussed several times. My understanding is that there is no particular reason to favour <code>whisker_exchange</code> over the same lemma in the other direction. If this helps automation locally, it would suffice to make it a local simp lemma.</p>",
        "id": 558800390,
        "sender_full_name": "Joël Riou",
        "timestamp": 1763803192
    },
    {
        "content": "<p>Okay but was it also discussed wether to add it as an <code>aesop</code> rule?</p>",
        "id": 558800451,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1763803252
    },
    {
        "content": "<p>If I understood correctly when you said it was discussed already, this was whether it should be a simp lemma or not, but maybe I misunderstood this.</p>",
        "id": 558800607,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1763803402
    },
    {
        "content": "<p>I remember that at some point I fiddled locally with unsafe aesop rules with similar kind of lemmas (perhaps even this one!), but never really got that to get automation un-stuck in the cases I were interested in. It might be user error.</p>\n<p>On the other hand, I think <code>whisker_exchange</code> (for monoidal categories and bicategories) is a perfect fit for a <code>grind _=_</code> lemma, but this alone won’t suffice and we probably need way more annotations before we can get <code>grind</code> to a satisfying place for bicategories and monoidal categories (I think it has a lot of potential there, though!)</p>",
        "id": 558808087,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1763810906
    },
    {
        "content": "<p>Okay, that's good to know, thanks a lot!</p>",
        "id": 558808387,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1763811232
    },
    {
        "content": "<p>Then I will just wait for grind to save me at some point in the future :)</p>",
        "id": 558808406,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1763811250
    }
]