[
    {
        "content": "<p>Dear all,</p>\n<p>I am browsing through the mathlib docs, and have figured some things out but still have questions.</p>\n<ol>\n<li>\n<p>What do the colors on the left side of each item designate?  Is there a color coding available as a reference?  I presume it is something about missing or unsafe implementations etc.  More specifically?</p>\n</li>\n<li>\n<p>What is the difference between <code>equations</code> and the <code>source</code> link?</p>\n</li>\n<li>\n<p>In some situations, there are identical names in different namespaces, like <code>Init.Data</code> and <code>Lean.Data</code>.  What is the relationship between those names?</p>\n</li>\n</ol>\n<p>More generally I have tons of questions that would be better suited for a dedicated Q&amp;A site rather than a chat; this could aggregate many beginner questions and alleviate this forum for answering the same things over and over again.  Is there such a place (perhaps on Stack Exchange)?</p>\n<p>Thank you all!</p>",
        "id": 377886052,
        "sender_full_name": "Ioannis Konstantoulas",
        "timestamp": 1690132693
    },
    {
        "content": "<p>Note that <a href=\"https://proofassistants.stackexchange.com/\">https://proofassistants.stackexchange.com/</a> does exist, though I think your questions are probably better addressed here</p>",
        "id": 377886221,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690132757
    },
    {
        "content": "<ol>\n<li>There's no key to speak of, but generally the colors just correspond to the first word of the declaration (<code>def</code>/<code>theorem</code>/<code>structure</code>/etc)</li>\n</ol>",
        "id": 377886578,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690132870
    },
    {
        "content": "<ol start=\"2\">\n<li>One summarizes the definition, one actually takes you to the exact source code that defines it (which includes comments). The equation is the _generated_ output; some definitions may have no source at all, while others might use tactics to generate their equations.</li>\n</ol>",
        "id": 377886857,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690132946
    },
    {
        "content": "<p>Oh, so the colors have nothing to do with the implementation status of each item.  OK!</p>",
        "id": 377887251,
        "sender_full_name": "Ioannis Konstantoulas",
        "timestamp": 1690133056
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"577163\">Ioannis Konstantoulas</span> has marked this topic as resolved.</p>",
        "id": 377888877,
        "sender_full_name": "Notification Bot",
        "timestamp": 1690133660
    },
    {
        "content": "<p>If it's in the docs in the first place, then it's almost guaranteed to be implemented!</p>",
        "id": 377890011,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690134099
    },
    {
        "content": "<p>Reading safety, <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Quot.unquot#doc\">docs#Quot.unquot</a> is an example of how something unsafe is rendered (i.e., nothing special besides the <code>unsafe</code> keyword)</p>",
        "id": 377890112,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690134129
    }
]