[
    {
        "content": "<p>Do we ever need (a) <code>AEMeasurable</code>; (b) <code>AEStronglyMeasurable</code> when the codomain is not a <code>NormedAddCommGroup</code>? I guess, one exception is \"a set in a normed add comm group\". Are there any other exceptions?</p>",
        "id": 395988228,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1696988016
    },
    {
        "content": "<p>Also, do we need <code>AEMeasurable</code> for anything but \"an auxiliary definition used to prove theorems about <code>AEStronglyMeasurable</code>\"?</p>",
        "id": 395988393,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1696988103
    },
    {
        "content": "<p>It shows up in my definition of Bernoulli sequences. I don't think I can prove <code>AEStronglyMeasurable</code> there? <a href=\"https://github.com/YaelDillies/LeanCamCombi/blob/main/LeanCamCombi/BernoulliSeq.lean\">https://github.com/YaelDillies/LeanCamCombi/blob/main/LeanCamCombi/BernoulliSeq.lean</a></p>",
        "id": 396023102,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1697007666
    },
    {
        "content": "<p>In practice, the main player is definitely <code>AEStronglyMeasurable</code> (which is the measurability-like condition you need to be able to speak of integrability). I'd say <code>AEMeasurable</code> is there for completeness of the API, and mainly used to build results for <code>AEStronglyMeasurable</code>. We could try to replace it everywhere with <code>NullMeasurable</code> (is that what you are hinting at?), but I'm not sure what we would gain with the refactor.</p>",
        "id": 396025096,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1697008495
    },
    {
        "content": "<p>For me, the main benefit is that <code>NullMeasurable</code> is exactly what was used in measure theory/probability class I took in the university. I don't know if there are courses that use a.e.-measurable functions instead.</p>",
        "id": 396411770,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1697167202
    },
    {
        "content": "<p>If a.e.-measurable functions are common in measure theory/probability courses, then I have no serious arguments (apart from \"less definitions, less lemmas to maintain\"). If not, then IMHO using more common definitions lowers the entry barrier for new users.</p>",
        "id": 396411993,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1697167321
    },
    {
        "content": "<p>In probability theory, the most common assumption (by far) is just measurability (possibly assuming that the measure is complete). The standard (advanced) assumption for integration is Bochner measurability, i.e., <code>AEStronglyMeasurable</code>. I don't think the other notions are as important, and we are free to use what is the nicest for formalization. Since <code>AEStronglyMeasurable</code> is naturally based on <code>AEMeasurable</code> and not on <code>NullMeasurable</code>, I think it is natural for the library to focus more on <code>AEMeasurable</code> than <code>NullMeasurable</code>.</p>",
        "id": 396428655,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1697175933
    },
    {
        "content": "<p>\"Just measurability\" was defined as \"the preimage of a Borel set is Lebesgue measurable\" which is exactly <code>NullMeasurable</code>.</p>",
        "id": 396545518,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1697217632
    },
    {
        "content": "<p>One bonus of <code>NullMeasurable</code> is that it's just <code>Measurable</code> for <code>μ.completion</code>.</p>",
        "id": 396545596,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1697217667
    },
    {
        "content": "<p>I don’t think <code>NullMeasurable</code> is more intuitive than <code>AEMeasurable</code> though. It’s true that it’s more standard, but I would say if you understand completion of measures you should have no trouble at all understanding what <code>AEMeasurable</code> means.</p>",
        "id": 396547840,
        "sender_full_name": "Anatole Dedecker",
        "timestamp": 1697218668
    },
    {
        "content": "<p>\"Just measurability\", for me, means that the preimage of a Borel set is a Borel set. Otherwise, it depends on the choice of a measure, while in general measurability is discussed before the introduction of the notion of measure, right after the introduction of sigma-algebras. When you do things like Markov chains later on, you also have many measures on a single measurable space, and the right notion should obviously not depend on the measure. It's probably a question of teaching tradition depending on the countries!</p>",
        "id": 396553666,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1697221635
    },
    {
        "content": "<p>OK, I see that I'm outnumbered ;) And it was low priority for me anyway.</p>",
        "id": 396555406,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1697222461
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"214703\">Yury G. Kudryashov</span> has marked this topic as resolved.</p>",
        "id": 396580701,
        "sender_full_name": "Notification Bot",
        "timestamp": 1697237850
    }
]