[
    {
        "content": "<p>I recently looked at the list of <a href=\"https://leanprover-community.github.io/100-missing.html\">Missing theorems from Freek Wiedijk's list of 100 theorems</a> and saw that \"61: Theorem of Ceva\" was missing.  As a result, I <a href=\"https://github.com/plby/lean-proofs/blob/main/100Theorems/61.md\">auto- formalized</a> Ceva's theorem using Aristotle.  I then <a href=\"https://github.com/leanprover-community/mathlib4/pull/33388\">attempted to add</a> this proof to the <a href=\"https://github.com/leanprover-community/mathlib4/pull/33388/files#diff-36f3a2db2d8ae3134f0ee13de5cb299396def282d13dd07368845382da143cfbR258-R260\">100 theorems YAML file</a>.</p>\n<p>In the process, I have learned that this was the Nth proof of Ceva's theorem, where \"N is much bigger than 1\".  In particular, I learned that it was proven <a href=\"https://github.com/leanprover-community/mathlib3/pull/10632\">over 4 years ago</a> way back in mathlib3 days.  I don't know what the other N-2 proofs are.  And now, there is <a href=\"https://github.com/leanprover-community/mathlib4/pull/33409\">proof N+1</a> that \"Unlike various previous attempts\", is \"in appropriate generality for mathlib\".</p>\n<p>However, proof N+1 does not use the concepts of distance (signed or unsigned) or of the Euclidean plane.  This was confusing to me, because I polled several professional academic mathematicians and they all thought Ceva's theorem was about distances in triangles in the plane.  I also checked the first 20 or so statements of Ceva's theorem online (Wikipedia, Mathworld, etc) and I couldn't find a version that <em>didn't</em> mention distance.  Accordingly, I was impressed that a version of \"Ceva's theorem\" of \"appropriate generality for mathlib\" was so general that it did not include Ceva's theorem itself as a special case.</p>\n<p>As a discussion topic, I had the following related questions:</p>\n<ol>\n<li>If one of the \"100 theorems\" (or 1000) like Ceva's theorem is proven, but not accepted into mathlib, should it be listed as <a href=\"https://leanprover-community.github.io/100.html\">proven in Lean</a> or should it be <a href=\"https://leanprover-community.github.io/100-missing.html\">missing</a>?</li>\n<li>What if it has been proven \"N&gt;&gt;1\" times?  Can that be documented on the <a href=\"https://leanprover-community.github.io/100.html\">100 theorems page</a>?</li>\n<li>If one of the \"100 theorems\" is proven, and the author attempts to contribute it to mathlib, should it be listed as proven in Lean while it's in process?  What if it's been two years and it still hasn't been accepted yet?  What if it's been 4 years, Lean has changed major version numbers, and the PR was abandoned?  (These questions are not hypothetical.)</li>\n<li>Suppose you have a version of \"Ceva's theorem\", whether in mathlib or not, that doesn't mention distances and in particular doesn't include Ceva's theorem as it appears stated almost anywhere, should <em>that</em> be <a href=\"https://github.com/leanprover-community/mathlib4/blob/da810066f7400ac6d99886567d0ffdcbe7f8c4d8/docs/100.yaml#L244-L247\">listed as proving Ceva's theorem for the purposes of the 100 theorems</a>?</li>\n</ol>",
        "id": 565935125,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767217577
    },
    {
        "content": "<p>It's fine to add a reference to a theorem to the yaml even if it doesn't land in mathlib</p>",
        "id": 565935402,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767217934
    },
    {
        "content": "<p>Freek's list (deliberately, I think) doesn't come with any definition of which of many different but related statements that might informally be considered versions of the same theorem is supposed to be proved to count as having done something on the list (or, what the axiomatic basis is supposed to be for proving things - which affects e.g. whether Pythagoras is close to being true by definition or needs more complicated geometrical reasoning). This leads to such things as how I think for a long time what we listed for the triangle inequality was the <em>definition</em> of a metric space.</p>",
        "id": 565938535,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767221752
    },
    {
        "content": "<p>In the early days of formalization, when few of the theorems on the list had been formalized in any ITP, or indeed in the early days of Lean formalization, when few had been formalized in Lean, simply doing any version of a result on the list, regardless of library integration, helped to demonstrate the abilities of formalization in general, or Lean formalization in particular.</p>",
        "id": 565938623,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767221891
    },
    {
        "content": "<p>We're not in those early days any more (for any result on that list other than FLT). You can of course formalize something on the list for fun <strong>whether or not it's already shown on the list as being formalized in Lean</strong>. But just increasing the number of entries shown as being formalized in Lean (anywhere, whether or not in mathlib) seems of less value to me now. Most of the value from formalizing something new on the list isn't from increasing the number, it's from getting the formalization - and consequently, all the resulting smaller lemmas and definitions used in its proof - into mathlib, in mathlib-appropriate generality (with each lemma in the appropriate generality for that lemma). (And so getting a formalization into mathlib of something on the list previously formalized outside mathlib, without increasing the total number formalized, is as valuable as formalizing for mathlib something on the list not previously formalized at all - and more valuable than formalizing something new on the list but not getting it into mathlib.)</p>",
        "id": 565939112,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767222267
    },
    {
        "content": "<p>This means, for example, that if you're going for the isoperimetric theorem, as one example listed as not done in Lean (though I think someone had a project working on it at some point), doing it in n dimensions, aiming for mathlib, is much better than just doing a 2-dimensional version with a view to getting it done quicker (though the HOL formalization linked from Freek's list as the only one for that theorem is just a 2-dimensional version).</p>",
        "id": 565939259,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767222461
    },
    {
        "content": "<p>I'd prefer the headline number on the 100-theorems page to be the number that are done in mathlib or the mathlib archive, with a second figure for those formalized somewhere else and a prominent red flag on those entries indicating they haven't (yet) been integrated into mathlib.</p>",
        "id": 565939436,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767222701
    },
    {
        "content": "<p>As for Ceva, it's extremely common for a formal statement of a result to have gone through several stages of generalization so it doesn't look very much like the most familiar informal statements of that result. I think it's clear that Ceva is in essence an affine space result, and that other versions should be deduced from an affine space version, and whether you treat the main version for such a list as being an affine space statement, or as being something immediately derived from an affine space statement with <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=dist_left_lineMap#doc\">docs#dist_left_lineMap</a> and similar that say how a general affine statement can be converted to one with distances in the <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=NormedAddTorsor#doc\">docs#NormedAddTorsor</a> case (and then consider the affine space statement itself to be one of the intermediate lemmas that are often the main benefit of formalizing something for mathlib), isn't an interesting question.</p>",
        "id": 565939656,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767223048
    },
    {
        "content": "<p>The question isn't which should be considered the main statement.  The question is whether the \"generalization of X\" in mathlib should even include X at all.</p>",
        "id": 565949002,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767237675
    },
    {
        "content": "<p>This was my first PR to mathlib.  What I've learned is that in the past, people have apparently repeatedly come with proofs of theorems from the \"100 theorems\" list, attempting to get them into mathlib, and they have failed even after 2--4 years of trying.  (I did not know this, and so I too \"fail to engage with past Zulip discussions\".)</p>",
        "id": 565949424,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767238569
    },
    {
        "content": "<p>Mathematically, I've also learned the slightly surprising fact that multiplying some distances together for a point inside a triangle <a href=\"https://github.com/leanprover-community/mathlib3/pull/10632#issuecomment-994971708\">*isn't* Ceva's theorem</a> but a version which <em>doesn't even</em> multiply distances for a point in a triangle IS Ceva's theorem.  Someone should tell Wikipedia and Mathworld.</p>",
        "id": 565949440,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767238593
    },
    {
        "content": "<p>Happy New Year!</p>",
        "id": 565949549,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767238771
    },
    {
        "content": "<p>May the new year bring new contributors that prove a theorem from the \"100 theorems\" list and manage to get them into mathlib while it's still 2026.</p>",
        "id": 565949578,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767238820
    },
    {
        "content": "<p>On a related note, I just found the comment <code>will enter mathlib in 2024</code> in <code>1000.yaml</code>.  Maybe 2026 will be the year?</p>",
        "id": 565950713,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767240449
    },
    {
        "content": "<p>I think we'd save on a lot of man-hours if we had some sort of unofficial 100 theorems list including all of the theorems that have done in Lean before but are not yet (or ever) in Mathlib</p>",
        "id": 565966086,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1767260570
    },
    {
        "content": "<p>My point is that this already exists and it's the 100.yml file</p>",
        "id": 565966668,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767261333
    },
    {
        "content": "<p>PRs to add links to non-mathlib formalizations are welcome</p>",
        "id": 565966701,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767261365
    },
    {
        "content": "<p>I think the state of whether and how an entry on a list of theorems is \"done\" is at least two-dimensional, but the pages we have can't represent that.</p>\n<p>On the \"whether\" axis, there are at least five options:</p>\n<ol>\n<li>Done in mathlib.</li>\n<li>Done in the mathlib archive.</li>\n<li>Done outside mathlib / mathlib archive (possibly with an older version of Lean).</li>\n<li>In progress but not yet <code>sorry</code>-free.</li>\n<li>Not being worked on.</li>\n</ol>\n<p>My disagreement with how things are presented on the current lists is that I think option 3 has more in common with options 4 and 5 than with options 1 and 2 - if something isn't integrated with the current version of mathlib and kept up to date as part of mathlib maintenance, it will probably bit rot and cease to be useful. (Or: I want \"Lean has X and Y and Z\" (implication that it's a single version that has them all), not \"Lean has X\" and \"Lean has Y\" and \"Lean has Z\" (possibly different versions for each of them).)</p>\n<p>On the \"how\" axis, an informal name for a theorem may correspond to several different but related informal statements, each of which may correspond to several different but related formal statements, and not all of these may immediately look very close to being the same theorem. Sometimes one statement is clearly more general than the others, which can be deduced from it; sometimes different statements generalize in different directions. This is <strong>not</strong> actually unique to formalization; you often get cases in informal mathematics where people may refer to theorem X as being essentially the same as / a special case of theorem Y, even if the correspondence is not at all obvious without a more extensive knowledge of the area.</p>",
        "id": 565978612,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767274435
    },
    {
        "content": "<p>2.5. Done with an open Mathlib PR</p>",
        "id": 565979534,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1767275693
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"266253\">Joseph Myers</span> <a href=\"#narrow/channel/287929-mathlib4/topic/100.20theorems.3A.20Ceva's.20theorem/near/565978612\">said</a>:</p>\n<blockquote>\n<p>I think option 3 has more in common with options 4 and 5 than with options 1 and 2 - if something isn't integrated with the current version of mathlib and kept up to date as part of mathlib maintenance, it will probably bit rot and cease to be useful.</p>\n</blockquote>\n<p>It seems a bit extreme to say a proof not being in Mathlib makes it in any sense closer to including <code>sorry</code>. Ideally a completed proof downstream of Mathlib with pinned revisions remains a valid, compiling proof over time. There are technical reasons this may not be true in practice, but this is a general failure of reproducibility in building software (not a problem unique to Lean). I fully agree that inclusion in Mathlib garuntees a level of maintaince to newer versions of Lean that is desirable, but I would find it inaccurate and limiting to say anything outside of Mathlib is inherently a less complete proof.</p>",
        "id": 565982725,
        "sender_full_name": "Chris Henson",
        "timestamp": 1767278959
    },
    {
        "content": "<p>I'd say it's less complete as a <em>project</em> (the greater part of a formalization project is getting things into mathlib, not getting to <code>sorry</code>-free) rather than less complete as a <em>proof</em>.</p>",
        "id": 565984629,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767280950
    },
    {
        "content": "<p>Or: most of the value from mathlib comes from having all the lemmas available together and integrated, rather than thousands of separate small libraries each using a different version of Lean. If you have <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>N</mi></mrow><annotation encoding=\"application/x-tex\">N</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10903em;\">N</span></span></span></span> entries in the list that are in mathlib and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>M</mi></mrow><annotation encoding=\"application/x-tex\">M</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10903em;\">M</span></span></span></span> that aren't, maybe that means that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>N</mi><mo>+</mo><mi>M</mi></mrow><annotation encoding=\"application/x-tex\">N+M</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.7667em;vertical-align:-0.0833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10903em;\">N</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">+</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10903em;\">M</span></span></span></span> is a measure of value based on results in isolation, but <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo fence=\"true\">(</mo><mfrac linethickness=\"0px\"><mi>N</mi><mn>2</mn></mfrac><mo fence=\"true\">)</mo></mrow><annotation encoding=\"application/x-tex\">\\binom{N}{2}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1.2723em;vertical-align:-0.35em;\"></span><span class=\"mord\"><span class=\"mopen delimcenter\" style=\"top:0em;\"><span class=\"delimsizing size1\">(</span></span><span class=\"mfrac\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.9223em;\"><span style=\"top:-2.355em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\">2</span></span></span></span><span style=\"top:-3.144em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.10903em;\">N</span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.345em;\"><span></span></span></span></span></span><span class=\"mclose delimcenter\" style=\"top:0em;\"><span class=\"delimsizing size1\">)</span></span></span></span></span></span> (with <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>M</mi></mrow><annotation encoding=\"application/x-tex\">M</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10903em;\">M</span></span></span></span> not involved at all) is a measure of value based on network effects.</p>",
        "id": 565984951,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767281308
    },
    {
        "content": "<p>ChatGPT tells me that 5 of the 6 highest-profile Lean formalizations aren't part of Mathlib.  (The 6th was Mathlib itself, listed first.)</p>",
        "id": 565985040,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767281400
    },
    {
        "content": "<p>I'm happy that there's a healthy world of formalization in Lean outside of Mathlib.</p>",
        "id": 565985062,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767281422
    },
    {
        "content": "<p>Since it's often the intermediate definitions and lemmas that are more valuable than the leaf results, a Lean formalization can get much of its value by contributing those to mathlib even if the leaf results don't end up there. (But \"highest-profile\" may contribute a different kind of value by attracting people to contribute rather than through the content of the formalization itself. It's less clear that increasing the number done on the 100-theorems list from 89 to 90, say, has that kind of value.)</p>",
        "id": 565985277,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767281666
    },
    {
        "content": "<p>Another significant form of value is the gain in understanding of the strengths and weaknesses of different approaches to formalizing an area of mathematics (different choices of possible definitions, intermediate lemmas that prove useful but might not appear in the informal literature, what kinds of little steps in the proofs were convenient or awkward to do, etc.) - the insights that may then appear in papers about the formalization. How to get that kind of insight when heavily using autoformalization is an open question - did you manage to extract such insights from your interactions with Aristotle to prove things on the 100-theorems list?</p>",
        "id": 565985439,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767281876
    },
    {
        "content": "<p>I'd like to see the entirety of FLT end up in mathlib - but that depends on all the known-in-1980s pieces that are outside the scope of the current project being formalized (and getting those more generally useful pieces into mathlib would also provide a large part of the value of getting FLT into mathlib). However, FLT is at a level of size and complexity where simply doing it at all, anywhere, should give a lot of insights into formalization, which isn't the case now for most of the rest of the 100 theorems list.</p>",
        "id": 565985676,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767282147
    },
    {
        "content": "<p>I don't object to <em>including</em> information about non-mathlib formalizations on the 100-theorems (or 1000-plus) list - it's treating them as done on the same level as mathlib formalizations that I think is misleading.</p>",
        "id": 565985977,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767282460
    },
    {
        "content": "<p>I think we are more in agreement with your distinction between \"project\" and \"proof\", specifically that:</p>\n<ul>\n<li>inclusion in Mathlib implies a high degree of review scrutiny, maintainability, and interoperability with future versions of Lean and Mathlib</li>\n<li>projects outside Mathlib can have correct proofs, but probably more tied to a particular pinning of revisions</li>\n</ul>\n<p>I think your idea of \"project\" still carries an implicit assumption of Mathlib as an end goal for all formalizations. To be clear, I fully agree with you on the immense value that upstreaming to Mathlib provides, but I also recognize that this not necessarily the goal of every formalization project, and that high quality work happens outside of Mathlib. </p>\n<p>With that in mind, I don't find it particularly misleading to include non-Mathlib formalizations of sufficient quality on the 100-theorems list, though it is probably a bit of a historical quirk that these YAML files are hosted in the Mathlib repo. I find this especially true of the 1000-theorems list, as I think there are many theorems that would find difficultly finding a place in Mathlib, such as Church-Rosser that is now in CSLib.</p>",
        "id": 565988242,
        "sender_full_name": "Chris Henson",
        "timestamp": 1767285523
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"687698\">@Chris Henson</span> I think building a list of projects and proofs is a good place to start. I have two proofs that I built/looked at this morning. One that involves a discrepancy between quantity and distance (pigeonhole principle) and one that involves binary choice and the creation of a new object (proof that there are an infinite number of primes). I'm desirous of getting a better mapping of these techniques within proofs. In part because those different kinds of proof techniques take different forms in my \"terrain\" methodology and I want to use that to understand existing proofs and proof theory better</p>",
        "id": 565988662,
        "sender_full_name": "Matthew Coke",
        "timestamp": 1767286220
    },
    {
        "content": "<p>Another note: as far as I'm aware, none of the other languages require a formalization to be part of an integrated library to be listed on Freek's page</p>",
        "id": 565994118,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767293006
    },
    {
        "content": "<p>(Though landing in mathlib is obviously the best outcome for the ecosystem, assuming we have the contributors to maintain the proof)</p>",
        "id": 565994564,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767293700
    },
    {
        "content": "<p>1000-plus, however, <em>does</em> distinguish (\"L\" versus \"X\" status). And I'm more concerned with how we show what we have on the Lean community site (where we could make the difference between various forms of \"done\" a lot more obvious), than with the simplified representation on Freek's site.</p>",
        "id": 565994682,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767293893
    },
    {
        "content": "<p>Regarding the original \"saw it was listed as missing, autoformalized it then discovered past formalizations and discussions\" that started this discussion, maybe the lists of missing theorems from 100-theorems and 1000-plus should have a note at the top of the form \"If you are interested in formalizing one of these theorems, and especially if you are interested in adding a formalization of it to mathlib, you should search Zulip for past discussions and previous work. It may be useful to start a discussion on Zulip if you don't find previous discussions of that theorem, since people on Zulip may know of other attempts at that theorem or have advice on the appropriate form of that theorem for inclusion in mathlib.\". (The <a href=\"https://leanprover-community.github.io/undergrad_todo.html\">undergrad todo list</a> already has such a note. Even after merging some form of the PR starting this discussion, the 1000-plus page should probably also have a note about the likelihood that various theorems there have in fact already been done in Lean without being listed there - and quite a few on 1000-plus are probably easy enough to do in mathlib-ready form that there may be less need to start a discussion first for those if you're confident in what the formalization should look like.)</p>",
        "id": 565995433,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767294737
    },
    {
        "content": "<p>I would suggest that, while mathlib maintainers may be more interested in the list of theorems in mathlib, most readers who come across the webpage would be more interested in the list of formalization attempts overall. Given that the webpage purports to be generated from the .yaml files, it should be straightforward to have it generate qualifiers such as “in progress”, “outside mathlib”, “Lean 3”, etc, as desired.</p>",
        "id": 566000525,
        "sender_full_name": "Lawrence Wu (llllvvuu)",
        "timestamp": 1767302868
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"419930\">Boris Alexeev</span> <a href=\"#narrow/channel/287929-mathlib4/topic/100.20theorems.3A.20Ceva's.20theorem/near/565949440\">said</a>:</p>\n<blockquote>\n<p>Mathematically, I've also learned the slightly surprising fact that multiplying some distances together for a point inside a triangle <a href=\"https://github.com/leanprover-community/mathlib3/pull/10632#issuecomment-994971708\">*isn't* Ceva's theorem</a> but a version which <em>doesn't even</em> multiply distances for a point in a triangle IS Ceva's theorem.  Someone should tell Wikipedia and Mathworld.</p>\n</blockquote>\n<p>It's more common than you may realize to have some disagreement about what \"X's theorem\" is exactly. I <a href=\"https://mathoverflow.net/a/496912\">recently learned</a> that \"Rolle's theorem,\" which nowadays we think of as a theorem of calculus, looks quite different from what Rolle originally proved, and that Rolle himself was skeptical of the logical validity of the infinitesimal calculus! Rolle's original theorem was more about the interlacing of the roots of a polynomial and the roots of its derivative, and what we would call derivatives he called \"cascades,\" which he did not use calculus to define. Rolle would turn over in his grave to discover that a version which doesn't even mention polynomials explicitly, and which involves concepts that were anathema to Rolle, IS Rolle's theorem!<br>\nI think it's best not to be too dogmatic about nomenclature. For the purposes of mathlib, some decisions have to be made, but we don't have to go as far as to say that what goes by \"X's theorem\" in mathlib IS X's theorem.</p>",
        "id": 566003408,
        "sender_full_name": "Timothy Chow",
        "timestamp": 1767307197
    },
    {
        "content": "<p>(BTW </p>\n<p><span class=\"user-mention silent\" data-user-id=\"266253\">Joseph Myers</span> <a href=\"#narrow/channel/287929-mathlib4/topic/100.20theorems.3A.20Ceva's.20theorem/near/565938535\">said</a>:</p>\n<blockquote>\n<p>Freek's list (deliberately, I think) doesn't come with any definition of which of many different but related statements that might informally be considered versions of the same theorem is supposed to be proved to count as having done something on the list</p>\n</blockquote>\n<p>Freek verbally confirmed to me that this was deliberate a few years ago)</p>",
        "id": 566006824,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1767312230
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"607118\">Lawrence Wu (llllvvuu)</span> <a href=\"#narrow/channel/287929-mathlib4/topic/100.20theorems.3A.20Ceva's.20theorem/near/566000525\">said</a>:</p>\n<blockquote>\n<p>I would suggest that, while mathlib maintainers may be more interested in the list of theorems in mathlib, most readers who come across the webpage would be more interested in the list of formalization attempts overall. Given that the webpage purports to be generated from the .yaml files, it should be straightforward to have it generate qualifiers such as “in progress”, “outside mathlib”, “Lean 3”, etc, as desired.</p>\n</blockquote>\n<p>I would be happy to review PRs to the website which would improve things on this front (or incorporate any of the other nice suggestions in this thread about how to communicate the status of formalizations).</p>",
        "id": 566007693,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1767313737
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"266253\">Joseph Myers</span> <a href=\"#narrow/channel/287929-mathlib4/topic/100.20theorems.3A.20Ceva's.20theorem/near/565995433\">said</a>:</p>\n<blockquote>\n<p>maybe the lists of missing theorems from 100-theorems and 1000-plus should have a note at the top of the form \"If you are interested in formalizing one of these theorems, and especially if you are interested in adding a formalization of it to mathlib, you should search Zulip for past discussions and previous work. It may be useful to start a discussion on Zulip if you don't find previous discussions of that theorem, since people on Zulip may know of other attempts at that theorem or have advice on the appropriate form of that theorem for inclusion in mathlib.\"</p>\n</blockquote>\n<p>A nice coincidence <a class=\"message-link\" href=\"/#narrow/channel/217875-Is-there-code-for-X.3F/topic/Pick.27s.20Theorem/near/566008423\">#Is there code for X? &gt; Pick's Theorem @ 💬</a></p>",
        "id": 566008761,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1767315531
    },
    {
        "content": "<p>I think the insistence on getting things into mathlib for a formalization \"project\" is over-stated.  For example, I'm formalizing solutions to Erdős problems, and I'm not holding my breath for mathlib to even consider accepting those.</p>\n<p>So what is the value, then, of these formalizations?  For one, I have pedestrian concerns such as correctness of the mathematics.</p>",
        "id": 566009794,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767316747
    },
    {
        "content": "<p>I would like to explicitly say one of the values of formalizing a theorem on the 100 theorems list <em>outside</em> of mathlib: it just lets people know that it's possible.  As Kevin knows very well, not being able to define the terms in your theorems is a significant impediment to formalizing their proofs.</p>",
        "id": 566009835,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767316852
    },
    {
        "content": "<p>Formalization to ensure correctness is relevant for new results (in which case the quality of the formalization doesn't really matter - though if you write definitions and lemmas in a suitable form for mathlib, you can get that extra benefit out of it, and help the next person formalizing something in the same area of mathematics, even if the final leaf result doesn't go in mathlib - and the mathlib archive would often be a good place for such leaf results, once everything suitable for mathlib proper has gone there). It's relevant for results where the peer review process failed to reach a conclusion on the mathematics (say Con(NF) or the Kepler conjecture, as examples where formalization resolved such doubts). But for the results on the 100-theorems list, we don't have such doubts about correctness (though some people may have had such doubts about the four colour theorem before it was formalized, or at least before the improved proof by Robertson, Sanders, Seymour and Thomas).</p>",
        "id": 566009904,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767317032
    },
    {
        "content": "<p>Consider, for example, \"13. the polyhedron formula\".  Maybe in the version that eventually appears in mathlib, \"in order to have greater generality\", someone needs to prove something about the universal map from an abelian category to its Grothendieck group.</p>\n<p>But for someone trying to just prove things about polyhedra, it's very useful to know that no one has proven V+F-E=2 for polyhedra in part because there's not even a definition of polyhedron.</p>",
        "id": 566009935,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767317120
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"419930\">Boris Alexeev</span> <a href=\"#narrow/channel/287929-mathlib4/topic/100.20theorems.3A.20Ceva's.20theorem/near/566009835\">said</a>:</p>\n<blockquote>\n<p>I would like to explicitly say one of the values of formalizing a theorem on the 100 theorems list <em>outside</em> of mathlib: it just lets people know that it's possible.</p>\n</blockquote>\n<p>We <em>already know</em> it's possible (for everything on that list smaller than FLT).</p>\n<blockquote>\n<p>As Kevin knows very well, not being able to define the terms in your theorems is a significant impediment to formalizing their proofs.</p>\n</blockquote>\n<p>Which is why much of the value from one of these formalizations comes from doing it for mathlib - and thus getting lots of small intermediate definitions and API lemmas for those definitions into mathlib, even if the final leaf result only goes in the mathlib archive not mathlib proper.</p>",
        "id": 566010001,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767317239
    },
    {
        "content": "<p>Okay, not \"possible\" but \"a reasonable thing to do with the current state of Mathlib definitions\"?</p>",
        "id": 566010087,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767317309
    },
    {
        "content": "<p>For the polyhedron formula, you'll find lots of past discussions on Zulip about planar graphs / combinatorial maps / the Jordan curve theorem. Sometimes, yes, you want V+F-E=2 as a leaf result (I'll want it eventually in AperiodicMonotilesLean, which means I want it in mathlib in a form that can be applied to maps drawn in the plane - albeit only I only need it for maps with polygonal regions that are all convex except for the infinite one). But much of the benefit would be from making it possible to talk about lots of <em>other</em> results involving planar graphs (or other things involving the Jordan curve theorem), rather than the specific result.</p>",
        "id": 566010169,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767317494
    },
    {
        "content": "<p>I really should have stopped last year, or at least after this message, which I'll just say again:</p>",
        "id": 566010256,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767317629
    },
    {
        "content": "<p>I'm happy that there's a healthy world of formalization in Lean outside of Mathlib.</p>",
        "id": 566010257,
        "sender_full_name": "Boris Alexeev",
        "timestamp": 1767317630
    },
    {
        "content": "<p>As for Ceva, I'm happy to add more familiar versions in due course, but those would build on the affine versions (and there are lots more affine versions still to be done) - so first the material in that PR (as opposed to all the things that might be related but aren't in the PR) needs to be reviewed until it's ready to go in.</p>",
        "id": 566010357,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767317772
    },
    {
        "content": "<p>It would be interesting if we had AIs that could take non-mathlib formalizations and rework them for mathlib (including reworking definitions based on human feedback, making things more general, etc.), so that mathlib could benefit and grow more from the non-mathlib formalization world - but they aren't quite at that level yet (though if a human suggests the precise sequence of definitions and lemmas desired, they may be able to fill in many of the proofs).</p>",
        "id": 566010611,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1767318285
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"419930\">@Boris Alexeev</span> I'm sorry that you've had a bad experience here. I hope I can offer some slight consolation by suggesting that the discussion you have triggered here is very valuable and will be an input into future decisions regarding how we manage our documentation.</p>\n<p>Regardless of the points discussed above related to mathematical generality and library maintenance, the human factor is also important and we want contributors to have a good experience. I hope that your next contribution will be more enjoyable.</p>",
        "id": 566042693,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1767349711
    }
]