[
    {
        "content": "<p>Generally speaking, we consider lemmas that involve directly equating objects of categories to be 'evil' in Mathlib, in part for aesthetic reasons (since we try to stick to isomorphisms in pen and paper math as well), and in part for practical reasons (since objects are often essentially types, and type equality is painful to work with in Lean.) Fair enough, most of the time -- but sometimes we're working directly with <code>Cat</code> itself, or some other strict bicategory, where in order to use categorical machinery from the rest of the library we need to talk about the strict equality of functors (which implicitly involves strict equality of objects, as well as introducing DTT issues of their own.) As a guy working on categorical graph theory in Mathlib (via <code>Quiv</code>), I trip over this a lot.</p>\n<p>As the resulting lemmas are often quite painful to derive, and it is not always obvious how far their assumptions can be relaxed, I think it would be useful to <em>have</em> a place for 'evil' lemmas -- a <code>StrictCat</code> locale or something along those lines, to be used where lax notions from higher category theory are inappropriate or insufficient.</p>",
        "id": 521021635,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1748495804
    },
    {
        "content": "<p>Also when working with FundamentalGroupoid you do want to refer to the points (= objects) rather than \"identifying\" all points in the same path component. A formalization of the Van Kampen theorem is that <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/AlgebraicTopology/FundamentalGroupoid/Basic.html#FundamentalGroupoid.fundamentalGroupoidFunctor\">FundamentalGroupoid.fundamentalGroupoidFunctor</a> is a co-sheaf, for which we do want to consider colimits in <code>Cat</code>/<code>Grpd</code>.</p>",
        "id": 521095211,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1748525422
    },
    {
        "content": "<p>I would like to mention that in my formalization of the homotopy theory of Kan complexes, it was also helpful to consider the fundamental groupoid as a pseudofunctor: <a href=\"https://github.com/joelriou/topcat-model-category/blob/master/TopCatModelCategory/SSet/Pseudofunctor.lean#L48-L57\">https://github.com/joelriou/topcat-model-category/blob/master/TopCatModelCategory/SSet/Pseudofunctor.lean#L48-L57</a></p>",
        "id": 521105553,
        "sender_full_name": "Joël Riou",
        "timestamp": 1748528774
    },
    {
        "content": "<p>I guess the issue pointed by <span class=\"user-mention\" data-user-id=\"224323\">@Junyan Xu</span> comes from the fact that we do not have the (locally groupoidal) bicategory of groupoids, nor a notion of (co)limits in (2,1)-categories. Considering it as a pseudofunctor to Cat (which in facts lands in its subcategory of groupoid) is probably the way to go.</p>",
        "id": 521106618,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1748529112
    },
    {
        "content": "<p>So, since we seem to have some support for this, do we have a place to put them? My current thought is to just have something like <code>Mathlib.CategoryTheory.Cat.Lemmas</code> and a namespace<code>StrictCat</code>, with as many of the 'evil' lemmas as we can fit into a low-import file and all relevant simps/instances <code>scoped</code> to <code>StrictCat</code>; does anyone have a preference for a better name?</p>",
        "id": 521383311,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1748646259
    },
    {
        "content": "<p>I don't have much context here, but if you're tempted to write these lemmas for a particular category, should you instead be writing some lemma that provides equality back in the language of types (eg apply <code>.hom</code>)?</p>",
        "id": 521383526,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1748646417
    },
    {
        "content": "<p>The \"particular category\" in this case is <code>Cat</code> itself, primarily. The lemmas would be about equality of categorical objects -- objects themselves and functors, and isomorphisms rather than equivalences of categories. And it's precisely the 'evil'-ness of the lemmas that makes it challenging to write general-case lemmas; in short, we see a lot of <code>rewrite failed, motive is not type correct</code> here</p>",
        "id": 521383892,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1748646637
    },
    {
        "content": "<p>I’m running into an other case where we might want to perform some rather evil constructions: the <a href=\"https://kerodon.net/tag/009T\">Duskin nerve of a bicategory</a> is a construction that allows one to embed the theory of bi-categories into the category of simplicial sets, it has some nice properties, for instance, when the bi-category we give it is locally groupoidal, then the Duskin nerve is in fact a quasicategory (in fact, the Duskin nerve is always an (∞, 2)-category, but we don’t have that yet).</p>\n<p>The Duskin nerve requires evil objects such as the 1-category of bicategories (with morphisms strictly unitary lax functors, i.e functors that are unitary \"on the nose\") and the embedding from the strict 1-category of categories in that category.</p>\n<p>I’m not working on the Duskin nerve right now, but I might need it soon. What would be the \"canonical place\" for this construction?</p>",
        "id": 525328696,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1750684320
    },
    {
        "content": "<p>(in this particular case, maybe we can do without the 1-category of bicategories w/ strictly unitary lax functor, but we can’t do without said functors and some equalities about them I think)</p>",
        "id": 525336309,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1750686309
    }
]