[
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/24465\">#24465</a> contains a linter that enforces whitespace formatting on all declarations up to and excluding the type signature.  Essentially, it checks that the \"hypotheses\" of each declaration are correctly formatted.</p>",
        "id": 515514619,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1746109486
    },
    {
        "content": "<p>While the scope is limited, the linter found hundreds of exceptions in mathlib, including one in <a href=\"https://github.com/leanprover-community/mathlib4/pull/24119\">#24119</a>, merged 8 hours ago.</p>",
        "id": 515514632,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1746109491
    },
    {
        "content": "<p>The PR is long, but a lot of it is documentation, tests and making the tests compliant.  All the mathlib adaptation PRs that resulted from it have been completely straightforward.</p>",
        "id": 515514646,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1746109496
    },
    {
        "content": "<p>Another strong point in favour of the linter is that it has no \"special-casing\", although it has an exclusion mechanism to allow the linter to ignore parts of a declaration, based on the syntax type that gave rise to them.</p>",
        "id": 515514660,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1746109499
    },
    {
        "content": "<p>Overall, I think that it works very well and the fact that there isn't a single exception in all of mathlib seems a strong endorsement!</p>",
        "id": 515514665,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1746109501
    },
    {
        "content": "<p>Some previous discussions:</p>\n<ul>\n<li><a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Linting.20space.20around.20variables/with/504535993\">#mathlib4 &gt; Linting space around variables</a> </li>\n<li><a class=\"message-link\" href=\"/#narrow/channel/113488-general/topic/Mathlib.20community.20meetings/near/499861275\">#general &gt; Mathlib community meetings @ 💬</a></li>\n</ul>",
        "id": 515515360,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1746109716
    },
    {
        "content": "<p>As I already said on github (also perhaps on a related PR), I think this is great to have. I look forward to extending this linter in the future, towards checking all formatting (with an opt-out for syntax it doesn't understand). I can try to review the linter implementation soon.</p>",
        "id": 515520422,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1746111213
    },
    {
        "content": "<p>Let me dream big: what is needed to make this closer to an auto-formatter, i.e. enable the author of a pull request to automatically reformat all affected lines to comply with the linter? I presume there are two steps:</p>\n<ul>\n<li>making the linter generate \"try this\" suggestions (or similar) --- this is blocked on <a href=\"https://github.com/leanprover/lean4/pull/4363\">lean#4363</a> (the RFC is accepted, I think - and medium priority)</li>\n<li>some way of \"apply all try this suggestions in this file\" (which could be be useful in many other settings also, such as tryAtEachStep or for auto-fixing all non-terminal simps, and generally for self-rewriting code)</li>\n</ul>\n<p>Is there a way to move any of these items forward?</p>",
        "id": 515520463,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1746111230
    },
    {
        "content": "<p>(Without opening the can of worms that is <code>lake exe refactor</code>.)</p>",
        "id": 515520942,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1746111377
    },
    {
        "content": "<p>Right now, the linter piggy-backs on the pretty-printer for deciding what is correctly formatted or not (plus a little custom-handling of where to put line breaks).</p>",
        "id": 515522532,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1746111850
    },
    {
        "content": "<p>However, the pretty-printer has too many short-comings to be reliably used as an \"oracle formatter\".  This, I view as the main obstacle, and the linter takes no step in this direction.</p>",
        "id": 515522716,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1746111915
    },
    {
        "content": "<p>The other question, of automated code-editing is certainly (and easily) within reach.  I think that all that is lacking is the desire to accept one way as the standard and then build infrastructure around it.</p>",
        "id": 515522946,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1746111957
    },
    {
        "content": "<p>I ran a few tests, before and after <code>refactor</code>, using it and not using it.  They all worked, of course each with its pros and cons.</p>",
        "id": 515523135,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1746112010
    }
]