[
    {
        "content": "<p>There is a discussion about what the category of commutative algebras should be called (<a href=\"https://github.com/leanprover-community/mathlib4/pull/23601\">#23601</a>), and by extensions how should we name similar categories. There are three versions proposed:</p>\n<ol>\n<li><code>CommAlg</code>, if we use this convention we should probably rename <code>AlgebraCat</code> to <code>Alg</code>. This agrees with the notation for <code>Grp</code> and <code>CommGrp</code>. It also is analogous to how &lt;algebraic object&gt;-object categories are named: <code>Mon_ C</code>, <code>Grp_ C</code> etc.</li>\n<li><code>CommAlgCat</code>, agrees with category names such as <code>MonCat</code> and <code>RingCat</code>. It also makes clear that we're talking about a category, and hopefully allows us to avoid issues with overzealous abbreviation (see <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Doset.doset#doc\">docs#Doset.doset</a>).</li>\n<li><code>CommAlgebraCat</code>, agrees with<code>AlgebraCat</code>. This option is arguably the most consistent with the current naming in mathlib, but it is a mouthful.</li>\n</ol>\n<p>I think the first convention is the best as long as it doesn't cause any issues, and we might want to consider renaming other categories to have consistent notation across the board.</p>",
        "id": 513310134,
        "sender_full_name": "Michał Mrugała",
        "timestamp": 1745185691
    },
    {
        "content": "<p>I'm in favour of the second or third: names like <code>Alg</code> in the global namespace are ambiguous and confusing for not much good reason; see also the discussion here <a class=\"message-link\" href=\"/#narrow/channel/287929-mathlib4/topic/Naming.20convention/near/512687004\">#mathlib4 &gt; Naming convention @ 💬</a>. The only examples we have of that style are <code>Grp</code> and <code>CommGrp</code>, which in my eyes are unfortunate exceptions to the otherwise sensible convention that exists. </p>\n<p>With version 1, it's also not clear what happens to something like <code>RingCat</code>: I don't like the idea of naming some of them <code>-Cat</code> and some of them not, depending on the naming choices used elsewhere in mathlib! This is a really easy way to make the naming convention hard to predict</p>",
        "id": 513311909,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1745187124
    },
    {
        "content": "<p>I guess we could change <code>RingCat</code> to <code>Rng</code>, but I can see that getting hairy</p>",
        "id": 513311988,
        "sender_full_name": "Michał Mrugała",
        "timestamp": 1745187219
    },
    {
        "content": "<p>There's a fourth option which is to put those definitions in a namespace. Personally, I find it a bit odd that <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Mon_#doc\">docs#Mon_</a> is in the root namespace when category theory is otherwise very consistently namespaced</p>",
        "id": 513312118,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1745187351
    },
    {
        "content": "<p>Yeah, if these are in a namespace then I'm happy with <code>Grp</code> and <code>Ring</code> and <code>Alg</code> to be the names</p>",
        "id": 513312220,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1745187466
    },
    {
        "content": "<p>Do you really mean <code>Ring</code>? With <code>open CategoryTheory</code> I should imagine that this would cause trouble. Or do you mean <code>Rng</code>?</p>",
        "id": 513312905,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1745188158
    },
    {
        "content": "<p>I imagine calling it <code>Rng</code> might give at least some confusion to new users, since this sometimes refers to a ring without identity element (since you drop the \"i\")</p>",
        "id": 513346426,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1745214733
    }
]