[
    {
        "content": "<p>Hi everyone,</p>\n<p>I’m working with probability theory in mathlib, and I noticed that some commonly used properties — such as independence additivity for common distributions(for example: sums of independent Poissons, exponentials, etc.) — are frequently needed in practical proofs.</p>\n<p>Before I start preparing a PR, I’d like to ask:<br>\nDo you think these lemmas belong in mathlib?</p>\n<p>Is there an existing place in the library where such results should live?</p>\n<p>Are there related ongoing efforts or recommended directions I should review first?</p>\n<p>My motivation is to help reduce boilerplate and make probabilistic reasoning more convenient. I’m happy to contribute if this aligns with current goals of the probability theory library.</p>\n<p>Thanks for your advice!</p>",
        "id": 560984525,
        "sender_full_name": "huaizhangchu",
        "timestamp": 1764495357
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span> and <span class=\"user-mention\" data-user-id=\"223948\">@David Ledvinka</span> have been thinking about making probabilistic reasoning more convenient in mathlib over the last few weeks (motivated by my Annals-formalisation project; the Annals has published several theorems in probability in the last few years).</p>",
        "id": 560984993,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764495834
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/287929-mathlib4/topic/About.20common.20distribution.20independence-additivity.20lemmas/near/560984993\">說</a>：</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"246273\">Bhavik Mehta</span> and <span class=\"user-mention silent\" data-user-id=\"223948\">David Ledvinka</span> have been thinking about making probabilistic reasoning more convenient in mathlib over the last few weeks (motivated by my Annals-formalisation project; the Annals has published several theorems in probability in the last few years).</p>\n</blockquote>\n<p>Thanks again for the pointers!<br>\nJust to mention — I’m still quite new to mathlib and to contributing, so I’m very happy to learn and follow existing plans. My current motivation came from actually needing these lemmas in some work I’m doing, and I thought they might be useful more broadly.</p>\n<p>If there is anything I should read or any way I could help (even small tasks), I’d love to try!</p>",
        "id": 560985521,
        "sender_full_name": "huaizhangchu",
        "timestamp": 1764496098
    },
    {
        "content": "<p>These sound useful but I am not entirely sure what you mean. Maybe post the statements of the lemmas? In general Mathlib is missing a lot of basic probability stuff which should/will eventually be there.</p>",
        "id": 560994445,
        "sender_full_name": "David Ledvinka",
        "timestamp": 1764505195
    },
    {
        "content": "<p>I guess something like <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Probability/Distributions/Gaussian/Real.html#ProbabilityTheory.gaussianReal_add_gaussianReal_of_indepFun\">ProbabilityTheory.gaussianReal_add_gaussianReal_of_indepFun</a> for other distributions</p>",
        "id": 560994545,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1764505294
    },
    {
        "content": "<p>This should probably be stated in terms of <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Probability/HasLaw.html#ProbabilityTheory.HasLaw\">ProbabilityTheory.HasLaw</a> by the way.</p>",
        "id": 560994648,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1764505404
    },
    {
        "content": "<p>Thanks a lot for the feedback!</p>\n<p>Yes — what I had in mind is similar to ProbabilityTheory.gaussianReal_add_gaussianReal_of_indepFun: lemmas stating that the sum of independent random variables with certain distributions has another known distribution (e.g. Poisson, Binomial, Exponential, etc.).</p>\n<p>I’m considering experimenting with adding a new section within the corresponding distribution files (e.g. Poissons, exponentials, …) to develop independence-additivity lemmas, probably phrased using ProbabilityTheory.HasLaw as @Etienne Marion suggested.</p>\n<p>Do you think this approach makes sense from a design perspective?<br>\nOr would it be better to place them somewhere more general (e.g. in a dedicated file for probabilistic reasoning infrastructure)?</p>\n<p>I’d really appreciate any guidance before I start drafting something.<br>\nThanks again for the suggestions!</p>",
        "id": 560995678,
        "sender_full_name": "huaizhangchu",
        "timestamp": 1764506360
    },
    {
        "content": "<p>I think it makes sense to have each statement in the folder corresponding to the distribution, so eg the result about Poisson should go in the file about Poisson distribution. For the exponential this should go in the folder about the Gamma distribution.</p>",
        "id": 560996447,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1764507035
    },
    {
        "content": "<p>Thanks a lot, that makes perfect sense — I’ll try putting each lemma in the corresponding distribution file and see how it works out.<br>\nThanks again for the guidance!</p>",
        "id": 560997619,
        "sender_full_name": "huaizhangchu",
        "timestamp": 1764508117
    },
    {
        "content": "<p>Binomial is currently in active PRs (see <a href=\"https://github.com/leanprover-community/mathlib4/pull/31908\">#31908</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/28248\">#28248</a>), but I think Poisson and Exponential should be fair game. </p>\n<p>There has been some discussion recently on how discrete distributions should be defined but nothing concrete decided. I have advocated for moving away from the PMF approach and using a linear combination of diracs instead (Poisson is already defined in Mathlib using the PMF approach). There is another formalisation specific issue:  which domains should we primarily develop the random variable APIs (and measures) for? As the most extreme example, for positive finite distributions one could  define them on <code>Fin n, ℕ, ℤ, ℝ≥0, ℝ</code>. Should these all be defined in Mathlib with the appropriate relations and duplicated APIs for each one? Note for exponential we don't have a <code>ℝ≥0</code> version. My current opinion is that perhaps the answer for distributions like Poisson is <code>ℕ </code>or <code>ℤ</code> and <code>ℝ</code> but I am very unsure here.  Nevertheless perhaps its hard to know the right answers to these problems without getting it wrong first. So I encourage you to just try \"something\", but I figured I would give you a sense of a few of the \"formalization specific\" issues in this area.</p>",
        "id": 560998760,
        "sender_full_name": "David Ledvinka",
        "timestamp": 1764509175
    },
    {
        "content": "<p>Thanks a lot for the detailed explanation — this gives me much clearer context about the design questions around discrete distributions, PMF vs. linear combination of diracs, and domain choices. I really appreciate the overview.</p>\n<p>Since Poisson and Exponential seem like fair starting points, I’ll explore drafting a few concrete independence-additivity lemmas in the current structure without committing to strong architectural choices. Then hopefully we can evaluate whether this direction fits well or needs adjustment.</p>\n<p>I’ll also take a careful look at the active Binomial PRs (<a href=\"https://github.com/leanprover-community/mathlib4/pull/31908\">#31908</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/28248\">#28248</a>) so that whatever I try stays consistent with ongoing work.</p>\n<p>Thanks again for the encouragement!</p>",
        "id": 561002895,
        "sender_full_name": "huaizhangchu",
        "timestamp": 1764512726
    },
    {
        "content": "<p>I am guessing that you are writing with an LLM. If that is the case, I think it would have been nice to say it from the beginning, as we regularly get AI-generated messages coming from people who completely rely on AI and produce very low quality conversations. I am not saying it is your case, it does look like you are willing to learn and contribute which is great!</p>",
        "id": 561005019,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1764514506
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"223948\">David Ledvinka</span> <a href=\"#narrow/channel/287929-mathlib4/topic/About.20common.20distribution.20independence-additivity.20lemmas/near/560998760\">said</a>:</p>\n<blockquote>\n<p>There has been some discussion recently on how discrete distributions should be defined but nothing concrete decided. I have advocated for moving away from the PMF approach and using a linear combination of diracs instead (Poisson is already defined in Mathlib using the PMF approach). There is another formalisation specific issue:  which domains should we primarily develop the random variable APIs (and measures) for? As the most extreme example, for positive finite distributions one could  define them on <code>Fin n, ℕ, ℤ, ℝ≥0, ℝ</code>. </p>\n</blockquote>\n<p>I agree that weighted sums of Diracs seems like a better approach than PMF.<br>\nFor the domain, it looks like a tricky question that depends a lot on what you want to do with the distribution in your application. I recently implemented Bernoulli distributions for a project, in which it was very convenient to have a space with two points, but I also got to Bernoulli by mapping real distributions while not changing the mean, so having something not too far from <code>ℝ</code> was important. To my surprise, I ended up choosing the subtype <code>({0, 1} : Set ℝ)</code>. I will never advocate for that to be the standard domain for Bernoullis,  so it would be nice to somehow have an implementation in Mathlib that can apply to multiple two-points domains.</p>",
        "id": 561006268,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1764515355
    },
    {
        "content": "<p>Yeah I agree that for specific applications it depends. I guess (for Mathlib) its a balancing act of maintainability, usability and flexibility. Infact I have written up a \"two-point distributions\" file multiple times but never PRed anything because I have been unhappy with some part of the design. I definitely think I tend to be \"too\" perfectionist though. </p>\n<p>May I ask why just having it be a measure on ℝ (say defined like <code>p • .dirac 1 + (1 - p) • .dirac 0</code> or equivalently pushing the measure defined on a smaller type into ℝ) didn't work for you? I ask not because I doubt you but because I want to collect all the different considerations for design.</p>",
        "id": 561008075,
        "sender_full_name": "David Ledvinka",
        "timestamp": 1764516594
    },
    {
        "content": "<p>I was manipulating a quantity similar to a Renyi divergence, which is an infimum over probability measures of something. If my measure was on Real I would have to argue that the minimum was attained at a Bernoulli distribution (otherwise the thing in the infimum would be infinite). With a measure defined on a two points space I get it automatically and can compute the divergence easily.</p>",
        "id": 561011036,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1764518650
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"703970\">Etienne Marion</span> <a href=\"#narrow/channel/287929-mathlib4/topic/About.20common.20distribution.20independence-additivity.20lemmas/near/561005019\">說</a>：</p>\n<blockquote>\n<p>I am guessing that you are writing with an LLM. If that is the case, I think it would have been nice to say it from the beginning, as we regularly get AI-generated messages coming from people who completely rely on AI and produce very low quality conversations. I am not saying it is your case, it does look like you are willing to learn and contribute which is great!</p>\n</blockquote>\n<p>Thanks for pointing that out — and apologies for not mentioning it earlier.<br>\nYes, English is not my first language, so I sometimes use an LLM to help polish my wording, but the ideas and technical content are my own. I will make sure to state this explicitly next time.</p>\n<p>I really appreciate your understanding and the guidance so far. I’m genuinely trying to learn and contribute, and I’m grateful for the patience and help from the community.</p>",
        "id": 561043855,
        "sender_full_name": "huaizhangchu",
        "timestamp": 1764547272
    }
]