[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/31924\">#31924</a>, I started formalizing alternative axiomatizations of boolean algebras, as proposed by Huntington and Robbins. Basically, a boolean algebra is a commutative additive <em>semigroup</em>  with a negation, and one single additional relational axiom. Huntington proved in 1933 that his axiom, <br>\n<code>(xᶜ + yᶜ)ᶜ + (xᶜ + y)ᶜ = x</code> led to boolean algebras. Robbins's axiom, <code>((x + y)ᶜ + (x + yᶜ)ᶜ)ᶜ = x</code>, is the dual of Huntington's, but it happened to be more difficult to prove that it also leads to boolean algebras, this was done in several steps (Winker, 1992; McLune, 1996) using automatic provers.</p>\n<p>My formalization started initially out of fun,  but the translation from mathematical paper to formalized proof ends up being a bit boring and I wonder whether this should land in mathlib or not.</p>",
        "id": 558900960,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1763910455
    },
    {
        "content": "<p>My opinion is that this shouldn't be in mathlib unless there's some other application where making a boolean algebra via these axioms is easier. I proved Robbins' conjecture here <a href=\"https://github.com/leanprover-community/mathlib3/blob/90daf3c2173a1a9c3686c073a6af11609cef04fa/archive/robbins.lean#L444\">https://github.com/leanprover-community/mathlib3/blob/90daf3c2173a1a9c3686c073a6af11609cef04fa/archive/robbins.lean#L444</a> 4 years ago, and similarly to you felt it was a bit boring! But perhaps putting it in Archive makes sense</p>",
        "id": 558915281,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1763924560
    },
    {
        "content": "<p>Because one of my professors was yelling at me that I didn't know Boolean algebras, I went ahead and formalised the Robbins conjecture proof, this time put in <code>Archive</code>: <a href=\"https://github.com/leanprover-community/mathlib4/pull/34963\">#34963</a></p>",
        "id": 572582992,
        "sender_full_name": "Jeremy Tan",
        "timestamp": 1770518245
    }
]