[
    {
        "content": "<p>Hi all — I’m working on formalizing <strong>Delone sets and early aperiodic order theory</strong> in mathlib.<br>\nMy first PR is here:</p>\n<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/32030\">#32030</a></p>\n<p>A reviewer suggested that some of the foundational design choices might benefit from wider visibility, so I’m summarizing them here.<br>\nIf you’d like more background or to see the earlier discussion in detail, the PR conversation contains the full review thread and motivations for the decisions below.</p>\n<hr>\n<h2><strong><code>DeloneSet</code> as a structure</strong></h2>\n<p>The current design bundles:</p>\n<ul>\n<li>\n<p>the underlying set <code>carrier</code>,</p>\n</li>\n<li>\n<p>a proof it is <code>UniformlyDiscrete</code>,</p>\n</li>\n<li>\n<p>a proof it is <code>RelativelyDense</code>.</p>\n</li>\n</ul>\n<p>The structure-based approach avoids the repeated extraction of existential witnesses required by an <code>IsDelone</code> predicate.<br>\nSince later theory  (patches, hulls, repetitivity, tilings, etc.) continuously refers to specific radii (e.g., in patch definitions, repetitivity bounds, hull arguments), having these as explicit fields yields a far more convenient and readable API.</p>\n<hr>\n<h2><strong>Working in <code>MetricSpace</code></strong></h2>\n<p>Classical Delone theory fundamentally relies on <strong>quantitative metric control</strong>:</p>\n<ul>\n<li>\n<p>packing and covering radii,</p>\n</li>\n<li>\n<p>patch windows,</p>\n</li>\n<li>\n<p>tile diameters,</p>\n</li>\n<li>\n<p>repetitivity scales.</p>\n</li>\n</ul>\n<p>These real-valued bounds are fundamental to aperiodic order, so <code>MetricSpace</code> is the appropriate setting.</p>\n<hr>\n<h2><strong>Roadmap</strong></h2>\n<p>After this PR (basic Delone sets), the plan is to develop:</p>\n<ul>\n<li>\n<p>finite local complexity (via difference sets),</p>\n</li>\n<li>\n<p>patches of Delone sets,</p>\n</li>\n<li>\n<p>hulls and minimality under translation,</p>\n</li>\n<li>\n<p>repetitivity and linear repetitivity,</p>\n</li>\n<li>\n<p>basic tiling structures and local finiteness,</p>\n</li>\n<li>\n<p>followed by substitution tilings, Meyer sets, and diffraction.</p>\n</li>\n</ul>\n<hr>\n<p>If anyone has thoughts on these foundational design choices, I’d appreciate feedback now so that the later PRs  (I already have several in the pipeline but haven't proposed them yet) build on solid ground.<br>\nThanks!</p>",
        "id": 561784029,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1764815015
    },
    {
        "content": "<p>I don't have comments specifically on the design choices for Delone sets; what I have to say here relates only to later stages of the development.</p>\n<p>I've also started developing some definitions relating to tilings in <a href=\"https://github.com/jsm28/AperiodicMonotilesLean\">AperiodicMonotilesLean</a> - which I do definitely intend to get back to working on more actively when I have time.</p>\n<p>Now, so far I've only set up definitions there for tilings in a discrete context, on the basis that API setup in a continuous (metric space) context could follow later (with the API set up to parallel the discrete API as far as possible) when the discrete API is more developed - but my expectation would be to work with indexed families of closed sets under a group of isometries, requiring the interiors to be disjoint for it to be a tiling (some authors have other variants such as intersections of measure zero instead of interiors disjoint). I also haven't PRed any of the material about tilings to mathlib, on the basis that building more on top of it first might help confirm whether it's a good API or not (but if people think it's worth putting such material in mathlib before then, I could start PRing some of the 3000 lines of Lean I have there, at the risk that it ends up needing to be reworked later if there turn out to be problems with the API design).</p>\n<p>For the benefit of readers on Zulip not familiar with the field, I should note that there are two different approaches to the idea of aperiodicity in tilings. One (which is the one I'm concerned with for AperiodicMonotilesLean) considers it as a local-to-global phenomenon, where you're concerned with how purely local constraints on how tiles fit together force a global lack of periodicity in the tiling. The other is concerned with structures that show certain kinds of order without being periodic and studies the properties of those structures, which include but aren't limited to tilings arising from sets of tiles that force a lack of periodicity. (You can extremely easily construct a substitution tiling with aperiodicity in the second sense starting from tiles that also admit periodic tilings, and so are not an aperiodic set of tiles in the first sense.) I would hope that common definitions of tiles and tilings can work for both approaches, but the kinds of things done after setting up the definitions may differ somewhat.</p>",
        "id": 561852622,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1764847561
    }
]