[
    {
        "content": "<p>I just noticed that <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.Iso.symm#doc\">docs4#CategoryTheory.Iso.symm</a> doesn't indicate that the declaration is tagged with <code>@[symm]</code>. Is this expected? Note that later declarations on that web page are correctly shown with the <code>@[simp]</code> attribute attached.</p>",
        "id": 313860531,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1670192259
    },
    {
        "content": "<p>I suspect this is an aspect of the whole \"there is no uniform mechanism for asking which attributes are on a declaration\" problem. :-(</p>",
        "id": 314144798,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1670282642
    },
    {
        "content": "<p>I guess that it's not the end of the world if we can't see these in the docs. I've got used to them from mathlib3 but at the end of the day I'm not sure I'm particularly interested in seeing whether something is tagged <code>symm</code> apart from when I'm trying to debug teething troubles with <code>symm</code>.</p>",
        "id": 314181848,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1670311180
    },
    {
        "content": "<p>The issue is that doc-gen4 needs to know about the environment extension and its types etc. In order to access this information. But since symm is not in core (I thibk?) That would require it to pull that in as a dependency cycle :/</p>",
        "id": 314205522,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1670321943
    },
    {
        "content": "<p>It's increasingly clear we need a centralised store of which declarations have which attributes, no?</p>",
        "id": 314205747,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1670322045
    },
    {
        "content": "<p>Thinking further though there might be a way for a package to provide extractor functions to doc-gen via some meta programming mechanism but I'm not sure.</p>\n<p>And I agree that that would be the simpler solution</p>",
        "id": 314205794,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1670322073
    },
    {
        "content": "<p>I am reviving this old topic to ask whether there is </p>\n<ol>\n<li>A list of all <code>mathlib</code> attributes?</li>\n<li>A reference about \"what\"  an attribute is and how it works. I have tried looking at <a href=\"https://github.com/leanprover/lean4/blob/ffac974dba799956a97d63ffcb13a774f700149c/src/Lean/Elab/Tactic/Ext.lean\">the doc for the ext one</a> and it looks daunting. Is there perhaps an easier example to understand what lies behind the scene?</li>\n</ol>",
        "id": 488064793,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1733913235
    },
    {
        "content": "<p>AFAIR, currently, an attribute is a syntax for calling any metaprogram. It is responsible for maintaining its data, and there is no uniform way to query all attributes. If you want to support specific attributes in your code, then you have to look at each of them and see how it stores its data (probably, in some env extension).</p>",
        "id": 488072395,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1733915740
    },
    {
        "content": "<p>Thanks! As a matter of fact mine was more of a pedagogical question, aimed at understanding what is there under the hood rather than adding something to my code.</p>",
        "id": 488073004,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1733915984
    },
    {
        "content": "<p>I'll try to keep on digging.</p>",
        "id": 488073033,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1733915995
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"214703\">Yury G. Kudryashov</span> <a href=\"#narrow/channel/287929-mathlib4/topic/attributes.20in.20docs/near/488072395\">said</a>:</p>\n<blockquote>\n<p>and there is no uniform way to query all attributes.</p>\n</blockquote>\n<p>doesn't <code>#help attribute</code> do this?</p>",
        "id": 488188201,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1733951070
    },
    {
        "content": "<p>I think Yury was indirectly answering your question about \"what\" an attribute is <span class=\"user-mention\" data-user-id=\"300245\">@Filippo A. E. Nuccio</span>, since the point of view of the metaprogrammer is as under the hood as you can get.</p>\n<p>In short: if you write <code>@[my_attr]</code> before a declaration, then this causes a metaprogram to run at some stage of elaboration (configuration: <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Lean.AttributeApplicationTime#doc\">docs#Lean.AttributeApplicationTime</a>), and it can do anything.</p>\n<p>A common sort of attribute is one that has an associated <em>environment extension</em>. The environment extension is often a table that keeps track of some collection of declarations, maybe with some associated data, and the data is saved to disk (in olean files) and loaded again by <code>import</code>.</p>\n<p>Here are the key parts of the <code>@[ext]</code> system.</p>\n<ul>\n<li><a href=\"https://github.com/leanprover/lean4/blob/ffac974dba799956a97d63ffcb13a774f700149c/src/Lean/Elab/Tactic/Ext.lean#L199-L205\">https://github.com/leanprover/lean4/blob/ffac974dba799956a97d63ffcb13a774f700149c/src/Lean/Elab/Tactic/Ext.lean#L199-L205</a> defines the environment extension. The <a href=\"https://github.com/leanprover/lean4/blob/ffac974dba799956a97d63ffcb13a774f700149c/src/Lean/Elab/Tactic/Ext.lean#L193\">tree</a> field indexes <code>ext</code> theorems based on the resulting types, for fast lookup.</li>\n<li>The <a href=\"https://github.com/leanprover/lean4/blob/ffac974dba799956a97d63ffcb13a774f700149c/src/Lean/Elab/Tactic/Ext.lean#L240\">add</a> field for when the <code>ext</code> attribute is declared gives the metaprogram. It is given the declaration being defined. In the basic case of an ext lemma, <a href=\"https://github.com/leanprover/lean4/blob/ffac974dba799956a97d63ffcb13a774f700149c/src/Lean/Elab/Tactic/Ext.lean#L260\">this line</a> is where the lemma is installed in the environment extension (where it is added to <code>tree</code>).</li>\n<li>Much of the other code is for realizing <code>ext</code> theorems for structures and <code>ext_iff</code> theorems from <code>ext</code> theorems. There's also some validation that the <code>ext</code> theorems have the correct form.</li>\n</ul>\n<p>Then, the <code>ext</code> tactic reads this environment extension when trying to find an applicable ext lemma. If there were no <code>ext</code> tactic, there would still be a case for having a <code>@[ext]</code> attribute: we could delete the environment extension, and then <code>@[ext]</code> would just be responsible for realizing <code>ext</code> theorems for structures and for realizing <code>ext_iff</code> theorems from <code>ext</code> theorems. In that case, there would be no way to know for sure whether <code>@[ext]</code> was ever applied (all we can see is that there are the <code>ext</code> and <code>ext_iff</code> theorems available, which may have been written by hand).</p>",
        "id": 488188474,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1733951172
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"684366\">@Edward van de Meent</span> Yury means \"there's no uniform way to query the data of attributes\". You are right that you can query Lean for the list of all attributes that exist.</p>",
        "id": 488188600,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1733951221
    },
    {
        "content": "<p>There's a core PR in progress for \"attribute delaborators\" to give an interface where attributes can read their own data and represent themselves as syntax, on a best-effort basis. <a href=\"https://github.com/leanprover/lean4/pull/6115\">lean4#6115</a></p>",
        "id": 488188803,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1733951295
    },
    {
        "content": "<p>Wow, thanks a lot for the detailed explanation. It'll take time to digest, in the meanwhile I am really grateful.</p>",
        "id": 488623411,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1734007009
    }
]