[
    {
        "content": "<p>Git has a nice \"hooks\" feature that allows one to run scripts before/after different git actions (commit, push, etc. ) and allows for instance to prevent pushing if <code>lake exe lint-style</code> fails, or running <code>lake exe cache get</code> upon branch switching.</p>\n<p>As these hooks have to be put in the <code>.git</code> folder by default, they are not subject to version control, and so it’s normally up to each and everyone to setup their hooks, but I believe some of them could (and should) be distributed and put up automatically when setting up mathlib (for instance, the lint-style one before pushing) or when running <code>lake update</code> on mathlib.</p>\n<ul>\n<li>What should be the \"right way\" to do this? Would adding a <code>lake exe setup-hooks</code>, documenting its existence and recommend running it once when setting up a mathlib fork be acceptable?</li>\n<li>Which hooks would be considered good as having \"by default\"? I would say <code>lake exe lint-style</code> before pushing would be nice, what are other \"cheap linters\" that could be run before pushing? Conditioning pushing to a <code>lake build</code> is perhaps too much given that it might take a while on some systems.</li>\n</ul>",
        "id": 481284199,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1731061581
    },
    {
        "content": "<p>We used to have that in lean 3, though I ended up turning it off because I often didn't want/need the cache and it takes a while to try to download everything</p>",
        "id": 481288805,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1731063130
    },
    {
        "content": "<p>yes, post-checkout <code>lake exe cache get</code> should probably not be a default, I’d say most defaults should concern <code>pre-push</code>-type of hooks.</p>",
        "id": 481289457,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1731063340
    },
    {
        "content": "<p>Before think about if/how to distribute, I think we can start by having a nice collection that we can point to, on the website</p>",
        "id": 481311270,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1731071222
    },
    {
        "content": "<p>And once that has stabilized we can think about distributing it by default</p>",
        "id": 481311301,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1731071238
    },
    {
        "content": "<p>Could running of <code>lake exe mk_all</code> be turned into a hook too? I often get caught up on this one and it seems relatively simple as a task.</p>",
        "id": 525094559,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1750448033
    },
    {
        "content": "<p>(or is it already available somewhere? Did the collection that <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span>  proposed get compiled at some point?)</p>",
        "id": 525094741,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1750448136
    },
    {
        "content": "<p>I might suggest that to start with, we could have a tracked <code>git_hooks</code> folder in the repository containing sample hooks files with instructions on how to move the files into the <code>.git</code> directory and set them up. </p>\n<p>Here's a PR (<a href=\"https://github.com/leanprover-community/mathlib4/pull/26239\">#26239</a>), though I would be happy to hear more about which hooks we think are appropriate for which commands by default.</p>",
        "id": 525103090,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1750453383
    }
]