[
    {
        "content": "<p>I have noticed some issue with the current usage of <code>awaiting-zulip</code>: Reviewers tend to mark a PR <code>awaiting-zulip</code> as soon as they expect the PR author to create a discussion on Zulip, rather than when that discussion is actually created. This means that plenty of PRs tagged <code>awaiting-zulip</code> are actually awaiting an action from the author, rather than from the community.</p>",
        "id": 515909207,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1746282984
    },
    {
        "content": "<p>For example, <a href=\"https://github.com/leanprover-community/mathlib4/pull/19872\">#19872</a> was tagged <code>awaiting-zulip</code> even though the relevant Zulip discussion didn't exist until five minutes ago.</p>",
        "id": 515909258,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1746283012
    },
    {
        "content": "<p>The description of the <code>awaiting-zulip</code> tag makes it quite clear that there is an expectation that the Zulip discussion already exists:</p>\n<blockquote>\n<p>There is a Zulip discussion; the author should await and report/implement the decision reached there</p>\n</blockquote>",
        "id": 515909430,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1746283087
    },
    {
        "content": "<p>Could I please ask reviewers to only use <code>awaiting-zulip</code> once there's a clearly signposted Zulip discussion linked to from the PR? This will ensure that labels stay actionable.</p>",
        "id": 515909545,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1746283163
    },
    {
        "content": "<p>IMHO, explicitly asking the author to start a discussion is enough to use this label.</p>",
        "id": 515914449,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1746285664
    },
    {
        "content": "<p>OTOH, I understand why you prefer to have <code>awaiting-author</code>, not <code>awaiting-zulip</code> in this case.</p>",
        "id": 515914637,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1746285764
    },
    {
        "content": "<p>What about the following?</p>\n<ul>\n<li>We add a bot that adds <code>awaiting-zulip</code> whenever the PR description has <code>- [ ] Zulip discussion: link</code></li>\n<li>The same bot marks this TODO item as done whenever the Zulip discussion is marked as resolved.</li>\n<li>If a reviewer requests the author to start a Zulip thread, they use <code>awaiting-author</code> and post a standard message (we can have it in saved responses).</li>\n</ul>",
        "id": 515915089,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1746286000
    },
    {
        "content": "<p>Another option for item 3: if a reviewer adds <code>awaiting-zulip</code> but there is no <code>- [ ] Zulip discussion:</code> in the description, then a bot posts a standard message and changes the label to <code>awaiting-author</code>.</p>",
        "id": 515915207,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1746286074
    },
    {
        "content": "<p>Of course, someone has to write this bot.</p>",
        "id": 515915244,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1746286082
    },
    {
        "content": "<p>Is a convention of \"apply both awaiting-author and awaiting-zulip\" sufficient here?</p>",
        "id": 515922909,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1746290255
    }
]