[
    {
        "content": "<p>Hello everyone, this is my first message here and I'm really glad to be finally participating in this community.</p>\n<p>Among other things, I'm really interested in combinatorics, so I was excited when I realized mathlib didn't yet include a proof that bell numbers count partitions.  I do see that we have Multibell numbers since even Finsets are still implemented as Multisets first, but yeah, the correspondence between multibell numbers and multiset partitions hasn't yet been established.</p>\n<p>I already have an almost complete proof that the standard bell numbers count partitions of Finsets! And I'm really excited I managed to get there, but I want to understand how can I contribute this to Mathlib. Of course I can try enhancing the proof to be more general and consider multisets, but more than that I want to know if there are any naming conventions, or maybe line of code metric (my proof is currently around 700 lines) that I need to satisfy, or if maybe I need to be more through in reusing other results already in mathlib etc</p>\n<p>Also, more on proof structure, I want to understand if it's ok to use simp, or if I need to always use simp only, and in general what constitutes a clean proof that's up to mathlib standards</p>\n<p>I'm open to feedback and I already expect to hear that my Lean is not that good yet, but I really want to start contributing to mathlib so I don't mind: <a href=\"https://github.com/Eduardogbg/lean-play/blob/main/BellParts/Partition.lean\">Partition.lean</a></p>\n<p>(also I know that there's already a partition struct in mathlib but this one is simpler I think as it's just for finsets? Tho I'm not sure)</p>\n<p>Thanks so much for your help</p>",
        "id": 523129546,
        "sender_full_name": "Eduardo",
        "timestamp": 1749486975
    },
    {
        "content": "<p>Your link leads to 404.</p>",
        "id": 523135021,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1749488778
    },
    {
        "content": "<p>This is a nice result. There are summaries of mathlib's naming conventions and programming rules on mathlib's main page  : </p>\n<ul>\n<li><a href=\"https://leanprover-community.github.io/contribute/style.html\">Library style guidelines</a></li>\n<li><a href=\"https://leanprover-community.github.io/contribute/naming.html\">Naming conventions</a></li>\n</ul>",
        "id": 523135250,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1749488873
    },
    {
        "content": "<p>oopsie sorry repo is public now</p>",
        "id": 523135309,
        "sender_full_name": "Eduardo",
        "timestamp": 1749488901
    },
    {
        "content": "<p>ok I realize now a few things:</p>\n<ol>\n<li>the partition on <code>Enumerative</code> is integer partition, not set partition, I got confused (especially considering Bell is there as well). I realize now that I probably should use <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Data/Setoid/Partition.html\">Data.Setoid.Partition</a></li>\n<li>Since there's a <a href=\"https://github.com/leanprover-community/mathlib4/blob/7deb334c5f5104f4edad1a6396dd02a8cddefb86/Mathlib/Data/Setoid/Partition.lean#L25C1-L30C1\">TODO on Setoid.Partition</a> my argument could be around <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Order/Partition/Finpartition.html#Finpartition.parts\">Order.Partition.Finpartition</a> instead, but I would have it to specialize to Fintypes anyways.</li>\n<li>Considering I could generalize it for Multiset instead (to complete the <a href=\"https://github.com/leanprover-community/mathlib4/blob/7deb334c5f5104f4edad1a6396dd02a8cddefb86/Mathlib/Combinatorics/Enumerative/Bell.lean#L32C1-L36C1\">TODO on Bell</a>) that's already many different paths I go through</li>\n</ol>\n<p>would appreciate some input on how to go about this on the cleanest way</p>",
        "id": 523158537,
        "sender_full_name": "Eduardo",
        "timestamp": 1749498957
    }
]