[
    {
        "content": "<p>Thanks for doing this! I'm glad I'm not the only one that was slightly uncomfortable with the lack of a convention :)</p>\n<p>Here are some more bikesheds I've noticed, if you (or anyone) would like to fix:</p>\n<ol>\n<li>Spacing in the introduction of the files. I.e. we have a sequence 1. the copyright 2. the imports, 3. the docstring,  4. the end of docstring <code>-/</code> marker, and 5. the lean code. Some files put a space (or more!) in between some of these steps, some don't, etc.</li>\n<li>Should the title for the introduction docstring be <code>/-! # Title</code> or <code>/-! \\n # Title</code>? Similarly for titles of sections.</li>\n<li>Should one line docstrings be closed in the same line, or in the next one? (I've been told it should be in the same line, but there are plenty that don't do this, and I don't see this in the guidelines)</li>\n<li>Some docstrings/comments just end a line and continue to the next line despite not being close to the line character limit, e.g. <a href=\"https://github.com/leanprover-community/mathlib4/blob/master/Mathlib/Order/Filter/CountableInter.lean#L138\">this</a></li>\n<li>No convention of break lines in between <code>universe</code>/<code>variable</code> and <code>namespace</code>/<code>section</code> declarations. (My own preference is that there should be no line breaks in between <code>universe</code> and <code>variable</code>, and a line break between every other pair)</li>\n</ol>",
        "id": 533251662,
        "sender_full_name": "Fernando Chu",
        "timestamp": 1754558200
    },
    {
        "content": "<p>(3) has been discussed in a different thread: as I understand it, there's some consensus, but there are (at least) 2500 doc-strings to fix. So that will only happen with some automated help.</p>",
        "id": 533252278,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1754558445
    },
    {
        "content": "<p>Let me move this to a different thread: trying to keep the bikeshedding somewhat searchable.</p>",
        "id": 533252372,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1754558482
    },
    {
        "content": "<p>3 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Style.20.3Abicycle.3A.20.3A.20indenting.20second.20lines.20in.20doc-strings/with/533235940\">#mathlib4 &gt; Style :bicycle: : indenting second lines in doc-strings</a> by <span class=\"user-mention silent\" data-user-id=\"634338\">Michael Rothgang</span>.</p>",
        "id": 533252440,
        "sender_full_name": "Notification Bot",
        "timestamp": 1754558519
    },
    {
        "content": "<p>Re (4): some doc-strings in mathlib use semantic line breaks (I believe), but these are a great minority.<br>\nIf you see a doc-string which fits (4) but is not a semantic line break, feel free to make a PR. (I don't think these are very high priority, though. I'm making the doc-string changes because I have a linter written which can enforce them.)</p>",
        "id": 533252672,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1754558612
    }
]