[
    {
        "content": "<p>Hi everyone,</p>\n<p>While working on <a href=\"https://github.com/leanprover-community/mathlib4/pull/6045\">#6045</a>, I encountered an interesting phenomenon. I was modifying the definition of <code>IsLocalRingHom</code>, which led to many instances in the algebraic geometry files breaking. I found that there is a file named <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Algebra/Category/Ring/Instances.html\">Mathlib.Algebra.Category.Ring.Instances</a> that contains all the <code>IsLocalRingHom</code> instances required by the algebraic geometry files. Despite the changes to the <code>IsLocalRingHom</code> definition, this file compiled perfectly. However, subsequent files that were supposed to depend solely on instances in this file failed to compile.</p>\n<p>I'm curious if it would be beneficial to implement a mechanism (perhaps involving transparency or priority) that requires all instance searches within a file to first/only rely on certain predefined instances. This could potentially significantly reduce the instance search time for very late files.</p>",
        "id": 475523847,
        "sender_full_name": "Jiang Jiedong",
        "timestamp": 1728381332
    },
    {
        "content": "<p>Have you looked into why the instances are breaking? If it is not a timeout issue but that Lean cannot find them completely, I don't think the solution proposed will help here.</p>",
        "id": 475574017,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1728396918
    },
    {
        "content": "<p>I agree with you, <span class=\"user-mention\" data-user-id=\"439483\">@Andrew Yang</span>, that this approach will not solve issues beyond the timeout problem. However, I believe it could assist in more quickly identifying the real cause of the issue. If there are found instances where the search does not pass through the file <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Algebra/Category/Ring/Instances.html\">Mathlib.Algebra.Category.Ring.Instances</a> as designed, we could detect it early, potentially reducing future maintenance work.</p>",
        "id": 475583578,
        "sender_full_name": "Jiang Jiedong",
        "timestamp": 1728398526
    },
    {
        "content": "<p>Without looking, things are probably getting filtered out by the discrimination tree here.</p>",
        "id": 475584625,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1728398739
    },
    {
        "content": "<p>The current instance problem after <a href=\"https://github.com/leanprover-community/mathlib4/pull/6045\">#6045</a> is indeed not a timeout problem. I suspect something undesired is happening in the coercion process when one writes <code>LocalRing.ResidueField.map (f.stalkMap x)</code>.</p>",
        "id": 475584723,
        "sender_full_name": "Jiang Jiedong",
        "timestamp": 1728398758
    }
]