[
    {
        "content": "<p>Hey guys, I have seen that Brouwer's fixed point theorem is proven in lean3 <a href=\"https://github.com/Shamrock-Frost/BrouwerFixedPoint/blob/master/src/brouwer_fixed_point.lean\">https://github.com/Shamrock-Frost/BrouwerFixedPoint/blob/master/src/brouwer_fixed_point.lean</a></p>\n<p>I would like to port it and its result to mathlib4, since I might want to do some game theory, and for that I likely need either Brouwer or Kakutani.</p>\n<p>Is this a good idea. It seems that the way to prove it is to calculate homology groups of spheres and balls. The idea is that if Brouwer is false then there exists a homotopy ball -&gt; sphere. and homotopy equivalence implies that the homology groups are isomorphic. however the homology groups of the ball and sphere are not isomorphic.</p>\n<p>Also there seems to be some work regarding simplicial homology and how it relates to singular homology.</p>\n<p>Any ideas, suggestions?</p>",
        "id": 452218368,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1721263074
    },
    {
        "content": "<p>I am not aware of developments about homology of topological spaces or simplicial sets in mathlib, but it would be very good projects!</p>",
        "id": 452239477,
        "sender_full_name": "Joël Riou",
        "timestamp": 1721274962
    },
    {
        "content": "<p>So as of right now I am trying to figure out how the port works. The lean3 repository doesn't even compile and it gives me weird oom or type errors. What would be the starting point even, would it be simplicial homology?</p>",
        "id": 452243473,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1721276877
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110401\">@Brendan Seamas Murphy</span> <span class=\"user-mention\" data-user-id=\"231775\">@Brendan Seamas Murphy</span> What's the status of Brouwer porting / inclusion into mathlib?</p>",
        "id": 452248794,
        "sender_full_name": "Thomas Browning",
        "timestamp": 1721279497
    },
    {
        "content": "<p>Hi! I'm just confirming commit be49bf8 builds before I reply to the open issue. The short version is that the project was out of date with mathlib3 at the time of completion and broke when updated. I and I had planned to get it up to the latest version before running mathport but didn't finish. I'd love to see this ported and would be happy to help if you have questions <span class=\"user-mention\" data-user-id=\"725717\">@metakuntyyy</span>. I believe be49bf8 should build and would be a good comparison to the latest commit but it might be a waste of work to restart from there</p>",
        "id": 452249957,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1721280179
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"214703\">@Yury G. Kudryashov</span> might know about relevant PRs or changes in mathlib4 about the simplex stuff</p>",
        "id": 452250009,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1721280226
    },
    {
        "content": "<p>I guess the whole homological algebra machinery in mathlib4 is quite different from what is used in your project, right?</p>",
        "id": 452250167,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1721280331
    },
    {
        "content": "<p>Hmm, probably the stuff copied from LTE can be removed</p>",
        "id": 452251972,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1721281321
    },
    {
        "content": "<p>Yeah, that sounds great <span class=\"user-mention\" data-user-id=\"110401\">@Brendan Seamas Murphy</span> </p>\n<p>I've always to understand the connection between homology and topology and the construction of the homology groups in detail. I guess this should be a fine project for a beginner, given that the solution is already there.</p>",
        "id": 452441284,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1721336999
    },
    {
        "content": "<p>I ported some simple lemmas that don't involve homologies some time ago. I'm ready to talk about the best way to fit this or that non-homological lemma (point topology, linear algebra) in Mathlib 4, but I have no experience with the implementation of homology in Mathlib.</p>",
        "id": 452441603,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1721337149
    },
    {
        "content": "<p>Also as a bonus, if the proof is done I might try to port the results to metamath. It misses a lot of concepts and definitions.</p>",
        "id": 452441800,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1721337238
    },
    {
        "content": "<p>It would be nice to have a version that builds against Mathlib 3 <code>master</code> branch, then run <code>mathport</code> and start going through the files.</p>",
        "id": 452442057,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1721337343
    },
    {
        "content": "<p>Is there any documentation how the mathport works? Has anyone done it and what is the general idea behind it?</p>",
        "id": 452442187,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1721337401
    },
    {
        "content": "<p>Mathlib was ported using <code>mathport</code>. Once we have a version that builds with the latest mathlib3, I can run <code>mathport</code> for you.</p>",
        "id": 452442264,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1721337449
    },
    {
        "content": "<p>Ah great, so I assume most things remaining to be done is documentation of the ported lemmas?</p>",
        "id": 452442434,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1721337536
    },
    {
        "content": "<p>No, a lot of code was not up to Mathlib standards. Also, homologies are done differently in Mathlib 4, so you'll need to rewrite parts of the proof using a different API.</p>",
        "id": 452442520,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1721337596
    },
    {
        "content": "<p>But the first step is to make it compile.</p>",
        "id": 452442722,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1721337710
    },
    {
        "content": "<p>Ah ok, I think I understand it. Because there are tons of ways to do the same thing in mathematics the goal is to use unified data structures. For example you can define two similar concepts in a slightly different way. The goal is to use the unified api of mathlib, where in the port a different api is used.</p>\n<p>Did I understand that one correctly?</p>",
        "id": 452442894,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1721337804
    },
    {
        "content": "<p>Yes, some of the mathematical facts in the repository was already added to Mathlib, sometimes under a slightly different name or using different API. If we want to merge it to Mathlib, then we need to port the code to Mathlib definitions.</p>",
        "id": 452443051,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1721337903
    },
    {
        "content": "<p>Understood, thanks.</p>",
        "id": 452443096,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1721337928
    },
    {
        "content": "<p>The major place where this happens is that the project uses a different definition of standard topological simplices than mathlib. When I was planning to port this I was planning to change the definition in mathlib to the one used this project (which uses the existing machinery in other parts of mathlib for simplices defined as a convex hull, while the current definition is ad-hoc. Iirc)</p>",
        "id": 452443404,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1721338090
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110401\">@Brendan Seamas Murphy</span> correct me if I'm wrong, but if the project depends on a fair amount of LTE, then I think trying to use mathport might be painful. Or is the dependency on LTE pretty light?</p>",
        "id": 452487651,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1721365332
    },
    {
        "content": "<p>AIUI (just an interested bystander), thia project depended on LTE - and then replaced this dependency by manually inlining the relevant parts (still ten thousand lines, but much less than LTE).</p>",
        "id": 468567974,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1725802447
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110401\">@Brendan Seamas Murphy</span> Did you get to confirming <code>be49bf8</code> builds? How much effort would it be to makes this project build with the latest mathlib(3)?</p>\n<p><a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/Orientable.20Surface/near/468552782\">Just today</a>, I was reminded of some result which would really like to use homology groups of spheres. I understand this project won't be mathlib-PRable as-is, but porting it to Lean 4 still seems like a major step forward; I would be a shame to see this silently wither.</p>",
        "id": 468568172,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1725802576
    },
    {
        "content": "<p>I fear that porting this to Lean 4 using mathport will be a lot of effort, and the end result would be something that is still quite far from mathlib compatibility (in the strict sense). After all, homological algebra went through a massive refactor.<br>\nSo I think it might be better to use this repo as a very detailed blueprint, and just rewrite it in idiomatic mathlib4 homological algebra.</p>\n<p><span class=\"user-mention\" data-user-id=\"459699\">@Joël Riou</span> what do you think?</p>",
        "id": 468995622,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1725949618
    },
    {
        "content": "<p>Yes, I would agree that it would be more interesting and efficient to use Brendan's repository as a blueprint/inspiration on how to proceed, and rewrite the code.</p>",
        "id": 469055396,
        "sender_full_name": "Joël Riou",
        "timestamp": 1725964720
    }
]