[
    {
        "content": "<p>I did a complete rewrite of <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=NONote#doc\">docs#NONote</a> in my own <a href=\"https://github.com/vihdzp/ordinal-notation/blob/master/OrdinalNotation/Notations/Cantor.lean\">ordinal notations repository</a> about a year ago. I kind of left it at that since I figured no one would want to review a rewrite this big, but I just came across <a href=\"https://github.com/leanprover-community/mathlib4/pull/27187\">#27187</a> by <span class=\"user-mention\" data-user-id=\"569722\">@Miyahara Kō</span>.</p>",
        "id": 529539805,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1752884629
    },
    {
        "content": "<p>I'm wondering, should I PR this to Mathlib? The file gets rewritten completely and (in my opinion) improved in a bunch of ways. Copying from the docstring:</p>\n<ul>\n<li><code>ONote</code> is renamed to <code>PreCantor</code> and <code>NONote</code> is renamed to <code>Cantor</code>.</li>\n<li>The <code>Preorder</code> instance is no longer defined in terms of <code>repr</code>, thus making it computable.</li>\n<li><code>NFBelow</code> is disposed of, and <code>NF</code> is no longer a typeclass.</li>\n<li>\n<p>The definition of <code>opow</code> is heavily simplified, avoiding multiple auxiliary definitions and<br>\n  instead relying only on <code>natOpow</code>.</p>\n</li>\n<li>\n<p>Most proofs are golfed substantially by relying on new lemmas for ordinal arithmetic (in<br>\n  particular, I got rid of those hideous <code>simp only says</code>).</p>\n</li>\n</ul>",
        "id": 529539848,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1752884698
    },
    {
        "content": "<p>(In retrospective maybe NF should stay as a typeclass, but everything else is to me an improvement)</p>",
        "id": 529539951,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1752884826
    },
    {
        "content": "<p>I can try to tweak my code to make it a bit closer to what's in Mathlib currently, but I don't think there's a way to do my refactor without either temporarily removing a lot of the functionality from <code>ONOte</code> and PRing it back gradually, or doing a huge 1000-line PR at once.</p>",
        "id": 529540108,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1752885053
    },
    {
        "content": "<p>I took a look at your repository and it seems you have a library for Veblen ordinal notation. Since this is a strict superset of Cantor's ordinal notation, and because ordinal notation can be very useful—especially for things like an ordinal version of the <code>norm_num</code> tactic as the notations grow—I'd suggest replacing the current <code>NONote</code> with your Veblen ordinal notation rather than the Cantor one.<br>\nI'm not an reviewer, but I’ve made over 300 PRs so far, and non-reviewer feedback is welcome, so I’ll be happy to review it!</p>",
        "id": 529540382,
        "sender_full_name": "Miyahara Kō",
        "timestamp": 1752885497
    },
    {
        "content": "<p>My Veblen ordinal notation is incomplete, unfortunately. I was trying to create a more general framework for ordinal notations, noting that most of them have the form of an inductive lists of lists, but I never really completed that project.</p>",
        "id": 529540447,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1752885606
    },
    {
        "content": "<p>In truth I think the ideal scenario would be to have multiple ordinal notations for multiple uses. Veblen's ordinal notation is far from the most general one; there's Veblen's Klammersymbolen, there's Buchholz's notation, and a lot of more esoteric stuff.</p>",
        "id": 529540583,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1752885798
    },
    {
        "content": "<p>Maybe it's best to have all of them available rather than just trying to do the single most powerful one</p>",
        "id": 529540595,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1752885819
    },
    {
        "content": "<p>I see. In any case, a PR refactoring Cantor's ordinal notation is very welcome!</p>",
        "id": 529541968,
        "sender_full_name": "Miyahara Kō",
        "timestamp": 1752887650
    },
    {
        "content": "<p>I'll assemble the PR. I'll see if there's a way to minimize it.</p>",
        "id": 529541991,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1752887692
    }
]