[
    {
        "content": "<p>I am surprised to see <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.Limits.Fan.proj#doc\">docs#CategoryTheory.Limits.Fan.proj</a> and Cofan.inj  are <code>def</code>s rather than <code>abbrev</code>s, as they are introducing a new way to talk about the same thing, and seem like they just increase the API surface area, and block rewriting. Does anyone remember the history here (I fear that I am to blame, long ago...)?</p>",
        "id": 508182102,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1742966042
    },
    {
        "content": "<p>I think we can just try to make it an <code>abbrev</code> and see what happens?</p>",
        "id": 508186866,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1742968854
    },
    {
        "content": "<p>I'm not too happy about this. Specifically in the limits parts of the category theory library we have the problem that there are already a lot of <code>abbrev</code>s which mean that in many situations the lemma that you need to apply has a name that is quite different from what you see in the goal. I think this is one of the reasons why the category theory part of mathlib has a reputation of being difficult to learn.</p>\n<p>Looking at the data, this problem seems to be confined mostly to the fact that we repeat a lot of the general limits API definition for every special shape (I had thought that there are more examples outside of the special shapes, but it looks like I was wrong). I wish we could find a solution for this. I understand that it's nice to have the specialized API, and I understand that repeating all of the limits lemmas for every special shape is painful, but the current situation of \"either <code>simp</code> can solve the goal, or I need to go look what the thing on my screen actually means and then manually look through the general limits API to find the matching lemma which looks completely different from my goal\" is also very unsatisfying in my opinion.</p>\n<p>In the case of products, I think that there is a good reason to have a \"hard\" (<code>def</code>) abstraction barrier, namely that we might want users (perhaps especially those who just use category theory while working on results from other fields) to be able to work with products in terms of  the indexing type <code>β</code> and not the indexing category <code>Discrete β</code>, and <code>simp</code> and similar automation should make sure that the goal stays in \"product land\" so that the user does not have to interface with the more general limits library if all they need are the basic properties of products. Moving to \"limits land\" should be an explicitly user-requested step that changes <code>Fan.proj</code> into <code>Cone.π</code>, <code>j : β</code> into <code>⟨j⟩ : Discrete β</code> and so on. Right now, in my experience calling <code>simp</code> often leaks these things into goals because <code>simp</code> just apply whatever general limits lemma it can find.</p>",
        "id": 508194981,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1742972810
    },
    {
        "content": "<p>Sounds even better. :-)</p>",
        "id": 508220819,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1742981352
    },
    {
        "content": "<p>For pullbacks (which are defined as <code>abbrev</code>), it seems that when a lemma like <code>pullback.lift_fst</code> may apply, <code>simp</code> would rather use the more general <code>limit.lift_π</code>, which is moderately annoying. If we were to make a change, introducing more API separation using defs instead of abbrevs could be better. However, another issue is that when we make a definition of a <code>Fan</code>,  the <code>simps</code> attribute would generate lemmas involving <code>Cone.π</code> instead of the specialized API <code>Fan.proj</code>...</p>",
        "id": 508231251,
        "sender_full_name": "Joël Riou",
        "timestamp": 1742984128
    }
]