[
    {
        "content": "<p><a href=\"/user_uploads/3121/ob7IRSkZ2IOyC6E7lxhdNYh3/hales_slide.png\">hales_slide.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/ob7IRSkZ2IOyC6E7lxhdNYh3/hales_slide.png\" title=\"hales_slide.png\"><img data-original-dimensions=\"467x311\" src=\"/user_uploads/thumbnail/3121/ob7IRSkZ2IOyC6E7lxhdNYh3/hales_slide.png/840x560.webp\"></a></div><p>I just ran into the slide which Tom Hales put up in 2017, with his list of stuff which needed to be formalised just to <em>state</em> the results in his area of expertise. Looking at them seven years on, we're doing pretty well!</p>\n<p>Notable definitions which we don't have: motives (needs a theory of varieties, which we don't have), moduli spaces (there was progress made at the AIM meeting but it would be nice to see a roadmap), class field theory (progress is being made here by Maria Ines and Filippo, and I will hopefully be running something in 2025 specifically on this, although nothing is confirmed yet), locally symmetric spaces (probably we have the prerequisites for this now) and rigid geometry (probably via Huber's foundations). But we really have knocked off a bunch of stuff on this list; it's funny to think that in 2017 this was complete science fiction!</p>\n<p>The slide appears 35 minutes into Hales' talk <a href=\"https://www.newton.ac.uk/seminar/21474/\">here</a>. </p>\n<p>We should probably do algebraic varieties at some point :-)</p>",
        "id": 471292231,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1726674220
    },
    {
        "content": "<p>what does \"motives\" mean here?</p>",
        "id": 471292584,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1726674313
    },
    {
        "content": "<p>I'm assuming it means \"one of the standard definitions of pure motives\" and although humanity can't prove they're all equal, I'm pretty sure that we can't currently state any of them in Lean!</p>",
        "id": 471295867,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1726675244
    }
]