[
    {
        "content": "<p>I made a PR <a href=\"https://github.com/leanprover/lean4/pull/4037\">leanprover/lean4#4037</a> that was merged two days ago and it contained two lemmas. I have things I want to add to Mathlib that use these lemmas. Is there some nightly branch to which I can make a PR now or should I wait just for v4.9.0-rc1?</p>\n<p>I suppose the former option would be slightly complicated, as the core PR requires changes to Mathlib that are still on the \"lean-pr-testing-4037\" branch.</p>",
        "id": 437676072,
        "sender_full_name": "Peiran Wu",
        "timestamp": 1715182597
    },
    {
        "content": "<p>I don't think things would make it into mathlib itself until the toolchain changes. I am not sure I would develop on top of nightly but <span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span>  or <span class=\"user-mention\" data-user-id=\"307953\">@Ruben Van de Velde</span> might have a better sense of whether this is actually a bad idea or not</p>",
        "id": 437676572,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1715182770
    },
    {
        "content": "<p>My expectation is for my \"second-order\" changes to make it into Mathlib after it moves to v4.9.0-rc1. But I felt it would be nice to have a placeholder saying I've already done such and such work and also to receive feedback.</p>\n<p>I can also just make a draft PR to the master branch, adding the two lemmas and required changes temporarily, and remove them later.</p>",
        "id": 437678158,
        "sender_full_name": "Peiran Wu",
        "timestamp": 1715183295
    },
    {
        "content": "<p>That last approach sounds very sensible to me!</p>",
        "id": 437678515,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1715183416
    },
    {
        "content": "<p>Yeah, just add the lemmas to your pr when you make it. We'll remove them on nighty-testing when needed. (Just make sure they do match exactly, so we don't have to think about it)</p>",
        "id": 437696144,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1715188820
    }
]