[
    {
        "content": "<p>This may be github skill issues on my end, but I don’t get any kind of notification when the <code>leanprover-community-bot-assistant</code> adds the \"merge conflict\" label on my PRs, but I do get notifications whenever the various bots comments things on the PR.<br>\nWould it be hard to make the bot comment as well as adding the label?</p>",
        "id": 504803351,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1741690141
    },
    {
        "content": "<p>I think github doesn't send notifications for this (so you're not missing anything). My personal hack is to check the overview of all my pull requests often enough (using e.g. <a href=\"https://jcommelin.github.io/queueboard/triage.html?search=grunweg&amp;sort=9-desc#all\">https://jcommelin.github.io/queueboard/triage.html?search=grunweg&amp;sort=9-desc#all</a>; replace \"grunweg\" in the URL by your github username).</p>",
        "id": 504806690,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1741691009
    },
    {
        "content": "<p>Making the bot comment: that should be doable; let me ping our CI experts <span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> and <span class=\"user-mention\" data-user-id=\"123965\">@Bryan Gin-ge Chen</span>.</p>",
        "id": 504806775,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1741691032
    },
    {
        "content": "<p>This seems more like a preference that GitHub should give each user (and I do not think that it does).  Right now, there is no <code>mathlib</code> action that directly sends an email to the author and I do not know if even that would be easy.  Besides, I would also not know how to make it configurable, so that each author can choose whether they want to receive emails or not for <code>merge-conflict</code>s.</p>",
        "id": 504856627,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1741703090
    },
    {
        "content": "<p>In conclusion, my impression is that this is something that I would like to have as an option, but I suspect that it would have to be a github offer, rather than a <code>mathlib</code> one.</p>",
        "id": 504856635,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1741703091
    },
    {
        "content": "<p>I fully agree that \"receive an email if there is a merge conflict\" should be opt-in.</p>\n<p>I wondering about something else, though: can the merge conflict bot add a comment \"this PR has a merge conflict\" (or slightly more creative) when it adds the label? That implies a github notification for those who care about it.<br>\nWriting this, I'm not sure if the bot <em>should</em> do so - but this is very feasible, right?</p>",
        "id": 504857252,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1741703217
    },
    {
        "content": "<p>I agree that in the best of worlds, this is an option that should come from github. But, as this seem not to be the case, can’t we just ask the bot to comment on the PR? We have already a few bots that comment on PRs (dependabot, etc..), so this seems like a good middle ground?</p>",
        "id": 504857746,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1741703321
    },
    {
        "content": "<p>well, <span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> beat me to it.</p>",
        "id": 504857862,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1741703347
    },
    {
        "content": "<p>The action that mathlib uses does have the option of adding a comment to the PR, beside adding the label.</p>",
        "id": 504858630,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1741703494
    },
    {
        "content": "<p>Before changing that, I would still like to see some support for the extra emails that everyone will receive.</p>",
        "id": 504858724,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1741703518
    },
    {
        "content": "<p><a href=\"https://github.com/eps1lon/actions-label-merge-conflict\">The merge conflict workflow we're using</a> does actually allow for commenting on the PR. If this is desired I can add this. </p>\n<p>(Adding this shouldn't increase the token usage of the bot by too much, and though we used to have problems with this bot using too much quota it seems <a href=\"https://github.com/leanprover-community/mathlib4/actions/workflows/merge_conflicts.yml?query=is%3Afailure\">the last sequence of failures</a> was several months ago even though we didn't change anything and the number of open PRs has only increased...)</p>\n<p><strong>edit</strong>: ah, while I was investigating this, Damiano posted the same thing...</p>",
        "id": 504859682,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1741703708
    },
    {
        "content": "<p>If quota becomes a problem, we can also add the comment in a separate action that is triggered by the label.  That could use a different quota, right?</p>",
        "id": 504860190,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1741703826
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/22833\">#22833</a></p>",
        "id": 504862166,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1741704229
    },
    {
        "content": "<p>/poll Do you want to receive email notifications when a PR acquires <code>merge-conflict</code>s?<br>\nYes<br>\nNo<br>\nIndifferent</p>",
        "id": 504862561,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1741704309
    },
    {
        "content": "<p>Does the bot we use set <code>X-Github-Reason</code> headers, or an equivalent? This is a header GitHub typically sets which lets one filter out noisy email notifications (see <a href=\"https://docs.github.com/en/account-and-profile/managing-subscriptions-and-notifications-on-github/setting-up-notifications/configuring-notifications#filtering-email-notifications\">here</a>)</p>",
        "id": 504935410,
        "sender_full_name": "Julian Berman",
        "timestamp": 1741721589
    },
    {
        "content": "<p>Oh I misread, it'd be a comment? Then no presumably</p>",
        "id": 504935684,
        "sender_full_name": "Julian Berman",
        "timestamp": 1741721663
    },
    {
        "content": "<p>I don't know about <code>X-Github-Reason</code> (in the sense that I never heard about it!), but indeed the bot will simply post a comment to the PR and GitHub already has its own mechanism for notifying when a comment is added to a PR.</p>",
        "id": 504935922,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1741721735
    },
    {
        "content": "<p>Note that this is all speculation, since it has not been tested: I learned to not trust that CI will do what you think it will, unless you test it every single time that you use it.</p>",
        "id": 504936106,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1741721782
    },
    {
        "content": "<p>It seems like there is a majority of preferences for adding a comment: I'll wait a little bit longer before removing the <code>awaiting-zulip</code> label on the PR, but it looks like this is a direction that most people either want or do not especially care about.</p>",
        "id": 505082153,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1741773687
    },
    {
        "content": "<p>I've removed <code>awaiting-zulip</code>, as the poll indicates that more people would be happier if we went forwards with this.</p>",
        "id": 506059586,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1742195456
    },
    {
        "content": "<p>I have maintainer merge'd this PR, as the implementation looks straightforward.</p>",
        "id": 510454613,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1743922851
    }
]