[
    {
        "content": "<p>I've just added a space in a (almost) leaf file in a Mathlib PR. Looking at the build step in CI, as expected it only builds the file and the one file that imports it, together with Mathlib.lean. But then it seems to build a lot of Archive and Counterexamples and also many tests. Why is that? Unless there is an <code>import Mathlib</code> at the top of a file (which I don't think is the case), no rebuild should be necessary, as no dependency has changed. (The relevant material is so new that no downstream files in Archive/Counterexamples/Test uses it.)</p>\n<p>(Caveat: there are currently problems with github that make all CI steps except building fail. But the cache from the previous build (before adding the space) should still be available.)</p>",
        "id": 571522711,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1770065605
    },
    {
        "content": "<p>If I remember correctly, CI only gets the cache from the base of the PR - not of intermediate PR commits (even if this cache was uploaded). <span class=\"user-mention\" data-user-id=\"123965\">@Bryan Gin-ge Chen</span> mentioned changing this, at some point in the past.</p>",
        "id": 571533473,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1770069667
    },
    {
        "content": "<p>Working on new syntax linters occasionally makes me encounter the extreme version of this: modifying the linter naturally rebuilds all of mathlib (as the linter needs to check all files), but then a merge of master also rebuilds evefything - as opposed to just the new files.</p>",
        "id": 571533628,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1770069729
    },
    {
        "content": "<p>The ping happened to remind me that I should get back to <a href=\"https://github.com/leanprover-community/mathlib4/pull/33044\">#33044</a>. I guess that may be a different issue though?</p>",
        "id": 571535152,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1770070298
    },
    {
        "content": "<p>That issue (or perhaps some extension, also looking at intermediate commits) might be it!</p>",
        "id": 571544937,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1770075020
    },
    {
        "content": "<p>A further data point: I just submitted a PR that only changes the name of a leaf file. The \"build\" step in CI still seems to build all the files in MathlibTest (but did not build anything in Archive or Counterexamples). Does this step not check whether the files depend on something that has changed?</p>",
        "id": 571702201,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1770134733
    },
    {
        "content": "<p>Another thing I noticed is that every time CI runs, it seems to build all the tools from scratch. Would it be possible to make it use precompiled versions (as long as the PR does not change anything in the tooling)?</p>",
        "id": 571702463,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1770134795
    }
]