[
    {
        "content": "<p>I often use the <a href=\"https://github.com/leanprover-community/mathlib4/actions/\">actions tab</a> of the mathlib4 repo and have found it cumbersome to scroll through a bunch of outdated / no-longer-used workflows in the sidebar to get to what I want. One way to remove a workflow from the sidebar is to delete all the workflow runs corresponding to that workflow using e.g. <a href=\"https://github.com/orgs/community/discussions/26256\">scripts from this GitHub community discussion</a>. (Are there other ways?) </p>\n<p>Would anyone be opposed if I deleted a bunch of these runs to make the actions tab easier to navigate? Note that detailed logs <a href=\"https://docs.github.com/en/organizations/managing-organization-settings/configuring-the-retention-period-for-github-actions-artifacts-and-logs-in-your-organization\">expire after 90 days</a> anyways, so I don't think there's much valuable information left in old runs.</p>",
        "id": 524926805,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1750354570
    },
    {
        "content": "<p>Besides debugging, I think that the only part of the CI logs that may have some \"historical\" relevance is the one recording the size of the <code>olean</code>s.  The idea of that step was to use it as a measure for detecting potential slow-downs due to inefficient code.  However, I think that no one ended up looking at that CI step and the automation that was supposed to use it, did not get developed (i.e., I did not do it!).</p>",
        "id": 524930506,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1750356689
    },
    {
        "content": "<p>So, overall, I am in favour of cleansing the logs, maybe we can start by removing the log that are 60 days old, to see how the scripts work?</p>",
        "id": 524930507,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1750356691
    },
    {
        "content": "<p>Looks like the following may do the trick:</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>gh run list --workflow='&lt;name of workflow&gt;' --created='&lt;2025-04-19' --json databaseId | jq '.[].databaseId' | xargs -I{} gh run delete {}\n</code></pre></div>\n<p>We can get a list of workflow names with <code>gh workflow list -a --json name</code>.</p>",
        "id": 524963882,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1750380520
    },
    {
        "content": "<p>I just ran your last command.  Should we start clearing <code>move-decls (label)</code> (that, btw, was last used a year ago, so well before the 90 days period).</p>",
        "id": 525002587,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1750409604
    },
    {
        "content": "<p>Since I happened to be reminded of this today, I will start cleaning up logs for inactive workflows that were only used for testing to make our list of workflows easier to navigate.</p>",
        "id": 547548391,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1761671046
    },
    {
        "content": "<p>Thank you very much!  I had forgotten about this discussion!</p>",
        "id": 547548850,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1761671185
    },
    {
        "content": "<p>I am in favour of a robust clean up: if we end up removing a few too many workflow runs, I would not be too fussed.</p>",
        "id": 547548976,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1761671232
    }
]