[
    {
        "content": "<p>Out of curiosity, what is the goal of that refactor?</p>",
        "id": 453644387,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1721813538
    },
    {
        "content": "<p>The current issue is that <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=ProbabilityTheory.Kernel.condKernel#doc\">docs#ProbabilityTheory.Kernel.condKernel</a> only works for a standard Borel space, and <span class=\"user-mention\" data-user-id=\"373986\">@Kalle Kytölä</span> claims there are situations where we don't have that, and yet we have a conditional kernel</p>",
        "id": 453645403,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1721813775
    },
    {
        "content": "<p>What kind of situations? Do you mean other hypotheses under which you can also get a general construction for a conditional kernel, or do you mean that it might well exist for particular kernels (\"by chance\") and then if it exists for some kernels, then it exists for others that you can build from them?</p>",
        "id": 453647873,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1721814396
    },
    {
        "content": "<p>I was involved in the refactor only recently so I have to ask Kalle (in a few minutes), but it seems that it is the latter</p>",
        "id": 453648356,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1721814519
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"350992\">Rémy Degenne</span> <a href=\"#narrow/stream/287929-mathlib4/topic/github.20permission/near/453647873\">said</a>:</p>\n<blockquote>\n<p>if it exists for some kernels, then it exists for others that you can build from them</p>\n</blockquote>\n<p>That is particularly true when considering <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=ProbabilityTheory.Kernel.condKernelCountable#doc\">docs#ProbabilityTheory.Kernel.condKernelCountable</a></p>",
        "id": 453648473,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1721814555
    },
    {
        "content": "<p>General constructions indeed only exists for Borel spaces, but isolating the defining property (a characteristic predicate) from the construction seems worthwhile. As you say, kernels might exist \"by chance\" even in other situations. But maybe more importantly, a user should be able to make <em>hypotheses</em> about the existence of kernels in spaces which are not standard Borel, or which the user at least does not want to prove are standard Borel.</p>\n<p>So the main argument is: The construction requires the user to provide a proof of standard Borel space property. The characteristic predicate can be used without that. <span class=\"user-mention\" data-user-id=\"727171\">@Kin Yau James Wong</span> has shown that many of the lemmas about the kernels hold assuming only the characteristic predicate, and he has of course also shown that the construction satisfies the characteristic predicate.</p>",
        "id": 453649027,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1721814718
    },
    {
        "content": "<p>What's not super clear to me is how often we care about non-standard Borel spaces</p>",
        "id": 453649443,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1721814814
    },
    {
        "content": "<p>That makes sense and looks like a very sensible refactor!</p>",
        "id": 453649683,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1721814868
    },
    {
        "content": "<p>Seldom, indeed (referring to Yaël's question about how often we care about spaces that are not standard Borel spaces). But in my opinion we would often want to free the user from providing the proof of the standard Borel space property.</p>",
        "id": 453649689,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1721814871
    },
    {
        "content": "<p>That refactor makes me think of the approach of the paper <a href=\"https://arxiv.org/abs/1908.07021\">https://arxiv.org/abs/1908.07021</a> by Fritz about Markov categories, and in particular of definition 11.5: Fritz defines the property of having conditionals for a Markov category, and then remarks that it is the case for categories of finite probability spaces and for the category of standard Borel spaces.</p>",
        "id": 453651887,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1721815560
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/15105\">#15105</a></p>",
        "id": 453733499,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1721836606
    }
]