[
    {
        "content": "<p>I noticed that the current definition of conditional independence requires <code>Ω</code> is a standard Borel space. On the one hand I can't think (off the top of my head) any reasonable example of a not standard Borel examples that we care about in practice. On the other hand this is not a common assumption in say the (general state space) Markov chain literature (see for example Meyn and Tweedie) since it is giving up generality unnecessarily (at least in paper math). Was it discussed and decided that we don't care about such generality? Or could we generalize the definition?</p>",
        "id": 565819337,
        "sender_full_name": "David Ledvinka",
        "timestamp": 1767119217
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"373986\">@Kalle Kytölä</span> and I similarly generalised <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=MeasureTheory.condExp#doc\">docs#MeasureTheory.condExp</a> to avoid assuming standard Borel in the theory of Gibbs measures</p>",
        "id": 565823858,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1767122109
    },
    {
        "content": "<p>And indeed our rationale in the case that <span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> mentions was very similar to what <span class=\"user-mention\" data-user-id=\"223948\">@David Ledvinka</span> said above.</p>\n<p>I.e., I cannot think of concrete applications where the spaces would not be standard Borel, but when developing some general theory (whether for Markov processes or Gibbs measures), making this specific assumption about the spaces did not seem natural --- instead just assuming we are given the necessary kernels (whose existence can be guaranteed for example by the standard Borel space assumptions) seemed the natural way to go. Unfortunately this is a while ago, so I don't remember anymore if we landed on a particularly clear design... But at least in principle I agree with David's sentiment.</p>",
        "id": 565824532,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1767122549
    },
    {
        "content": "<p>The standard Borel assumption in the Mathlib material could be replaced by the existence of conditional probabilities (standard Borel is there only to be able to use <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Probability/Kernel/Condexp.html#ProbabilityTheory.condExpKernel\">ProbabilityTheory.condExpKernel</a>). And in a book about Markov chains you have them as an assumption, I guess.</p>",
        "id": 565824850,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1767122760
    },
    {
        "content": "<p>At the bottom of page 18 of <a href=\"https://arxiv.org/pdf/2510.04070\">my preprint on the use of Markov kernels in Mathlib</a>, in which I write about their use for conditional independence, I wrote:</p>\n<blockquote>\n<p>Another more minor refactor would be to follow the example of<br>\n[For21] and (somewhat artificially) extend our definition to any space by requiring that there<br>\nexists a conditional kernel such that the definition applies</p>\n</blockquote>",
        "id": 565825251,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1767122941
    },
    {
        "content": "<p>By the way, I'm really glad that you are being paid to look at our probability theory material and make it better! I made some initial choices in those files but with more eyes on them we will surely improve them a lot.</p>",
        "id": 565826070,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1767123517
    },
    {
        "content": "<p>Ok I think your discussion on the strength and weaknesses in the preprint is exactly relevant. </p>\n<p>While we do assume we have such a Kernel in the case of Markov Chains the weak Markov property itself could be stated without this assumption, even though we cannot guarantee the existence of a transition kernel without the Borel assumption (which is why we do assume existence). I also agree with the fact that manipulating kernels is much easier, which is why I mentioned that the loss generality which is almost free on paper is probably much less free in formalisation. I could definitely work around this (perhaps with the minor refactor idea). </p>\n<p>The only reason I am hesitant to not use the classical definition (a la Definition 4.1 in your preprint) is that if someone decides they do need this level of generality it seems like it will be a gargantuan refactor that will only get worse. Maybe thats fine though.</p>",
        "id": 565830783,
        "sender_full_name": "David Ledvinka",
        "timestamp": 1767126751
    },
    {
        "content": "<p>Doing some \"light\" research I noticed that <span class=\"user-mention\" data-user-id=\"666653\">@Asgar Jamneshan</span> , who is on this forum, has several papers that consider generalisations of related ideas outside of the standard Borel setting (for example  <a href=\"https://arxiv.org/abs/1701.02661\">this</a> one). Perhaps you have some insight here?</p>",
        "id": 565832188,
        "sender_full_name": "David Ledvinka",
        "timestamp": 1767127724
    },
    {
        "content": "<p>The definition of a Markov kernel is valid on all spaces; it just does not, outside the standard Borel setting, represent conditional expectation (since the latter is only defined up to almost-everywhere equality, i.e., as an equivalence class in <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi>L</mi><mn>2</mn></msup></mrow><annotation encoding=\"application/x-tex\">L^2</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8141em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\">L</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8141em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">2</span></span></span></span></span></span></span></span></span></span></span>). One way to define conditional independence is to work with conditional expectations instead of kernels, or equivalently in a pointfree framework using measure algebras of probability spaces (see Fremlin’s <em>Measure Theory</em>, Volume 4, §458). Another possibility is to work with Stone models of probability algebras (such models also appear under different names in the literature); see, for example, Section 8 of <a href=\"https://arxiv.org/pdf/2010.00681\">https://arxiv.org/pdf/2010.00681</a>. Yet another possibility is to use category theory, as in Simpson’s paper: <a href=\"https://www.sciencedirect.com/science/article/pii/S1571066118300318\">https://www.sciencedirect.com/science/article/pii/S1571066118300318</a>. There is also a more topos-theoretic/sheaf-theoretic approach to measure theory, as developed in my paper cited above, but that might be overkill if the primary purpose is to formalize conditional independence.</p>",
        "id": 565861382,
        "sender_full_name": "Asgar Jamneshan",
        "timestamp": 1767157920
    }
]