[
    {
        "content": "<p>I just noticed that the list of undergraduate mathematics <a href=\"https://leanprover-community.github.io/undergrad.html\">in</a> and <a href=\"https://leanprover-community.github.io/undergrad_todo.html\">not in</a> mathlib contradict each other in places (e.g., orthonormality of irreducible characters is listed as present yet it and even irreducible representation are listed as absent).</p>\n<p>Would a PR removing the \"missing\" items which are obviously present (because they are on the \"present\" list and I check the link to see that it indeed exists) be welcome?</p>",
        "id": 497206235,
        "sender_full_name": "Raghuram",
        "timestamp": 1738450968
    },
    {
        "content": "<p>OK, this is more ambiguous than I thought:</p>\n<ul>\n<li>I'm not sure if \"endomorphism exponential\" and \"matrix exponential\" should be separate items.</li>\n<li>Ditto for \"associative algebra\" and \"algebra\" over a commutative ring (if the latter means a non-associative one, it's not that it can't be specifically defined so much as there is no reason to, for example, <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Algebra/Algebra/Defs.html#Implementation-notes\">here</a> it's just suggested to use a list of typeclass assumptions).</li>\n<li><a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Analysis/Calculus/FDeriv/Symmetric.html#second_derivative_symmetric\">\"partial derivatives commute\"</a> is proven without defining directional or partial derivatives, by just applying the derivative (a linear map) to a vector. There isn't a definition to be linked to for directional or partial derivatives, but it does seem fair to say that (at least directional) derivatives are present.</li>\n<li>Similarly, there are series tests like the <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Analysis/SpecificLimits/Normed.html#Antitone.tendsto_alternating_series_of_tendsto_zero\">alternating series test</a> with (not-necessarily unconditional) convergence of a series defined ad-hoc in the statement.</li>\n</ul>\n<p>IG there is a common theme here of things that are basically in mathlib, but there isn't a single clean definition/theorem to point to. I'm not sure what to do about that.</p>",
        "id": 497212656,
        "sender_full_name": "Raghuram",
        "timestamp": 1738457620
    },
    {
        "content": "<p>Your first question is simple: things are listed as separate items iff the French curriculum this list was created from does the same</p>",
        "id": 497228759,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1738474004
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"501683\">Raghuram</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Conflicting.20info.20on.20website.20about.20undergrad.20maths.20in.20mathlib/near/497212656\">said</a>:</p>\n<blockquote>\n<p>IG there is a common theme here of things that are basically in mathlib, but there isn't a single clean definition/theorem to point to. I'm not sure what to do about that.</p>\n</blockquote>\n<p>Yes, this is the main difficulty with this list. Sometimes we add a somewhat vague declaration. You could also create a declaration specifically for this purpose. The danger is that people may want to start using it and complain there is no API for it, so we need a warning in the docstring.</p>",
        "id": 497293524,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1738532419
    },
    {
        "content": "<p>It really depends on the item. For instance for commutativity of partial derivatives I think it’s fine to point to the abstract statement.</p>",
        "id": 497293605,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1738532489
    }
]