[
    {
        "content": "<p>Hello! I may wonder how we can contribute to Mathlib4. I am currently working on some topics in convex ananlysis and convex optimization. We are working on  formalizing some properties related to the properties of the convex functions and the convergence rate of some classical optimization methods. How should we organize our code so that it meets the relevant requirements of mathlib？How do we upload our written code？Can there be some documentation written with relative requirements? Thank you very much for answering!</p>",
        "id": 379952747,
        "sender_full_name": "Chenyi Li",
        "timestamp": 1690701824
    },
    {
        "content": "<p>Hi! You should have a look at the whole \"Contributing\" section of <a href=\"https://leanprover-community.github.io/index.html\">https://leanprover-community.github.io/index.html</a> <br>\nUnfortunately most of the information there is still about Lean3, and I’m not sure we have it updated for Lean4 anywhere, so you’ll have to adapt it a bit based on existing Mathlib4 code.</p>",
        "id": 379955847,
        "sender_full_name": "Anatole Dedecker",
        "timestamp": 1690703182
    },
    {
        "content": "<p>I am trying to configure mathlib according to the official tutorial. When I proceed to the following operation in VScode：</p>\n<p>Run <code>cd mathematics_in_lean</code><br>\nRun <code>lake exe cache get</code></p>\n<p>It always shows that :</p>\n<p>fatal: unable to read tree (984d7ee170b75d6b03c0903e0b750ee2c6d1e3fb)<br>\nerror: external command 'git' exited with code 128</p>\n<p>I have tried reinstalling git, but it still doesn't work.</p>",
        "id": 491098363,
        "sender_full_name": "guiwan",
        "timestamp": 1735398153
    },
    {
        "content": "<p>That sounds like somehow your cloned repository is corrupt. Assuming you haven't done any work in that directory, delete <code>mathematics_in_lean</code>, reclone it, and then let us know what you see from running that command.</p>",
        "id": 491099045,
        "sender_full_name": "Julian Berman",
        "timestamp": 1735398842
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"321696\">Julian Berman</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Contribute.20to.20Mathlib4/near/491099045\">said</a>:</p>\n<blockquote>\n<p>That sounds like somehow your cloned repository is corrupt. Assuming you haven't done any work in that directory, delete <code>mathematics_in_lean</code>, reclone it, and then let us know what you see from running that command.</p>\n</blockquote>\n<p>Thank you very much. The original error did not appear, but there is a new error. I will try to solve it first. Thank you again.</p>",
        "id": 491101215,
        "sender_full_name": "guiwan",
        "timestamp": 1735400928
    },
    {
        "content": "<p>Hello I am currently in the process of learning about Lean4. I am interested in learning by attempting to contribute to mathlib as I get the impression that it is \"friendly\" to contribute to. Do you recommend a beginner like me to do so, and what if i'm not already well versed in a particular math topic (but open to learn about it while attempting an issue), would that be okay?</p>",
        "id": 533888475,
        "sender_full_name": "Jafar Tanoukhi",
        "timestamp": 1754959407
    },
    {
        "content": "<p>We'd love new contributors, but please be aware that it is quite challenging, and both some formalization experience and significant maths experience is helpful!</p>\n<p>The best way to start is to post here (or in #**new members&gt;) about your mathematical interests, and to try to identify something that you know well, but is not in Mathlib, but all of the prerequisites are already!</p>",
        "id": 533888581,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1754959528
    },
    {
        "content": "<p>Hmmm, I am only recently getting into mathematically rigourous topics which I guess puts me at a big disadvantage here. I was hoping to maybe find a good first issue and then learn the math/formalization skills it would require as I go. From what you say though, that sounds far fetched maybe ?</p>",
        "id": 533889012,
        "sender_full_name": "Jafar Tanoukhi",
        "timestamp": 1754959945
    },
    {
        "content": "<p>Maybe you can try what I did for my first contribution: create your own project on a topic you'd like to formalize without caring too much about mathlib contribution yet. During the formalization process, you will likely encounter small lemmas that feels \"should be in mathlib but somehow not yet\", that's what you can start creating PRs for. The first few could be just five lines, and that's good because you can get familiar with the review process easily with shorter ones.</p>",
        "id": 533889402,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1754960293
    },
    {
        "content": "<p>That sounds awesome, thanks I will do so.</p>",
        "id": 533889443,
        "sender_full_name": "Jafar Tanoukhi",
        "timestamp": 1754960339
    }
]