[
    {
        "content": "<p>**What are the academic, professional, and personal benefits of contributing to mathlib?<br>\nHow can I contribute to mathlib?<br>\nIs contributing really important?<br>\nWhere can I find topics that are missing from mathlib?**</p>",
        "id": 533447296,
        "sender_full_name": "İmran Tanrikolu",
        "timestamp": 1754653144
    },
    {
        "content": "<p>Hi! Contributions to mathlib are very welcome, there's lots of work to be done --- so glad to hear you're interested.</p>",
        "id": 533457453,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1754657179
    },
    {
        "content": "<p>I'm not sure what you're asking, though: your questions seem very generic --- what do you <em>really</em> want to know?</p>",
        "id": 533457697,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1754657270
    },
    {
        "content": "<p>If you tell us more about your background/what you know and are interested in, we can suggest suitable topics. As-is, mathlib is broad enough that trying to mention every possible project is not feasible.</p>",
        "id": 533457838,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1754657316
    },
    {
        "content": "<p>Besides, the answers to your question depend on your situation. For example,</p>\n<ul>\n<li>contribution to mathlib is obviously important for mathlib; I believe we really need a common ground of shared definitions and results if we want e.g. formalisation of research papers to become more standard</li>\n<li>contributing to mathlib got me my current job, which makes me <em>much</em> happier than my previous one -- so this can be very useful. But this will vary from person to person.</li>\n</ul>",
        "id": 533458116,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1754657421
    },
    {
        "content": "<p>In other words: if you tell us what you actually want to know, there's a chance we can answer your actual questions.</p>",
        "id": 533458169,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1754657444
    },
    {
        "content": "<p>not necessarily the optimal way, but I find <a href=\"https://leanprover-community.github.io/1000-missing.html\">https://leanprover-community.github.io/1000-missing.html</a> a good starting point to find missing topics in mathlib. (someone might be already working on some though, so also search open PR and zulip discussion)</p>",
        "id": 533493168,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1754670318
    },
    {
        "content": "<p>So if you contribute to mathlib, you too can have <span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span>'s job! (Wait, maybe that's not the goal here)</p>",
        "id": 533521890,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1754684588
    }
]