[
    {
        "content": "<p>Hi, I'd like to add a type for continuous partial linear maps modeled on <code>LinearPMap</code>. I'd like to generalize lemmas like <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=LinearPMap.map_zero#doc\">docs#LinearPMap.map_zero</a>, <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=LinearPMap.map_add#doc\">docs#LinearPMap.map_add</a> etc. so that they apply both to <code>LinearPMap</code> and <code>ContinuousLinearPMap</code>. However I don't know how to do that, the usual mechanism of using some class like <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=AddHomClass#doc\">docs#AddHomClass</a> does not work because the domain depends on the map, I can't even provide a <code>FunLike</code> instance. Any suggestions are welcome!</p>",
        "id": 490216152,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1734721637
    },
    {
        "content": "<p>Do you know about <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=DFunLike#doc\">docs#DFunLike</a> ?</p>",
        "id": 490284692,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1734774727
    },
    {
        "content": "<p>I do, but I don't see how it helps. <code>f : LinearPMap R E F</code> is a function from <code>f.domain</code> to <code>F</code>, so the domain depends on the function, while I was under the impression that a <code>DFunLike</code> instance just coerces to a dependent function type with a fixed domain.</p>",
        "id": 490284956,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1734775012
    },
    {
        "content": "<p>Ah, I see what you mean!</p>",
        "id": 490285504,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1734775504
    },
    {
        "content": "<p>Maybe introducing a <code>PFunLike</code> class might work, but this would require a different notion of partial function than <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=PFun#doc\">docs#PFun</a>, and I don't feel like it's worth it, so I'll just duplicate lemmas.</p>",
        "id": 491264836,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1735554256
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"412682\">Moritz Doll</span> and I had a long discussion (it's in a public thread somewhere) about such a class, and using it in precisely this context. It was probably sometime during the port.</p>",
        "id": 491331505,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1735594096
    },
    {
        "content": "<p>Found it <a href=\"#narrow/channel/116395-maths/topic/linear_pmap_class\">here</a></p>",
        "id": 491333292,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1735595427
    },
    {
        "content": "<p>I would be happy to try and implement this. My understanding of the typeclass inference is not so deep however, and I would need some guidance. Also, I had in mind that it would be easier to just define this separately from <code>LinearMapClass</code> rather than creating a <code>LinearPMapClass</code> instance for <code>LinearMap</code>. That would of course gives us two separate systems while one is a particular case of the other mathematically, so not very nice, but I don’t know if considering a <code>LinearMap</code> as a <code>LinearPMap</code> with domain <code>top</code> will give us something as smooth as what we have right now.</p>",
        "id": 491383973,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1735636649
    },
    {
        "content": "<p>I think there should <em>not</em> be an instance for <code>LinearMap</code> for the reasons Moritz and I encountered in the other thread. Users should have to pass through an explicit equivalent between linear maps and the subtype of linear pmaps with domain = top.</p>",
        "id": 491404276,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1735651889
    },
    {
        "content": "<p>I just opened <a href=\"https://github.com/leanprover-community/mathlib4/pull/20663\">#20663</a>. It is a minimal implementation to get a <code>LinearPMapClass</code> instance for <code>LinearPMap</code> with basic mapping lemmas. I imitated the already existing system to build the hierarchy but did not implement all the different types of homs, only the homclasses.</p>\n<p>It went well except for an issue because of (I suspect) the defeq <code>LinearPMap.domain</code> vs <code>PFunLike.domain</code> which is not always seen through. It appears at two places:</p>\n<ul>\n<li>In the file <code>Algebra.Module.Injective</code> in the theorem <code>extension_property</code>, the proof went <code>h ▸ ⟨⟩</code> and it broke so I had to replace it with <code>have : ... := h; this ▸ ⟨⟩</code> to get it to work, where <code>...</code> is the same as <code>h</code> but replacing <code>LinearPMap.domain</code> with <code>PFunLike.Domain</code>.</li>\n<li>In the file <code>LinearAlgebra.LinearPMap</code> in the theorem <code>supSpanSingleton_apply_mk</code>, it had a <code>simp</code> attribute but did not pass the linter because it could not simplify itself. I removed the <code>simp</code> tag and nothing broke.</li>\n</ul>\n<p>Apart from that replacing all the <code>LinearPMap.map_add</code> by <code>pmap_add</code> and so on went without any trouble. I'm not sure what should be added or removed in what I did. I think it's very minimal but I did not want to add too much in case I was going the wrong way.</p>",
        "id": 493122215,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1736624198
    },
    {
        "content": "<p>At a (very brief) glance, it looks reasonable. Unfortunately, I probably won't have much time to look at it soon, as I'm about to be burdened with many commitments.</p>",
        "id": 493150013,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1736652358
    }
]