[
    {
        "content": "<p>Suppose file <code>A</code> has imports <code>X</code>, <code>Y</code> and <code>Z</code>. Then <code>A</code> gets (cleanly, no splitting / moving) renamed to <code>B</code>. We then perform a module deprecation for <code>A</code>. What should be the imports of the (now deprecated) module <code>A</code>? The <code>create_deprecated_module</code> command uses <code>X</code>, <code>Y</code> and <code>Z</code>, but I think it should be <code>B</code> alone.</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span>, but I'm interested in input from anybody.</p>",
        "id": 558732832,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1763751643
    },
    {
        "content": "<p>Here is my reasoning for saying <code>B</code> as opposed to <code>X</code>, <code>Y</code>, <code>Z</code>. Suppose I am a downstream file that imports <code>A</code>, and I use the declaration <code>foo</code> within <code>A</code>. After the rename and deprecation, when I tried to build my file, I get a warning on the import line saying \"replace <code>A</code> with <code>X</code>, <code>Y</code>, <code>Z</code>\", and also my file is broken (because it references <code>foo</code> which is now in <code>B</code>, which I am not importing). <em>Moreover</em>, even if I follow the advice of the deprecation warning, my file <em>still</em> doesn't build. So, yeah, that sucks.</p>\n<p>In contrast, if <code>A</code> just contiains <code>B</code> as the import, then I get the warning, and my file builds both before and after the substitution.</p>",
        "id": 558737411,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1763753303
    },
    {
        "content": "<p>nevermind me, I think this is just noise and I'm using <code>create_deprecated_module</code> wrong.</p>",
        "id": 558740075,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1763754351
    },
    {
        "content": "<p>I agree that the command should use <code>B</code>, and IIRC create_deprecated_module already does that. If you spot a case where it's wrong, please report the bug :-)</p>",
        "id": 558752451,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1763759792
    },
    {
        "content": "<p>My issue was that <code>find_deleted_files</code> want generating the <code>rename_to</code>, I guess because the match wasn't strong enough.</p>",
        "id": 558761353,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1763764313
    }
]