[
    {
        "content": "<p>So many theorems in PDE and analysis (that I want to formalize) needs some version of the Stokes' theorem on a manifold (with corners). I know that there are people working on differential forms right now, but are there anything else I can do to accelerate this process of having the Stoke's theorem in Mathlib?</p>",
        "id": 554766621,
        "sender_full_name": "Yongxi Lin (Aaron)",
        "timestamp": 1762799332
    },
    {
        "content": "<p>Can you state the theorem and PR it as <code>proof_wanted</code>?</p>",
        "id": 554767011,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1762799467
    },
    {
        "content": "<p>Actually I believe stating Stoke's theorem is harder than proving it. I don't think we are ready to state this theorem. We don't have the definition of differential forms in Mathlib yet, which requires the definition of tensor bundles. Do we have exterior derivatives (the <code>d</code>-operator in the Stokes' theorem)?  Do we have a proof that the boundary of a manifold of dimension <code>n</code> is also a manifold of dimension <code>n-1</code>? I think we also need the definition of orientation on vector spaces and on manifolds.</p>",
        "id": 554770109,
        "sender_full_name": "Yongxi Lin (Aaron)",
        "timestamp": 1762800668
    },
    {
        "content": "<p>We have some of the ingredients already (either in mathlib or on a branch):</p>\n<ul>\n<li>we have the orientation of a module <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Orientation#doc\">docs#Orientation</a>, in particular of vector spaces</li>\n<li><a href=\"https://github.com/leanprover-community/mathlib4/pull/16239\">#16239</a> has an <em>almost correct</em> definition of manifolds: it is wrong precisely for one-manifolds with boundary. There was a zulip discussion about fixing it (<a class=\"stream-topic\" data-stream-id=\"217875\" href=\"/#narrow/channel/217875-Is-there-code-for-X.3F/topic/Orientable.20Surface/with/499781834\">#Is there code for X? &gt; Orientable Surface</a> ); help with that is welcome. (It's on my list of items to return to, but not high priority right now.)</li>\n</ul>",
        "id": 554792728,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762809246
    },
    {
        "content": "<p>I'd like to ask what you mean precisely by \"the boundary of a n-manifold is an (n-1)-manifold\": for instance, is the original manifold allowed to have corners? Note that mathlib's notion of a manifold says \"manifold with boundary and corners of any order\" (and is in fact slightly more general than this\" --- so what you want to say is something like \"M is a smooth manifold whose boundary is a smooth manifold without corners\". <a href=\"https://github.com/leanprover-community/mathlib4/pull/31351\">#31351</a> does this.</p>",
        "id": 554793176,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762809426
    },
    {
        "content": "<p>(It's not in mathlib yet for several reasons, the biggest one being that it's waiting on defining smooth immersions --- those are also PRed and will hopefully get merged this week.)</p>",
        "id": 554793258,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762809459
    },
    {
        "content": "<p>This may seem pedantic --- my point is that mathlib-level generality exposes some genuine mathematical question that you need to take a stance on.</p>",
        "id": 554793365,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762809506
    },
    {
        "content": "<p>Yury Kudryashov has formalised most of differential forms, without explicit language of tensor bundles. <a href=\"https://github.com/leanprover-community/mathlib4/pull/30886\">#30886</a> defines the exterior derivative of vector fields (on normed spaces). More work is in a dedicated repository, and gradually being PRed to mathlib.</p>",
        "id": 554793444,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762809543
    },
    {
        "content": "<p>A PR adding <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Orientation#doc\">docs#Orientation</a> to the library overview is welcome, by the way: you want to modify <a href=\"https://github.com/leanprover-community/mathlib4/blob/master/docs/overview.yaml\">https://github.com/leanprover-community/mathlib4/blob/master/docs/overview.yaml</a> in a suitable way.</p>",
        "id": 554795546,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762810350
    },
    {
        "content": "<p>Thank you Michael, I’ll take a look of these links first.</p>",
        "id": 554820281,
        "sender_full_name": "Yongxi Lin (Aaron)",
        "timestamp": 1762824344
    },
    {
        "content": "<p>Ironically, one of the reasons Bourbaki got started was to give a thorough treatment of Stokes' theorem from the gound up. The group accidentally reinvented 20th century mathematics first..... and I note the book on manifolds has not yet appeared, just the <em>Fascicule des résultats</em>, which, as the publisher's website says, \"Il ne contient pas de démonstration.\"</p>",
        "id": 554822551,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762826093
    }
]