[
    {
        "content": "<p>Group homology and group cohomology have similar but \"dual\" APIs and at the Oxford class field theory workshop it was proposed to write an which could in some cases take a lemma about group cohomology and prove a dual lemma about group homology, analogous to <code>@[to_additive]</code>.</p>\n<p>But this proposal has run into an unexpected roadblock: the definition of group cohomology internally uses functions G^n -&gt; M, and the definition of group homology internally uses finitely-supported functions G^n -&gt; M and these are implemented via <code>Finsupp</code> which means that <code>G</code> needs to have decidable equality for many results in group homology, but it is not necessary for group cohomology. I mentioned this briefly before in <a class=\"message-link\" href=\"/#narrow/channel/287929-mathlib4/topic/Keeping.20a.20def.20computable.20with.20inversion/near/525572779\">#mathlib4 &gt; Keeping a def computable with inversion @ 💬</a> but it didn't bother me much back then; it now bothers me a bit more though because it means that it's far less clear how to write the <code>@[to_homology]</code> attribute.</p>\n<p>Group homology is relatively new to mathlib and it would perhaps be feasible to refactor it to not use <code>Finsupp</code> but do we even have non-constructive finitely-supported functions?</p>\n<p>Another hack would be to let the attribute just add a nonconstructive <code>DecidableEq G</code> instance but this doesn't sound like a good idea if we are unlucky enough to ever want to say anything about homology of a group which happens to have decidable equality. My initial reaction was that this would basically never happen but unfortunately today at the workshop we needed a proof that the trivial group had trivial homology and unfortunately the idiomatic way to say a group is trivial seems to be <code>[Subsingleton G]</code> and we have <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=decidableEq_of_subsingleton#doc\">docs#decidableEq_of_subsingleton</a> . This is<br>\nsuper-frustrating because the decidability is not buying us anything here, it is literally just getting in the way. Perhaps it's worth stressing here that <code>rfl</code> doesn't buy us anything in the proof that the trivial group has trivial homology; the proof has a little content, is not <code>rfl</code>, and decidability is literally doing nothing but getting in the way.</p>\n<p>A horrible fix would be to demand that G had decidable equality in group cohomology too but my thoughts on that approach are unprintable.</p>",
        "id": 529936779,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1753119314
    },
    {
        "content": "<blockquote>\n<p>Group homology is relatively new to mathlib and it would perhaps be feasible to refactor it to not use <code>Finsupp</code> but do we even have non-constructive finitely-supported functions?</p>\n</blockquote>\n<p>Are finsupps an implementation detail or part of the API?</p>",
        "id": 529938782,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1753119970
    },
    {
        "content": "<p>I'm not sure I understand the question well enough to be able to answer it.</p>",
        "id": 529941534,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1753121000
    },
    {
        "content": "<p>Does anyone doing group homology need to know that it's finsupp under the hood?</p>",
        "id": 529941793,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1753121086
    },
    {
        "content": "<p>I had a quick go at swapping <code>Finsupp</code> for <code>DFinsupp</code>; the result is worse, because <code>DFinsupp</code> is computable in the wrong direction. <del>I speculate that swapping Finsupp for <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=FreeAbelianGroup#doc\">docs#FreeAbelianGroup</a> might make everything computable without the cost of <code>DecidableEq</code>, but would be annoying due to lack of API</del> nevermind, that's not the type I thought it was</p>",
        "id": 529943528,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1753121758
    }
]