[
    {
        "content": "<p>As I understand it, Mathlib is entirely based in classical logic and is uninterested in supporting other weaker forms of logic. So why do we have duplicated <code>Decidable</code> versions of classical theorems?</p>",
        "id": 494655129,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1737303633
    },
    {
        "content": "<p>I understand why those are there in core Lean 4, I'm not asking for that to be changed. I'm instead asking about theorems like e.g. <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Decidable.ne_or_eq#doc\">docs#Decidable.ne_or_eq</a> which exist within our own jurisdiction.</p>",
        "id": 494655218,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1737303708
    },
    {
        "content": "<p>A lot of these are inherited in Lean 3, but I think \"<em>entirely</em> based in classical logic\" is a little strong. Certainly in the past there have been users interested in basic theorems about <code>List</code>s etc who seemingly have interest in avoiding <code>choice</code>, and the maintenance burden of keeping these <code>Decidable</code> theorems around is quite low</p>",
        "id": 494655369,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1737303835
    },
    {
        "content": "<p>Here's the original thread where the decidable namespace was proposed: <a class=\"message-link\" href=\"/#narrow/channel/144837-PR-reviews/topic/.232332/near/193252722\">#PR reviews &gt; #2332 @ 游눫</a></p>",
        "id": 494655638,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1737303954
    },
    {
        "content": "<p>Well, the reason I view this as a problem is that introducing choice in a proof is not only extremely easy to do by accident, but also not considered a breaking change in Mathlib. So it seems a bit weird to try and make guarantees around the absence of choice.</p>",
        "id": 494655704,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1737303981
    },
    {
        "content": "<p>I think that guarantee is only promised by (the obvious subset of) things within the <code>Decidable</code> namespace</p>",
        "id": 494655771,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1737304032
    },
    {
        "content": "<p>Fair enough. </p>\n<p>Do the other things discussed in that thread still hold today? e.g. \"we won't block a PR that gets rid of choice even if the proof is longer\"</p>",
        "id": 494655906,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1737304141
    },
    {
        "content": "<p>I have never seen anyone try to do this and I can't imagine that going smoothly</p>",
        "id": 494655943,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1737304178
    },
    {
        "content": "<p>I think that's up to subjective reviewer judgement. If the proof gets one line longer I don't see it being a problem, if it gets 100 lines longer then I would expect it not to be merged</p>",
        "id": 494655949,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1737304183
    },
    {
        "content": "<p>I don't think we gain anything today by explicitly announcing such PRs are not welcome, vs waiting for them to appear before making judgements on a case-by-case basis</p>",
        "id": 494656033,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1737304223
    },
    {
        "content": "<p>Alright then. So it's less so that Mathlib is entirely classical, and moreso that there just hasn't been too much interest in developing the non-classical theory</p>",
        "id": 494656062,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1737304253
    },
    {
        "content": "<p>And that there is no contribution requirement in general for avoiding choice, at least once you leave very basic lemmas and enter things with mathematical content.</p>",
        "id": 494656249,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1737304410
    }
]