[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/15589\">#15589</a>, I am \"multiplicativizing\" <code>Archimedean</code>, which involved creating a new class and shifting lemmas from mentioning <code>nsmul</code> to <code>pow</code>. In the <a href=\"https://github.com/leanprover-community/mathlib4/pull/15589#issuecomment-2273559852\">PR summary comment</a>, it says that various declarations are lost -- but they are not, they are generated by to_additive and retain their original name. Is this expected? I could imagine two scenarios</p>\n<ul>\n<li>completely new declaration, tagged with to_additive -- this really added two declarations -- the summary can mention the primary name with a symbol to indicate that it generated an additive version too</li>\n<li>existing declaration is now generated via a to_additive of a new declaration -- the summary should mention the new one but not consider the old one gone</li>\n</ul>",
        "id": 457121227,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1723040197
    },
    {
        "content": "<p>Yeah, the summary looks only at the actual source code</p>",
        "id": 457122624,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1723040637
    },
    {
        "content": "<p>My understanding is that the tool which is trying to figure out if declarations are lost is not doing anything clever, it's just grepping the source code or something. <span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> will know better. It works very well in many cases but I'm pretty sure that you've got a case here where the naive approach will fail.</p>",
        "id": 457122668,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1723040643
    },
    {
        "content": "<p>We're hoping something leaff-based to replace at some point</p>",
        "id": 457122727,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1723040664
    },
    {
        "content": "<p>Indeed, the current script is intended as a \"patch\": it is quick, only looks at the source code with no parsing, no namespace, no auto-generated information.</p>",
        "id": 457126518,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1723041819
    },
    {
        "content": "<p>So, what you describe is expected, not desired, but also not within the scope of the current script.</p>",
        "id": 457126636,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1723041848
    },
    {
        "content": "<p>Makes total sense, thanks. I think my PR description would help explain the \"lost declarations\" for any reviewer.</p>",
        "id": 457156398,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1723050286
    },
    {
        "content": "<p>Indeed!  I actually am fairly surprised by how effective the script is.  I also think that it probably reached the limit of its capabilities, while still being maintainable and simple-minded.</p>",
        "id": 457156749,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1723050402
    }
]