[
    {
        "content": "<p>Do anyone have idea about how to define a prism operator in algebraic topology,  to show that 2 homotopic maps f g : X to Y (where x and Y are topological spaces) deduce same chain map?</p>",
        "id": 429122640,
        "sender_full_name": "Rui Chen",
        "timestamp": 1711233241
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"270676\" href=\"/#narrow/stream/270676-lean4/topic/Defining.20Prism.20Operator\">#lean4 &gt; Defining Prism Operator</a> by <span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span>.</p>",
        "id": 429309941,
        "sender_full_name": "Notification Bot",
        "timestamp": 1711353423
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"703148\">@Rui Chen</span> I don't think that mathlib has anything in that direction yet. <span class=\"user-mention\" data-user-id=\"110401\">@Brendan Seamas Murphy</span> is our local expert on this kind of stuff.</p>",
        "id": 429310014,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1711353459
    },
    {
        "content": "<p>Yes, although in my implementation of singular homology I deduced this via the method of acyclic models instead of defining an explicit chain homotopy</p>",
        "id": 429716021,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1711477900
    },
    {
        "content": "<p>In hindsight I don't think this was a good decision</p>",
        "id": 429716266,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1711477994
    },
    {
        "content": "<p>I have not checked 100% of the details, but I think that it should follow from the similar statement for simplicial sets (if two maps <code>A ⟶ B</code> are homotopic, then the induced chain maps are homotopic): apply it to the morphism of simplicials sets <code>Sing X ⟶ Sing Y</code> deduced from the two homotopic maps of topological spaces <code>X ⟶ Y</code>.</p>\n<p>In order to prove the fact for simplicial sets, it seems to me that we could prove that if <code>h</code> is an homotopy between two morphisms of simplicial objects in a preadditive category (in our case the category of abelian groups), then the corresponding induced morphisms on the alternating face map complexes are also chain homotopic.</p>\n<p>(Note that in mathlib we do not have yet the notion of homotopy between morphisms of simplicial objects, but we shall have soon the notion of simplicial categories in mathlib, see <a href=\"https://github.com/leanprover-community/mathlib4/pull/11398\">#11398</a>, and the fact that the category of simplicial objects in a category is a simplicial category should be obtained soon: <span class=\"user-mention\" data-user-id=\"488744\">@Jack McKoen</span>  and I are working on this.)</p>",
        "id": 429720756,
        "sender_full_name": "Joël Riou",
        "timestamp": 1711479596
    }
]