[
    {
        "content": "<p>For the second time when bumping FLT I have run into an issue where a declaration has been removed without deprecation, and after some detective work I've found that a deprecation attempt has actually been made (and has passed review) but there has been a namespace issue: the code</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"kn\">namespace</span><span class=\"w\"> </span><span class=\"n\">Foo</span>\n\n<span class=\"bp\">&lt;</span><span class=\"n\">stuff</span><span class=\"bp\">&gt;</span>\n\n<span class=\"kn\">lemma</span><span class=\"w\"> </span><span class=\"n\">bar</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">blah</span><span class=\"w\"> </span><span class=\"bp\">=</span><span class=\"w\"> </span><span class=\"n\">blah</span><span class=\"w\"> </span><span class=\"o\">:=</span><span class=\"w\"> </span><span class=\"bp\">...</span>\n\n<span class=\"kn\">end</span><span class=\"w\"> </span><span class=\"n\">Foo</span>\n</code></pre></div>\n<p>becomes</p>\n<div class=\"codehilite\" data-code-language=\"namespace\"><pre><span></span><code>&lt;stuff&gt;\n\nend Foo\n\nlemma bar_with_new_name : blah = blah := ...\n\n@[deprecated (since := \"2025-12-11\")]\nalias bar := bar_with_new_name\n\n...\n</code></pre></div>\n<p>with the consequence that mathlib now has a new deprecated definition <code>bar</code> in the root namespace, and code which calls <code>bar</code> with <code>Foo</code> open will typically flag the deprecation but code which calls <code>Foo.bar</code> e.g. via dot notation will simply result in an error because <code>Foo.bar</code> is now gone. I am also getting confusing output from <a href=\"https://mathlib-changelog.org/\">https://mathlib-changelog.org/</a> about this; I don't know enough about how that website works to say any more though. </p>\n<p>Is there a way of linting against this in CI? I don't know too much about linting but this sounds like a complex problem because one has to compare before and after mathlibs. Right now my understanding is that we're using a python script to do a best approximation of this, but the python script does not catch the phenomenon above and in both cases which affected FLT it has been expert users who have made the deprecation error; if it can happen to them, it can happen to all of us.</p>",
        "id": 564903024,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1766334678
    },
    {
        "content": "<p>Are you saying that the change did not show up in the 'declarations diff' section of PR summary? Given your description of the issue I would have expected it to show up there (and perhaps it should be surfaced better to reviewers, but I think it's good to first establish whether it could have been spotted there.)</p>",
        "id": 564903552,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1766335413
    },
    {
        "content": "<p>The declarations diff is text-based, so does not take <code>namespace</code> into account. We need to replace it with something that uses the actual resolved names, but nobody's taken up the task yet</p>",
        "id": 564904920,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1766337197
    },
    {
        "content": "<p>So my questions are basically what something which did the job more accurately would look like, and how much work it would be.</p>",
        "id": 564907325,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1766340391
    },
    {
        "content": "<p>The last time this came up (and briefly discussing in person with <span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span>) there were questions about replacing the current implementation that stalled things a bit. If you wait for oleans for the PR, it is straightforward to diff declarations. The pending question was if this was a significant enough regression from the current quick feedback that we should still start with a text-based diff that is updated after the build is done.</p>",
        "id": 564908502,
        "sender_full_name": "Chris Henson",
        "timestamp": 1766341813
    },
    {
        "content": "<p>If the text-based diff is cheap then I don't see why we shouldn't keep it. I see that radar is making a preliminary post and then editing it later on (e.g. pinging people when it terminates).</p>",
        "id": 564910234,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1766343985
    },
    {
        "content": "<p>It seems confusing to post \"this is fine!\" \"actually it's not\"</p>",
        "id": 564911173,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1766345333
    },
    {
        "content": "<p>Hmm maybe. It could be two tests, or one could simply argue that if a test is strictly better than another test then the weaker test can just be dropped.</p>",
        "id": 564911271,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1766345490
    },
    {
        "content": "<p>Maybe we should just go ahead with the diff computed using the oleans and forget about the text-based one.</p>",
        "id": 564919420,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1766357431
    },
    {
        "content": "<p>It is always easy to resurrect the old one, in case it is missed.</p>",
        "id": 564919440,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1766357451
    },
    {
        "content": "<p>Now might also be a good time to figure out whether we want to be stricter about declarations that disappear, and maybe add a flag for those, e.g. a label that the script applies.</p>",
        "id": 564919492,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1766357523
    },
    {
        "content": "<p>Of course, it would still be nice to have something with the comprehensivebess of Leaff, but I'm not sure how viable it is to resurrect that. Obviously the maintenance on that would be much higher too.</p>",
        "id": 564920981,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1766359575
    },
    {
        "content": "<p>I'd love to see a diff of binder info if there is one- if any variables changed from explicit to implicit, or changed their name. I think it's helpful to both the author and reviewers, the author might have not intended to change something but a <code>variable</code> command sneaked the change into more theorems than expected.</p>",
        "id": 564954418,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1766391742
    }
]