[
    {
        "content": "<p>The files <code>Mathlib/Data/Analysis/Filter.lean</code> and <code>Mathlib/Data/Analysis/Topology.lean</code> re-implement a bit of the theory of filters and of topology from 2017. The files are experimental, and they have received no real features or usage since they were first made. Sounds like they are clearly ready for deprecation. Any project that wants to adopt these modules, or shall I deprecate them without replacement?</p>\n<p>(I came across this while tracking down the directories imported by Mathlib/Data. Analysis and topology are only imported by <code>Data/Real</code>, <code>Data/Complex</code> and <code>Data/Analysis</code>.)</p>",
        "id": 541469325,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1758809574
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> do you want to explain a bit about the intended purpose of these files?</p>",
        "id": 541480420,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1758812287
    },
    {
        "content": "<p>they provide a computational interpretation of filters, continuous functions etc, by associating elements of a type with a subbase operation</p>",
        "id": 541480827,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1758812374
    },
    {
        "content": "<p>for example you can do this for the topology of the reals by using rational intervals</p>",
        "id": 541481001,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1758812410
    },
    {
        "content": "<p>I also want to remark that I don't think the described deprecation flowchart is right (speaking more generally than this specific material). Just because a theorem isn't getting use doesn't mean it should be deleted. Unless you mean deprecation as in people should avoid it, but who is that going to affect in the first place if it's not being used? It's not even an argument that it shouldn't be used, only that as a matter of fact it is not, which is at best weak evidence that it is not a good API.</p>",
        "id": 541482369,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1758812724
    },
    {
        "content": "<p>That feels right to me, certainly - if there's a general use at least.</p>",
        "id": 541483007,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1758812868
    },
    {
        "content": "<p>sorry, I don't know who you are agreeing with</p>",
        "id": 541483250,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1758812927
    },
    {
        "content": "<p>Sorry: you.</p>",
        "id": 541483284,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1758812935
    },
    {
        "content": "<p>For an example of a file I myself created, I think <code>Mathlib.Topology.MetricSpace.Infsep</code> is missing something of a use right now, but it is intended to provide the analysis way of spelling \"minimum distance of a set\", essentially: I think it is worth keeping, and the API was based off of <code>Set.diam</code> and I think is pretty sensible. But, well, ultimately I could see a deprecation argument. I think this would be somewhat overzealous though - and even more so in the case of the files you mention!</p>",
        "id": 541483549,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1758812994
    },
    {
        "content": "<p>To be honest I never really expected those files to get much use, but the reason for this is that I don't think it's an area that is very well studied. You need to care about both topology and computation (in the Brouwer sense) at the same time to be lead to this approach</p>",
        "id": 541484238,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1758813146
    },
    {
        "content": "<p>I think it's related to realizability models, it's not an area I know much about</p>",
        "id": 541484597,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1758813228
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Deprecating.20Mathlib.2FData.2FAnalysis/near/541480827\">said</a>:</p>\n<blockquote>\n<p>they provide a computational interpretation of filters, continuous functions etc, by associating elements of a type with a subbase operation</p>\n</blockquote>\n<p>Sure, I did actually read the module documentation <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span>. I guess my question could have been more specific: what abilities does this computational interpretation unlock? Was the goal to use it in a tactic at some point?</p>",
        "id": 541484839,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1758813285
    },
    {
        "content": "<p>No, it wasn't for a tactic. It was actually computation for its own sake when I wrote it. You should be able to use it in some <code>#eval</code> things but it's still a bit high order so it's hard to see exactly what you would be doing</p>",
        "id": 541485300,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1758813400
    },
    {
        "content": "<p>there are some things where you can for example reduce checking that a function is continuous to a countable sequence of decidable tests</p>",
        "id": 541485458,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1758813447
    },
    {
        "content": "<p>if you have an open set, and provide a point in it, you can compute a specific interval that is in the set</p>",
        "id": 541485852,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1758813541
    },
    {
        "content": "<p>this is kind of like the representation of a topology you might find in sage</p>",
        "id": 541486006,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1758813584
    },
    {
        "content": "<p>Ah, the age old \"should Mathlib care about computation\" question.</p>",
        "id": 541572617,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1758854008
    },
    {
        "content": "<p>Independently of this, I really wish we had an answer one way or the other.</p>",
        "id": 541572639,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1758854028
    },
    {
        "content": "<p>What I don't understand then is: the files claim to be experimental. I thought this meant: the experiment is to see if they are more useful than the current implementations. If they have not seen use since 2017, then they are not more useful. So we should stop spending our effort on maintaining these files (which has probably been more effort than writing them in the first place), and mark them as deprecated.</p>",
        "id": 541607959,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1758874072
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hern치ndez</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Deprecating.20Mathlib.2FData.2FAnalysis/near/541572639\">said</a>:</p>\n<blockquote>\n<p>Independently of this, I really wish we had an answer one way or the other.</p>\n</blockquote>\n<p>When I joined the Mathlib community in 2019 I was told directly that Mathlib does not care about computation. Did we change our mind?</p>\n<p>(Which would be great for me, since I am an intuitionist!)</p>",
        "id": 541608166,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1758874151
    },
    {
        "content": "<p>I certainly care about computation.</p>",
        "id": 541614009,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1758875850
    },
    {
        "content": "<blockquote>\n<p>So we should stop spending our effort on maintaining these files (which has probably been more effort than writing them in the first place), and mark them as deprecated.</p>\n</blockquote>\n<p>As someone who has had to painstakingly fix other files that haven't been used since 2017, I'd really like to stress this point.</p>",
        "id": 541660284,
        "sender_full_name": "Violeta Hern치ndez",
        "timestamp": 1758890874
    }
]