[
    {
        "content": "<p>I was having a bit of trouble wrapping my mind around the 18 different types of (semi)linear maps in mathlib, so I decided to make this diagram using Obsidian's Canvas. I can't guarantee that it's accurate, and it's not the most general it could be, but maybe it will be helpful to at least one person.</p>\n<p><a href=\"/user_uploads/3121/2-vijMYbZJR9leJF5Lxbb7iH/Linear-Maps-in-Lean.png\">Linear Maps in Lean.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/2-vijMYbZJR9leJF5Lxbb7iH/Linear-Maps-in-Lean.png\" title=\"Linear Maps in Lean.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"3940x1980\" src=\"/user_uploads/thumbnail/3121/2-vijMYbZJR9leJF5Lxbb7iH/Linear-Maps-in-Lean.png/840x560.webp\"></a></div><p>(Here's the .json source in case anyone wants it: <br>\n<a href=\"/user_uploads/3121/kPwSMiTX24MqZRuk-1w0dZG7/Linear-Maps-in-Lean.canvas\">Linear Maps in Lean.canvas</a></p>",
        "id": 533186317,
        "sender_full_name": "Niels Voss",
        "timestamp": 1754518500
    },
    {
        "content": "<p>Not sure if you want these, but there's also <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=PositiveLinearMap#doc\">docs#PositiveLinearMap</a> and <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CompletelyPositiveMap#doc\">docs#CompletelyPositiveMap</a> !</p>",
        "id": 533341683,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1754590403
    },
    {
        "content": "<p>Do <code>PositiveLinearMap</code> and <code>CompletelyPositiveMap</code> have any relation whatsoever to <code>LinearMap.IsPositive</code>?</p>",
        "id": 533375749,
        "sender_full_name": "Niels Voss",
        "timestamp": 1754608827
    },
    {
        "content": "<p>Not much relation, since they require different data... <code>PositiveLinearMap</code>s require an ordering on the input and output vector spaces; <code>LinearMap.IsPositive</code> requires an inner product structure.</p>\n<p>The most common instance of the ordering on the vector space would be looking at the vector space of R-valued matrices, and the <a href=\"https://en.wikipedia.org/wiki/Loewner_order\">Loewner order</a>. Then the positive elements are the positive semidefinite matrices. Matrices also have the Frobenius inner product, and then the inner product of two positive semidefinite matrices is always positive. So, for this particular ordering and this particular inner product, every <code>PositiveLinearMap</code> also <code>IsPositive</code>. (You can also talk about this for linear operators, instead of just matrices, of course.)</p>\n<p>The converse is not true: there are <code>IsPositive</code> linear maps between spaces of matrices that are not <code>PositiveLinearMap</code>s.</p>\n<p><code>CompletelyPositiveMap</code> is a strengthening of <code>PositiveLinearMap</code> that requires it stays a PositiveLinearMap under tensor products with the identity. It turns out that, if you write down the matrix elements of a <code>CompletelyPositiveMap</code>, they correspond directly to the matrix elements of <code>IsPositive</code> maps, and this is known as <a href=\"https://en.wikipedia.org/wiki/Choi%27s_theorem_on_completely_positive_maps\">Choi's theorem</a>. By 'correspond directly' I mean that it's a linear isometry to convert between these two sets.</p>\n<p>But the funny thing is that it's not writing down \"the matrix elements\" in the same basis ... because as I said before, every <code>CompletelyPositiveMap</code> is a <code>PositiveLinearMap</code>, and there are <code>IsPositive</code> maps that <em>aren't</em> <code>PositiveLinearMap</code>, so it's not that <code>CompletelyPositiveMap = IsPositive</code>. Since we're talking about linear maps from matrices to matrices, the matrix elements are generally labelled by 4 indices, and there's sort of two different reasonable ways to organize it then. And, _in the correct two distinct organizations of this data_, <code>CompletelyPositiveMap</code> and <code>IsPositive</code> are the same.</p>",
        "id": 533659465,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1754840894
    },
    {
        "content": "<p>To make things worse, there is a notion of <a href=\"https://mathworld.wolfram.com/CompletelyPositiveMatrix.html\">Completely Positive Matrix</a> which as far as I know is not in Mathlib. It crops up in optimization theory and polyhedral complexity stuff. They're the dual cone to the <a href=\"https://mathworld.wolfram.com/CopositiveMatrix.html\">Copositive Matrix</a>.</p>\n<p>Now, I mentioned how <code>PositiveLinearMap</code> requires an ordering on the input and output vector spaces. The notion of Completely Positive Matrix appears when you equip the vector space ℝ^n with the \"component-wise ordering\": like, <code>(x1,y1,z1) ≤ (x2,y2,z2) ↔ (x1 ≤ x2) ∧ (y1 ≤ y2) ∧ (z1 ≤ z2)</code>. With that ordering, every completely positive matrix is also <code>PositiveLinearMap</code>, and every <code>PositiveLinearMap</code> is copositive. Both of these inclusions are strict. This also happens to be an ordering+inner product pair where every <code>PositiveLinearMap</code> also <code>IsPositive</code>, although again, this isn't always true.</p>",
        "id": 533659981,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1754841525
    },
    {
        "content": "<p>That might've been more than you wanted to know :)</p>",
        "id": 533660013,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1754841559
    }
]