[
    {
        "content": "<p>Does mathlib allow for different proofs of the same theorem? If so, how would these appear in mathlib (and if you could point me to any examples that already exist, that would be great). In particular, how is the naming of the theorems with different proofs done? If only one proof is allowed, how do you decide which proof deserves to be in mathlib? </p>\n<p>For example, in random matrix theory, there are two different techniques (one being the moment method which is combinatorial and the other using resolvents and complex analysis) that can be used to prove the same theorems. Would one proof via the moment method and another via resolvents be allowed to coexist in mathlib, or is only one allowed?</p>",
        "id": 534032176,
        "sender_full_name": "Fred Rajasekaran",
        "timestamp": 1755022357
    },
    {
        "content": "<p>If it breaks a tie, mathlib uses the proof which holds in greater generality, but of course in that the case they are no longer the same theorem!</p>",
        "id": 534032363,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1755022439
    },
    {
        "content": "<p>Otherwise in general mathlib indeed keeps only one proof of each theorem; it's arguably intended as a library of theorems with verification that they are true, and not as a library of proofs.</p>",
        "id": 534032522,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1755022508
    },
    {
        "content": "<p>In the past what I've done is keep the old proof around in my repo, which I maintain</p>",
        "id": 534032736,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1755022602
    },
    {
        "content": "<p>But all proofs of the same theorem are equal :)</p>",
        "id": 534035606,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1755023827
    },
    {
        "content": "<p>Maybe those two proof approaches can be imagined as some kind of \"induction principle\" that you could wrap up into a lemma, and then you'd have two different lemmas that could both be in mathlib</p>",
        "id": 534035951,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1755023975
    },
    {
        "content": "<p>Otherwise that's only happened in Archive/</p>",
        "id": 534036005,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1755023991
    }
]