[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"359992\">Robert Maxton</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20cases'.20deprecated.3F/near/510047295\">said</a>:</p>\n<blockquote>\n<p>I think this is mostly an artifact of the lack of good (esp. good \"canonical\") documentation for tactics. To my knowledge the only way of getting any sort of systematic coverage of what tactics are available is through <a href=\"https://github.com/haruhisa-enomoto/mathlib4-all-tactics/blob/main/all-tactics.md\">Haruhisa's trick</a>, which yes, results in a big barrier to entry that scales with the number of tactics. But if we had, in any of our three major documentation sources, a guide to the most common/\"center path\" tactics that work most of the time in each field, then having variants IMO ceases to be a barrier to entry; new users should follow the documentation and use the rarely-changing shortlist of common tactics to get started, and treat the variants as \"advanced usage.\"</p>\n<p>... Actually, do the various textbooks take PRs? Because I might just contribute an appendix somewhere myself.</p>\n</blockquote>\n<p>I'm trying to advocate this <a href=\"https://leanprover-community.github.io/mathlib-manual/html-multi/Tactics/All-tactics/#all_tactics\">automatically generated list of all tactics in Mathlib</a> which is already linked on <a href=\"http://leanprover-community.github.io\">leanprover-community.github.io</a></p>\n<p>If you have the time and motivation, contributing to it would be much appreciated and I think it would be a good investment of time as Verso should help us keeping the document updated in the future.</p>\n<p>There are two fronts to contribute:</p>\n<ul>\n<li>Create PRs to mathlib  (and dependencies) marking alternative forms of tactics with <code>@[tactic_alt original_tactic]</code>, cleaning-up docstrings  as you do so, i.e. describing all tactic alternatives in the main tactic's docstring. I already did this for <code>abel</code>, see the merged <a href=\"https://github.com/leanprover-community/mathlib4/pull/21085\">#21085</a>. This reduces the number of individual tactics on the list. (e.g. there are currently <a href=\"https://leanprover-community.github.io/mathlib-manual/html-multi//Tactics/All-tactics/#have-next\">7 different <code>have</code> tactics on the list</a>)</li>\n<li>In the sections before \"All tactics\" there is a draft for categorising some tactics manually into small and useful bits. These sections could always need some more thought and editing in order to be as useful as they can be. At this stage it would also be appreciated if you completely scrapped some sections or introduced new ones depending on what you think would be useful! I'm happy to merge any PRs to that <a href=\"https://github.com/leanprover-community/mathlib-manual/\">repository</a> <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></li>\n</ul>\n<p>I believe in this approach because there is no documentation written which can rott: The sorted &amp; curated lists of tactics are something any documentation would need as a base and everything else comes directly from the source code.</p>",
        "id": 510066401,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1743730284
    },
    {
        "content": "<p>There are also 19 tactics starting with <code>simp...</code> on the list, so certainly there is another option for improvement...</p>",
        "id": 510066677,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1743730440
    },
    {
        "content": "<p>In <a href=\"https://leanprover-community.github.io/mathlib-manual/html-multi//Tactics/All-tactics/#Lean___Parser___Tactic___match\">https://leanprover-community.github.io/mathlib-manual/html-multi//Tactics/All-tactics/#Lean___Parser___Tactic___match</a>, hovering over <code>match</code> gives a pretty unhelpful docstring. In this case it's fine, since I'm looking at a helpful description anyway, but this looks like Verso doing something suboptimal if <code>match</code> gives this message in other situations too.</p>",
        "id": 510075297,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1743735788
    },
    {
        "content": "<p>nice spot: I've asked this question at <a href=\"https://github.com/leanprover/verso/issues/351\">https://github.com/leanprover/verso/issues/351</a> with detailed description.<br>\n(although, arguably for this particular example the solution might be to just remove the conflicting syntax which has been <a href=\"https://github.com/leanprover-community/batteries/blame/4f7258c077d7b5640d5bef77b574feae89c58f5e/Batteries/Tactic/NoMatch.lean#L15-L22\">deprecated a year ago</a>)</p>",
        "id": 510126442,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1743756811
    },
    {
        "content": "<p>I went a bit further through the tactic list, and have tried to categorise very apparent duplicates.</p>\n<p>In mathlib, so easily actionable</p>\n<ul>\n<li>measurability (four versions)</li>\n<li>use and use! (the doc-string already explains both variants, so this may just need <code>tactic_alt</code>)</li>\n<li>choose and choose! (same story)</li>\n<li>I wonder if the doc-strings for by_contra and by_contra! can be combined: this requires closely looking at them, though</li>\n</ul>\n<p>Definitely defined in core</p>\n<ul>\n<li>apply, apply at and apply with a config should be unified</li>\n<li>three versions <code>change</code> which could be combined</li>\n<li>bv_decide and bv_decide? are present twice each</li>\n<li>\n<p><code>simpa_all?</code>, <code>simp_all?!</code>, <code>dsimp?</code> and <code>dsimp?!</code> have the exact same doc-string as <code>simp?</code>: that's not helpful :-)<br>\nPerhaps <code>dsimp</code> should explain <code>dsimp!, </code>dsimp?<code> and </code>dsimp?!` also; similarly for simp_all.</p>\n</li>\n<li>\n<p>trace (two copies)</p>\n</li>\n</ul>\n<p>I'm not sure if the following are in core or not</p>\n<ul>\n<li>maybe the repeat(')(1) versions should also be combined</li>\n<li>should rename and rename' be combined?</li>\n<li>there are many variants of have('), some in mathlib, some in core</li>\n<li><code>observe?</code> has the same doc-string twice: combining them would be useful</li>\n</ul>",
        "id": 513654086,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745339294
    }
]