[
    {
        "content": "<p>I want to shorten \"non-zero\" to \"nonzero\" and \"non-empty\" to \"nonempty\" across mathlib. I am motivated by The Chicago Manual of Style that encourages doing so: <a href=\"https://www.chicagomanualofstyle.org/qanda/data/faq/topics/HyphensEnDashesEmDashes/faq0079.html\">https://www.chicagomanualofstyle.org/qanda/data/faq/topics/HyphensEnDashesEmDashes/faq0079.html</a></p>\n<p>The idea is that hyphens should be dropped if they do not serve a purpose. Among purposes that can be served by a hyphen is:</p>\n<ul>\n<li>Avoiding doubling letters: Some authors prefer \"non-negative\" over \"nonnegative\" because of the double \"n\".</li>\n<li>Respecting proper names: E.g. \"non-Euclidean\"</li>\n<li>Avoiding ambiguity in larger compounds: E.g \"non-zero-divisor\".</li>\n</ul>\n<p>But in the cases of \"non-zero\" and \"non-empty\", the hyphen is just wasted space, as far as I can see.</p>\n<p>However, my PRs (<a href=\"https://github.com/leanprover-community/mathlib4/pull/28949\">#28949</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/28951\">#28951</a>) have raised a bit of discussion, and I wanted to bring this discussion to the attention of the community to see whether I can get consent.</p>\n<p>The opposing viewpoint seems to be that this should be considered a matter of taste and left up to individual authors.</p>\n<p>Any takes on this?</p>",
        "id": 536210838,
        "sender_full_name": "Harald Husum",
        "timestamp": 1756206200
    },
    {
        "content": "<p>I personally prefer non-zero and non-empty as they sometimes feel more readable to me. Since it's not incorrect to add hyphens here, I think it shouldn't matter all that much.</p>",
        "id": 536218409,
        "sender_full_name": "Monica Omar",
        "timestamp": 1756209023
    },
    {
        "content": "<p>I like to talk about nonzero-sum games.</p>",
        "id": 536222190,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1756210265
    },
    {
        "content": "<p>In some sense any change here will be futile unless you also write a linter stopping people from adding the versions you don't like in later PRs.</p>",
        "id": 536223368,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1756210686
    },
    {
        "content": "<p>Individual taste, please. We're in the weeds now in terms of improving readability, and the bother of implementing the rules exceeds the payoff.</p>",
        "id": 536224601,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756211084
    },
    {
        "content": "<p>To be clear, I don't desire to implement this as a rule, <span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span>,  and I do not think it is wise to lint against this, <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>. Either would add friction to the PR process, which clearly outweighs the benefit.</p>\n<p>I don't mind the fact that \"non-zero\"s and \"non-emty\"s will be slowly accumulating again after the PRs are merged. In my mind, this kind of grammar issue is best dealt with by way of infrequent bulk PRs, done by those who care to, like me. In that way, no additional workload is placed on contributors or reviewers.</p>\n<p>Hence, what I am asking for is nothing at all beyond getting these two PRs merged. Just want to make sure my intentions aren't misunderstood.</p>",
        "id": 536247798,
        "sender_full_name": "Harald Husum",
        "timestamp": 1756217869
    },
    {
        "content": "<p>It <em>is</em> additional workload on reviewers though. Every minute I spend reviewing one of these PRs is a minute I can't spend reviewing a PR about mathematics. And note the time devoted to this discussion too. So either we should choose to care and lint against it, or we should choose to not care and not bother. As Kim suggests, I think we should go for the latter.</p>\n<p>Note: this is not leveled as a criticism of you. I'm only trying to inform about the reality of the situation.</p>",
        "id": 536261059,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1756221647
    },
    {
        "content": "<p>I do appreciate that you are only trying to help out. I don't construe any malintent.</p>",
        "id": 536261222,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1756221703
    },
    {
        "content": "<p>I like this general principle for large collaborative projects:</p>\n<blockquote>\n<p>Contributors should feel free to express themselves using their own local style, so long as (1) the style guide has nothing to say on it, (2) the local style is understandable, and (3) it's not an <em>idiosyncratic</em> style. Furthermore, contributors are <em>not</em> free to make changes to other people's stylistic expression <em>unless</em> it's incidental to a substantive contribution <em>or</em> it is a PR to fix style guide violations.</p>\n</blockquote>\n<p>I tend to be more on the side of \"let people do what they want within established conventions, so long as the expression is clear and the style doesn't obscure intention\" (even for code formatting).</p>\n<p>So, unless The Chicago Manual of Style is adopted as part of the mathlib styleguide, I would suggest closing the PRs. The fact even a single person has spoken in favor of hyphens, paired with the fact I've seen that style before, is enough for me at least to not feel comfortable merging.</p>\n<p>(Should we adopt more formally some version of the \"don't touch other peoples' style unless it's a style guide violation\" principle?)</p>",
        "id": 536265544,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1756223030
    },
    {
        "content": "<blockquote>\n<p>(Should we adopt more formally some version of the \"don't touch other peoples' style unless it's a style guide violation\" principle?)</p>\n</blockquote>\n<p>Or if it's to expand on the docs or make something clearer; so not just pure style edits</p>",
        "id": 536270239,
        "sender_full_name": "Monica Omar",
        "timestamp": 1756224350
    },
    {
        "content": "<p>That's meant to fall under \"substantitive contribution\". Clearly it needs to be clearer :-)</p>",
        "id": 536270387,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1756224402
    },
    {
        "content": "<p>I would make an exception for clear fixes: a big collection of typo fixes is welcome, in my opinion. Even if these are rules that are often ignored (hausdorff to Hausdorff, for example, or correcting the spelling of person's names).</p>",
        "id": 536274672,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756225841
    },
    {
        "content": "<p>Otherwise, I agree: once a change is controversial (and this one clearly is), it's not worth bikeshedding over.</p>",
        "id": 536274738,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756225862
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197836\">Jireh Loreaux</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536261059\">said</a>:</p>\n<blockquote>\n<p>It <em>is</em> additional workload on reviewers though. Every minute I spend reviewing one of these PRs is a minute I can't spend reviewing a PR about mathematics.</p>\n</blockquote>\n<p>I am not asking you to review the PR unless you <em>care</em> about writing style. I just had hope that <em>some</em> reviewer cares enough, that is all. If there is such a reviewer, they would presumably not find it to be a burden.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"197836\">Jireh Loreaux</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536261059\">said</a>:</p>\n<blockquote>\n<p>And note the time devoted to this discussion too.</p>\n</blockquote>\n<p>I don't see that I am forcing you to engage with me. I hope you do so out of your own volition. And I really don't think I should feel guilty for raising this discussion, even if you don't share my opinion.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536265544\">said</a>:</p>\n<blockquote>\n<p>The fact even a single person has spoken in favor of hyphens, paired with the fact I've seen that style before, is enough for me at least to not feel comfortable merging.</p>\n</blockquote>\n<p>That is a viewpoint I can understand and respect, even if I don't agree with it. I'd much prefer if something like The Chicago Manual of Style was included in the mathlib style guidelines, but I also understand that this might be a controversial opinion.</p>",
        "id": 536276664,
        "sender_full_name": "Harald Husum",
        "timestamp": 1756226485
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> Typos aren't style — I don't see a reason to make an exception for fixing mistakes. It's worth clarifying the distinction though: mistakes are wrong, style differences are not.</p>",
        "id": 536276671,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1756226487
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"634338\">Michael Rothgang</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536274738\">said</a>:</p>\n<blockquote>\n<p>Otherwise, I agree: once a change is controversial (and this one clearly is), it's not worth bikeshedding over.</p>\n</blockquote>\n<p>To go a bit further, I'm saying that we can decide ahead of time that changes made only for style are controversial, as a matter of policy. (Style not set out in the style guide.)</p>",
        "id": 536276968,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1756226614
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"767479\">Harald Husum</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536276664\">said</a>:</p>\n<blockquote>\n<p>And I really don't think I should feel guilty for raising this discussion, even if you don't share my opinion.</p>\n</blockquote>\n<p>Please don't interpret Jireh as saying that you should feel guilty.</p>\n<p>You have to understand that every PR is a burden. Every PR has the capacity to occupy any particular reviewer's attention, even if just to decide whether to look more closely — contributors are implicitly asking all reviewers to take a look. The longer the PR sits in the review queue, waiting for reviewers to come to some decision, the more time is spent on it. We accept the burden, so don't feel guilty, but burden is an appropriate word. (Regarding your point about volition, as a mathlib maintainer Jireh has some responsibility to make sure PRs are addressed.)</p>\n<p>For the record, I don't believe Jireh <em>doesn't</em> care about writing style, so we can't ask him not to think about this PR. His saying \"it should either be linted or we shouldn't care\" is a review in itself.</p>\n<p>(I think I should say that this thread isn't necessarily about your PRs per se, so I hope you don't take it personally. Your PRs are a good spark for a broader discussion about style and what should be an acceptable contribution. The way the project is organized is that it can be difficult to make decisions to close PRs, and so it would help to have some guidelines. The size of the mathlib PR queue can be quite daunting.)</p>",
        "id": 536281123,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1756228162
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"767479\">Harald Husum</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536276664\">said</a>:</p>\n<blockquote>\n<p>And I really don't think I should feel guilty for raising this discussion</p>\n</blockquote>\n<p>I'm sorry if my message was interpreted that way, it was not my intent, as I tried to make clear that it is not a criticism of you. And I'm not saying this Zulip discussion isn't worthwhile, only that it consumes a nonzero amount of time.</p>\n<p>Kyle's responses accurately summarize the situation (i.e., every PR consitutes some burden, and as a maintainer I have a responsibility to review PRs I'm capable to review.)</p>",
        "id": 536291906,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1756232922
    },
    {
        "content": "<p>Summarizing this discussion, I see that there isn't consent to be had. Fair enough, I agree that it isn't worth bike-shedding over, so I've closed the PRs in question.</p>\n<p>There's a few things I want to comment on, though, now that I have time.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"197836\">Jireh Loreaux</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536261059\">said</a>:</p>\n<blockquote>\n<p>So either we should choose to care and lint against it, or we should choose to not care and not bother.</p>\n</blockquote>\n<p>This strikes me as a false dichotomy. There are quite a few examples of things we do care about and do bother with, but don't lint against. Implementing the naming convention is one example. Fixing typos and grammar errors is another. Is your opinion that there is something unsatisfactory with these examples inhabiting this in-between state?</p>\n<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536265544\">said</a>:</p>\n<blockquote>\n<p>Should we adopt more formally some version of the \"don't touch other peoples' style unless it's a style guide violation\" principle?</p>\n</blockquote>\n<p>I mean I don't disagree in principle. In matters that are purely about style, I don't feel it is appropriate to override other people's work. The problem is that there's a fairly broad grey-zone between purely stylistic issues and outright grammatical errors. I feel like the PRs i proposed in this thread are nice examples of that.</p>\n<p>I proposed the PRs and raised this discussion because, in my mind, the use of \"non-zero\" and \"non-empty\" lie closer to \"grammatical error\" territory than to \"stylistic plurality\" territory (as opposed to nonnegative vs. non-negative, as discussed in my OP, which truly comes down to style). Having witnessed the resulting discussion here, the takeaway is that the community still deems this an expression of allowable stylistic plurality. This is totally fine; the point I'm making is that this conclusion was, to me, by no means given (and even surprising).</p>\n<p>If I'm going to continue improving the documentation of mathlib, which I hope to do, I will, repeatedly, encounter this broad grey-zone in some way or another. If I risk being understood as controversial or provoking every time I end up touching this zone, that would seem off-putting and demotivating to me. I might then err on the side of caution and just not contribute.</p>\n<p>In summary, if you want to discourage attempts at purely stylistic changes, I think you should also take on the burden of making absolutely clear what is considered style and what is not. That is, you need to find a way to draw a clear line somewhere in this grey-zone. Can you do that?</p>\n<p><span class=\"user-mention silent\" data-user-id=\"197836\">Jireh Loreaux</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536291906\">said</a>:</p>\n<blockquote>\n<p>And I'm not saying this Zulip discussion isn't worthwhile, only that it consumes a nonzero amount of time.</p>\n</blockquote>\n<p>Thank you for clarifying. I read your initial comment as expressing frustration that this had to be a discussion to begin with, but I now understand that was not your intent.</p>",
        "id": 536317235,
        "sender_full_name": "Harald Husum",
        "timestamp": 1756245070
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"767479\">Harald Husum</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536317235\">said</a>:</p>\n<blockquote>\n<p>If I'm going to continue improving the documentation of mathlib, which I hope to do, I will, repeatedly, encounter this broad grey-zone in some way or another.</p>\n</blockquote>\n<p>I think the general advice here should be to aim for substantive documentation: why is this implemented the way it is, how do I use this API, show examples of setting something up, etc. These are sorely sorely lacking all across the library!</p>",
        "id": 536330079,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756253949
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"767479\">Harald Husum</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536317235\">said</a>:</p>\n<blockquote>\n<p>if you want to discourage attempts at purely stylistic changes, I think you should also take on the burden of making absolutely clear what is considered style and what is not. That is, you need to find a way to draw a clear line somewhere in this grey-zone. Can you do that?</p>\n</blockquote>\n<p>Ok: it's a matter of style if the variations appear in multiple usages in quality published sources.</p>\n<p>Your examples of \"non-zero\" and \"non-empty\" might be grammatical errors to some people, but I can easily find plenty of usages in textbooks. Even Wikipedia has an article called <a href=\"https://en.wikipedia.org/wiki/Non-zero\">\"Non-zero\"</a>, and in <a href=\"https://en.wikipedia.org/wiki/Null_vector\">Null vector</a> it's got both \"non-zero\" and \"nonzero\" in successive paragraphs! Wikipedia is not proof of anything, but Mathlib is a math formalization project, not a project researching correct English usage, so if Wikipedia editors don't see \"non-zero\" as a mistake, I feel comfortable saying the question is unsettled.</p>\n<p>Notice that this makes it hard or nearly impossible to prove that something <em>isn't</em> a matter of style. The burden on an author of a mistake-only PR is to prove that they are grammar mistakes, or at least assume the risk that their PR will be closed. If neither is possible, or if it takes too much reviewer energy to evaluate, I'd avoid it.</p>\n<p><em>Substantive</em> improvements are welcome, like Kim said. There are many many more directions with better yield (in terms of benefit-per-(author + reviewer time)) to pursue at the moment. If that's the thrust of your contributions, I would not worry about gray zones.</p>\n<p>Being semiserious, if \"non-zero\" is bothersome, and you think it's worth the energy, you could conduct a campaign to submit PRs that improve the paragraphs that contain \"non-zero\", and incidentally use \"nonzero\" instead. If you hide it across multiple PRs that each stand on their own, no one would be the wiser. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> More seriously, this is explicitly allowed in <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536265544\">the principle</a> I was suggesting. If you rewrite something, you don't have to preserve the style in which it was written.</p>",
        "id": 536335720,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1756259259
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536330079\">said</a>:</p>\n<blockquote>\n<p>I think the general advice here should be to aim for substantive documentation: why is this implemented the way it is, how do I use this API, show examples of setting something up, etc. These are sorely sorely lacking all across the library!</p>\n</blockquote>\n<p>I'm sorry to say I don't think I have the knowledge set to do so effectively. I am not a mathematician and my experience with Lean does not reach beyond completing the NNG, so the best I can really hope for, at least in the near future, is to improve upon preexisting  documentation.</p>\n<p>You could argue that this is reason for me to refrain from contributing, but my sense is that the sum total of my contributions are for the benefit of mathlib, even if it does imply sometimes proposing changes that will probe the boundary of usefulness.</p>\n<p>You could also argue that I should have raised the discussion before creating the PRs, but in this case, where the effort needed to create the PRs is low, I feel it substantially helps the discussion to have the PRs ready to go. Perhaps I could have marked them <code>RFC</code> or <code>WIP</code>, but I didn't really expect pushback on this before I got it.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536335720\">said</a>:</p>\n<blockquote>\n<p>Ok: it's a matter of style if the variations appear in multiple usages in quality published sources.</p>\n</blockquote>\n<p>I'm a layman, I don't have access to the vast majority of quality published sources in mathematics.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536335720\">said</a>:</p>\n<blockquote>\n<p>Your examples of \"non-zero\" and \"non-empty\" might be grammatical errors to some people, but I can easily find plenty of usages in textbooks. Even Wikipedia has an article called <a href=\"https://en.wikipedia.org/wiki/Non-zero\">\"Non-zero\"</a>, and in <a href=\"https://en.wikipedia.org/wiki/Null_vector\">Null vector</a> it's got both \"non-zero\" and \"nonzero\" in successive paragraphs! Wikipedia is not proof of anything, but Mathlib is a math formalization project, not a project researching correct English usage, so if Wikipedia editors don't see \"non-zero\" as a mistake, I feel comfortable saying the question is unsettled.</p>\n</blockquote>\n<p>I think this is the better argument. I wasn't aware of the Wikipedia article for instance. My queries on the matter led me to the CMOS and their clear recommendation, and every LLM i queried recommended  that I go for \"nonzero\" and \"nonempty\" in the context of formal mathematics writing, so I assumed I was on safe ground. Obviously I could have done even more research.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536335720\">said</a>:</p>\n<blockquote>\n<p>Notice that this makes it hard or nearly impossible to prove that something <em>isn't</em> a matter of style. The burden on an author of a mistake-only PR is to prove that they are grammar mistakes, or at least assume the risk that their PR will be closed. If neither is possible, or if it takes too much reviewer energy to evaluate, I'd avoid it.</p>\n</blockquote>\n<p>I don't really mind closing PRs, like I did in this case. I want there to be a low bar for <em>making</em> PRs, not necessarily <em>merging</em> PRs. It isn't problematic to me if the only review I get is \"this seems like a change that is too stylistic in nature, won't review unless a stronger case is made\". I just think it is culturally unhealthy if the act of making the PR in the first place is seen as bothersome. I mean, I won't be making PRs that I myself find to be purely stylistic, but eventually I will propose changes that I think are uncontroversial that do in fact turn out to be controversial. I want that recognized as a cost of doing business, so to speak.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536335720\">said</a>:</p>\n<blockquote>\n<p>Being semiserious, if \"non-zero\" is bothersome, and you think it's worth the energy, you could conduct a campaign to submit PRs that improve the paragraphs that contain \"non-zero\", and incidentally use \"nonzero\" instead. If you hide it across multiple PRs that each stand on their own, no one would be the wiser. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> More seriously, this is explicitly allowed in <a href=\"#narrow/channel/287929-mathlib4/topic/Dropping.20hyphens/near/536265544\">the principle</a> I was suggesting. If you rewrite something, you don't have to preserve the style in which it was written.</p>\n</blockquote>\n<p>My ulterior motive for these borderline stylistic changes was actually to clean up the diff of potential PRs doing just this. I'm employing LLMs to clean up mathlib documentation, but LLMs tend to want to fix both grey-zone and non-grey-zone mistakes. My thinking was that if I make preemptive PRs cleaning up all the common grey-zone stuff, I can eventually get diffs that cleanly focus in on more substantive changes, some of which might require careful review. My thinking was that the reviewer burden would be smaller in total if these grey-zone changes were done isolated and in bulk (and only a single time for each class of mistake), rather than intermittently \"polluting\" more substantive changes in a wider set of PRs.</p>\n<p>I take it that you might actually prefer the latter, and that I can totally respect. My intuition just wasn't calibrated for that.</p>",
        "id": 536373433,
        "sender_full_name": "Harald Husum",
        "timestamp": 1756284289
    },
    {
        "content": "<p>I might as well ask for a \"pre-review\" on the following PRs then. All of these are examples of PRs that can hypothetically be construed as too stylistic, depending on where the line is drawn.</p>\n<ul>\n<li><del>-#28798: doc: prefer \"cannot\" over \"can not\"</del></li>\n<li><a href=\"https://github.com/leanprover-community/mathlib4/pull/28945\">#28945</a>: doc: hyphenate compound adjectives ending in -dimensional</li>\n<li><a href=\"https://github.com/leanprover-community/mathlib4/pull/28910\">#28910</a>: doc: hyphenate compound adjectives ending in -theoretic</li>\n</ul>\n<p>Are these PRs I should aim to keep free of merge-conflicts, because they eventually will be reviewed? Or are they considered controversial and distracting, and hence should be closed ASAP?</p>\n<p>Any takes are welcome.</p>",
        "id": 536547044,
        "sender_full_name": "Harald Husum",
        "timestamp": 1756366568
    }
]