[
    {
        "content": "<p>I am working as a summer project with my supervisor to formalize some results with intention of them (hopefully) being included in mathlib eventually. Although I have been progressing and completing some of the proofs, I find that a lot of them are clunky and could most probably be done in a shorter and more elegant way. I was wondering how important the optimization of a proof is relevant when being considered for contribution? or if the proof is completed the job can be considered done?</p>",
        "id": 445961005,
        "sender_full_name": "Pietro Lavino",
        "timestamp": 1718921129
    },
    {
        "content": "<p>The fact that <a href=\"https://bit.ly/3cKk3ld\">#queue</a> has size 200 is plenty of evidence that just completing the proof is a long way from the job being done, when it comes to getting PRs merged into mathlib.</p>",
        "id": 445961210,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1718921231
    },
    {
        "content": "<p>My advice would be to focus on your project first, making sure that you formalize <em>some</em> proof.  The process of contributing to mathlib is, in my opinion, an extra layer of complication that may very well be bigger (and almost certainly) longer than the scope of the summer project.</p>",
        "id": 445961262,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1718921247
    },
    {
        "content": "<p>Don't worry too much about \"elegance\" to begin with. Splitting things up into small lemmas (hopefully \"natural\" ones) goes a very long way to solving this problem.</p>",
        "id": 445969734,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1718925053
    },
    {
        "content": "<p>Let me add: the way I learned a lot about writing more concise or elegant proofs was by submitting pull requests to mathlib and learning from the review feedback. For merging code into mathlib, it should be reasonably concise - but this process can also happen during code review.</p>",
        "id": 446124885,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1718988803
    }
]