[
    {
        "content": "<p>I just tried to update Mathlib in EulerProducts via the ∀ menu and got the error message</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>Cannot read 'lake-manifest.json' file at /home/mstoll/.elan/toolchains/leanprover--lean4---v4.14.0-rc2/src/lean/lake-manifest.json.\n</code></pre></div>\n<p>which is a bit strange, since there is no <code>lake-manifest.json</code> there (so the error is sort of OK, but why was it looking for this file?).</p>\n<p>Updating manually on the command line via <code>lake update mathlib</code> afterwards worked OK.</p>",
        "id": 481319321,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1731074103
    },
    {
        "content": "<p>I assume you had a file from core open and focused when trying to update Mathlib?</p>\n<p>The VS Code extension figures out the project to execute commands in from the tab that is currently active. If you had a tab with a core file open, it will attempt to run the update in core, which obviously doesn't have a <code>lake-manifest.json</code> file.</p>\n<p>Could you create an issue in vscode-lean4 to improve this error message for this kind of common mistake?</p>",
        "id": 481325032,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1731075975
    },
    {
        "content": "<p>The only files I had open were from my project, plus (apparently, without me noticing) the \"Welcome\" tab with the \"Lean 4 Setup\" (no idea where this came from). Could this have a similar effect?</p>",
        "id": 481325576,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1731076133
    },
    {
        "content": "<p>No. If you really had a file from your project open and not one in core, it should attempt to update your project.</p>\n<p>Can you still reproduce this issue reliably?</p>",
        "id": 481326154,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1731076308
    },
    {
        "content": "<p>After having updated manually, I cannot reproduce it now.</p>",
        "id": 481326325,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1731076356
    }
]