[
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/actions/runs/21905714476/job/63245344382?pr=35122\">A recent CI run</a> of <a href=\"https://github.com/leanprover-community/mathlib4/pull/35122\">#35122</a> failed because of a stray <code>#check</code> command: so far, so good. However, the error message is pretty inscrutable... I don't see it explaining the problem at all. (This error happened to a student of mine, who is new to mathlib. Expected them to understand and fix this is... tough.)</p>\n<p>We used to have nice errors for noisy lines: can we get this check back? (Didn't we have a linter for noisy commands, for example?)</p>",
        "id": 573292649,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1770818164
    },
    {
        "content": "<p>There's the hashCommand linter, at least, which should have caught this...I see it checks for <code>warningAsError</code> to be true as a proxy for being in CI? Did CI change which options it takes at some point, perhaps?</p>",
        "id": 573368054,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1770837080
    },
    {
        "content": "<p>If I remember correctly, the hashCommand linter only emits a warning if the command itself does not.  In the case of <code>#check</code>, then hashCommand linter should say nothing, since <code>#check</code> is already being noisy.</p>",
        "id": 573376680,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1770840226
    },
    {
        "content": "<p>Looking at the current logic, it seems to emit a warning if the original command is silent <em>or</em> <code>warningAsError</code> is true, and there are a couple of comments nearby about logging during CI; it seems that warningAsError is being used as a proxy for activating the linter even on noisy commands during CI, but this isn’t explicit… <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 573418767,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1770859597
    },
    {
        "content": "<p>Though, if that is the goal, I wonder if we should instead either be checking an environment variable for being in CI, or checking <code>Elab.inServer</code> (so that behavior is the same in local <code>lake build</code>s, but doesn’t clutter your infoview while editing)</p>",
        "id": 573418965,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1770859753
    }
]