[
    {
        "content": "<p>Using <code>exact?</code> and <code>apply?</code> today was basically hanging my system.  I restarted vscode and watched lean eat up my memory each time I used the above commands and it wouldn't release the memory after either finding an answer or me stopping the search.  I was able to make it climb and eat all 16 GB on my laptop.  To work around this I monitored my memory usage and would restart vscode when it started getting high.  I should preface this with I have <code>set_option maxHeartbeats 10000000</code> set as there was a theorem that needed it.  Additionally, I am on mathlib <code>26b25885bff1060bd207eb45ab1ddf6e534ae6c1</code> and lean <code>leanprover/lean4:v4.2.0-rc1</code></p>",
        "id": 393999936,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1696019497
    },
    {
        "content": "<p>(<span class=\"user-mention\" data-user-id=\"443984\">@Newell Jensen</span> I don't think it's related to the other topic, so I've moved it here)</p>",
        "id": 394000614,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1696019768
    },
    {
        "content": "<p>Are you able to make a <a href=\"https://leanprover-community.github.io/mwe.html\">#mwe</a> to reproduce this?</p>",
        "id": 394000709,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1696019824
    },
    {
        "content": "<p>Let me see.  One of the reasons I was just making a passing comment in the other thread is I have moved on from the issue for the time being and my code has changed but I might be able to get it to start eating the memory again.</p>",
        "id": 394001100,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1696020030
    },
    {
        "content": "<p>It's working great now so I am not sure what was hanging it up before.  I do remember I had about 10 <code>have</code>s in the proof (I tend to do this before golfing the code to make sure I am getting things to work step by step before stitching it back together in a more succinct form).  Oh well.  If I hit it again I will be sure to stop and share an <a href=\"https://leanprover-community.github.io/mwe.html\">#mwe</a> so as to troubleshoot it.</p>",
        "id": 394002860,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1696020925
    },
    {
        "content": "<p>Even just a commit pointing to a reproducible state would be helpful for an issue like this (where a <a href=\"https://leanprover-community.github.io/mwe.html\">#mwe</a> may be too much to ask).</p>",
        "id": 394358427,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1696235319
    }
]