[
    {
        "content": "<p>As discussed in <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/with/505140807\">#mathlib4 &gt; Grammars downstream of Mathlib</a>. Discussion started <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505757306\">here</a>.</p>",
        "id": 505784197,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741995454
    },
    {
        "content": "<p>I think with the very narrow interpretation of \"no deprecation is required here\" this could make sense, but I think mathlib is already fairly willing to waive deprecation requirements with reasonable justification (e.g. \"you deprecated Foo to Bar, I won't make you deprecate the 100 lemmas about Foo if dot notation still works\" or \"this lemma only landed last week and there's a typo in its name\")</p>",
        "id": 505784805,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1741995792
    },
    {
        "content": "<p>I would deprecate 100 lemmas in case 1.</p>",
        "id": 505810292,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1742014862
    },
    {
        "content": "<p>I don't think we did that with the <code>Is*</code> renames</p>",
        "id": 505827896,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1742029730
    },
    {
        "content": "<p>The full story of the <code>TopologicalRing</code> -&gt; <code>IsTopologicalRing</code> rename is that in my machine-generated PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/21472\">#21472</a> which did the renaming, I totally forgot to deprecate anything and no reviewers mentioned this. Then two people independently, on the same day, pointed out to me that bumping their projects was more painful than expected because there was a host of errors instead of warnings, so I spent a couple of hours manually going through the 187 files changed in the renaming PR, and then made <a href=\"https://github.com/leanprover-community/mathlib4/pull/22608/commits/3aa6716e03a4c6f495ba5af6f9e4c7e5e3fd32bb\">this commit</a> which deprecated every result which had been explicitly renamed in the original PR. However it perhaps did not quite do the \"100 lemma\" approach which Yury suggested; to do this would involve not just looking at the changes made by the PR but at all of the 187 changed files, to find everything in the changed namespaces. However my reasoning was that anyone using <code>TopologicalRing</code> would now discover very quickly that it had changed to <code>IsTopologicalRing</code> because of the deprecation warning, and then it would be pretty obvious that if they actually had any <code>open TopologicalRing</code>s in their code then it would be pretty clear that they should be changing them to <code>open IsTopologicalRing</code> anyway. The idea of deprecations is to make it easier for the user to bump; our setup isn't going to change <code>open TopologicalRing</code>to <code>open IsTopologicalRing</code> anyway. In fact mathlib tended not to <code>open TopologicalRing</code> anyway, so in fact perhaps that commit I linked to is a good approximation to what Yury was suggesting.</p>\n<p>Ironically, the commit was then reviewed and I was told that most of the deprecating I'd done was deprecation of instances which is apparently not policy, so i had to make <a href=\"https://github.com/leanprover-community/mathlib4/pull/22608/commits/087b6e08cf08f7d080ca23bdcb2b3906a26a1de8\">this commit</a> undeprecating all the instance names anyway!</p>",
        "id": 505859716,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1742053565
    }
]