[
    {
        "content": "<p>Hello. </p>\n<p>Q: Is there an opinion mathlib-wise on using <code>fun_prop</code> with <code>maxTransitionDepth</code> set to something greater than 1? Grepping for it, it appears to have never been used, so I was wondering if this is because it is considered bad practice or if it just hasn't happened yet.</p>\n<p>Context: I'm using <code>LocallyIntegrable</code> a lot, so I put a bunch of <code>fun_prop</code> attributes on it (as well as <code>IntegrableOn</code> and <code>LocallyIntegrableOn</code>,  all of which currently have none), but most of the time the result I want is a  chain of <code>LocallyIntegrableOn</code> -&gt; <code>IntegrableOn</code> -&gt; <code>Integrable</code> so I need to set the depth to 2. It seems to me that <code>LocallyIntegrableOn</code> lemmas are always going to be used this way more or less anyway.</p>",
        "id": 540197039,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1758190568
    },
    {
        "content": "<p>I don't think that there is anything wrong with increasing <code>maxTransitionDepth</code>. Please experiment with it, and report back your findings!</p>",
        "id": 540202293,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1758192610
    },
    {
        "content": "<p>The decision to set it to one was somewhat arbitrary. The thinking was partially that the theorems are usually transitively closed anyway i.e. if there is <code>IntegrableOn -&gt; LocallyIntegrableOn </code> and <code>Integrable -&gt; IntegrableOn </code> then there is usually <code>Integrable -&gt; LocallyIntegrableOn</code> theorem and the transition depth can be one. </p>\n<p>Keeping the transition depth low also keeps the search space smaller but I haven't done much testing to see if that is really the case.</p>\n<p>So you can do</p>\n<ul>\n<li><code>Integrable -&gt; LocallyIntegrableOn</code></li>\n<li>set <code>maxThransitionDepth</code> to two or larger</li>\n</ul>\n<p>Either should be fine.</p>",
        "id": 540228150,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1758200647
    },
    {
        "content": "<p>Yes I was thinking along the lines that increasing it might cause a terrible slowdown. Adding a relevant lemma (maybe it's already there and only has to be marked too) sounds like a good idea regardless. Thank you</p>",
        "id": 540241364,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1758203926
    }
]