[
    {
        "content": "<p>Recently, there has been a lot of PRs about context-free languages that Mathlib maintainers didn't have time for. Off the top of my head:<br>\n<span class=\"user-mention\" data-user-id=\"762700\">@Alex Loitzl 🐓</span> <br>\n<span class=\"user-mention\" data-user-id=\"767695\">@Tristan Figueroa-Reid</span> <br>\n<span class=\"user-mention\" data-user-id=\"786070\">@Rudy Peterson</span> <br>\n<span class=\"user-mention\" data-user-id=\"741612\">@Stefan Hetzl</span> <br>\n<span class=\"user-mention\" data-user-id=\"759645\">@Tobias Leichtfried</span> </p>\n<p>One of us should start a new repository downstream of Mathlib where we will focus all grammar-related endeavors.<br>\nWho wants to create and maintain it?</p>",
        "id": 505140807,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1741787814
    },
    {
        "content": "<p>Unfortunately, I don't know that much about computability and complexity to be a maintainer.</p>",
        "id": 505197971,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741799587
    },
    {
        "content": "<p>Happy to help in any way I can</p>",
        "id": 505200056,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1741800052
    },
    {
        "content": "<p>But you probably want a repo under leanprover-community?</p>",
        "id": 505200230,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1741800097
    },
    {
        "content": "<p>Also, it might be better to move all of computability and complexity to its own repository.</p>",
        "id": 505212431,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741803051
    },
    {
        "content": "<blockquote>\n<p>there has been a lot of PRs about context-free languages that Mathlib maintainers didn't have time for</p>\n</blockquote>\n<p>A new repository isn't a bad option, but another good option is for people contributing in this area to start reviewing each other's PRs!</p>",
        "id": 505221164,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1741805243
    },
    {
        "content": "<blockquote>\n<p>another good option is for people contributing in this area to start reviewing each other's PRs!</p>\n</blockquote>\n<p>I afaik reviewed all of them but nobody merged them.</p>",
        "id": 505223606,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1741805953
    },
    {
        "content": "<p>My impression is that Mathlib maintainers don't find it sufficient when we review each other PRs. They want to review our PRs themselves and they say they don't have people for that.</p>",
        "id": 505340252,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1741851253
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505340252\">said</a>:</p>\n<blockquote>\n<p>My impression is that Mathlib maintainers don't find it sufficient when we review each other PRs. They want to review our PRs themselves and they say they don't have people for that.</p>\n</blockquote>\n<p>It's a shame that it's quite hard to reach the same level of code quality that the mathlib4 maintainers work at, but I feel like your impression raises some more issues about the state of mathlib4 rather than computability specifically. The other easy (nondichotomous) choice is that mathlib4 lowers the bar for code quality, which doesn't seem like a good idea.</p>",
        "id": 505343748,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741852296
    },
    {
        "content": "<p>The current policy is that a maintainer needs to review everything that goes into mathlib, yeah, but that's certainly easier (though not necessarily <em>easy</em>) if someone else who knows the mathematics has already given a thumbs-up</p>",
        "id": 505344223,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1741852450
    },
    {
        "content": "<p>What makes me sad the most is that <span class=\"user-mention\" data-user-id=\"762700\">@Alex Loitzl 🐓</span> 's result<br>\n<a href=\"https://github.com/AlexLoitzl/pumping_cfg/blob/cc4c1f157919f94c2c4cdbaabf50b60abba2822a/PumpingCfg/Pumping.lean#L319\">https://github.com/AlexLoitzl/pumping_cfg/blob/cc4c1f157919f94c2c4cdbaabf50b60abba2822a/PumpingCfg/Pumping.lean#L319</a><br>\ncannot find its way to Mathlib.</p>\n<p>If it were up to me, I would make all those 5000 or so lines that lead to it private and expose only the final result, then ask Mathlib reviewers to review the final results only, and merge it. Unfortunately, it will not fly with the Mathlib policies.</p>",
        "id": 505349424,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1741853723
    },
    {
        "content": "<p>We should absolutely strive for <code>Language.IsContextFree.pumping</code> being in Mathlib. It is really sad that Mathlib reviewers don't let it pass.</p>",
        "id": 505350106,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1741853916
    },
    {
        "content": "<blockquote>\n<p>If it were up to me, I would make all those 5000 or so lines that lead to it private and expose only the final result, then ask Mathlib reviewers to review the final results only,</p>\n</blockquote>\n<p>5000 lines of unreviewed code in mathlib is a time bomb waiting to blow up in Kim's face when they update mathlib to the next Lean version, or when anyone changes how a tactic works, adds a new simp lemma, etc</p>",
        "id": 505350660,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1741854112
    },
    {
        "content": "<p>I see ~ 600 lines leading up to it... Am I missing some dependency chain?</p>",
        "id": 505350848,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1741854162
    },
    {
        "content": "<p>(which PR are we even talking about here; a thread without a PR link is much less likely to attract reviews)</p>",
        "id": 505350970,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1741854215
    },
    {
        "content": "<p>The original PR that was the cherry on top for this discussion was <a href=\"https://github.com/leanprover-community/mathlib4/pull/21585\">https://github.com/leanprover-community/mathlib4/pull/21585</a>, but the linked repository does not have a full associated PR.</p>",
        "id": 505351315,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741854324
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505350848\">said</a>:</p>\n<blockquote>\n<p>I see ~ 600 lines leading up to it... Am I missing some dependency chain?</p>\n</blockquote>\n<p>Yes, it depends on <a href=\"https://github.com/leanprover-community/mathlib4/pull/19943\">#19943</a> being merged first.</p>",
        "id": 505351644,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1741854414
    },
    {
        "content": "<p>Which might not be totally out of the picture?<br>\nI am hoping to at least wrap up the PR in the coming weeks, when I have some more time. (Whatever the final decision may be)</p>",
        "id": 505352056,
        "sender_full_name": "Alex Loitzl 🐓",
        "timestamp": 1741854537
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505351644\">said</a>:</p>\n<blockquote>\n<p>Yes, it depends on <a href=\"https://github.com/leanprover-community/mathlib4/pull/19943\">#19943</a> being merged first.</p>\n</blockquote>\n<p>Understood. Thanks for the pointer.</p>",
        "id": 505352213,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1741854594
    },
    {
        "content": "<p>I understand that unreviewed code should not go into mathlib in order not to become a burder later on. On the other hand, I have a similar sentiment as <span class=\"user-mention\" data-user-id=\"417654\">@Martin Dvořák</span>  concerning the formalisation of the equivalence between context-free grammars and pushdown automata by my student <span class=\"user-mention\" data-user-id=\"759645\">@Tobias Leichtfried</span> .</p>",
        "id": 505352603,
        "sender_full_name": "Stefan Hetzl",
        "timestamp": 1741854704
    },
    {
        "content": "<p>I am a bit of an outsider to formal maths and ITP, but I think that the policy of having one monolithic block of formal mathematics (as Lean does with mathlib) makes a lot of sense and makes Lean stand apart from most, if not all, other ITPs. I am not sure which vision for the entire field is behind this policy, but when the vision is that, at some point, mathematicians are supposed to submit a paper with partial or full formalisation to journals, then I think there is no way around making this monolithic block as comprehensive as possible. Whether that should be done in one repository or in several ones, and what the maintenance structure should look like is to decide for people who are much more familiar with the technical matters than I am.</p>",
        "id": 505352790,
        "sender_full_name": "Stefan Hetzl",
        "timestamp": 1741854751
    },
    {
        "content": "<p>In any case, to outsiders, the perspective of contributing something that will in the end receive formal approval as part of that monolithic block, whatever this may mean in technical terms, is very attractive and a big part of the motivation for formalising something.</p>",
        "id": 505352865,
        "sender_full_name": "Stefan Hetzl",
        "timestamp": 1741854774
    },
    {
        "content": "<p>To be quite clear, I am happy to review the PRs on computability people send my way, but I am not a maintainer</p>",
        "id": 505358547,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1741856083
    },
    {
        "content": "<p>(and when I do review them, please implement the feedback!)</p>",
        "id": 505358686,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1741856124
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> Thank you! Could you have a look at <a href=\"https://github.com/leanprover-community/mathlib4/pull/22159\">PR #22159</a>? It adds the definition of pushdown automata (which is the first step for the result about the equivalence of context-free grammars and pushdown automata).</p>",
        "id": 505359629,
        "sender_full_name": "Stefan Hetzl",
        "timestamp": 1741856386
    },
    {
        "content": "<p>I think all this grammar stuff is the perfect example of something that should happily live outside of Mathlib, even more that combinatorial game theory.</p>",
        "id": 505364976,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1741857746
    },
    {
        "content": "<p>My point of view is and has been that reviewing this content is useful regardless of whether it ends up in mathlib or a submathlib or something else yet again</p>",
        "id": 505408276,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1741869184
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505364976\">said</a>:</p>\n<blockquote>\n<p>I think all this grammar stuff is the perfect example of something that should happily live outside of Mathlib, even more that combinatorial game theory.</p>\n</blockquote>\n<p>Are there guidelines for how the maintainers decide something like this? I am very happy that matroids didn’t end up on the wrong side of such a judgment call - I would very likely have given up if they had, knowing that everything rots the day I stop paying attention.</p>",
        "id": 505539231,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1741905721
    },
    {
        "content": "<p>We're in a sort of transitional period at the moment, where we would all like to get started on \"child of Mathlib\" repositories, but we don't have a successful example yet to follow.</p>\n<p>To summarize, here's what I have in mind:</p>\n<ul>\n<li>Such a repository would live in the <code>leanprover-community</code> github organization, and would be named <code>mathlib-XXX</code> for some <code>XXX</code>.</li>\n<li>\"Politically\" it could have a separate set of maintainers (e.g. with their own private zulip stream for coordination), although it is very likely that at first this set would overlap with the mathlib maintainers. Further, the \"mathlib admin\" team would have final jurisdiction in the event of a serious problem.</li>\n<li><code>mathlib-XXX</code> repositories would maintain the same technical standards as Mathlib:<ul>\n<li>no <code>sorry</code> on the <code>main</code> branch</li>\n<li>all Mathlib linters (indeed, all of Mathlib CI) run all the time</li>\n<li>note this step requires some engineering work --- it would be a disaster to copy-paste Mathlib's github workflows, as they would rot fast. We need to factor out as much Mathlib CI as possible into Github actions and reusable scripts</li>\n</ul>\n</li>\n<li><code>mathlib-XXX</code> repositories would regularly update to the latest Mathlib --- in particular this requires a commitment from the maintainers to undertake or coordinate this work. They would bump to the latest toolchain monthly, like Mathlib does</li>\n<li>the queueboard should support all these repositories too</li>\n</ul>",
        "id": 505543821,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1741907859
    },
    {
        "content": "<p>Now all this sounds like a lot of work, and I appreciate that currently it is an obstacle to launching such <code>mathlib-XXX</code> repositories! But it's important to remember that all this work already has to happen at Mathlib, and the reason Mathlib is having to throttle growth in some directions is that we're having trouble keeping up with all this.</p>",
        "id": 505543828,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1741907864
    },
    {
        "content": "<p>There is a lot of engineering work to make this work nicely (abstracting common CI components, automation to bump downstream repositories and notify maintainers about problems requiring manual intervention, the queueboard, automated assistance for identifying and moving material upstream)... Some of this will be done by the enthusiastic volunteers who've made all the CI and automation around Mathlib possible, some will be done by FRO employees, and we are working really hard to source money for paid engineering time on these problems.</p>",
        "id": 505543832,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1741907868
    },
    {
        "content": "<p>I think there are already great initial steps. Projects like Carleson and FLT are helping build the infrastructure, but these are <em>not</em> <code>mathlib-XXX</code> projects --- you can tell that because they have <code>sorry</code> on their <code>main</code> branch. Likely candidates for <code>mathlib-XXX</code> projects are Yael and Bhavik's additive combinatorics project, the nascent combinatorial game theory project, and the whole languages/grammars/automata project.</p>",
        "id": 505543840,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1741907873
    },
    {
        "content": "<p>But it's really important that the people running these projects understand what they are signing up to --- it's really not possible to run a durable project where you allow in \"5000 lines of private code\", because the maintainers are signing up to managing this forever, as Lean changes, and as Mathlib changes. Obviously a <em>huge</em> fraction of the maintenance work does not actually fall on the maintainers because other contributors do so much, but they have to be ready to backstop this work, and to set standards so it is possible. Hopefully this gives some context for while Mathlib has been having to throttle expansion into new areas. It is a massive commitment to take in new code!</p>",
        "id": 505543844,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1741907873
    },
    {
        "content": "<p>I am hoping to have successfully separated add-combi from LeanAPAP and set CI up for it within the next few months. As Kim says, this is a lot of work!</p>",
        "id": 505554333,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1741913223
    },
    {
        "content": "<p>For context, I am currently managing 11 Lean projects of various sizes and forms, and it is a HUGE pain that workflows aren't uniformised. I have a strong incentive to improve on the status quo</p>",
        "id": 505554545,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1741913391
    },
    {
        "content": "<p>Also:</p>\n<ul>\n<li><code>mathlib-XXX</code> should be included in the online API documentation for mathlib, so people can search and browse the API for all the repositories together.</li>\n<li><code>mathlib-XXX</code> should update frequently (say daily or more frequently) to the <em>same</em> mathlib version so that an external project can use multiple <code>mathlib-XXX</code> repositories. Each one updating daily to a slightly different mathlib version from that day would be a lot less helpful to external users.</li>\n</ul>",
        "id": 505554597,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1741913409
    },
    {
        "content": "<p>(Slight caveat on the frequent updating: if there's one common mathlib version each day that gets a matching commit in every <code>mathlib-XXX</code>, it should be OK for some <code>mathlib-XXX</code> to have <em>additional</em> updates during the day - in particular, if a lemma of use to that <code>mathlib-XXX</code> has just been merged to the main mathlib4 repository and people want to put something depending on that lemma in that <code>mathlib-XXX</code> repository immediately without waiting for the next nightly update. That might need extra smarts in <code>lake update</code> to be able to automatically pick compatible versions of all <code>mathlib-XXX</code> dependencies, however.)</p>",
        "id": 505555439,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1741913887
    },
    {
        "content": "<p>I think that having a separate repository is a good idea, but I am not in favor of having a bunch of different repositories over different accounts/a bunch of repositories under mathlib4. From the limited experience I have in this community, it seems that what these projects are looking for is a place to store lower quality code that isn't exactly to par with mathlib4 but still at least uses reasonable names, can afford minor breaking changes, publishes to lake automatically, and other conveniences.</p>\n<p>It doesn't seem too wise to have a bunch of duplicated infrastructure spread about potentially dozens of separate repositories (as we would have to develop another separate piece of infrastructure to roll out these changes) when this code could be kept in mathlib4, or (and perhaps a better idea), some kind of mathlib4-extras, where both core mathlib4 maintainers and maintainers that don't have the code quality standards of mathlib4 (but still have a good understanding of what is 'good' code) can build projects that aren't as crucial to the building blocks of commonly-used mathematics.</p>\n<p>The main motivation I see for a mathlib4-extras is to still establish a good form of community between these projects: for example, one of combinatorial game theory's few applications is in its numerous algorithms that can be classified into various complexity classes, so a well-developed complexity library might become a dependency of combinatorial game theory: it is much harder to collaborate if they are across different repositories (as a case study, even mathlib4 takes a while to upstream certain theorems to batteries)</p>",
        "id": 505561026,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741916991
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"767695\">@Tristan Figueroa-Reid</span>, I disagree with a few things above.</p>\n<p>Anyone looking for a place to store lower quality code should work outside of <code>mathlib-XXX</code> until such a time as they are ready to contribute to the \"durable\" ecosystem (or to blueprint projects). What I'm proposing is not for that. (So in particular if the contributors to a candidate <code>mathlib-XXX</code> <em>do</em> want a place to store lower quality code, it would be good to know that so we find a better solution for them.) Lower quality code is simply a maintenance impossibility, and I don't think the mathlib ecosystem should take that trade-off at all.</p>\n<p>The point is that it is no longer viable to put <em>everything</em> in mathlib, because there is only so much that the maintainer group can take responsibility for, and simply \"adding more maintainers\" becomes impossible after some point. We need a more distributed system to enable growth.</p>\n<p>But you're absolutely right that it's not wise to duplicate infrastructure --- this is why we want to refactor Mathlib CI into reusable components, so hopefully setting up all the CI for a <code>mathlib-XXX</code> is a matter of turning on a few Github actions (which will update automatically as the CI evolves). I think we'll have some Lean FRO employee time to help with this next quarter, and as Yael says above, they and others are keen to work on this too!</p>",
        "id": 505584206,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1741928056
    },
    {
        "content": "<p>(That was on me for the wording, but I do not mean lower quality as something impossible to maintain - perhaps a better upper example would be the lowered standard of code quality that is given to IMO formalizations, where proofs are allowed to be denser than usual)</p>\n<p>The motivation above completely makes sense to keep these out of <code>mathlib4</code>, though I am struggling to see any benefit for the <code>mathlib-xxx</code> repositories being all separate when they will all be owned by the same <code>leanprover-community</code> organization anyways.</p>",
        "id": 505584998,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741928439
    },
    {
        "content": "<p>(e.g. DefinitelyTyped, a 3m sLoC monorepo with dozens of large projects and thousands of smaller projects manages to have similar code quality across the board, and doesn't need to deal with syncing up infra across different repositories). While <code>mathlib4</code> and the <code>mathlib-xxx</code> might have different levels of code quality, I doubt that it would be desirable that the <code>mathlib-xxx</code> repositories have varying levels of code quality *when compared against each other, so it seems better for them to be combined into some <code>extras</code> repository.</p>",
        "id": 505585634,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741928674
    },
    {
        "content": "<p>Generally, I do see the motivation for this if mathlib-xxx repositories were owned by other users. I agree that this infrastructure should be developed for external Lean projects that aren't in <code>leanprover-community</code>. However, I suspect that the move of projects that are too hard to maintain in <code>mathlib4</code> and fragmenting them to <code>mathlib4-xxx</code> repositories anticipates the limits of monorepos, when there are (albeit enterprise) open source projects like gecko or blink that surpass +50m sLoC, or non-enterprise repositories with hundreds of maintainers like nixpkgs.</p>",
        "id": 505588630,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741930229
    },
    {
        "content": "<p>Those are good observations. We definitely need to explore ways in which the ecosystem can become more distributed. One thing I'm a bit worried about is if we have <code>mathlib4-xyz</code> and <code>mathlib4-abc</code>, and they both have some more advanced theory that wants to import more basic files from the other.</p>",
        "id": 505599977,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1741935704
    },
    {
        "content": "<p>Also, I guess we'll want reverse CI (testing mathlib PRs against mathlib-***)</p>",
        "id": 505611593,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1741940507
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505611593\">said</a>:</p>\n<blockquote>\n<p>Also, I guess we'll want reverse CI (testing mathlib PRs against mathlib-***)</p>\n</blockquote>\n<p>We shouldn't need to do this as long as the <code>mathlib-***</code> repo(s) are not doing anything blatantly against the style guide like using non-terminal simps.</p>",
        "id": 505611983,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741940628
    },
    {
        "content": "<p>In my experience bumping downstream repositories, that's overly optimistic</p>",
        "id": 505612429,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1741940771
    },
    {
        "content": "<p>(Thanks for that notice! I don't have much experience with downstream repositories as I am a new contributor, but I have seen that complaint in Zulip quite a few times)</p>\n<p>My original thinking was that the repositories <code>mathlib4</code>, <code>batteries</code>, and a <code>mathlib4-extras</code> that covers all of our potential <code>mathlib4-xxx</code> repos would be a good balance of maintainability and infrastructure deduplication. I think that having \"reverse CI\" under that system is do-able, but I am worried about the magnitude at which there will be PRs where:</p>\n<ul>\n<li>Author makes a PR to mathlib4 and the \"reverse CI\" fails.</li>\n<li>The author makes a temporary patch for the mathlib4 PR to make the reverse CI work, and this PR gets merged</li>\n<li>A PR is merged to mathlib4-extras (this would get worse if we had various mathlib-xxx repositories) that fixes what was blocking the original mathlib4 PR</li>\n<li>A new mathlib4 PR gets made that finally does the <em>intended</em> behavior.</li>\n</ul>\n<p>Without the CI this would only get worse, where we would have randomly failing builds if mathlib-xxx automatically updates, but with it, I could easily imagine this annoying cycle of PRs.</p>",
        "id": 505614214,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741941331
    },
    {
        "content": "<p>This is a good reason to have the potential <code>mathlib4-xxx</code> repositories in <code>mathlib4</code>, but that would require some adjoint maintainer system where the current list of maintainers maintains <code>Mathlib</code> and we have a secondary list of maintainers that maintain the extra side projects in some other subfolder.</p>",
        "id": 505614751,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741941515
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505599977\">said</a>:</p>\n<blockquote>\n<p>Those are good observations. We definitely need to explore ways in which the ecosystem can become more distributed. One thing I'm a bit worried about is if we have <code>mathlib4-xyz</code> and <code>mathlib4-abc</code>, and they both have some more advanced theory that wants to import more basic files from the other.</p>\n</blockquote>\n<p>In metamath this situation also arises (because there is a central portion and then \"mathboxes\" managed by individuals), and the solution is quite simple: if something is needed by more than one mathbox, it needs to be upstreamed to the central portion, here mathlib. The fact that there is this cross cutting requirement is exactly the justification one needs (generally) to upstream something to mathlib.</p>",
        "id": 505623897,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1741944298
    },
    {
        "content": "<p>Indeed. (I believe) The main suggestion here is to have extended mathlib modules where they can be maintained by other people who don't fit the requirements to be a core mathlib4 maintainer. The other 'fix' is to relax the maintainer requirements / the bar for code quality, but this core idea is to hit a balance between code quality and maintainability, where the core mathlib4 can have its high code quality, while the extended mathlib4 modules have high enough quality code to be depended on, but not high that it excludes potential maintainers.</p>",
        "id": 505624857,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741944568
    },
    {
        "content": "<p>The increasing number of PRs and the variety of fields with not enough qualified maintainers was what drove the idea to have these extra mathlib modules. The other main question is where to put this: after Ruben's comment, I'm leaning to having these mathlib4 extensions be subfolders in the mathlib4 repository, but outside of Mathlib/ (like Archive/). Though, it seems reasonable to have a single repository for this too. I did explain this earlier, but I should clarify that I am in opposition of having several leanprover-community/mathlib-xxx repositories and at the very least, I want these mathlib4 extensions in one repo.</p>",
        "id": 505625614,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741944779
    },
    {
        "content": "<p>I guess an alternative solution would be to keep everything inside the mathlib repo, and assign \"module maintainers\" who can review changes that stay within  particular modules</p>",
        "id": 505627675,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1741945415
    },
    {
        "content": "<p>It would be nice if these non-core modules were separate libraries on reservoir, though. I am in favor of keeping it inside the mathlib repo but I do see motivation for them to be separately published libraries at least.</p>",
        "id": 505631052,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741946388
    },
    {
        "content": "<p>Can I elaborate on what that motivation is? Why does the granularity on reservoir matter?</p>",
        "id": 505633749,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1741947121
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505633749\">said</a>:</p>\n<blockquote>\n<p>Can I elaborate on what that motivation is? Why does the granularity on reservoir matter?</p>\n</blockquote>\n<p>Granular cache I guess (assuming caches exist for all reservoir packages in the future).</p>",
        "id": 505668776,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1741957236
    },
    {
        "content": "<p>For now cache is granular per file anyway</p>",
        "id": 505719645,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1741970239
    },
    {
        "content": "<p>Just the tools to download things at that granularity need some work</p>",
        "id": 505719682,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1741970251
    },
    {
        "content": "<p>I was originally thinking of doing that separate reservoir packaging to establish a clear boundary between Mathlib and these mathlib extras, but we absolutely could just have, as Ruben suggested:</p>\n<ul>\n<li>The current core maintainers that can review and merge any PR</li>\n<li>Code owners for certain modules, perhaps with notices that these modules are allowed to be merged by X person/people.</li>\n</ul>",
        "id": 505738239,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741975403
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505599977\">said</a>:</p>\n<blockquote>\n<p>Those are good observations. We definitely need to explore ways in which the ecosystem can become more distributed. One thing I'm a bit worried about is if we have <code>mathlib4-xyz</code> and <code>mathlib4-abc</code>, and they both have some more advanced theory that wants to import more basic files from the other.</p>\n</blockquote>\n<p>I think that it is good to have supporting infrastructure for external projects outside of leanprover-community, but <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> did put up a good point that when code needs to be shared, the best place that should go in some kind of <code>mathlib</code>.</p>\n<p>For example, in <a href=\"https://github.com/vihdzp/combinatorial-games/\">vihdzp/combinatorial-games</a>, there is currently a transfer of ownership of <code>NatOrdinal</code> from <code>mathlib4</code> to <code>combinatorial-games</code>, since, even though <code>NatOrdinal</code> does have <a href=\"https://github.com/leanprover-community/mathlib4/pull/16391\">other uses</a>, it is most closely related to combinatorial games. (to clarify, I am not against this move, but I wanted to bring it up for this point) - without adding more core maintainers than necessary, it seems that it would be a lot easier for core maintainers to review <code>NatOrdinal</code> changes if they saw the exact motivation in combinatorial game theory.</p>\n<p>With the dependent PR system, this is made a lot easier, too:</p>\n<p>For some mathlib module <code>X</code> that isn't covered by a primary maintainer of mathlib itself, a potential contributor to <code>X</code> can make some PR to mathlib, and make a new PR contributing to <code>X</code> that depends on the previous PR. A core maintainer can review the first PR, and a maintainer of <code>X</code> can review the second PR. This workflow is much easier to accomplish within a single repository.</p>",
        "id": 505749637,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741979476
    },
    {
        "content": "<p>It seems like a good idea to at least try this code ownership system:  it seems a lot easier than trying to make the infrastructure for a polyrepo, and we're already seeing the conflicts of code ownership in a repository that isn't even in <code>leanprover-community</code> yet.</p>",
        "id": 505749750,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741979518
    },
    {
        "content": "<p>What do you mean by \"code ownership\" precisely? We previously tried github's CODEOWNER file, and it was not so good</p>",
        "id": 505749930,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1741979574
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505749930\">said</a>:</p>\n<blockquote>\n<p>What do you mean by \"code ownership\" precisely? We previously tried github's CODEOWNER file, and it was not so good</p>\n</blockquote>\n<p>Better infrastructure would be needed for that than GitHub's (unfortunately weak) code owner system. I don't have a good example of a system that works well for this, as I am only aware of the other end of the contributor spectrum, where there are thousands of modules, each with its own set of maintainers.</p>",
        "id": 505750202,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741979669
    },
    {
        "content": "<p>We do have our own fork of bors now, so we could experiment with it</p>",
        "id": 505750664,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1741979839
    },
    {
        "content": "<p>I've always wanted to, but at the time I was messing with it cache was on fire so I had other things to do</p>",
        "id": 505750764,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1741979879
    },
    {
        "content": "<p>it's also kind of annoying to work with because there is a bunch of heroku stuff involved in deploying it</p>",
        "id": 505750951,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1741979946
    },
    {
        "content": "<p>you can run it locally though, it's an elixir program</p>",
        "id": 505751015,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1741979978
    },
    {
        "content": "<p>A simple system would be that:</p>\n<ul>\n<li>\n<p>The core 20-ish maintainers still have the same permissions as they have.<br>\nWe have a file that contains metadata about which non-core maintainers can merge PRs targeting specific folders. These folders will only be in this list if no core maintainer is willing to maintain them (complexity, combinatorial game theory, etc.). If a folder isn't in that list, that implies that it's maintained by said core maintainers.</p>\n</li>\n<li>\n<p>Those non-core maintainers can then merge those targeted PRs.</p>\n</li>\n</ul>",
        "id": 505751244,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741980065
    },
    {
        "content": "<p>I think this would work quite well with the dependent PRs system, and it still preserves the benefits of a monorepo (codebase-wide golfing, shared infra, etc...)</p>",
        "id": 505751422,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741980125
    },
    {
        "content": "<p>I would not have the \"only if no core maintainer is willing\" clause, I think we can just have topic maintainers in addition to core maintainers</p>",
        "id": 505751468,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1741980147
    },
    {
        "content": "<p>and topic maintainers would only have permission to merge to certain files/folders</p>",
        "id": 505751515,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1741980176
    },
    {
        "content": "<p>My own two cents, I do prefer having separate repositories. Mathlib is huge, and even downloading the cache takes me a couple of minutes. In that same time, I can build the entire CGT repo on my machine.</p>",
        "id": 505754010,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1741981153
    },
    {
        "content": "<p>I argue that this is an issue with cache (or rather, lake), but fixing it never seems to make it to the top of the issue list</p>",
        "id": 505754241,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1741981219
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505754010\">said</a>:</p>\n<blockquote>\n<p>My own two cents, I do prefer having separate repositories. Mathlib is huge, and even downloading the cache takes me a couple of minutes. In that same time, I can build the entire CGT repo on my machine.</p>\n</blockquote>\n<p>The main argument here is to try to get the best of both worlds, where there are modules where non-core contributors can merge pull requests instead of having to wait on core maintainers to do so.</p>",
        "id": 505754287,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741981239
    },
    {
        "content": "<p>The original suggestion was to have a polyrepo of <code>mathlib-xxx</code> (e.g. <code>mathlib-cgt</code>), but it was suggested earlier that it would be easier to have some code ownership system inside <code>Mathlib</code> where a similar process could take place. The only place where this would cause a slowdown in development is when certain theorems need to be upstreamed to *parts of <code>Mathlib</code> maintained by core maintainers, but I think that if core maintainers need to worry about less PRs, that issue should resolve itself.</p>",
        "id": 505754655,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741981333
    },
    {
        "content": "<p>Perhaps tangentially, I feel that whenever I try and downstream results to Mathlib I often get met with some sort of pushback, usually in the form of \"this is unnecessary\". I had this happen recently with <a href=\"https://github.com/leanprover-community/mathlib4/pull/22617\">#22617</a>, where two small auxiliary lemmas that have been convenient to me in the CGT repo got struck down because you could replicate them with a somewhat unintuitive use of <code>mt</code>.</p>",
        "id": 505754910,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1741981434
    },
    {
        "content": "<p>That is even more reason to keep this in <code>Mathlib</code>! I'm unopinionated about the PR you linked, but for PRs like that, it would motivate the contributors to merge if they saw another PR that was clearly beneficial while depending on the original PR.</p>",
        "id": 505755470,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741981658
    },
    {
        "content": "<p>For example, changes to <code>NatOrdinal</code> seem quite strange out of the context of combinatorial game theory, but having two PRs: one that makes changes to <code>NatOrdinal</code>, and one that uses those changes to golf / prove new parts of combinatorial game theory gives much more motivation for a maintainer to believe that your changes are useful.</p>",
        "id": 505755617,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741981728
    },
    {
        "content": "<p>Plus, the early conflict helps! I doubt this would be the case for many parts of combinatorial game theory, but if a file from CGT or any other <code>mathlib-xxx</code> project were to be added to mathlib4, it would make more sense to have those conflicts earlier on than when the files are eventually moved.</p>",
        "id": 505755725,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741981790
    },
    {
        "content": "<p>I'm not sure if much would change from the current status quo? It's not like I haven't explained \"this PR is used within CGT because of this\", and I'm not confident that having CGT as an enshrined part of Mathlib would change the considerations of other maintainers.</p>",
        "id": 505756690,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1741982208
    },
    {
        "content": "<p>What I'm trying to get at is, the nice thing about having separate repos is that we can parallelize using new material in the new repo, and slowly porting/adapting that material for Mathlib.</p>",
        "id": 505756841,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1741982281
    },
    {
        "content": "<p>I think <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=IncompRel#doc\">docs#IncompRel</a> is a good example of this. It's nominally useful for more than just game theory, but it took months to be approved (<a href=\"https://github.com/leanprover-community/mathlib4/pull/19580\">#19580</a>) because of discussions about notation and whether we should also have the comparability relation as well. And that was one of the blockers for doing the <code>IGame</code> refactor within Mathlib.</p>",
        "id": 505757306,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1741982447
    },
    {
        "content": "<p>I do see the argument (though again, as established earlier, a monorepo would be technically better than a polyrepo while doing the same thing), but in terms of keeping everything in <code>Mathlib</code> itself, perhaps it might be a good idea to have some kind of experimental staging for definitions? i.e. some libraries like Node.JS use \"experimental methods\" that have debated on syntax, yet are still in the main deployment of the software, and can afford breaking changes.</p>",
        "id": 505758974,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741983133
    },
    {
        "content": "<p>I think that's potentially a separate issue? Like, we did do some major refactors on the CGT repo which were long overdue on Mathlib, but at this point it should be a stable-ish codebase.</p>",
        "id": 505761707,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1741984207
    },
    {
        "content": "<p>(Note that I do mean this for repositories that aren't just combinatorial game theory, but I can also see this happening again even in CGT) - since this happened in CGT, it's quite likely that these sorts of refactors and blocking definitions will be needed for other parts of mathlib4.</p>",
        "id": 505764023,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741985115
    },
    {
        "content": "<p>We do already have long-stretching Mathlib refactors, even ones that don't happen at the level of leaf files.</p>",
        "id": 505764341,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1741985267
    },
    {
        "content": "<p>IMO if we want to uphold the deprecation policy, what we already currently do, slowly phasing out definitions by others and adding the required deprecation tags, is about as good as can get. Experimental staging would be a big red tape essentially prohibiting downstream usage of these files.</p>",
        "id": 505764553,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1741985358
    },
    {
        "content": "<p>And if we're not willing to uphold the deprecation policy for these Mathlib side projects then it's even more difficult to justify that they're being held at Mathlib standards...</p>",
        "id": 505764631,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1741985396
    },
    {
        "content": "<p>(if we just want to test things out, there's always the tried and true \"make a branch for it\")</p>",
        "id": 505764966,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1741985524
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505764631\">said</a>:</p>\n<blockquote>\n<p>And if we're not willing to uphold the deprecation policy for these Mathlib side projects then it's even more difficult to justify that they're being held at Mathlib standards...</p>\n</blockquote>\n<p>(Note that they won't be held directly at Mathlib standards, but still with some standards: the general idea is to have a monorepo where these projects can exist at a slightly lower code quality)</p>\n<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505764966\">said</a>:</p>\n<blockquote>\n<p>(if we just want to test things out, there's always the tried and true \"make a branch for it\")</p>\n</blockquote>\n<p>Would this work for the case above with <code>IncompRel</code>, where the notation was being bikeshedded?</p>",
        "id": 505765305,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741985668
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"767695\">Tristan Figueroa-Reid</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505765305\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505764631\">said</a>:</p>\n<blockquote>\n<p>And if we're not willing to uphold the deprecation policy for these Mathlib side projects then it's even more difficult to justify that they're being held at Mathlib standards...</p>\n</blockquote>\n<p>(Note that they won't be held directly at Mathlib standards, but still with some standards: the general idea is to have a monorepo where these projects can exist at a slightly lower code quality)</p>\n<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505764966\">said</a>:</p>\n<blockquote>\n<p>(if we just want to test things out, there's always the tried and true \"make a branch for it\")</p>\n</blockquote>\n<p>Would this work for the case above with <code>IncompRel</code>, where the notation was being bikeshedded?</p>\n</blockquote>\n<p>You do have a point, experimental staging on that file would allow us to get work on games done more quickly...</p>",
        "id": 505766750,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1741986271
    },
    {
        "content": "<p>I guess I'm simply skeptical due to the usual \"we've never needed this before\" argument</p>",
        "id": 505768981,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1741987233
    },
    {
        "content": "<p>That makes sense. I suppose so far the suggestions are:</p>\n<ul>\n<li>We move the repositories that were recently removed from Mathlib back into Mathlib</li>\n<li>We experiment with a codeowner-like system, where we have non-core maintainers that are able to merge PRs that target only specific files and folders: it is okay if these files and folders aren't perfect.</li>\n<li>We experiment with tagging definitions as experimental, where bikeshedding can happen when they are stabilized.</li>\n</ul>",
        "id": 505773131,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741989435
    },
    {
        "content": "<p>An intermediate solution might be to have some staging branches from which mathlib maintainers can slowly draw material into the main branch</p>",
        "id": 505784008,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1741995313
    },
    {
        "content": "<p>In my experience, staging branches don't work quite well since they don't play to git's strengths (quite the opposite, actually). Since we already have attributes, it doesn't seem too unreasonable to have experimental attributes. Though, this \"experimental feature\" topic should probably be a different thread.</p>",
        "id": 505784134,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741995398
    },
    {
        "content": "<p>(<a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Experimental.20Attribute/with/505784197\">#mathlib4 &gt; Experimental Attribute</a>)</p>",
        "id": 505784225,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741995474
    },
    {
        "content": "<p>For the sake of this thread, then, I think it seems like a good idea to experiment with modifying bors such that we can have a fine-grained code ownership system and see how well that works with our \"sub-maintainers.\" I believe the (absolutely non-exhaustive: I'm not aware of the state of the other proposed <code>mathlib-xxx</code> projects) people that would be on that list is <span class=\"user-mention\" data-user-id=\"459227\">@Violeta Hernández</span> for combinatorial game theory, and <span class=\"user-mention\" data-user-id=\"417654\">@Martin Dvořák</span> for computability and complexity?</p>",
        "id": 505784399,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741995575
    },
    {
        "content": "<p>I think complexity should be kept separate from computability</p>",
        "id": 505788727,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1741998298
    },
    {
        "content": "<p>Good point! I forgot about that. The original issue was that we didn't have enough domain experts on _computability_ (regarding CFGs, right?) in the core maintainer team. In this case, maybe <code>./Complexity</code> wouldn't have a code owner, but files in <code>Complexity</code> related to <code>Computability</code> can have Martin Dvořák [meta: how do you ping people silently on zulip?] as a code owner.</p>",
        "id": 505788922,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741998421
    },
    {
        "content": "<p>That being said, since we have almost no complexity theory (in any textbook sense at least), any discussion of complexity is moot for now. Also complexity is such a gigantic and broad area that I think it should first develop in its own repository with members from that community taking the lead.</p>",
        "id": 505789496,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1741998763
    },
    {
        "content": "<p>A big point in this discussion is enabling the same fluidity that people working in their own repositories and putting a (restricted portion) of that freedom inside Mathlib.</p>",
        "id": 505789730,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741998956
    },
    {
        "content": "<blockquote>\n<p>[meta: how do you ping people silently on zulip]</p>\n</blockquote>\n<p>Like this: <span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <code>@_**Martin Dvořák**</code></p>",
        "id": 505789860,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1741999040
    },
    {
        "content": "<p>(Also, while I am painfully aware about the magnitude of tcs complexity theory as a field, some fields are being formalized in mathlib4 that are bigger than complexity, and they can be built just as well inside Mathlib.)</p>",
        "id": 505789863,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1741999043
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"767695\">Tristan Figueroa-Reid</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505789730\">said</a>:</p>\n<blockquote>\n<p>A big point in this discussion is enabling the same fluidity that people working in their own repositories and putting a (restricted portion) of that freedom inside Mathlib.</p>\n</blockquote>\n<p>It might be that these are inherently opposite goals. Mathlib tries to have a solid foundation, whereas one usually wants to test out different ideas at the onset of a large project.</p>",
        "id": 505793634,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1742001733
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505793634\">said</a>:</p>\n<blockquote>\n<p>It might be that these are inherently opposite goals. Mathlib tries to have a solid foundation, whereas one usually wants to test out different ideas at the onset of a large project.</p>\n</blockquote>\n<p>Indeed! The original idea was to have parts of Mathlib that had slightly less code quality than the rest: they would still be \"part of mathlib,\" but would be marked as maintained by certain non-core maintainers.</p>",
        "id": 505799377,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742005778
    },
    {
        "content": "<p>Much depends on what you mean by \"less code quality\". Are we talking about not working in the right generality or missing API lemmas, or not following code style or naming conventions, or not following the rules to make proofs maximally robust against upstream changes?</p>",
        "id": 505818914,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1742022239
    },
    {
        "content": "<p>The inherent problem is that this highly depends on the individual non-core maintainer. I am not strictly sure what \"less code quality\" would entail myself. My best frame of reference is in <a href=\"https://github.com/vihdzp/combinatorial-games/tree/master/CombinatorialGames\">combinatorial-games</a>, which does not sparingly use <code>aesop</code>. However, due to my inexperience, I am unaware of any underlying style issues beyond that.</p>\n<p>(I should re-establish, in my intent to discourage the use of a polyrepo, that I am mainly discussing whether it's a good idea to keep all of the mathlib-extra projects inside Mathlib or outside of it, whether that be a single external repository or some subfolder in <code>mathlib4</code> like <code>Archive</code> - <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505588630\">there are no technical reasons *that I am aware of as to why we should split each mathlib-extras project into its own repository.</a>)</p>",
        "id": 505819435,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742022689
    },
    {
        "content": "<p>Here is one such technical reason: If something breaks in a submathlib during a mathlib refactor, then the mathlib contributor will have to fix the submathlib, regardless of the code quality of the latter</p>",
        "id": 505822127,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1742025108
    },
    {
        "content": "<p>This is because all projects in a single repo share their lakefile, and therefore must be on the same version of everything (and in particular of each other)</p>",
        "id": 505822208,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1742025158
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505822127\">said</a>:</p>\n<blockquote>\n<p>Here is one such technical reason: If something breaks in a submathlib during a mathlib refactor, then the mathlib contributor will have to fix the submathlib, regardless of the code quality of the latter</p>\n</blockquote>\n<p>This is a genuine concern of mine by the way, not a theoretical one. I expect that what will happen in such a (rather common) situation is that:</p>\n<ul>\n<li>the mathlib contributor starts a refactor</li>\n<li>the bad quality code breaks, so they can't finish the refactor</li>\n<li>they instead must first clean the bad quality code up</li>\n</ul>",
        "id": 505822386,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1742025333
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505822208\">said</a>:</p>\n<blockquote>\n<p>This is because all projects in a single repo share their lakefile, and therefore must be on the same version of everything (and in particular of each other)</p>\n</blockquote>\n<p>(I suppose this is more of an argument against having these mathlib modules outside of Mathlib4, but I can't see why that would specifically justify a polyrepo)</p>",
        "id": 505822398,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742025347
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505822208\">said</a>:</p>\n<blockquote>\n<p>This is because all projects in a single repo share their lakefile, and therefore must be on the same version of everything (and in particular of each other)</p>\n</blockquote>\n<p>Have you read <span aria-label=\"wait one second\" class=\"emoji emoji-261d\" role=\"img\" title=\"wait one second\">:wait_one_second:</span> ?</p>",
        "id": 505822477,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1742025388
    },
    {
        "content": "<p>I have <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span>, though I did doubt it - are lakefiles really tied to git repositories directly? I was unaware of that.</p>",
        "id": 505822510,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742025422
    },
    {
        "content": "<p>Technically, you <em>can</em> have lakefiles in subfolders. I am not sure of the implications with respect to git</p>",
        "id": 505822596,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1742025484
    },
    {
        "content": "<p>In the current setup, what happens is</p>\n<ul>\n<li>the mathlib contributor starts a refactor</li>\n<li>the bad quality code doesn't break, because it still uses an older version of mathlib</li>\n<li>the refactor gets merged</li>\n<li>when the bad quality code is updated to post the refactor, the submathlib contributors have to fix their bad quality code</li>\n</ul>",
        "id": 505822665,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1742025554
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505822386\">said</a>:</p>\n<blockquote>\n<p>This is a genuine concern of mine by the way, not a theoretical one. I expect that what will happen in such a (rather common) situation is that:</p>\n<ul>\n<li>the mathlib contributor starts a refactor</li>\n<li>the bad quality code breaks, so they can't finish the refactor</li>\n<li>they instead must first clean the bad quality code up</li>\n</ul>\n</blockquote>\n<p>I do think that it is a reasonable assumption to say that the code won't be of horrible quality - there are plenty of people in the mathlib community that have been here for a few years and can absolutely recognize immediate red flags with bad style like odd instances, non-terminal simps, etc...</p>\n<p>It wouldn't be a horrible idea, though, to go back through some of the mathlib4 PRs that weren't made by the current mathlib4 maintainers and seeing how many reviews were targeted towards these kinds of bad styles that weren't about naming / formatting.</p>",
        "id": 505822754,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742025610
    },
    {
        "content": "<p>I am not one such person (as I am still not fully aware of all of the best practices of mathlib4), but in this thread alone, there were about three or four such people that aren't mathlib4 maintainers but are absolutely aware of how to make good-style PRs.</p>",
        "id": 505822942,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742025755
    },
    {
        "content": "<p>As a pretty active mathlib reviewer, I can tell you that a lot of pull requests contain code that if it were to break during a refactor of mine I would feel uncomfortable working around, and instead would first clean up.</p>",
        "id": 505822986,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1742025801
    },
    {
        "content": "<p>(Just to clarify, are you saying that it's quite common [at least for you] to worry about how your potential refactors affect open pull requests?)</p>",
        "id": 505826901,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742028992
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505822127\">said</a>:</p>\n<blockquote>\n<p>Here is one such technical reason: If something breaks in a submathlib during a mathlib refactor, then the mathlib contributor will have to fix the submathlib, regardless of the code quality of the latter</p>\n</blockquote>\n<p>I don’t think this is meant to work like this. Otherwise there is no point having separate repositories. “Submathlib” maintainers will have to fix the code, not Mathlib maintainers.</p>",
        "id": 505831840,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1742032759
    },
    {
        "content": "<p>Yes, Patrick, that is exactly my point</p>",
        "id": 505834569,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1742034817
    },
    {
        "content": "<p>I probably read too quickly, sorry.</p>",
        "id": 505837824,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1742037502
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"767695\">Tristan Figueroa-Reid</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505819435\">said</a>:</p>\n<blockquote>\n<p>My best frame of reference is in <a href=\"https://github.com/vihdzp/combinatorial-games/tree/master/CombinatorialGames\">combinatorial-games</a>, which does not sparingly use <code>aesop</code>. </p>\n</blockquote>\n<p>That's Mathlib guidance? I wasn't aware of it! </p>\n<p>To be fair, it would be very painful and probably undesirable to get rid of a lot of these usages, as they take place within very deep structural inductive proofs.</p>",
        "id": 505894413,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1742080231
    },
    {
        "content": "<p>I've never heard any guidance against <code>aesop</code>.</p>\n<p>If an <code>aesop</code> proof takes a long time to compute, it might be worth using <code>aesop?</code> to eliminate and optimize it, for sake of compile times. Or, if a goal is really delicate in some way, where small changes might make <code>aesop</code> succeed or fail, I might be wary of using it, but these are all I can think of.</p>",
        "id": 505895278,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1742080961
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505822665\">said</a>:</p>\n<blockquote>\n<p>In the current setup, what happens is</p>\n<ul>\n<li>the mathlib contributor starts a refactor</li>\n<li>the bad quality code doesn't break, because it still uses an older version of mathlib</li>\n<li>the refactor gets merged</li>\n<li>when the bad quality code is updated to post the refactor, the submathlib contributors have to fix their bad quality code</li>\n</ul>\n</blockquote>\n<p>I've had experience doing refactors and then having to fix up very weird code I barely understand and which barely worked. It's not an enviable position. And if these subrepos are going to be about topics which are already niche for the standards of Mathlib (which requires a college degree at minimum to understand in its entirety) then I think it's even more important to avoid people constantly running into problems with them.</p>",
        "id": 505895418,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1742081109
    },
    {
        "content": "<p>I'd feel particularly bad if I was constantly getting called to fix my CGT code because Mathlib doesn't build and no one else can fix it, instead of just bumping the CGT repo on every release and fixing whatever breaks in a single swoop.</p>",
        "id": 505895653,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1742081298
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"767695\">@Tristan Figueroa-Reid</span> Beware of conflating code quality with style. Code quality has many factors, some are style (useful for making sure people don't get distracted by irrelevant details), but more important are large-scale features. Do the interfaces make sense? Are they complete? Do they prevent exposing internal details? Is the code structured in a way where maintaining it when upstream changes are made is generally easy? Is it structured where changes to internal details don't affect downstream projects too badly? Is functionality well-factored-out? Can people find things? Figure out how to use things? Is the design set up in a way that supports most interests without much compromise? Are the compromises well understood and documented? Etc etc etc.</p>\n<p>Mathlib is also this big experiment to see if all of modern mathematics can fit together. No one knows if it's possible. Large-scale cross-cutting refactors have been necessary as people have gained a better understanding of how mathematics should be set up. This is a very mathematical activity too — mathematicians like gaining insight by thinking deeply about things we think we already know well.</p>",
        "id": 505896066,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1742081663
    },
    {
        "content": "<p>With my Lean developer hat on, mathlib has varying code quality, and some of mathlib has made necessary changes painful to carry out. Mathlib is a great test suite for Lean, since it seems to exercise every observable behavior of the system, whether it's an intended feature or not. But also, sometimes proofs have inscrutable intermediate states, or they make use of some defeq abuse that should never have worked in the first place. The FRO has made a commitment to keep mathlib up-to-date though, so we do the work to fix these issues when we modify Lean (many thanks to Kim here!).</p>\n<p>Earlier in the thread there were some comments about 500 line proofs. For theoretical areas it's hard to imagine an irreducibly complex proof that has to be that long (for proofs about concrete complicated programs, that's a different story). I could be off the mark, but if a proof could be written in a maintainable way at 500 lines, likely it is obvious how to decompose it into pieces and it would have been done. There is no value judgment here about whether it is \"right\" or \"wrong\" to have long proofs. I'm just thinking about this from the perspective of someone who regularly has to go into other people's proofs to fix them up, and who appreciates that Mathlib reviews do a lot of work toward making this sort of work actually manageable.</p>",
        "id": 505897642,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1742083101
    },
    {
        "content": "<p>(the proof that surreal number multiplication is well-defined is about 500 lines too... thankfully its contributors figured out a pretty ingenious way to split it up into sub-lemmas. it took a lot of effort, though.)</p>",
        "id": 505899251,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1742084338
    },
    {
        "content": "<p>I see! That makes more sense. I wasn't aware of the depth as to how much <code>mathlib</code> needs to be kept up to date. Perhaps it would be best then to have a bunch of <code>lake</code> projects inside a separate <code>mathlib4-extras</code> repository, then? We would still have the benefits of a monorepo (shared infrastructure, codebase-wide golfs) while still enabling some separation of concerns between core <code>mathlib4</code> and these child projects.</p>\n<p>(One of the few benefits to having each <code>mathlib4-extra</code> module being its own repository is the clone size and less clutter in issues and pull requests, but a depthless clone and GitHub's labels easily give that same benefit to the shared potential <code>mathlib4-extra</code> monorepo.)</p>\n<p>Perhaps even <code>Archive</code> can be moved to this potential <code>mathlib4-extra</code> space. That way, the three big _libraries_ in the <code>leanprover-community</code> space would be <code>batteries</code>, <code>mathlib4</code>, and <code>mathlib4-extra</code>.</p>",
        "id": 505905206,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742089578
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505897642\">said</a>:</p>\n<blockquote>\n<p>Earlier in the thread there were some comments about 500 line proofs. For theoretical areas it's hard to imagine an irreducibly complex proof that has to be that long (for proofs about concrete complicated programs, that's a different story).</p>\n</blockquote>\n<p>This is not really a dichotomy. In the study of grammars, even if you study them \"theoretically\" (whatever it means), you sometimes need to analyze long sequences of rewrites. When the invariants preserved throughout the rewriting get complicated, the proofs that the invariants are preserved get even more complicated.</p>\n<p>Of course, you can split the long proof into many shorter proofs, but then you have to copypaste enormous intermediate steps from the local context into the lemma assumptions.</p>",
        "id": 505941794,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1742119365
    },
    {
        "content": "<p>I feel like having all the mathlib-extra repositories in the same repo, even separate from Mathlib, still leads to the same sort of problems, where we can't do a version bump because some code broke and only the 3 people working within that specific section of the repository are able to fix it easily.</p>",
        "id": 505987657,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1742152906
    },
    {
        "content": "<p>You could run your repos like I run FLT, not in leanprover-community, and I bump it every week or two and never feel under pressure.</p>",
        "id": 506002593,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1742163665
    },
    {
        "content": "<p>(Note that FLT isn't a library - one of the more weirder things that I wasn't expecting, but is something that we should indeed worry about, is that people will depend on these <code>mathlib4-extras</code> repositories - for example, the formalization of Hex based on mathlib4's CGT.)</p>",
        "id": 506027609,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742179133
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505987657\">said</a>:</p>\n<blockquote>\n<p>I feel like having all the mathlib-extra repositories in the same repo, even separate from Mathlib, still leads to the same sort of problems, where we can't do a version bump because some code broke and only the 3 people working within that specific section of the repository are able to fix it easily.</p>\n</blockquote>\n<p>Absolutely! I suggested this earlier, but we can have separate lake projects in the same repository. It feels weird, but that's the core idea of a monorepo. <code>mathlib4</code> has a lot of interconnected parts with no clear dependency tree. The definition of 'monorepo' is arguable, but I consider a repository to be a proper monorepo if it has subprojects with well-defined relationships.</p>",
        "id": 506027755,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742179235
    },
    {
        "content": "<p>I was wondering if it was a good idea to have these projects in <code>Mathlib</code> itself, but the arguments against that were compelling <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 506027806,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742179276
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"767695\">Tristan Figueroa-Reid</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/506027755\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505987657\">said</a>:</p>\n<blockquote>\n<p>I feel like having all the mathlib-extra repositories in the same repo, even separate from Mathlib, still leads to the same sort of problems, where we can't do a version bump because some code broke and only the 3 people working within that specific section of the repository are able to fix it easily.</p>\n</blockquote>\n<p>Absolutely! I suggested this earlier, but we can have separate lake projects in the same repository. It feels weird, but that's the core idea of a monorepo. <code>mathlib4</code> has a lot of interconnected parts with no clear dependency tree. The definition of 'monorepo' is arguable, but I consider a repository to be a proper monorepo if it has subprojects with well-defined relationships.</p>\n</blockquote>\n<p>I'm quite sure we want master branch on any mathlib or submathlib to be always-green, ensured by CI, so having temporarily broken subfolders sounds like a non-starter. If they are to live in the mathlib monorepo then they will need to get fixes in the same PRs that cause the breakage, whether that means airlifting in a topic maintainer or whatever else.</p>",
        "id": 506108769,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1742207750
    },
    {
        "content": "<p>I think the folders wouldn't be \"temporarily broken\" but rather \"temporarily out of sync\"</p>",
        "id": 506109271,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1742207874
    },
    {
        "content": "<p>out of sync with what? In the one-repo-to-rule-them-all plan that folder would be the source of truth for that submathlib, so it would be going in and out of breakage</p>",
        "id": 506109603,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1742207947
    },
    {
        "content": "<p>The folder would have its own lakefile pointing at a non-necessarily-<code>master</code> revision of mathlib</p>",
        "id": 506110010,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1742208046
    },
    {
        "content": "<p>That is horrific</p>",
        "id": 506110102,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1742208069
    },
    {
        "content": "<p>A git repo should not need to reference its own history, this causes all sorts of problems</p>",
        "id": 506110220,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1742208095
    },
    {
        "content": "<p>if it needs to be versioned separately from mathlib, for god's sake please use a separate repo with separate change tracking</p>",
        "id": 506110483,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1742208140
    },
    {
        "content": "<p>I agree, just wanted you to know exactly what you were arguing against <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 506110497,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1742208142
    },
    {
        "content": "<p>[Oh, I did mean that in the sense that they should be in a separate repository because its pointing at <code>mathlib4</code>, though now I do see that there is less of a point in that regard, since they're all pointing at different versions of mathlib4 anyway]</p>\n<p>The arguments presented make sense! I was operating under the (idealistic) assumption that 'okay' code generally doesn't need to be refactored often to prevent CI from breaking, but I was unaware of, as many of you explained, the ways that proofs and definitions constantly break CI in <code>mathlib4</code> in ways that are only consistently recognizable to a few people. My general assumption was that a lot of the reviews were preventing stylistic drift and maintaining quality, i.e. that PRs were kept to a similar, up-to-date fashion as the rest of the codebase, and, as <span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> describes, that <a href=\"#narrow/channel/287929-mathlib4/topic/Grammars.20downstream.20of.20Mathlib/near/505896066\">the code is designed nicely in such a way that anticipates user needs</a> - not that those reviews were necessary to have the project continue on. I do appreciate that you all took the time to entertain this idea, though! <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> </p>\n<p>Given that information above, it does make sense that these mathlib4 modules are in different repositories.</p>",
        "id": 506191318,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742226362
    },
    {
        "content": "<p>(<span class=\"user-mention\" data-user-id=\"417654\">@Martin Dvořák</span> did you want to make the new repository for grammar-related formalizations?)</p>",
        "id": 506594569,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1742337922
    }
]