[
    {
        "content": "<p>Hi all, after learning Lean for a while, I decided to try some more serious project. I picked one of the unclaimed theorem from <a href=\"https://leanprover-community.github.io/1000-missing.html\">1000+ theorem</a> (somewhat randomly) and attempted to prove it. So here is the <em>almost</em> proved <a href=\"https://en.wikipedia.org/wiki/Hahn_embedding_theorem\">Hahn Embedding Theorem</a> <a href=\"https://github.com/wwylele/HahnEmbedding\">https://github.com/wwylele/HahnEmbedding</a>. It still has one sorry that I think is trivial in theory but cumbersome to code (In Hahn.lean, the base case for zorn lemma, a linear map spanned by a family of disjoint submodules). I am trying to finish it this week.</p>\n<p>My questions here are</p>\n<ul>\n<li>This is definitely not in mathlib yet, right? Do we want this in mathlib? (obviously not as-is. There are a lot of golfing to do)</li>\n<li>If we want this in mathlib, is it ok to make the codomain of the embedding <code>HahnSeries</code> like this code does? The original theorem simply specifies the codomain as \"set of all functions from Ω to R  which vanish outside a well-ordered set.\". I used <code>HahnSeries</code> because it matches the definition and already has some useful API.</li>\n</ul>",
        "id": 519722226,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1747872522
    },
    {
        "content": "<p>Yes, <code>HahnSeries</code> is a good choice for codomain.</p>",
        "id": 519735604,
        "sender_full_name": "Scott Carnahan",
        "timestamp": 1747881586
    },
    {
        "content": "<p><span aria-label=\"partying face\" class=\"emoji emoji-1f973\" role=\"img\" title=\"partying face\">:partying_face:</span> It is sorry-less now. Time to clean up stuff and see if I can make this mathlib-ready</p>",
        "id": 520023312,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1747997268
    },
    {
        "content": "<p>I have started PR piece by piece in <a href=\"https://github.com/leanprover-community/mathlib4/pull/25144\">#25144</a></p>",
        "id": 520157163,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1748056692
    }
]