[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/19959\">#19959</a>, <span class=\"user-mention\" data-user-id=\"459699\">@Joël Riou</span> defines a <code>HasCardinalLT</code> predicate for types and cardinals within distinct universes, for the purposes of using it within category theory. I'm wondering if we can implement this idea in more generality.</p>\n<p>Here's what I'm thinking: define a <code>HasULift a b c</code> typeclass for types <code>a</code>, <code>b</code> which embed as an initial segment of <code>c</code>. The intended implementers would be <code>a = Cardinal.{u}</code>, <code>b = Cardinal.{v}</code>, and <code>c = Cardinal.{max u v}</code> (as well as ordinals!). We can then define universe polymorphic equality and ordering between types <code>a</code> and <code>b</code>, and prove results like antisymmetry, transitivity, and whatnot.</p>\n<p>This would be a pretty big refactor, since at the moment a lot of results are stated using the <code>Cardinal.lift{v} a = Cardinal.lift{u} b</code> pattern, but it would have some benefits:</p>\n<ul>\n<li>more readable code that isn't littered with <code>lift</code></li>\n<li>we don't have to duplicate theorems by having lift and non-lift versions, since we can instead just write them using the universe polymorphic order predicates instead </li>\n<li>we sidestep existing issues with <code>simp</code> and <code>lift</code> (at the moment <code>simp</code> can't do simplifications like <code>lift.{max u v, u} = lift.{v, u}</code>)</li>\n</ul>",
        "id": 489233035,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1734354782
    },
    {
        "content": "<p>Again, I do not want to disturb the set theory API (for the limited use of which I have experienced very good behaviour of <code>simp</code>). The <code>HasCardinalLT</code> predicate is needed for the study of<code>κ</code>-filtered categories for a regular cardinal <code>κ</code> (they are a generalization of filtered categories, and they will be used when proving for example that Grothendieck abelian categories have enough injectives), and there is no particular reason it would be used extensively outside of category theory. Then, I do not think any refactor is necessary.</p>",
        "id": 489237173,
        "sender_full_name": "Joël Riou",
        "timestamp": 1734355863
    },
    {
        "content": "<p>I don't really see a reason for this predicate to be any more useful in the context of category theory than outside of it. If working with <code>lift</code> directly is troublesome, then my proposed refactor should be useful throughout Mathlib. If it's not, then I don't think the <code>HasCardinalLT</code> predicate is necessary.</p>",
        "id": 489238159,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1734356103
    },
    {
        "content": "<p>I can assert it is useful in the context of category theory!</p>",
        "id": 489238357,
        "sender_full_name": "Joël Riou",
        "timestamp": 1734356162
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459699\">Joël Riou</span> <a href=\"#narrow/channel/287929-mathlib4/topic/HasULift.20typeclass/near/489238357\">said</a>:</p>\n<blockquote>\n<p>I can assert it is useful in the context of category theory!</p>\n</blockquote>\n<p>I think this <span aria-label=\"this\" class=\"emoji emoji-1f446\" role=\"img\" title=\"this\">:this:</span> outweighs any considerations of refactoring the set theory API. <br>\nI've left an approving review but I wanted to give <span class=\"user-mention\" data-user-id=\"459227\">@Violeta Hernández</span> a chance to respond before maintainer merging</p>",
        "id": 489244373,
        "sender_full_name": "Dagur Asgeirsson",
        "timestamp": 1734357586
    },
    {
        "content": "<p>I do agree that this sort of ambitious refactor shouldn't hold up mathematical work. So I agree with this being merged as is.</p>",
        "id": 489244856,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1734357703
    },
    {
        "content": "<p>I do still think it can potentially be something to work on. If a simple cardinal inequality is inconvenient enough that it's useful to introduce API on top of that, then maybe that's true of the entire <code>lift</code> API too.</p>",
        "id": 489247354,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1734358350
    },
    {
        "content": "<p>I'll do the <code>HasULift</code> experiment as a draft PR. That should allow us to judge if I'm onto something.</p>",
        "id": 489247533,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1734358385
    }
]