[
    {
        "content": "<p>I would like to contribute to mathlib by formalizing Hoeffding's lemma. Could anyone enable access to mathlib for me? My GitHub account is tukamilano.</p>",
        "id": 475226080,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1728285724
    },
    {
        "content": "<p>Invite sent!</p>",
        "id": 475227693,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1728286010
    },
    {
        "content": "<p>Thank you so much!</p>",
        "id": 475227804,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1728286025
    },
    {
        "content": "<p>Do you have plans for things you want to formalize, beyond that lemma?</p>",
        "id": 475230922,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1728286512
    },
    {
        "content": "<p>Several of us are planning to formalizing the theorems in the textbook \"foundation of machine learning\" and aiming to formalize binary classification bounds of Rademacher complexity and linear prediction bounds.<br>\n<a href=\"https://cs.nyu.edu/~mohri/mlbook/\">https://cs.nyu.edu/~mohri/mlbook/</a></p>\n<p>The proof of maximal inequality will be completed once I can deal with the issue relating to \"sup\", and some of us is trying to formalize mcdiarmid's inequality.</p>\n<p>We haven't fully figured out how to define rademacher complexity yet.</p>",
        "id": 475251916,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1728292218
    },
    {
        "content": "<p>Very nice! Keep me updated and please request my review on your PRs. I don't do machine learning but I use a lot of the same machinery.</p>",
        "id": 475253279,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1728292667
    },
    {
        "content": "<p>About Hoeffding's lemma: its usual proof is in two steps, first proving that the cumulant generating function (cgf) of a random variable on [0,1] is less than the cgf of a Bernoulli distribution with same mean, then that a Bernoulli is sub-Gaussian. The first step is useful in itself, so please make sure to have that as an independent lemma! (for example it is used in theorem D.3 in the book you linked)</p>",
        "id": 475254812,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1728293135
    },
    {
        "content": "<p>I didn't follow the elementary proof of Hoeffding's lemma in the text I linked, but used cumulant which appears on another materials, so it's ok on that point</p>",
        "id": 475256030,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1728293517
    },
    {
        "content": "<p>As a preparation for the formalization of Hoeffding's lemma, I added the formalization of <a href=\"https://en.wikipedia.org/wiki/Popoviciu%27s_inequality_on_variances\">Popoviciu's inequality on variances</a> in the Probability.Variance.lean file. Once the branch is successfully merged into the mathlib repository, I'm going to submit a pull request for Hoeffding's proof itself.</p>",
        "id": 477436668,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1729169746
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/17868\">https://github.com/leanprover-community/mathlib4/pull/17868</a></p>",
        "id": 477437063,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1729169865
    },
    {
        "content": "<p>Great! I'll have a look.</p>",
        "id": 477440026,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1729170714
    },
    {
        "content": "<p>On it too <span aria-label=\"search\" class=\"emoji emoji-1f50d\" role=\"img\" title=\"search\">:search:</span></p>",
        "id": 477440820,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1729170952
    },
    {
        "content": "<p>I have just submitted a pull request for Hoeffding's lemma.<br>\n<a href=\"https://github.com/leanprover-community/mathlib4/pull/18091\">https://github.com/leanprover-community/mathlib4/pull/18091</a></p>",
        "id": 478377704,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1729636748
    },
    {
        "content": "<p>I have just been reading a pull request for Hoeffding's lemma <span aria-label=\"eyes\" class=\"emoji emoji-1f440\" role=\"img\" title=\"eyes\">:eyes:</span></p>",
        "id": 478378445,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1729637195
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"558149\">Kei TSUKAMOTO</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Hoeffding's.20lemma/near/475251916\">said</a>:</p>\n<blockquote>\n<p>Several of us are planning to formalizing the theorems in the textbook \"foundation of machine learning\" and aiming to formalize binary classification bounds of Rademacher complexity and linear prediction bounds.<br>\n<a href=\"https://cs.nyu.edu/~mohri/mlbook/\">https://cs.nyu.edu/~mohri/mlbook/</a></p>\n</blockquote>\n<p>It's a nice book to formalise. We had a seminar on it last year. But also do check out \"Understanding Machine Learning\" by Shai Ben David and Shai Shalev Schwartz</p>",
        "id": 478378766,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729637401
    },
    {
        "content": "<p>Thank you for telling me. I'll have a look</p>",
        "id": 478379008,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1729637544
    },
    {
        "content": "<p>Feel free to request my reviews as well. I am not an official reviewer but I do know most of the book</p>",
        "id": 478381630,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729639259
    },
    {
        "content": "<p>Anyone is welcome to review mathlib PRs!</p>",
        "id": 478416809,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1729662481
    },
    {
        "content": "<p>I left some preliminary comments on the PR (mainly: you should formulate your results with the definitions <code>mgf</code> and <code>cgf</code> that are in the Moments file), but I wanted to discuss here a more long term concern, assuming you want to formalize things like Hoeffding's inequality.</p>\n<p>I had a PR for mathlib3 (<a href=\"https://github.com/leanprover-community/mathlib3/pull/15141\">https://github.com/leanprover-community/mathlib3/pull/15141</a>) with Hoeffding's inequality for sub-Gaussian random variables (which you can combine with Hoeffding's lemma to get the inequality for bounded r.v.) and <span class=\"user-mention silent\" data-user-id=\"110050\">Sébastien Gouëzel</span>  rightly pointed out that it was a bit sad to not prove at the same time the Azuma-Hoeffding inequality. It has the same proof, but works for martingales and not just independent random variables.<br>\nThere is however a catch: for Azuma-Hoeffding you don't have an a.e. bounded hypothesis, you should have random variables that are a.e. bounded conditionally on some sigma-algebra (or conditionally sub-Gaussian random variables, not just sub-Gaussian). That issue is often not even mentioned in books because the conditional definition is a natural extension of the non-conditional definition, but it matters when formalizing!</p>\n<p>What it means in practice when implementing those inequalities, is that none of the lemmas that we are writing about a.e. bounded random variables will apply directly for the conditional versions. We could duplicate everything and have non-conditional statements and conditional statements, with duplicated or almost-duplicated proofs. That is not very appealing and not good for maintainability.</p>\n<p>There was the same issue for independence versus conditional independence. The solution I adopted was to introduce a new notion of independence with respect to a kernel and a measure <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Probability/Independence/Kernel.html#ProbabilityTheory.Kernel.Indep\">ProbabilityTheory.Kernel.Indep</a> which has both non-conditional and conditional definitions as special cases. All proofs are done for that, and then we have two definitions <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Probability/Independence/Basic.html#ProbabilityTheory.Indep\">ProbabilityTheory.Indep</a> and <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Probability/Independence/Conditional.html#ProbabilityTheory.CondIndep\">ProbabilityTheory.CondIndep</a> that are special cases of the kernel definition. So we have 3 definitions, but only one proof: the proofs for the two special cases are only one-liners. The kernel proof is essentially the conditional proof, but writing it with a kernel instead of a conditional expectation makes the expressions simpler and easier to manipulate in Lean.</p>\n<p>The solution transfers directly to the issue we have with concentration inequalities: instead of writing lemmas for a.e. bounded random variables (<code>∀ᵐ ω ∂μ, X ω ∈ Set.Icc a b</code>), we could write lemmas for <code>∀ᵐ ω ∂μ, ∀ᵐ w ∂(κ ω), X w ∈ Set.Icc a b</code>. Then for <code>κ</code> a constant kernel we get the unconditional hypothesis, and for <code>κ</code> equal to <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Probability/Kernel/Condexp.html#ProbabilityTheory.condexpKernel\">ProbabilityTheory.condexpKernel</a> we get conditionally bounded.</p>\n<p>I am not saying that you should do all of that in the current PR or even that you should be the one refactoring <code>mgf</code> and <code>cgf</code> in that way. But I wanted to caution that there is an issue that is easily overlooked when reading paper math, and describe the solution I came up with.</p>",
        "id": 478433577,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1729670161
    },
    {
        "content": "<p>Actually this makes sense. Should we refactor Popoviciu's inequality to use ae bounded wrt a kernel?</p>",
        "id": 478447717,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1729674549
    },
    {
        "content": "<p>If we want to also get conditional concentration inequalities without duplicating the proofs, then yes, that's what I am suggesting.<br>\nIf we proceed in the way I described above more generally, we should give the same treatment to mgf and cgf, variance and a bunch of other things. Basically, we should do everything for kernels and then specialize.</p>\n<p>I probably won't have time to do any of that refactoring myself in the next months.<br>\nAlso I know that the kernel formulation is a bit obscure so I don't really want to demand in reviews that people write their PRs in that framework. It might put off people (especially new contributors). Better to have something for the non-conditional case that we can eventually refactor than to have nothing.</p>",
        "id": 478480165,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1729685375
    },
    {
        "content": "<p>Could you recommend any reference materials used in the formalization of probability theory? Especially, I'd like to fully understand the kernel in mathlib. I suppose probability theory in mathlib is formalized with the kernel as a starting point, and varies from the sequence of standard probability textbooks, and there are some parts that are difficult to understand just by reading the Mathlib files.</p>",
        "id": 478682297,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1729765612
    },
    {
        "content": "<p>Have you read <a href=\"https://leanprover-community.github.io/blog/posts/basic-probability-in-mathlib/\">https://leanprover-community.github.io/blog/posts/basic-probability-in-mathlib/</a> ?</p>",
        "id": 478683841,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1729766203
    },
    {
        "content": "<p>Foundations of modern probability by Kallenberg was the main reference for martingales and if am not mistaken also for kernels.</p>",
        "id": 478685026,
        "sender_full_name": "Kexing Ying",
        "timestamp": 1729766641
    },
    {
        "content": "<p>That link does not contain much about Markov kernels specificly, it's more a broad overview.<br>\nMy go-to book for that subject is Foundations of modern probability. Chapters 3 and 8 in particular for kernels in the 3rd edition.</p>",
        "id": 478685967,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1729766961
    },
    {
        "content": "<p>\"Independence with respect to a kernel and a measure\" as in <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=ProbabilityTheory.Kernel.Indep#doc\">docs#ProbabilityTheory.Kernel.Indep</a> is not something you will find in any book. I made it up when I needed something convenient to prove properties of both conditional and non-conditional independence. It is very weakly related to (or vaguely inspired by) the transitional conditional independence ideas in <a href=\"https://arxiv.org/abs/2104.11547\">https://arxiv.org/abs/2104.11547</a> .<br>\nLikewise, the other kernel definitions I am proposing, like \"sub-Gaussian with with respect to a kernel and a measure\", are not described in any book or paper.</p>",
        "id": 478688499,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1729767910
    },
    {
        "content": "<p>On the discrete side, \"Probability and Computing\" By Eli Upfal and Michael Mitzenmacher is a good reference. Quite aside from algorithms, it has a lot of probability theory</p>",
        "id": 478706939,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729773688
    },
    {
        "content": "<p>Thank you. For now, I will read Chapters 3 and 8 of Foundations of Modern Probability.</p>",
        "id": 478750256,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1729785593
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243312\">@Kexing Ying</span> </p>\n<p>Have you ever considered formalizing the interchange between integration and differentiation under the condition that the sequence of functions is uniformly integrable? I'm currently using the interchange that follows from dominated convergence theorem in the proof, but I am wondering about generalizing the statement below.</p>\n<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/18091#discussion_r1814475153\">https://github.com/leanprover-community/mathlib4/pull/18091#discussion_r1814475153</a></p>",
        "id": 479436106,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1730194476
    },
    {
        "content": "<p>I've not thought about it but I would assume it would be the same as DCT since we do have the Vitali convergence theorem.</p>",
        "id": 479438092,
        "sender_full_name": "Kexing Ying",
        "timestamp": 1730195133
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"350992\">@Rémy Degenne</span> <br>\nI haven’t been working on this formalization, but I’d like to resume. I have a question about this <a href=\"https://github.com/leanprover-community/mathlib4/pull/18091#discussion_r1814475153\">comment</a>. How much generalization is necessary to be adopted in mathlib in this case? It doesn’t seem clear to me what integrability condition is permitted. Could you give me an example if any?</p>",
        "id": 488618803,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1734005546
    },
    {
        "content": "<p>I split the PR of Hoeffding's lemma up to integrable_expt<br>\n<a href=\"https://github.com/leanprover-community/mathlib4/pull/20017\">https://github.com/leanprover-community/mathlib4/pull/20017</a></p>\n<p>waiting for the reviews!</p>",
        "id": 489622997,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1734500095
    },
    {
        "content": "<p>If anyone has time, I'd like to request a review. It's a small pull request (aiming to use for Massart's lemma).<br>\n<a href=\"https://github.com/leanprover-community/mathlib4/pull/20437\">https://github.com/leanprover-community/mathlib4/pull/20437</a></p>",
        "id": 491764393,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1735913936
    },
    {
        "content": "<p>I have finished revising the Hoeffding's lemma according to the definition of moment (cumulant) generating function.</p>\n<p>Sorry for not responding sooner.<br>\n<a href=\"https://github.com/leanprover-community/mathlib4/pull/18091\">https://github.com/leanprover-community/mathlib4/pull/18091</a></p>",
        "id": 504350360,
        "sender_full_name": "Kei TSUKAMOTO",
        "timestamp": 1741493468
    }
]