[
    {
        "content": "<p>Hello! Currently, I am updating a project from <code>v4.7.0</code> to  <code>v4.21.0</code>. In between versions, a lot of theorems and packages have been marked as deprecated or have been deleted entirely. I was looking through documentations and the <a href=\"https://mathlib-changelog.org/v4\">changelog tool</a>, yet I cannot find the package or theorem the deleted functionality was transferred to. Can someone tell me please how to find the corresponding theorems/packages?</p>",
        "id": 532904683,
        "sender_full_name": "Matvey Lorkish",
        "timestamp": 1754396463
    },
    {
        "content": "<p>I wonder if it would be easier if you do this in multiple steps, like 4.7→4.11→4.16→4.21</p>",
        "id": 532905653,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1754396781
    },
    {
        "content": "<p>that would be actually a good idea probably I will try it out</p>",
        "id": 532906074,
        "sender_full_name": "Matvey Lorkish",
        "timestamp": 1754396926
    },
    {
        "content": "<p>To elaborate: whenever a theorem is renamed, a deprecated alias is put in place: this will warn you whenever you try to use the old theorem, and tell you about a replacement.</p>",
        "id": 532917015,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1754400568
    },
    {
        "content": "<p>These are removed after six months, i.e. roughly six Lean versions. So if you update in smaller steps, you can use those warnings to help you!</p>",
        "id": 532917160,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1754400608
    },
    {
        "content": "<p>Anything that's deprecated should have a pointer to what you should use instead</p>",
        "id": 532932867,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1754405314
    },
    {
        "content": "<p>It's also often less confusing if you upgrade in smaller steps, and easier to for someone else to review. I've previously used a script that takes care of writing the commit messages and bumping the toolchain/dependencies by one every time I say \"next\"...</p>",
        "id": 533004269,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1754438459
    }
]