[
    {
        "content": "<p>Hi, I am a new member still learning about Lean, and I would be interested in contributing to mathlib at some point, as I have worked on formalizations in Coq before. I was just wondering, how do you decide what new lemmas/theorems to add to mathlib? I saw there's this list of missing undergrad topics: <a href=\"https://leanprover-community.github.io/undergrad_todo.html\">https://leanprover-community.github.io/undergrad_todo.html</a> so is this list the highest priority of what lemmas/theorems should be added to mathlib first?</p>",
        "id": 490850144,
        "sender_full_name": "Noble Mushtak (he/him)",
        "timestamp": 1735200965
    },
    {
        "content": "<p>No not really, in fact many of the results there are not in mathlib because we don't particularly need them. Groups have their own ongoing projects which they add to mathlib bit by bit.</p>",
        "id": 490853513,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1735203370
    },
    {
        "content": "<p>There is no entity that makes decisions what to formalize. There are many individual contributors, each formalizes whatever they like. Maintainers decide whether the code is in good shape and the material is in scope of Mathlib.</p>",
        "id": 490916643,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1735247245
    },
    {
        "content": "<p>Quite often, people collaborate to formalize something big.</p>",
        "id": 490916665,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1735247273
    },
    {
        "content": "<p>Generally, people choose some big goal and formalize whatever they need for this goal.</p>",
        "id": 490929372,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1735258441
    },
    {
        "content": "<p>Mathlib has a very big scope. I've only come across a handful of situations where something isn't Mathlib appropriate, mostly because it's specialized and not too mathematical (e.g. Rubik's cubes, sudokus, my stuff on ordinal notations)</p>",
        "id": 492004674,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736116706
    },
    {
        "content": "<p>By default if you want to add something and there's any chance someone else might make use of it, then you can and should.</p>",
        "id": 492004690,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736116729
    },
    {
        "content": "<p>(but you can still ask if you're unsure)</p>",
        "id": 492004710,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736116747
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/How.20do.20you.20decide.20what.20to.20add.20to.20mathlib.3F/near/492004674\">said</a>:</p>\n<blockquote>\n<p>Mathlib has a very big scope. I've only come across a handful of situations where something isn't Mathlib appropriate, mostly because it's specialized and not too mathematical (e.g. Rubik's cubes, sudokus, my stuff on ordinal notations)</p>\n</blockquote>\n<p>This is one end of a spectrum of views, not universally held. If it will not be used by someone in an adjacent (or preferably far away!) field --- then I would strongly encourage development in a separate repository. As an example, I think all concrete \"named\" combinatorial games (domineering, hackenbush, etc) should be developed outside of Mathlib.</p>",
        "id": 492012543,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1736124358
    },
    {
        "content": "<p>Nim(bers) <span aria-label=\"face with peeking eye\" class=\"emoji emoji-1fae3\" role=\"img\" title=\"face with peeking eye\">:face_with_peeking_eye:</span></p>",
        "id": 492055594,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1736151212
    },
    {
        "content": "<p>Mathlib having a very big scope is kind of a historical accident. We are bound to move towards a smaller scope as more and more people start using Lean. We must leave space for other projects to grow and also keep Mathlib manageable.</p>",
        "id": 492071179,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1736157125
    },
    {
        "content": "<p>What is the smaller scope?</p>",
        "id": 492121059,
        "sender_full_name": "Artie Khovanov",
        "timestamp": 1736175604
    },
    {
        "content": "<p>My vision for the smaller scope is \"things discussed in lectures or seminars in the top maths departments in the world\" but others have different visions.</p>",
        "id": 492126818,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1736177512
    },
    {
        "content": "<p>(and, crucially, their prerequisites, right)</p>",
        "id": 492143651,
        "sender_full_name": "Artie Khovanov",
        "timestamp": 1736182688
    },
    {
        "content": "<p>I was taught all prerequisites in university lectures. I saw how to build maths from scratch.</p>",
        "id": 492149184,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1736184503
    },
    {
        "content": "<p>Except for type theory, right <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span></p>",
        "id": 492151646,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1736185276
    },
    {
        "content": "<p>That's true -- I was taught set-theoretic foundations. I learnt Lean's type theory in <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a> and I think it's safe to say that we have had all that for 7 years now :-)</p>",
        "id": 492152076,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1736185439
    },
    {
        "content": "<p>My view for a reasonable and useful scope would be \"Anything that will be reused\", or maybe \"Anything that will be reused in a different area\". This has the advantage of being actionable a posteriori: If you want to depend on a library that's not mathlib, then upstream the content you need from that library to mathlib</p>",
        "id": 492158404,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1736187691
    },
    {
        "content": "<p>... And that has reviewers</p>",
        "id": 492158885,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1736187881
    },
    {
        "content": "<p>If it's going to be reused, then hopefully that means there's &gt;= 2 people interested in it <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 492159235,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1736188026
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/channel/287929-mathlib4/topic/How.20do.20you.20decide.20what.20to.20add.20to.20mathlib.3F/near/492012543\">said</a>:</p>\n<blockquote>\n<p>If it will not be used by someone in an adjacent (or preferably far away!) field --- then I would strongly encourage development in a separate repository. </p>\n</blockquote>\n<p>Does it mean that if I raised the question <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/VCSP.20theory\">#mathlib4 &gt; VCSP theory</a> whether VCSP theory is in the scope of Mathlib, the answer in 2025 would be \"no\"? Not because of the lack of reviewers but simply because VCSP would be out of scope today?</p>",
        "id": 492162649,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1736189300
    },
    {
        "content": "<p>I don't think that I've come across that stuff in the departments I've worked in so I wouldn't be arguing for it to be in mathlib, but there are many maintainers and people have many different opinions, so I would just remain silent when faced with a question like that. I've only expressed my personal view above, I'm not speaking for the maintainers in general.</p>",
        "id": 492171397,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1736192516
    },
    {
        "content": "<p>As a maximalist, I think \"anything likely to be reused\" is appropriate for mathlib, and any other known mathematics (not likely to be reused) can go in the mathlib archive.</p>\n<p>However, I think we should distinguish here between <strong>mathlib the highly integrated library</strong> and <strong>mathlib the monorepo</strong>. We could have a highly integrated library made up of multiple repositories designed to be used together, and once mathlib gets to more than 10 to 100 times its present size, we may need to have the library in multiple repositories. It's <strong>mathlib the highly integrated library</strong> that I think should have maximal scope of everything that might be reused (and likewise, a mathlib archive of known mathematics in general would also not need to be in one repository).</p>\n<p>The <strong>highly integrated</strong> part is important for a multi-repository mathlib. All the repositories should be leanprover-community/mathlib[something] repositories, not in random personal GitHub accounts where they could be lost if the original author deletes them for some reason, or cease to be kept up to date with mathlib. They should all have the same naming, code style etc. conventions; all have the same linters enabled; all have the same CI and review processes; code shouldn't go in one of those repositories if it can sensibly go in the underlying core mathlib (and likewise if it can go somewhere intermediate in the dependency tree, once there is more than one level of dependencies). All the repositories should be updated to a new version of the core mathlib (and other intermediate dependencies) at least once a day, so there is a collection of versions of all the repositories no more than a day old that can be used together. The mathlib documentation on the website should cover all such repositories (with the ability to search either all of them together, or just a particular repository and its dependencies). (And something similar applies for a multi-repository mathlib archive, following similar conventions to the present mathlib archive and also frequently updated but not all in a single repository.)</p>",
        "id": 492179603,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1736195524
    },
    {
        "content": "<p>I do like Joseph's vision for a highly integrated multi-repository mathlib. I think it's worth thinking about the resources required to maintain this. Realistically, I think there is at least one full-time technical position required just to maintain the infrastructure that is implied by this vision, not to mention the implied expansion of the maintainer/reviewer team.</p>",
        "id": 492207929,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1736206219
    },
    {
        "content": "<p>Also presumably reverse-dependency CI so you notice when a mathlib-the-core-repo change breaks things in mathlib-the-library-in-many-repos</p>",
        "id": 492208175,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1736206333
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/channel/287929-mathlib4/topic/How.20do.20you.20decide.20what.20to.20add.20to.20mathlib.3F/near/492158404\">said</a>:</p>\n<blockquote>\n<p>\"Anything that will be reused in a different area\".</p>\n</blockquote>\n<p>Does this mean the entirety of ordinal arithmetic is out? <span aria-label=\"frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"frown\">:frown:</span></p>",
        "id": 493377934,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736781669
    },
    {
        "content": "<p>If anything, it would mean you get a whole project to yourself :)</p>",
        "id": 493378833,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1736781886
    }
]