[
    {
        "content": "<p>I have a situation where (as a side product of other results) I can reduce a theorem by 180 lines if I assume that the codomain is a Banach space and not just a normed space. As a mathematician, I never deal with non-complete normed spaces, but obviously mathlib works a bit different and imposing an assumption when unused is not great. However, I think there is a very valid question on how much code we want to have for generalizing in ways that realistically never come up.</p>",
        "id": 576168334,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1772161805
    },
    {
        "content": "<p>What's the theorem? In many cases, you can compose your function with the embedding into the completion, and get one result from the other.</p>",
        "id": 576172181,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1772164229
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=tendsto_integral_exp_inner_smul_cocompact#doc\">docs#tendsto_integral_exp_inner_smul_cocompact</a></p>",
        "id": 576172803,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1772164586
    },
    {
        "content": "<p>Yeah, that might work in this case</p>",
        "id": 576172908,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1772164653
    },
    {
        "content": "<p>BTW, if <code>E</code> is not a complete space, then the integral is 0 by definition, right?</p>",
        "id": 576173944,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1772164955
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/MeasureTheory/Integral/Bochner/Basic.html#MeasureTheory.integral_def\">MeasureTheory.integral_def</a></p>",
        "id": 576174061,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1772165003
    },
    {
        "content": "<p>ah, this is how little I care about non-complete spaces that I did not know that <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 576174142,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1772165045
    },
    {
        "content": "<p>Thanks Yury!</p>",
        "id": 576174197,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1772165088
    },
    {
        "content": "<p>Regarding \"realistically never come up\" -- what you mean is \"realistically never come up in your experience\". I developed the module topology in mathlib and was very careful to make sure that the results which worked for semirings were proved for semirings (some things worked, but not all). I was careful to separate them out even though it was more work at my end and in my application I never used semirings ever (and have even ranted in the past about how they are a pointless typeclass). And then about six months ago I got an email from someone in Japan who was looking for this exact theory of topologies on modules over the tropical semiring and apparently what I'd done was exactly what they needed. So never say never!</p>",
        "id": 576182900,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1772170414
    },
    {
        "content": "<p>And if the more general result already is in mathlib, I wouldn't propose a change to shorten and weaken it without a strong motivation</p>",
        "id": 576206978,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1772182246
    }
]