[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/21670\">#21670</a>, I'm adding a few new typeclasses, which generalise normed groups to include <code>ENNReal</code>: this need arose in the Carleson project. </p>\n<p>(Some broader context: this change allows e.g. stating \"the Hardy-Littlewood maximal function has weak type L^p\", with that function being ENNReal-valued --- without duplicating this definition. The definition of e.g. <code>HasFiniteIntegral</code> was already changed some time ago to allow for enormed spaces, now I'd like to generalise many lemmas in mathlib.)</p>\n<p>These typeclasses assume the space in question has an <code>enorm</code>, which is <code>ENNReal</code>-valued: to speak about continuity of that enorm, I need to import the topology on ENNReal, and know that the coercion to <code>NNReal</code> is continuous. Currently, this adds about 120 transitive imports to that file. The <a href=\"https://github.com/leanprover-community/mathlib4/pull/22093\">easy way</a> of reducing imports does not help much. There are <a href=\"https://github.com/leanprover-community/mathlib4/pull/22093#issuecomment-2670785335\">ideas</a> for reducing the effect, but at some point there will be an increase.</p>\n<p>In my opinion, this is the price to pay for this generalisation: having a more usable analysis library is worth it.<br>\nHowever, if you have major objections to this, please speak up and let's discuss!</p>",
        "id": 500930398,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1740071355
    },
    {
        "content": "<p>Note that, if <a href=\"https://github.com/leanprover-community/mathlib4/pull/21995\">#21995</a> gets merged, then <code>Data.Complex.Abs</code> will be replaced by <code>Data.Complex.Norm</code> which imports <code>Analysis.Normed.Group.Basic</code>. Thus, any changes to the imports of <code>Analysis.Normed.Group.Basic</code> could have a lot of impact. That was the reason for the split in <a href=\"https://github.com/leanprover-community/mathlib4/pull/21554\">#21554</a></p>",
        "id": 500965847,
        "sender_full_name": "Xavier Roblot",
        "timestamp": 1740084232
    },
    {
        "content": "<p>(Reviving this topic since I want to rearrange the <code>Instances.{ENN,NN,}Real</code> file in the coming days.) In the end my stance is that import cleanup is all about <em>unused</em> imports. If you add a set of imports that are <em>useful</em>, then no harm has been done.</p>",
        "id": 503223690,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1741082108
    }
]