[
    {
        "content": "<p>As preparation for writing instance priority linters, I wrote some code to generate the current algebraic hierarchy as a graph. <br>\nHere is the full \"algebraic hierarchy\" of mathlib:</p>\n<p><a href=\"/user_uploads/3121/FWYjZwWibH6lhbgAGv1KVBof/FullInstanceGraph.pdf\">FullInstanceGraph.pdf</a></p>\n<p>What are you looking at here?</p>\n<ul>\n<li>All nodes are classes with 1 explicit type argument (and potentially other type-class arguments). So not e.g. <code>Module</code></li>\n<li>Solid edges are \"forgetful\" instances from a class to another class (either generated by the <code>extends</code> syntax or by a user). Instances that have multiple source classes are not displayed.</li>\n<li>Dashed edges are classes that have another class as argument (e.g. there is a dashed edge <code>T0Space -&gt; TopologicalSpace</code>)</li>\n<li>Edges in the transitive closure are removed (e.g. there is no direct edge from <code>T1Space -&gt; TopologicalSpace</code>)</li>\n<li>Classes without any edges are not displayed</li>\n</ul>\n<p>If this is too overwhelming, here is a subgraph where we only take the classes with 1 argument (no other type-class arguments). That one is almost manageable!</p>\n<p><a href=\"/user_uploads/3121/1vg5IhMjJIvoILL-P7lHon5D/PartialInstanceGraph.pdf\">PartialInstanceGraph.pdf</a></p>\n<p>Code and output (in dot format) here: (this also contains all the instances with multiple sources, that are not as easily visualizable in a graph)</p>\n<p><a href=\"https://gist.github.com/fpvandoorn/c398ea0a926a8b4013344d4a45bf9bbb\">https://gist.github.com/fpvandoorn/c398ea0a926a8b4013344d4a45bf9bbb</a></p>\n<p>You can use <code>tred full.dot | dot -y -T pdf &gt; full.pdf</code> to generate the graphs (requires graphviz)</p>",
        "id": 378851049,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1690385809
    },
    {
        "content": "<p>Thanks a lot!</p>\n<p>I just printed the smaller graph on A3. It is barely readable. I will try A2 if I get a chance.</p>",
        "id": 405088181,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1701340801
    },
    {
        "content": "<p>Can we please put those PDFs somewhere more visibly? I often search for it on Zulip and end up opening this thread over and over again.</p>",
        "id": 438749946,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1715761233
    },
    {
        "content": "<p>Also, how hard would it be to automatically generate a new version of the graph every week or so?</p>",
        "id": 438750865,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1715761572
    },
    {
        "content": "<p>Now that there is a cron job running in CI, I am fairly confident that we could probably set something up that would produce these graphs regularly and post them, if this is something desirable.</p>",
        "id": 438781131,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1715772715
    },
    {
        "content": "<p>Honestly, I kind of liked the progress reports during the port and I think that some regular, global information on the \"status\" of mathlib is certainly added value.</p>",
        "id": 438781766,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1715772968
    },
    {
        "content": "<p>Post to LinkedIn?</p>",
        "id": 438783139,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1715773504
    },
    {
        "content": "<p>Does anybody have a newer version?</p>",
        "id": 456661720,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1722879153
    },
    {
        "content": "<p>Running the script by <span class=\"user-mention\" data-user-id=\"111080\">@Floris van Doorn</span> on current Mathlib gave me:<br>\n<a href=\"/user_uploads/3121/5_HadahF49L9DiGx0TixLRm_/Mathlib_classes.svg\">Mathlib_classes.svg</a></p>",
        "id": 462761386,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1723805348
    },
    {
        "content": "<p>As the graph above is overwhelmingly large, I also post a graph with basic algebraic classes only (in particular, <code>LinearOrderedField</code> and everything upstream):<br>\n<a href=\"/user_uploads/3121/LgX6mmSbnDg4WgAkQHvzz25j/Mathlib_LinearOrderedField.svg\">Mathlib_LinearOrderedField.svg</a></p>",
        "id": 462787212,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1723814765
    },
    {
        "content": "<p>It looks like <code>CommGroupWithZero</code> has an arrow to <code>CommMonoidWithZero</code> but not <code>CancelCommMonoidWithZero</code>, and <code>GroupWithZero</code> has an arrow to <code>MonoidWithZero</code> but not <code>CancelMonoidWithZero</code>.  Should this be changed?</p>",
        "id": 462828110,
        "sender_full_name": "Scott Carnahan",
        "timestamp": 1723828537
    },
    {
        "content": "<p>Looks like Martin didn't <code>import Mathlib</code> but merely <code>import Mathlib.Algebra.Field.Defs</code></p>",
        "id": 462828665,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1723828779
    },
    {
        "content": "<p>Yes, I thought it would be an easy way out. It turns out I have all the definitional relationships, but not all relationships.</p>",
        "id": 462830533,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1723829725
    },
    {
        "content": "<p>What I would like to do is to import entire Mathlib but draw only relationships between classes down of <code>LinearOrderedField</code>. Unfortunately, I don't know any easy way how to write such a script.</p>",
        "id": 462830890,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1723829917
    },
    {
        "content": "<p>I shouldn't have uploaded the second graph here, but for me, the graph of <code>LinearOrderedField</code> is still useful as it is. In a technical report I'm writing with Vladimir Kolmogorov, I want to document the definition of <code>LinearOrderedField</code> and the graph helps me to find the classes I need to document first. In fact, a graph containing only the definitional relationships (\"<code>extends</code>\") would me the most useful thing for me.</p>",
        "id": 462831530,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1723830228
    },
    {
        "content": "<p>Since I didn't find a way how to automatically filter for is-defined-using relationships only, I made the graph for <code>LinearOrderedField</code> by hand by following only the <code>extends</code> edges and ignoring all <code>FooCast</code> classes.<br>\n<a href=\"/user_uploads/3121/SdrYCaRWfrI6fYIhPeafxiCc/algebraic_hierarchy.svg\">algebraic_hierarchy.svg</a><br>\nPlease note that this graph is likely to contain mistakes, as I didn't use any software that could spot errors.</p>",
        "id": 465133477,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1724664652
    },
    {
        "content": "<p>Hi all, are the script(s) that generated the diagrams given above available somewhere?</p>",
        "id": 482704664,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1731709676
    }
]