[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/27620\">#27620</a>, I added some instances for grind's algebraic machinery. In that PR, I chose to just put the instances at the first place they could be defined.</p>\n<p><span class=\"user-mention\" data-user-id=\"240862\">@Oliver Nash</span> asked in the comments if it would be better to collect instances for <code>grind</code> in separate files. In fact, we already have some of this: the <code>Lean.Grind.Ring</code> instances are constructed in <code>Mathlib.Algebra.Ring.GrindInstances</code>. I did that one because there wasn't a natural home: it needs both</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"kn\">import</span><span class=\"w\"> </span><span class=\"n\">Mathlib</span><span class=\"bp\">.</span><span class=\"n\">Algebra</span><span class=\"bp\">.</span><span class=\"n\">Ring</span><span class=\"bp\">.</span><span class=\"n\">Defs</span>\n<span class=\"kn\">import</span><span class=\"w\"> </span><span class=\"n\">Mathlib</span><span class=\"bp\">.</span><span class=\"n\">Data</span><span class=\"bp\">.</span><span class=\"n\">Int</span><span class=\"bp\">.</span><span class=\"n\">Cast</span><span class=\"bp\">.</span><span class=\"n\">Basic</span>\n</code></pre></div>\n<p>My preference is to by default leave instances strewn about the library (perhaps with the convention that we never open namespaces to construct them, so searching for <code>Lean.Grind.</code> suffices to find them?).</p>\n<p>But I'm happy to have suggestions here (from library experts) about better practices.</p>\n<p>Note also that we are going to have <em>many</em> code blobs interacting with <code>grind</code> in future, for example just as we have positivity extensions all over Mathlib, we are likely going to have interval propagators for grind all over Mathlib. So additional costs of placement of these things needs to be weighed against a larger scale than then ~5 instances for grind we have so far.</p>",
        "id": 531950778,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1753918619
    },
    {
        "content": "<p>Thanks for raising this Kim. Thinking about this some more I can't quite tell what I prefer for now. I expect the tradeoffs to be clearer once we have more examples.</p>\n<p>It seems to me that it will be easier to collect instances than to disperse so maintaining the status quo (i.e., sprinkling instances through the library) seems like the right move for now.</p>",
        "id": 532070159,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1753967302
    }
]