[
    {
        "content": "<p>I think it makes sense to use inner product notation for integral lattices. But that notation is introduced in <code>Mathlib.Analysis.InnerProductSpace.Basic</code>. So I suggest  that we split that file. What would be a good place to put the file that introduces the inner product notation? <code>Mathlib.Algebra.Module.Inner</code>?</p>",
        "id": 433211768,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1713163386
    },
    {
        "content": "<p>Somewhat unrelated: for a while I've been thinking it would be nice to have an inner product class which provides the semilinear map, but doesn't connect it to the topology or provide a norm. In this way, we could have the natural inner product on functions <code>n \\to \\bbk</code> without ruining everything.</p>",
        "id": 433281506,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1713185145
    },
    {
        "content": "<p>With \"semilinear map\", do you mean the bilinear map?</p>",
        "id": 433297889,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1713189358
    },
    {
        "content": "<p>Or are you talking about some Hermitian thing?</p>",
        "id": 433297999,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1713189379
    },
    {
        "content": "<p>That is of course a thing to have. Especially when we'll want to study orthogonal groups and things like that, in whatever characteristic.</p>",
        "id": 433391707,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1713216907
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> I'm talking about having <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Analysis/InnerProductSpace/Basic.html#inner%E2%82%9B%E2%82%97\">innerₛₗ</a> without the topology requirement.</p>",
        "id": 433393412,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1713217650
    },
    {
        "content": "<p>so that's conjugate linear in the first coordinate and linear in the second.</p>",
        "id": 433393527,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1713217697
    },
    {
        "content": "<p>If we want the version that's bilinear instead of sesquilinear, it would be good to have different notation for it.</p>",
        "id": 433393584,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1713217731
    },
    {
        "content": "<p>I worry that this will lead to the immediate question \"why can't we have <code>norm x = inner x x</code> and keep ignoring topology\", and now we either have an instance diamond, or have just slightly moved the annoyance rather than solving it</p>",
        "id": 433393937,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1713217918
    },
    {
        "content": "<p>I don't think that fear is justified. I certainly am not asking for that, and I'm not really sure why people would want to talk about the norm without invoking the topology. That seems pretty niche. In contrast, having the inner product available (especially in bundled form) is handy.</p>",
        "id": 433420411,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1713231670
    },
    {
        "content": "<p>I worry that this will encourage new users to write <code>inner x y / norm y</code> as part of a projection in linear algebra, and will end up much more confused by the wrong norm than they would have been if <code>inner</code> were just an error</p>",
        "id": 433971569,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1713424428
    }
]