[
    {
        "content": "<p>I am in the process of cleaning up my proof for Hahn embedding theorem to make it mathlib ready. In one of the intermediate result, <a href=\"https://github.com/wwylele/HahnEmbedding/blob/main/HahnEmbedding/ArchimedeanSubgroup.lean#L149-L152\">I defined an object using <code>Exists.choose</code></a>, which morally reads weird because the satisfying object is not unique. The final theorem statement also takes the form of Exists, so in theory I could refactor this into an intermediate exists theorem (or something like a non-empty set), but everything will be more verbose (instead of saying the chosen element satisfies props, I'll need to say every such element satisfies props). What's mathlib's policy around this? Should I refactor it to avoid using <code>choose</code> for a <code>def</code>, or I don't need to bother?</p>",
        "id": 524931439,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1750357196
    },
    {
        "content": "<p>You don't need to bother, I think</p>",
        "id": 524931593,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1750357304
    },
    {
        "content": "<p>I think it's usually better to have a def and theorem of a property than a theorem proving existence, assuming you have more than one theorem about the def.</p>\n<p>This is dual to how it's usually better for theorems to take multiple parameters than to take conjunctions or existentials (that is, it's better to curry the parameters).</p>\n<p>Just please be sure to document that the def is an arbitrary choice! It can be helpful to have an explanation about just how non-unique it is too, and why it's helpful to have theory about the arbitrary choice.</p>",
        "id": 524932325,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1750357679
    },
    {
        "content": "<p>Got it!</p>",
        "id": 524932751,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1750357904
    }
]