[
    {
        "content": "<p>Hi, I am new here, so sorry if this comment is misplaced. Noticing that invariance of domain is key here, I would like to ask if there is the Jordan-Brouwer separation theorem in Mathlib Just stating it could be a good intermediate for the invariance of domain. </p>\n<p>One would also use the theorem about a continuous function defined on a compact<br>\nspace (a closed disk 𝔻ⁿ) and valued in a Hausdorff space (here ℝⁿ).</p>",
        "id": 524049228,
        "sender_full_name": "Jeremy Ravenel",
        "timestamp": 1749889024
    },
    {
        "content": "<p>Welcome! You ask a good question.<br>\nMathlib has the second result already (can't add the link right now as I'm on the phone). The Jordan curve theorem and invariance of domain would both be great to have. The \"correct\" proof of either requires the homology groups of spheres.<br>\nThis has been done in Lean 3 (by Sean Brendas Murphy, search for Brouwer's fixed point theorem on zulip). The homological algebra part has been refactored (and greatly improved) since then, so a line by line port to Lean 4 won't work as-is. Getting that work landed would be really great and a most welcome contribution, though.</p>",
        "id": 524052246,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1749892815
    },
    {
        "content": "<p>Mathlib knows about singular homology now (for details, search for a zulip thread with singular homology in the title). Proving it satisfies all the Eilenberg-Steenrod axioms would be the next step. You could use the Brouwer formalisation as an outline (writing the adapted proofs yourself).</p>",
        "id": 524052397,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1749893021
    },
    {
        "content": "<p>If that's exactly your cup of tea, I'd be happy to help you get started.</p>",
        "id": 524052436,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1749893074
    },
    {
        "content": "<p>So, long answer short: in the near term I don't think these questions affect the question in this thread (I'll move it to a new topic in a moment). That said, progress in them would be fantastic and a most welcome addition to mathlib!</p>",
        "id": 524052496,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1749893157
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> yes that would he good.</p>\n<p>Without of Mathlib, algebraic topology has Spanier-Whitehead duality and Alexander duality concerning complements of finite CW-complexes in spheres. I just learned theorem 3.1 <a href=\"https://webhomes.maths.ed.ac.uk/~v1ranick/papers/doldpup2.pdf\">here</a> today.</p>",
        "id": 524097404,
        "sender_full_name": "Jeremy Ravenel",
        "timestamp": 1749951258
    },
    {
        "content": "<p>3.6 there has the main insight: for a set X inside ℝⁿ and its complement, Y, there is a function f : X × Y → Sⁿ sending (x,y) to (x-y)/||x-y|| and it turns out to produce a dual map in reduced homology.</p>\n<p>The axioms would be a good project for me I think.</p>",
        "id": 524097968,
        "sender_full_name": "Jeremy Ravenel",
        "timestamp": 1749952119
    },
    {
        "content": "<p>For a submanifold of Sⁿ of dimension k, the normal disc bundle used in the theory of Thom classes gives a map from M × 𝔻ⁿ to Sⁿ⁻ ᵏ, which is related to the case in which M is Sⁿ⁻¹ and the normal bundle is 𝔻¹. In that theory, the complement of a normal disc bundle is \"equivalence relation fodder\" for  constructing the Thom space, which is homotopic to the pair (Sⁿ, Sⁿ - M× 𝔻ⁿ⁻ᵏ). </p>\n<p>This also has the elegant consequence that the complement of a manifold immersed in a sphere is the pullback of the special point in the Thom space, a based space (<span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> ) by the map φ  from Sⁿ into Th(M). Maybe all such complements arise in this way!</p>",
        "id": 524098747,
        "sender_full_name": "Jeremy Ravenel",
        "timestamp": 1749953260
    },
    {
        "content": "<p>8 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Fixing.20the.20definition.20of.20models.20with.20corners/with/515049529\">#mathlib4 &gt; Fixing the definition of models with corners</a> by <span class=\"user-mention silent\" data-user-id=\"634338\">Michael Rothgang</span>.</p>",
        "id": 524110893,
        "sender_full_name": "Notification Bot",
        "timestamp": 1749971966
    }
]