[
    {
        "content": "<p>I am a new lean user, interested in contributing to the Mathlib codebase. I saw that <a href=\"https://github.com/leanprover-community/mathlib4/pull/5939\">#5939</a> is marked as a good first issue. Can somebody point me towards where in the library I should look to familiarize myself with the relevant definitions, and where such a lemma would belong?</p>",
        "id": 440581788,
        "sender_full_name": "Theo Sandstrom",
        "timestamp": 1716587297
    },
    {
        "content": "<p>As a first guess, the lemma might seem to belong to <a href=\"https://github.com/leanprover-community/mathlib4/pull/5937/files#diff-d73959ba72f87f551261a21bd31a70e96d490e43d8fe85866f787b1e69aca7c4\">Mathlib/Geometry/Euclidean/Inversion/Calculus.lean</a> like the content in the PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/5937\">#5937</a> mentioned in the issue. But while working on the lemma, it may be a good idea to temporarily create a new file, so as to keep all of Mathlib's cache untouched. (By contrast if you edit an already existing file, anything depending on it would have to be built again.) The location can then be fixed once the proof is ready. And in a temporary file also you can temporarily <code>import Mathlib</code> (to be sure to have everything relevant available) and only <code>#minimize_imports</code> once you are done.</p>\n<p>As for how to familiarize yourself with the relevant definitions, I would start from somewhere (like the file above or the file <code>Mathlib.Geometry.Euclidean.Inversion.Basic</code> it imports) and read the \"module docstring\" at the top of the file. One can also \"hover\" over relevant-looking or interesting-looking terms to see their types and docstrings, and potentially \"right-click + Go to definition\" to get more details and context. But the question is very open-ended and depends a lot on what you know and are familiar with already... I recommend just playing around and asking if something specific looks puzzling.</p>",
        "id": 440584097,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1716588744
    }
]