[
    {
        "content": "<p>For actions of a group (or monoid) G on a measurable space X, there are 3 typeclasses about the measurability of the action:</p>\n<ul>\n<li><code>MeasurableConstSMul</code> : <code>x ↦ g • x</code> is measurable for each <code>g</code></li>\n<li><code>MeasurableSMul</code> : <code>x ↦ g • x</code> is measurable for each <code>g</code>, and <code>g ↦ g • x</code> measurable for each <code>x</code></li>\n<li><code>MeasurableSMul₂</code> : <code>(g, x) ↦ g • x</code> is measurable (this is strictly stronger than <code>MeasurableSMul</code>)</li>\n</ul>\n<p>The first doesn't require a measurable-space structure on <code>G</code>, only on <code>X</code>, while the other two require measurable-space structures on both.</p>\n<p>While experimenting with how to define the SL2R-invariant measure on the upper half-plane, I realised that for something like 90% of the theorems in Mathlib that had <code>MeasurableSMul</code> as hypothesis, the measurability in <code>g</code> isn't needed and the theorems worked fine with <code>MeasurableConstSMul</code> (avoiding the necessity of fixing a measurable-space structure on <code>G</code>). This modification is in PRs <a href=\"https://github.com/leanprover-community/mathlib4/pull/33659\">#33659</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/33710\">#33710</a>; thanks <span class=\"user-mention\" data-user-id=\"350992\">@Rémy Degenne</span> for the quick review on those.</p>\n<p>This makes me wonder: is <code>MeasurableSMul</code> actually needed at all? Perhaps it might be simpler to get rid of the existing <code>MeasurableSMul</code> and re-name what's currently called <code>MeasurableSMul₂</code> to <code>MeasurableSMul</code>. This would be consistent with the existing <code>ContinuousSMul</code> (which asserts joint continuity <code>G × X → X</code>, not continuity in either argument separately). Any thoughts?</p>",
        "id": 566719599,
        "sender_full_name": "David Loeffler",
        "timestamp": 1767787532
    },
    {
        "content": "<p>If I remember correctly, there is one result somewhere in Mathlib that uses <code>MeasurableSMul</code> becauses it wants the second condition in that typeclass (but not the first), but we don't have a <code>MeasurableSMulConst</code>. Now I need to remember which result that was.<br>\nThat does not answer your questions at all, but that's related.</p>",
        "id": 566720392,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1767787789
    },
    {
        "content": "<p>I guess that would be <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Measurable.smul_const#doc\">docs#Measurable.smul_const</a> (and its cousin <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=AEMeasurable.smul_const#doc\">docs#AEMeasurable.smul_const</a>)</p>",
        "id": 566720728,
        "sender_full_name": "David Loeffler",
        "timestamp": 1767787915
    },
    {
        "content": "<p>Right, there is that one. I was thinking about another, but it's possibly just because it's using this.</p>",
        "id": 566720963,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1767788009
    },
    {
        "content": "<p><code>MeasurableConstSMul</code> was probably introduced much later, FWIW</p>",
        "id": 566723829,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1767789171
    },
    {
        "content": "<p>I think I may have found out the answer to my question, after having a go at replacing <code>MeasurableSMul</code> instances with <code>MeasurableSMul₂</code>.</p>\n<p>If <code>G</code>, <code>X</code> are topological spaces satisfying <code>ContinuousSMul G X</code>, and we give both of them the Borel measurable-space structure, then <code>MeasurableSMul</code> is automatic; but <code>MeasurableSMul₂</code> isn't -- it needs an additional assumption, that one of <code>G, X</code> be second-countable, in order to ensure that the product measurable-space structure on <code>G × X</code> is Borel. </p>\n<p>So I guess that's a good reason for keeping the existing <code>MeasurableSMul</code>. Sorry for the noise!</p>",
        "id": 566725892,
        "sender_full_name": "David Loeffler",
        "timestamp": 1767789915
    },
    {
        "content": "<p>We even have a typeclass for \"either G or X is second countable\", which I found to my surprise a few months ago :-)</p>",
        "id": 566732577,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1767792139
    }
]