[
    {
        "content": "<p>In a discussion thread about how things should be named in automata theory, <span class=\"user-mention\" data-user-id=\"466334\">@Shreyas Srinivas</span>  made the following claim:</p>\n<p><a class=\"message-link\" href=\"/#narrow/channel/513188-CSLib/topic/Automata/near/542724886\">#CSLib &gt; Automata @ 💬</a> </p>\n<p>Is it true?  I would appreciate some clarifications.  I've always had the impression that mathlib wants to be all-encompassing and theoretical computer science is surely part of mathematics.</p>\n<p>CC:  <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span> , <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> , <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> , <span class=\"user-mention\" data-user-id=\"112857\">@Leonardo de Moura</span> , <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span></p>",
        "id": 542792339,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1759424923
    },
    {
        "content": "<p>Example : <a class=\"message-link\" href=\"/#narrow/channel/287929-mathlib4/topic/Labelled.20Transition.20Systems.20.28LTS.29/near/524378060\">#mathlib4 &gt; Labelled Transition Systems (LTS) @ 💬</a> And you might also want to scroll down that thread to the last messages.</p>",
        "id": 542792841,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1759425083
    },
    {
        "content": "<p>More concrete example : <a class=\"message-link\" href=\"/#narrow/channel/516743-computer-science/topic/Automata.20theory.20in.20Lean4/near/531956972\">#computer science &gt; Automata theory in Lean4 @ 💬</a></p>",
        "id": 542794444,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1759425575
    },
    {
        "content": "<p>I feel certain parts of the computability folder could reasonably move to cslib, specifically things about automata. but concepts like recursive functions and degree theory sit firmly in mathematics imo (people that work in these areas are exclusively housed in mathematics departments from what I have seen). But agreed with <span class=\"user-mention\" data-user-id=\"466334\">@Shreyas Srinivas</span> that the boundaries are fuzzy.</p>",
        "id": 542795739,
        "sender_full_name": "Tanner Duve",
        "timestamp": 1759425998
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"677310\">@Tanner Duve</span>  I would appreciate an articulation of the philosophical rationale behind this distinction.  Note that automata theory was invented by mathematical logicians to answer questions in logic and computability.  For example, consider the following seminal paper:<br>\n<a href=\"/user_uploads/3121/SHrSnB1Zi3k99KpKqKrUSEjm/Rabin-and-Scott-Finite_Automata_and_Their_Decision_Problems.pdf\">Rabin and Scott - Finite_Automata_and_Their_Decision_Problems.pdf</a></p>",
        "id": 542797085,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1759426474
    },
    {
        "content": "<p>Or this one:<br>\n<a href=\"/user_uploads/3121/xK9ozMb7aZypR4_WpqJP5TKM/Buchi-On-a-decision-method-in-restricted-second-order-arithmetic.pdf\">Büchi - On a decision method in restricted second order arithmetic.pdf</a></p>",
        "id": 542797424,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1759426621
    },
    {
        "content": "<p>It's true that formal models of computation have their roots in logic and foundations. I more so meant one could sensibly argue for automata theory today as being a \"CS topic\", since it's used in things like model checking and verification, automata learning, etc. (and taught to CS undergrads) I don't as much see classical recursion theory or degree theory as CS since from what I understand this kind of work is primarily done by logic people in math departments. Just my two cents though. In any case, computability isn't really on or related to anything on the <a href=\"https://github.com/leanprover-community/mathlib4?tab=readme-ov-file#maintainers\">list of mathematical interests of the mathlib maintainers</a>, which is something else to consider. I PR'd some basic stuff about Turing degrees that took a while to merge for this reason.</p>",
        "id": 542801345,
        "sender_full_name": "Tanner Duve",
        "timestamp": 1759428034
    },
    {
        "content": "<p>But I'm now realizing this discussion was already had and this post was made for the maintainers to clarify</p>",
        "id": 542803023,
        "sender_full_name": "Tanner Duve",
        "timestamp": 1759428611
    },
    {
        "content": "<p>Please try to avoid tagging a long list of people that are likely very busy. </p>\n<p>To address the question: to me, this is a practical issue of the effective scopes of the respective libraries, not history of the field. My thought process (as a CSLib maintainer) is that anything of a CS flavor and likely to always stay in a leaf of the Mathlib import graph could <em>possibly</em>, with  agreement of both libraries, be considered to move downstream.</p>\n<p>As to the specific case of automata mentioned in the title, my suggestion was essentially Kim's that is linked. In CSLib, add the desired implementation of automata, then see if the existing code in Mathlib can be ported. If so, it seems to meet the criteria I listed.</p>",
        "id": 542803320,
        "sender_full_name": "Chris Henson",
        "timestamp": 1759428712
    },
    {
        "content": "<p>Personally I want to see a clear policy statement from the mathlib community about their vision of the scope and ambition of mathlib.  That's why I copied my query to some leaders of the community.</p>\n<p>Whether a theory is a leaf node in mathlib can change over time.  Some time ago I saw the following talks on YouTube:<br>\n<a href=\"https://www.fields.utoronto.ca/talks/Fractal-Dimensions-and-Büchi-Automata\">https://www.fields.utoronto.ca/talks/Fractal-Dimensions-and-Büchi-Automata</a><br>\n<a href=\"https://www.fields.utoronto.ca/talks/Definability-Reals-Büchi-Automata\">https://www.fields.utoronto.ca/talks/Definability-Reals-Büchi-Automata</a><br>\nIf I were to formalize such theories and add them to mathlib, then automata theory would not be leaf nodes anymore, would they?  Do you consider such theories \"mathematics\" or \"computer science\"?  Furthermore, if some leaf theories are removed, other theories may become new leaves.  Do you keep going?</p>",
        "id": 542809482,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1759430781
    },
    {
        "content": "<p>Yes, there is change over time and a bit of social convention. I also am using \"leaf\" loosely and in comparison to Mathlib as a whole, say at roughly a module/directory level.</p>",
        "id": 542812173,
        "sender_full_name": "Chris Henson",
        "timestamp": 1759431722
    },
    {
        "content": "<p>The main limit on the scope of mathlib is, practically speaking, the availability of maintainers who can review incoming material.</p>",
        "id": 542816118,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1759433170
    },
    {
        "content": "<p>Historically, theoretical computer science has been well supported in languages other than lean/libraries other than mathlib, and mathlib specifically built itself as a sort of reaction to that. As a consequence, we now have an imbalance of maintaining/reviewing capacity away from computer science and it therefore seems very reasonable to move some computability theory out of mathlib and into a library with more suited maintainers.</p>",
        "id": 542818315,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1759433998
    },
    {
        "content": "<p>Regarding your example about Büchi automata and definable reals: Bringing niche topics back to the central table of mathematics within the paper literature takes time, much more time than it takes to move content between two Lean libraries. I think this is a non-issue</p>",
        "id": 542818608,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1759434142
    },
    {
        "content": "<p>Why do you think splitting into a separate library will improve the maintaining/reviewing capacity?  Can't you recruit cslib reviewers to review mathlib PRs?</p>\n<p>And do you consider cslib to be a staging area for mathlib, so that contents in the former will eventually make their way into the latter?  Or they will go their separate ways?</p>\n<p>Finally, what do you consider to be the central part of mathematics?  Does logic belong to that central part?  Should (say) proof theory be put in mathlib or cslib?  I'd appreciate a clear specification of the demarcation.</p>",
        "id": 542822938,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1759435738
    },
    {
        "content": "<p>I understand that you want clarity, but I am afraid there is no clear cut answer, only a heuristic : If something is studied largely in a CS department, and its publication venues are CS venues, then it probably goes to CSLib. Same for math. Proof theory might go to either with a <del>slight</del> substantial bias towards CSLib</p>",
        "id": 542823229,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1759435841
    },
    {
        "content": "<p>How about as a rule of thumb, if something is used in solving one of Hilbert's problems it should go in Mathlib. Therefore (because of the 10th problem) basic computability theory goes in Mathlib.</p>",
        "id": 542838211,
        "sender_full_name": "Bjørn Kjos-Hanssen",
        "timestamp": 1759443413
    },
    {
        "content": "<p>The decision rests with maintainers but I don’t see this  as a viable criterion. Far too much of modern CS theory came out of Hilbert’s problems. Maybe it’s just easier to ask mathlib maintainers in each individual instance, since mathlib is the upstream library.</p>",
        "id": 542838391,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1759443516
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110637\">Ching-Tsun Chou</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/542822938\">said</a>:</p>\n<blockquote>\n<p>Finally, what do you consider to be the central part of mathematics?  Does logic belong to that central part?  Should (say) proof theory be put in mathlib or cslib?  I'd appreciate a clear specification of the demarcation.</p>\n</blockquote>\n<p>This is a delicate question and different maintainers have different opinions. There is no clear specification of what is or isn't suitable for mathlib, and attempts to make one in the past have just resulted in the realisation that different maintainers can have very different ideas about the answer. There are around 30 maintainers with quite different backgrounds and interests, so although you've made it quite clear that you are looking for precise rules, in practice this seems to be difficult to achieve.</p>",
        "id": 542840895,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1759444963
    },
    {
        "content": "<p>This ambiguity was precisely why I asked the question.  But even leaving that question aside, no one has addressed my other questions:</p>\n<blockquote>\n<p>Why do you think splitting into a separate library will improve the maintaining/reviewing capacity? Can't you recruit cslib reviewers to review mathlib PRs?</p>\n<p>And do you consider cslib to be a staging area for mathlib, so that contents in the former will eventually make their way into the latter? Or they will go their separate ways?</p>\n</blockquote>",
        "id": 542844193,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1759446443
    },
    {
        "content": "<p>I love your optimism, but if you think that there is just a way that the mathlib maintainers can just magically make reviewers appear out of nowhere and review all our PRs then please explain how to make this happen, because right now the fact is that we have 2000 open PRs with more appearing every day. Reality is far more difficult than your mental model of the problem.</p>",
        "id": 542844670,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1759446691
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110637\">Ching-Tsun Chou</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/542844193\">said</a>:</p>\n<blockquote>\n<p>This ambiguity was precisely why I asked the question.  But even leaving that question aside, no one has addressed my other questions:</p>\n<blockquote>\n<p>Why do you think splitting into a separate library will improve the maintaining/reviewing capacity? Can't you recruit cslib reviewers to review mathlib PRs?</p>\n<p>And do you consider cslib to be a staging area for mathlib, so that contents in the former will eventually make their way into the latter? Or they will go their separate ways?<br>\n</p>\n</blockquote>\n</blockquote>\n<p>CSLib exists among other things to serve the formalisation goals of CS teachers and researchers. To answer one of your questions: no it’s probably not going to serve as a staging area for mathlib. At least, no such intention has been expressed by the project steering committee or maintainers so far. CS works very differently from math.</p>",
        "id": 542845932,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1759447529
    },
    {
        "content": "<p>Is there a website that tells us who are the project steering committee members and maintainers of cslib?</p>",
        "id": 542846228,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1759447759
    },
    {
        "content": "<p>Namely, something like this: <a href=\"https://leanprover-community.github.io/teams.html\">https://leanprover-community.github.io/teams.html</a></p>",
        "id": 542846353,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1759447837
    },
    {
        "content": "<p>As of now there is the google docs presentation from the initial meetings and the Zulip messages from some leaders on the CSLib channel. You are looking at a project in an extremely early stage.</p>",
        "id": 542846366,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1759447846
    },
    {
        "content": "<p>I was in that meeting.  In fact, I attended both occurrences.  As far as I can recall, the only thing that happened was some Amazon people announced what they wanted to do, most of which don't seem to have appeared in <a href=\"https://github.com/leanprover/cslib\">https://github.com/leanprover/cslib</a> yet.  I don't recall there were any announcement of a steering committee or maintainers.  If I have missed the announcements, please provide us with the URLs.</p>",
        "id": 542846871,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1759448182
    },
    {
        "content": "<p>I completely agree with Kevin, but will attempt to answer your questions as much as possible:</p>\n<p>1) Of course splitting does not by default increase the number of reviewers, but it helps to have a designated area for CS-related work. I personally think this fills a need that has existed for a while, and hope it will relieve a (very small) bit of burden from Mathlib reviewers.</p>\n<p>2) As I have mentioned previously, I have already made a couple of small PRs to Mathlib that originated in CSLib. The reverse has also happened, where a PR in Mathlib was determined to be a better fit for CSlib. In general though no, calling it a \"staging area\" for Mathlib is inaccurate. We are downstream and use certain infrastructure, but core results will remain in CSLib. While we have been discussing topics in a fuzzy area, there is certainly much work that is unambiguously CS and whose terminal destination is CSLib. There's an entire body of work about imperative verification not yet released publicly yet, as Shreyas said this is the project in an early state.</p>\n<p>3) There is a description in the repo that lists the current steering committee/maintainers: <a href=\"https://github.com/leanprover/cslib/blob/main/GOVERNANCE.md\">https://github.com/leanprover/cslib/blob/main/GOVERNANCE.md</a></p>",
        "id": 542847141,
        "sender_full_name": "Chris Henson",
        "timestamp": 1759448381
    },
    {
        "content": "<p>Keeping in mind what Kevin said that there are disagreements among the maintainers and I am representing only my own opinion: cslib is not a mathlib initiative; it was not started by mathlib maintainers and it is not hosted under leanprover-community (despite my urging). The scope of cslib is up to the maintainers of cslib, and contributors are free to contribute material to cslib or mathlib as they please. At the moment, they clearly have a nonempty intersection of possible coverage areas, and this isn't likely to change anytime soon. It's best to just decide where to put stuff pragmatically based on where you will get the best reviews.</p>",
        "id": 542859267,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1759459255
    },
    {
        "content": "<p>Mathlib currently has no policy of moving things to cslib in any systematic fashion. Which is to say: the answer to the title question is no, there is no plan to move Mathlib.Computability to CSLib. Maybe you wanted to propose such a plan, but right now that plan does not exist. I would likely be against it for the time being, citing concerns about maintainership and the uncertain future of cslib.</p>",
        "id": 542859314,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1759459312
    },
    {
        "content": "<p>I suppose I should also clarify that these are my own opinions as a individual maintainer of this new project. As indicated in the maintainer list, I am primarily reviewing and working on lambda calculi formalizations and just happened to see this thread.</p>\n<p>I will note regarding hosting that it is correct that we are not under <code>leanprover-community</code>, but we are under <code>leanprover</code>.</p>",
        "id": 542860250,
        "sender_full_name": "Chris Henson",
        "timestamp": 1759460420
    },
    {
        "content": "<p>indeed, and these are separate organizations (the FRO vs mathlib + MI)</p>",
        "id": 542860370,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1759460510
    },
    {
        "content": "<p>I think it would have been better to have cslib under the leanprover-community umbrella, but it was initiated by a group that seemed to have ties to Leo so I understand how it ended up in leanprover</p>",
        "id": 542860463,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1759460603
    },
    {
        "content": "<p>because of this (both the fact that mathlib and cslib maintainers have empty intersection AFAIK and that they are in separate umbrella orgs), transferring material from one repo to another is actually changing \"owners\", which complicates matters and makes it more than just moving things to another folder for topic coherence reasons</p>",
        "id": 542860779,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1759460921
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110637\">Ching-Tsun Chou</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/542822938\">said</a>:</p>\n<blockquote>\n<p>Why do you think splitting into a separate library will improve the maintaining/reviewing capacity?  Can't you recruit cslib reviewers to review mathlib PRs?</p>\n</blockquote>\n<p>Reviewing mathlib PRs is hard and it is not clear to me that training cslib reviewers to do that job is any more efficient than just letting them run their own thing</p>",
        "id": 542870048,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1759468961
    },
    {
        "content": "<p>I want to point out that I was answering in the context of whether CSLib should assume some latitude in defining automata. I did not speak of any plan to move computability from mathlib, just that maintainers seem to lean in the direction (see examples provided).  I am clarifying this since I am quoted in the message that started this whole thread. There is a mismatch between the title and the leading message.</p>",
        "id": 542893802,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1759479988
    },
    {
        "content": "<p>PS <span class=\"user-mention\" data-user-id=\"110637\">@Ching-Tsun Chou</span> I do think you are asking good and important questions, and I'm glad you're asking them. My answers are an attempt to demonstrate that in practice these questions are very complicated to answer. Questions such as \"what is in scope for mathlib\" have of course been asked several times before; it's just that all attempts to \"officially\" answer them have failed, basically because it is hard to get 30 people to agree on something.</p>",
        "id": 542907758,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1759484753
    },
    {
        "content": "<p>Thanks to all who commented.  It is good to know where everyone stands.</p>",
        "id": 543014767,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1759519143
    },
    {
        "content": "<p>I'm not a Mathlib maintainer, but my own view has always been that Mathlib should be cross-disciplinary. Not in the sense that every single discipline should be crammed into it, but rather that all the different disciplines within it should complement each other.</p>",
        "id": 543047521,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1759540574
    },
    {
        "content": "<p>Game theory was considered too niche to ever be used elsewhere, so it was split up (into yet another repository outside of the leanprover-community umbrella). Maybe computational theory fits that same description?</p>",
        "id": 543047578,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1759540610
    },
    {
        "content": "<p><span aria-label=\"fire\" class=\"emoji emoji-1f525\" role=\"img\" title=\"fire\">:fire:</span> maybe category theory fits that description too? I've seldom seen a non-category theory file importing a category theory one.</p>",
        "id": 543047704,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1759540732
    },
    {
        "content": "<p>AG imports CT all the time</p>",
        "id": 543047881,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1759540909
    },
    {
        "content": "<p>if the heuristic is \"imported by another\" then model theory is looking</p>",
        "id": 543047915,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1759540947
    },
    {
        "content": "<p>Do we have Ax-Grothendieck in Mathlib? (and if so, do we actually prove it via model theory?)</p>",
        "id": 543048134,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1759541136
    },
    {
        "content": "<p>I feel like a model theory project is something that could totally exist if there was more interest in it.</p>",
        "id": 543048151,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1759541155
    },
    {
        "content": "<p>O-minimality in model theory has recently had some spectacular applications in arithmetic geometry (I think due to Jonathan Pila and collaborators), and I recall (learning from zulip in fact!) some recent work linking game theory and Harder-Narasimhan theory in algebraic geometry, which has in fact been formalized in Lean. And for computability theory, the resolution of Hilbert's tenth problem comes to mind.</p>",
        "id": 543061846,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1759557075
    },
    {
        "content": "<p>My personal take is that while practical considerations should rightfully take precedence for now, I think we should still keep a view towards unity in the long run. Algebraic geometry in mathlib imports all sorts of things from RingTheory to Geometry to Topology to CategoryTheory, I can't imagine if the community had started out with separate libraries for all of those.</p>",
        "id": 543061869,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1759557117
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/543048134\">said</a>:</p>\n<blockquote>\n<p>Do we have Ax-Grothendieck in Mathlib? (and if so, do we actually prove it via model theory?)</p>\n</blockquote>\n<p>I think there's <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/FieldTheory/AxGrothendieck.html\">FieldTheory.AxGrothendieck</a> and I think it does use model theory (but I don't know the details)</p>",
        "id": 543062238,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1759557578
    },
    {
        "content": "<p>My understanding (not a maintainer, so no inside knowledge) is that moving combinatorial game theory to a separate repository already follows from practical considerations (no maintainers with the relevant expertise). If that changes and it is suddenly needed for other mathematics clearly in scope for mathlib, I wouldn't be surprised by it moving back.</p>",
        "id": 543107114,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1759601583
    },
    {
        "content": "<p>To propose an alternative: Is there some merit to the idea of copying the computability content from Mathlib without removing it, and simply not importing that part of the library. This would alleviate the issue of lots of Mathlib content disappearing all at once, and perhaps it would be possible due to the new module system. It might also allow us to make changes to the developments that make them better suited to other content in each library.</p>",
        "id": 563280034,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1765485997
    },
    {
        "content": "<p>Please don't :)</p>",
        "id": 563282078,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1765486859
    },
    {
        "content": "<p>I guess for some context, I have wanted to start putting some basic complexity theory into cslib (<a class=\"message-link\" href=\"/#narrow/channel/513188-CSLib/topic/Complexity.20Theory.20in.20CSLib/near/560226850\">#CSLib &gt; Complexity Theory in CSLib @ 💬</a> ), and I am currently wondering where I would put the theorem that a composition of polynomial time functions is itself polynomial time. On the one hand, this feels like this is starting to get into classic topics from undergrad CS and it really feels more appropriate for CSLib than Mathlib. On the other hand, it feels strange that this theorem would go in a different file, let alone a different repository, from the theorem that says that the identity function is polytime computable. What do people think would be the best way for me to proceed with this development?</p>",
        "id": 563286597,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1765488910
    },
    {
        "content": "<p>if it can be expressed using the computability library, feel free to PR it to mathlib</p>",
        "id": 563286720,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765488965
    },
    {
        "content": "<p>if you want to commit it to cslib you can do that too. It's just a question of which maintainers you want to review it</p>",
        "id": 563286838,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765489012
    },
    {
        "content": "<p>You could also propose moving entire files from Mathlib to Cslib.</p>\n<p>My understanding is that we don't currently have a good deprecation mechanism for moving individual declarations downstream (because you'd have to leave a deprecation message upstream, that would then cause a collision downstream), but we <em>do</em> have a good mechanism for deprecating entire files in a way that doesn't cause a problem downstream (and allows for including a message pointing to the downstream library).</p>\n<p>I would love to have some suggestions for how to orchestrate moving individual declarations into downstream libraries, leaving appropriate deprecations for users.</p>",
        "id": 563288104,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1765489520
    },
    {
        "content": "<p>Well, it seems <span class=\"user-mention\" data-user-id=\"307953\">@Ruben Van de Velde</span> thinks that we shouldn't duplicate code across repositories. I suppose I share concerns about that, such as the possibility that if the repositories have the same names for the same or similar concepts, then it will become difficult to simultaneously import both mathlib and cslib in further downstream repositories.</p>\n<p>I think in the long term, it would be nice to validate the models of computation that CSLib will specify by proving that their notion of polynomial time is equivalent to the Turing machine notion, and so if I had my druthers I might say that <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=TM2ComputableInTime#doc\">docs#TM2ComputableInTime</a> is about where I would start preferring content be moved. This is ~100 lines in a leaf file anyway, and I think it would be hard to find concepts downstream of this definition that are are not \"CS\" concepts.</p>",
        "id": 563293984,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1765492297
    },
    {
        "content": "<p>you can just put the things in different namespaces to avoid the name clash issues with duplication</p>",
        "id": 563294047,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765492332
    },
    {
        "content": "<p>obviously duplication is tech debt and shouldn't be encouraged per se, but short term duplication is okay as a means to grease the wheels while something is going through review</p>",
        "id": 563294102,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765492367
    },
    {
        "content": "<p>Just to cross-link, in case not everyone here saw it: <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Move.20automata.20theory.20in.20mathlib.20to.20CSLib.3F/with/563273770\">#mathlib4 &gt; Move automata theory in mathlib to CSLib?</a></p>",
        "id": 563294854,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1765492751
    },
    {
        "content": "<p>i'd like to note my worry that if too much computability theory moves to CSlib, we maybe won't have the definitions in mathlib for computability/realizability topoi... I'm not knowledgeable about the exact definitions required for these (yet, maybe in a year or two) but i do suspect that this ought to be possible to have in mathlib...</p>",
        "id": 563296432,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1765493521
    },
    {
        "content": "<p>perhaps someone more knowledgeable on the topic can comment exactly what parts of computability theory are necessary for these?</p>",
        "id": 563296560,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1765493590
    },
    {
        "content": "<p>I think we shouldn't move anything out of mathlib computability ATM; everything which is there is already in scope and \"being more CS than math\" is not for me sufficient reason to not have it in mathlib</p>",
        "id": 563296562,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765493591
    },
    {
        "content": "<p>this is kind of a branding issue caused by having a project called \"cslib\" which implies this is where the line should be drawn but I don't subscribe to it</p>",
        "id": 563296648,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765493649
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"684366\">Edward van de Meent</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563296432\">said</a>:</p>\n<blockquote>\n<p>we maybe won't have the definitions in mathlib for computability/realizability topoi</p>\n</blockquote>\n<p>Can Mathlib perhaps depend on CSLib? As long as there is no import cycle between the two, can two projects depend on each other?</p>",
        "id": 563296662,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1765493659
    },
    {
        "content": "<p>no that's not possible</p>",
        "id": 563296684,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765493673
    },
    {
        "content": "<p>Is it possible to make it possible?</p>",
        "id": 563296707,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1765493685
    },
    {
        "content": "<p>ask <span class=\"user-mention\" data-user-id=\"315577\">@Mac Malone</span></p>",
        "id": 563296719,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765493694
    },
    {
        "content": "<p>CSLib ought to retain some latitude in including definitions for the same things as mathlib but which are more convenient in CS</p>",
        "id": 563296787,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1765493731
    },
    {
        "content": "<p>Although I agree that the very branding of CSLib as “the” computer science library is going to be a source of some trouble.</p>",
        "id": 563296912,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1765493804
    },
    {
        "content": "<p>I think more than \"being more CS than math\" the issue might be that there's quite low reviewer capacity for this part of mathlib</p>",
        "id": 563299418,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1765495460
    },
    {
        "content": "<p>Gone through the thread. A few comments for the sake of clarity:</p>\n<ul>\n<li>\n<p>What I'm discussing in <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Move.20automata.20theory.20in.20mathlib.20to.20CSLib.3F/with/563322017\">#mathlib4 &gt; Move automata theory in mathlib to CSLib?</a> is moving automata <em>only</em> for now. The reason is technical: the way we formulate automata in cslib depends (for good reasons) on things that (for good reasons) were deemed out of scope for mathlib and instead sit very nicely in cslib. I'd like to unify APIs/naming, prevent tech debt, and avoid people doing duplicated work as much as possible.</p>\n</li>\n<li>\n<p>The rest of computability in mathlib is another matter. Some parts maybe should never get out of mathlib, or at the very least require much more planning. I believe we should analyse each case carefully -- also, the situation might evolve over time.</p>\n</li>\n</ul>",
        "id": 563480796,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1765547966
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563296912\">said</a>:</p>\n<blockquote>\n<p>Although I agree that the very branding of CSLib as “the” computer science library is going to be a source of some trouble.</p>\n</blockquote>\n<p>I certain don't make the claim that all computer science has to happen in CSLib, just as all math does not have to happen in Mathlib. As an example, my involvement in CSLib started because I wanted to formalize categorical semantics, and along the way required lambda calculi. I think it is nice to have some of this in an \"official\" location, and in the nearish future I plan to provide tooling that will allow users downstream of CSLib to more easily make their own lambda calculi formalizaitons.</p>",
        "id": 563485974,
        "sender_full_name": "Chris Henson",
        "timestamp": 1765549483
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"933054\">Snir Broshi</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563296662\">said</a>:</p>\n<blockquote>\n<p>Can Mathlib perhaps depend on CSLib? As long as there is no import cycle between the two, can two projects depend on each other?</p>\n</blockquote>\n<p>This is something that could be supported in the future. It is very similar to the notion of a  \"peer\" dependency in other package managers. If this is something CSLib decides it needs to do, that would be a good motivation to implement this. However, without such a motivater, this would not currently be a prioritized feature.</p>",
        "id": 563510400,
        "sender_full_name": "Mac Malone",
        "timestamp": 1765555778
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563299418\">said</a>:</p>\n<blockquote>\n<p>I think more than \"being more CS than math\" the issue might be that there's quite low reviewer capacity for this part of mathlib</p>\n</blockquote>\n<p>Maybe it's worth emphasizing that it is totally reasonable (and encouraged) for cslib contributors to review mathlib PRs; mathlib maintainers and reviewers are not the only people capable of leaving feedback, and if we see approval from a subject expert then that gets things very close to a merge</p>",
        "id": 563518495,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1765557862
    },
    {
        "content": "<p>(of course we can't expect cslib contributors to watch the PR list, but if a cslib PR depends on a mathlib one they you shouldn't feel powerless to help it move along)</p>",
        "id": 563518806,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1765557955
    },
    {
        "content": "<p>Fully agreed, and I've seen people doing that already.</p>\n<p>It doesn't help the case of automata much, unfortunately (which is the topic of the thread I opened), because it's not a case of 'we're missing features from mathlib' (which we already have a way to deal with).</p>",
        "id": 563539465,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1765564491
    },
    {
        "content": "<p>which thread?</p>",
        "id": 563539549,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765564525
    },
    {
        "content": "<p>The one linked here <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563480796\">https://leanprover.zulipchat.com/#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563480796</a></p>\n<p>(The mobile interface is giving me some trouble with copying the link directly, sorry.)</p>",
        "id": 563539677,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1765564580
    },
    {
        "content": "<p>I wonder if it is possible to carve out a subtree of mathlib to become cslib, which will be controlled by the current CSLib personnels.  Here by \"control\" I mean the decisions of what code gets into that subtree.  Then there is no issue of whether mathlib and cslib can refer to each other and solves the \"who can review the code?\" problem.</p>",
        "id": 563543305,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1765566107
    },
    {
        "content": "<p>I have been in support for a while now of having domain-specific maintainers as a means of getting mathlib past its current organizational bottleneck. I think what you are proposing is certainly possible, but I would phrase it more as cslib maintainers becoming mathlib maintainers specializing for that subfolder</p>",
        "id": 563543710,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765566266
    },
    {
        "content": "<p>there is nothing stopping people from having multiple hats</p>",
        "id": 563543758,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765566285
    },
    {
        "content": "<p>Nobody disagrees with that but it doesn't solve the problem that we'd like to use some of cslib's APIs in the design of automata theory (and more).<br>\nCslib is also gonna be a more natural place to have probabilistic and weighted automata and the like, because they are instances of the respective transition system generalisations (which we'd certainly develop once we get to this kind of machines).<br>\nMore of such examples will likely pop up.</p>",
        "id": 563544145,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1765566440
    },
    {
        "content": "<p>I think if people were on board with the general plan it wouldn't be that hard to get cslib maintainers to first review a lot of cs-related mathlib PRs and then graduate to being a full mathlib maintainer. The mathlib maintainer team has long recognized that we lack expertise and review bandwidth for cs topics so I think that would work out well</p>",
        "id": 563544225,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765566471
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"929508\">@Fabrizio Montesi</span> You might need to be more specific about that, but I think the answer is that you should either upstream this \"cslib API\" to mathlib or else create a compatible API which cslib can build on</p>",
        "id": 563544428,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765566551
    },
    {
        "content": "<p>That has been discussed at length and LTS were deemed out of scope.</p>",
        "id": 563544457,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1765566564
    },
    {
        "content": "<p>okay so leave LTS out of it</p>",
        "id": 563544492,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765566580
    },
    {
        "content": "<p>Our def of NFA extends LTS. :⁠-⁠)</p>",
        "id": 563544538,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1765566596
    },
    {
        "content": "<p>Eh, that sounds like a reason to have them in mathlib</p>",
        "id": 563544616,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765566628
    },
    {
        "content": "<p>maybe not the full theory but the bare definition</p>",
        "id": 563544666,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765566642
    },
    {
        "content": "<p>A big chunk of the theory is necessary to prove stuff about nfa elegantly</p>",
        "id": 563544750,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1765566669
    },
    {
        "content": "<p>(but not necessary to do it in general, ofc)</p>",
        "id": 563544773,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1765566680
    },
    {
        "content": "<p>then that's also a reason for inclusion for that</p>",
        "id": 563544790,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765566686
    },
    {
        "content": "<p>like, if you need it to do something in mathlib then that on its own is a cogent justification for inclusion in mathlib</p>",
        "id": 563544860,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765566717
    },
    {
        "content": "<p>That's a possible viewpoint, ofc. The other is that automata could just be in cslib.<br>\nI'm fine either way. I was the one originally proposing LTS for mathlib, but there was no interest.</p>\n<p>But why is it so important to have automata in mathlib?</p>",
        "id": 563545182,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1765566850
    },
    {
        "content": "<p>The point is that we need people, not definitions and proofs</p>",
        "id": 563545528,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765567003
    },
    {
        "content": "<p>I am personally of the opinion that all theoretical CS is in scope of mathlib, but we need more people to join the review and maintainer teams</p>",
        "id": 563545691,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765567067
    },
    {
        "content": "<p>having a separate library is and always was a backup plan for the case where the review capacity doesn't appear in time for your personal roadmap</p>",
        "id": 563545973,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765567181
    },
    {
        "content": "<p>There are other mathlib maintainers that will of course disagree with me, but they are not subject matter experts on this material. That's <em>why</em> we need more subgroupings of mathlib with their own smaller teams.</p>",
        "id": 563546524,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765567393
    },
    {
        "content": "<p>I agree with Mario but I don’t know how mathlib maintainers are recruited for an area that doesn’t exist in mathlib yet.</p>",
        "id": 563547234,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1765567641
    },
    {
        "content": "<p>the folder already exists</p>",
        "id": 563547281,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765567655
    },
    {
        "content": "<p>that's the whole reason we're having this discussion</p>",
        "id": 563547319,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765567672
    },
    {
        "content": "<p>if it was a completely disjoint topic split I don't think it would be an issue</p>",
        "id": 563547388,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765567698
    },
    {
        "content": "<p>but that almost never happens in mathlib, it's very interconnected and even if there are currently no or almost no connections you can find a few people who have ideas and/or plans which would use area X to contribute to area Y</p>",
        "id": 563547733,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765567833
    },
    {
        "content": "<p>I mean the content in computability is not substantial compared to what CSLib is aiming for.  Also the name is computability which is already limited in scope.</p>",
        "id": 563548888,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1765568370
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"929508\">Fabrizio Montesi</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563545182\">said</a>:</p>\n<blockquote>\n<p>But why is it so important to have automata in mathlib?</p>\n</blockquote>\n<p>Mathematicians prove theorems about automatic groups (for example all mapping class groups of surfaces are automatic) and I would very much hope to be able to state those theorems going forwards, but the definition which I know of automatic groups needs e.g. regular languages and finite state automata. However it would be fine just to have basic definitions in mathlib as far as I'm concerned.</p>",
        "id": 563550683,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765569115
    },
    {
        "content": "<p>For the record, I think alike on lots of things you wrote, Mario. (And when it was pointed out for LTS that mathlib didn't have good reviewers for that, I offered myself.)<br>\nIn general, one could have this discussion for many of the things currently or soon to be in the 'Foundations' and 'Languages' directories of cslib.</p>\n<p>It's not just one directory though, unless you mean that LTS and their equivalences (like bisimilarity) should live under 'Computability'. We'd need to open up mathlib to semantics, maybe more..<br>\nSo it's more of an area(s) maintainership issue. Also, we'd have to discuss the opposite concern (moving things out of cslib's maintainership).</p>",
        "id": 563550975,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1765569245
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563550683\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"929508\">Fabrizio Montesi</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563545182\">said</a>:</p>\n<blockquote>\n<p>But why is it so important to have automata in mathlib?</p>\n</blockquote>\n<p>Mathematicians prove theorems about automatic groups (for example all mapping class groups of surfaces are automatic) and I would very much hope to be able to state those theorems going forwards, but the definition which I know of automatic groups needs e.g. regular languages and finite state automata. However it would be fine just to have basic definitions in mathlib as far as I'm concerned.</p>\n</blockquote>\n<p>Thanks for this point, that's important to consider. (Side note: This makes me think even more that we might want a peer dependency in the future... :⁠-⁠))</p>",
        "id": 563551101,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1765569302
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"929508\">Fabrizio Montesi</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563550975\">said</a>:</p>\n<blockquote>\n<p>It's not just one directory though, unless you mean that LTS and their equivalences (like bisimilarity) should live under 'Computability'.</p>\n</blockquote>\n<p>If the material needs to be split into multiple directories, that's fine, that's up to the maintainers of the material and isn't really a big deal one way or another</p>",
        "id": 563568397,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765577009
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563545691\">said</a>:</p>\n<blockquote>\n<p>I am personally of the opinion that all theoretical CS is in scope of mathlib, but we need more people to join the review and maintainer teams</p>\n</blockquote>\n<p>How widely held is this view? My impression is that if I had tried to contribute say my work on lambda calculi, especially given we want multiple type systems and styles of binding, it would have been likely to stall early.</p>\n<p>To me the discussions of moving things like LTS to Mathlib is the mirror of concerns with downstreaming. The concept is new to me, but I think <span class=\"user-mention\" data-user-id=\"315577\">@Mac Malone</span>'s idea of a peer dependency could go a long ways to resolve some of these problems.</p>",
        "id": 563572967,
        "sender_full_name": "Chris Henson",
        "timestamp": 1765579854
    },
    {
        "content": "<p>proving the equivalence of lambda calculus and turing machines was definitely on my roadmap for the computability library, although I ran out of steam to push it myself</p>",
        "id": 563573090,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765579925
    },
    {
        "content": "<p>lambda calculus is also promising as a target for lean translation for an automatic computability prover for arbitrary functions</p>",
        "id": 563573205,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765579986
    },
    {
        "content": "<p>I would much rather see that we move things from Mathlib to Cslib where possible. Currently Mathlib has a large maintainer team, and membership of this group means many different things: both ability to use <code>bors merge</code>, but also full participation in our consensus-falling-back-to-voting mechanism for decision making. This makes it hard, and slow, to add more maintainers. For areas that are not growing particularly actively in Mathlib (and I think NFAs, and indeed all of Mathlib.Computability, is included in this), and are constrained by lack of availability of reviewers or maintainers at Mathlib, I would strongly encourage moving them to downstream libraries, in cases where there is sufficient activity/interest/momentum/infrastructure (and I think Cslib by now clearly meets that bar).</p>",
        "id": 563582960,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1765589010
    },
    {
        "content": "<p>Well, that's exactly why I've been arguing for mathlib maintenance to hierarchize some more, with smaller fiefdoms controlled by smaller subgroups of the maintainers so that we don't need one flat decision-making apparatus for everything. That's really an internal problem and I don't see why we can't grow maintainer membership 5x once we fix that</p>",
        "id": 563583237,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765589356
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563582960\">said</a>:</p>\n<blockquote>\n<p>This makes it hard, and slow, to add more maintainers. For areas that are not growing particularly actively in Mathlib (and I think NFAs, and indeed all of Mathlib.Computability, is included in this), and are constrained by lack of availability of reviewers or maintainers at Mathlib,</p>\n</blockquote>\n<p>This sounds like an argument for just not growing mathlib beyond its current size, since bigger mathlib means more reviewers and maintainers and you are arguing against that. I don't think anyone wants that, and I seem to recall an Institute being created in the recent past to do the opposite</p>",
        "id": 563583479,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765589648
    },
    {
        "content": "<p>so I think we need to solve our governance issues one way or another, and once we do I want us to crank up the membership to keep up with contributions (not just numerically but also representing the topic areas that our community is working on)</p>",
        "id": 563583616,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765589808
    },
    {
        "content": "<p>and I think it's clear that CS is currently underrepresented and I don't want us to solve that by just kicking CS out of mathlib because it's not a clean split</p>",
        "id": 563583652,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765589867
    },
    {
        "content": "<p>and also because I never stopped believing in the monorepo ideal of cross-discipline global coherence</p>",
        "id": 563583705,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765589936
    },
    {
        "content": "<p>My view is that this is actually the opposite of what you've been arguing! Let's take this to DMs, and see if we can resolve this there rather than having a public discussion about it based on misunderstandings.</p>",
        "id": 563584169,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1765590467
    },
    {
        "content": "<p>My perhaps biased opinion is that having these separate repositories for niche topics is a benefit to everyone. It means these projects won't get brought to a snail's pace by lack of available Mathlib maintainers, and it gives them more flexibility to try out radical stuff as their design coalesces.</p>",
        "id": 563606616,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1765618200
    },
    {
        "content": "<p>The CGT repo was birthed from a proposed refactor that would have totaled some 3,000 lines of diff had it been PR'd to Mathlib. Instead we split off, moved fast and broke stuff, and now the repository is thriving.</p>",
        "id": 563606697,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1765618317
    },
    {
        "content": "<p>I'm not against CGT eventually getting swallowed back into Mathlib, but I do think that without the opportunity to use this separate repository as a sort of staging ground, we would not have been able to develop the theory as far as we did. Perhaps CsLib could act in a similar way?</p>",
        "id": 563606758,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1765618367
    },
    {
        "content": "<p>certainly, cslib can function as a staging ground for mathlib in the same way that mathlib is a staging ground for batteries and batteries is a staging ground for lean core</p>",
        "id": 563608060,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765619953
    },
    {
        "content": "<p>You can say the same about project repos like FLT, which accumulate things to upstream asynchronously</p>",
        "id": 563608206,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765620121
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Is.20there.20a.20plan.20to.20offload.20Mathlib.2EComputability.20to.20Cslib.3F/near/563606758\">said</a>:</p>\n<blockquote>\n<p>I'm not against CGT eventually getting swallowed back into Mathlib, but I do think that without the opportunity to use this separate repository as a sort of staging ground, we would not have been able to develop the theory as far as we did. Perhaps CsLib could act in a similar way?</p>\n</blockquote>\n<p>This has been true of CSLib as well. I don't think for instance I would have pushed as far experimenting with grind and metaprogramming without a separate repo. A distinction I would make though is that I don't think CSLib will converge to something that makes sense to move into Mathlib.</p>\n<p>We are grateful for the foundation that Mathlib provides, and we have already made some small PRs for upstreaming things that unambiguously belong in Mathlib. My main point is that, given the current practicalities of bootstrapping Mathlib reviewers/maintainers that Kim describes above and what seems to be the more prevailing opinion of the scope of Mathlib, there are distinct advantages for certain CS-oriented topics to move to CSLib. Especially if we are able to eventually have mutual dependency as Mac suggests, I think we can mostly satisfy everyone.</p>\n<p>Again, I am not personally in a rush for this, and am very willing to work with Mathlib maintainers in whatever capacity is necessary to address any concerns.</p>",
        "id": 563609969,
        "sender_full_name": "Chris Henson",
        "timestamp": 1765622181
    },
    {
        "content": "<p>I think the main priority should be ensuring that any duplications are short lived and resolving any inconsistencies, so that the two libraries can be used together seamlessly</p>",
        "id": 563610073,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765622298
    },
    {
        "content": "<p>deciding where individual items go is less important</p>",
        "id": 563610082,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1765622312
    }
]