[
    {
        "content": "<p>Hi, just wanted to mention that I've started working on K-Lindelöf spaces in <a href=\"https://github.com/leanprover-community/mathlib4/pull/11800\">#11800</a>. As sanity check that my definition in terms of filters works, I've added all the API up to and including the theorem <code>isKLindelof_iff_cardinal_subcover</code> that establish that this is indeed the right definition. To keep the diff small, I think this is about the content I would like for this PR, I can flesh out the API in a follow-up. All feedback is welcome. This PR relies on some properties of <code>CardinalInterFilter</code>'s that I'm adding in <a href=\"https://github.com/leanprover-community/mathlib4/pull/11758\">#11758</a>, so I need that one to merge first. Feedback on that one is thus also very much welcome. </p>\n<p>I'm also curious about your thoughts on the following: </p>\n<ul>\n<li>As most (but not all!) of the interest results require <code>k</code> to be a regular cardinal (IsRegular k) I could assume this from the offset at a slight loss of generality. </li>\n<li>I had some universe-issues, which is due to the fact that the cardinalities don't really seem to play together nicely.  Whereas docs#Lindelöf sometimes has two different universes in a statement, I couldn't get that to work nicely, so I just worked with the cases where the universes agreed. I guess you can always lift to <code>max u v</code> if you want.</li>\n</ul>",
        "id": 430419442,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1711832049
    },
    {
        "content": "<p><del>I'm not putting it on <code>awaiting-review</code> for now, as I don't want to waste too much reviewing time in case <a href=\"https://github.com/leanprover-community/mathlib4/pull/11758\">#11758</a> doesn't fully go through. Any feedback is still welcome though!</del></p>",
        "id": 430419567,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1711832193
    },
    {
        "content": "<p>As <a href=\"https://github.com/leanprover-community/mathlib4/pull/11758\">#11758</a> has merged, I believe <a href=\"https://github.com/leanprover-community/mathlib4/pull/11800\">#11800</a> is now ready for review. Although it is a new file, it is a rather straightforward generalisation of Lindelöf spaces, which have already been added to Mathlib, so I believe that reviewing should be straightforward. If desired, I can also add prove the analogous 2/3 of the file and add it to this PR, but that might make matters a bit long. Let me know!</p>",
        "id": 431232595,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1712211630
    }
]