[
    {
        "content": "<p>Most docstrings in mathlib (at least from my experience) seem <em>not</em> to use LaTeX.  What is the desired convention here?  Is LaTeX something to be desired?  I have no problem using LaTeX but wondering if it is something that people even want. </p>\n<p>When reading the source code of mathlib, I would rather not have to read LaTeX source code because I have to decipher the LaTeX source in my mind while reading the docstring but when reading the generated docs I definitely prefer reading the rendered LaTeX.  Thus, since I normally read the source code and not the generated docs I would tend to side with not using LaTeX.</p>\n<p>Curious where others stand/sit on this issue?</p>\n<p>An aside, I would love to see a way to embed rended LaTeX within the lean source files but not sure how this would even be implemented or if at all possible??</p>",
        "id": 418938317,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1706656874
    },
    {
        "content": "<p>In mathlib3, if you wrote markdown with LaTeX in doc strings (embedded in the same way as you might write a question or answer on math.stackexchange or mathoverflow), doc-gen3 was able to generate HTML with the LaTeX rendered by MathJax. </p>\n<p>In principle we could with some effort port the same collection of hacks over to doc-gen4, but my impression is it's probably better to wait until <a href=\"https://github.com/leanprover/verso\">Verso</a> is ready for this sort of thing.</p>",
        "id": 418941228,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1706658460
    },
    {
        "content": "<p>Looks like LaTeX in docstrings is still working for mathlib4 from what I can see <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Algebra/Lie/CartanMatrix.html\">here for example</a></p>\n<p>But maybe you are referring to something else?</p>",
        "id": 418942042,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1706658926
    },
    {
        "content": "<p>(Ah, I guess doc-gen4 has some LaTeX + markdown capabilities, but compare your example to <a href=\"https://leanprover-community.github.io/mathlib_docs/algebra/lie/cartan_matrix.html#lie-algebras-from-cartan-matrices\">the output of doc-gen3</a>.)</p>\n<p>Reading over your first message in the thread again, I think I missed the point the first time around. Sorry for the noise!</p>",
        "id": 418947699,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1706662209
    },
    {
        "content": "<p>Yeah, there are some differences there between the outputs. No worries! Better than silence ;P</p>",
        "id": 418947954,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1706662420
    },
    {
        "content": "<p>A good compromise is sometimes to use latex with unicode math</p>",
        "id": 418976783,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1706683206
    },
    {
        "content": "<p>I only resort to LaTex after convincing myself that pure unicode just can't do the job. This usually happens only in longer text, such as module doc strings.</p>",
        "id": 419010384,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1706697172
    },
    {
        "content": "<p>A rule I'd propose is to use unicode (in backticks) if it's (almost) valid lean syntax, otherwise use latex (preferring unicode math where possible). Using pseudo code that's neither correct lean nor pretty LaTeX seems like a bad compromise to me</p>",
        "id": 419124974,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1706736000
    },
    {
        "content": "<p>Often a good use of LaTeX in a docstring is when the lean statement is becoming hard to read, since someone reading the web docs can most likely read the \"regular math\" faster than the lean statement</p>",
        "id": 419125301,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1706736124
    }
]