[
    {
        "content": "<p>In the docstring for <code>CategoryTheory.MonoidalClosed</code> it says that this is defining right monoidal closed categories. But the definition of right closed on wikipedia (and I think on the nlab, if I'm reading it right) would say we've defined a <em>left</em> closed category, because <code>Closed X</code> carries the data of a right adjoint for the left tensoring <code>X ⊗ -</code>. Is this a case where mathematical terminology is inconsistent, and some sources swap the meaning of left and right closed, or is it an error of the doc string?</p>",
        "id": 420735610,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1707514512
    },
    {
        "content": "<p>(I would like to implement separate left and right closed monoidal category classes, and it seems worth figuring this out first)</p>",
        "id": 420735679,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1707514540
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"438192\">@Yuma Mizuno</span></p>",
        "id": 420768978,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1707538711
    },
    {
        "content": "<p>I'm not sure which one (defined for <code>X ⊗ -</code> or <code>- ⊗ X</code>) should be called the left closed, but I think it's reasonable to change the current mathlib version to \"left\", which is at least consistent with Wikipedia. </p>\n<p>Perhaps <span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span>  has some ideas?</p>",
        "id": 420772115,
        "sender_full_name": "Yuma Mizuno",
        "timestamp": 1707542184
    },
    {
        "content": "<p>I think I choose this name based on having the opposite reading of nlab than Brendan's. They call (- \\otimes X) left tensoring. It is of course fairly arbitrary.</p>",
        "id": 420772412,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1707542580
    },
    {
        "content": "<p>Ah, on reread you're right. That is frustrating. I'm not sure what the right choice is, but I guess I don't like it if we use a convention based off (- \\otimes X) meaning \"left tensoring\" when in mathlib tensorLeft X is X \\otimes -</p>",
        "id": 420772554,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1707542759
    },
    {
        "content": "<p>I'm pretty sure the literature is largely inconsistent here. Internal consistency will suffice for us.</p>",
        "id": 420772735,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1707542948
    }
]