[
    {
        "content": "<p>I have recently heard, to my mild dismay, that contributions (especially contributions from new contributors) to mathlib are suggested to keep to around 150 lines of code. As my <code>ambivalent_def</code> project has vastly exceeded that scale already, I'm going to start soliciting belated feedback on this project as I start dripping it into digestible pull requests.</p>",
        "id": 452027301,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1721213238
    },
    {
        "content": "<p>The command (probably to end up being named <code>tfai_def</code>, for \"(the following are isomorphic)-def\") is meant to parallel the <code>opaque</code> command, but to follow up with a number of possible definitions; the idea being to handle in a semantically clear way definitions where no single canonical definition is to be preferred, and switching between definitions is to be possible at any time. As the new name implies, it is built on a lifting of <code>List.TFAE</code> into <code>Sort</code>, so that both the elements and the equivalences between them can be arbitrary <code>Sort</code>s.  This in turn depends on a lifting of <code>Chain</code> into <code>Sort</code>; the two together have consumed most of my dev time. It's now mostly done, but it's a rather large set of files at this point.</p>",
        "id": 452027312,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1721213244
    },
    {
        "content": "<p>In the first place, is this something Mathlib actually wants? (And doesn't already have, though I tried to check.)</p>",
        "id": 452027452,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1721213293
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"214703\">@Yury G. Kudryashov</span> had thoughts about generalising <code>tfae</code>. I'm not sure what the status is</p>",
        "id": 452035761,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1721215413
    },
    {
        "content": "<p>I thought about generalizing tfae to any partial order, not to Sort. What's the generalization of the \"equality from a cycle of implications\"?</p>",
        "id": 452056972,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1721219165
    },
    {
        "content": "<p>I also was thinking about partial orders, but I realized that in my own planned use cases, I wanted to use data-carrying relations like <code>FooEquiv</code></p>",
        "id": 452057512,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1721219326
    },
    {
        "content": "<p>Partial orders are well and good but <code>&lt;</code> is a relation that goes to <code>Prop</code></p>",
        "id": 452057555,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1721219340
    },
    {
        "content": "<p>So I ended up writing a <code>TFAE l up to eqv</code> notation and having a bunch of theorems that take a specific <code>antisymm : r a b -&gt; r b a -&gt; eqv a b</code>, or more generally a dependent <code>antisymm : (f : r a b) -&gt; (g : r b a) -&gt; p f g -&gt; eqv a b</code> for some other predicate <code>p</code></p>",
        "id": 452057805,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1721219422
    }
]