[
    {
        "content": "<p>I'm a bit perplexed by the naming of <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.Limits.IsLimit#doc\">docs#CategoryTheory.Limits.IsLimit</a>, because it is not <code>Prop</code>-valued. Wouldn'it nicer to call this structure a <code>UniversalLimitCone</code> (or something) and have a <code>IsLimitCone</code> structure (<code>Prop</code>-valued, this time) by quantifying over all <code>lift</code>s and then either bundling <code>fac</code> and <code>uniq</code> in an <code>and</code> field (so, a one-field structure), or a two-field (both <code>Prop</code>-valued) structure, the fields being <code>fac</code> and <code>uniq</code>?</p>",
        "id": 566919684,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1767871189
    },
    {
        "content": "<p>The reasoning here is that it is a <code>Subsingleton</code>. The fact that <code>IsLimit</code> contains data rarely (never?) causes trouble.</p>",
        "id": 566920124,
        "sender_full_name": "Christian Merten",
        "timestamp": 1767871378
    },
    {
        "content": "<p>The \"trouble\" I'm thinking of is psychological rather than anything else; it seems strange to start constructing a term in a <code>IsFoo</code> structure by producing a data for every <code>s : Cone F</code>. Are there other examples in the Category theory library (I don't know it well) where <code>IsFoo</code> structures appear although they contain data?</p>",
        "id": 566920610,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1767871566
    },
    {
        "content": "<p>I agree that <code>IsLimit</code> would probably not be the name we would choose if we had to choose a new name now. We have been following the <code>Is</code>-only-for-<code>Prop</code>s rule for new declarations for a while now, but renaming <code>IsLimit</code> would be a very annoying refactor, because it is used everywhere in the category theory library.</p>",
        "id": 566921554,
        "sender_full_name": "Christian Merten",
        "timestamp": 1767871949
    },
    {
        "content": "<p>Is it really hard if we want to rename <code>IsLimit</code> to <code>UnivLimit</code> (say?). Given there's no namespace involved, I would imagine that we can quite easily search-and-replace,  no?</p>",
        "id": 566921749,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1767872037
    },
    {
        "content": "<p>Or are there other arguments against?</p>",
        "id": 566921770,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1767872047
    },
    {
        "content": "<p>You have to fix the name of every declaration that mentions <code>IsLimit</code> (and <code>IsColimit</code>) as well and deprecate every single one of them. I am not sure this is worth it.</p>",
        "id": 566923477,
        "sender_full_name": "Christian Merten",
        "timestamp": 1767872760
    },
    {
        "content": "<p>if we are to rename it, I would prefer <code>LimitStruct</code>, but as Christian just beat me to it, we also have a considerable amount of docstrings/related names using this naming, so this would be one hell of a deprecation streak.</p>",
        "id": 566923612,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1767872815
    },
    {
        "content": "<p>OKOK, no problem. I certainly agree it is not a major issue.</p>",
        "id": 566923682,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1767872841
    }
]