[
    {
        "content": "<p>I got this all building, but it's very slow (requires bumping <code>maxHeartbeats</code> by 50%)<br>\nthe issue appears to be rewrite of <code>quotientPiLift_mk</code>, but I can't figure out how to unify it faster (and <code>set_option trace.Meta.whnf true</code> isn't giving me anything)</p>",
        "id": 328879581,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1676856239
    },
    {
        "content": "<p>another oddity is that <code>simp only [Pi.single_eq_same]</code> is unable to close a goal when <code>repeat (rw [Pi.single_eq_same])</code> is. For some reason simp is not rewriting exhaustively.</p>",
        "id": 328880009,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1676856621
    },
    {
        "content": "<p>Did you see the type ascriptions I added for <code>mk</code> and friends in <code>LinearAlgebra.Quotient</code>? They drastically sped up elaboration and in some cases prevented timeouts.</p>",
        "id": 328880803,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1676857316
    },
    {
        "content": "<p>interesting, I see this now<br>\nI'll try adding some type hints, but there aren't that many <code>Quotient.mk</code>s in the type of definitions in this file</p>",
        "id": 328887036,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1676862838
    },
    {
        "content": "<p>It seems like adding those in a few places in this file helps, but not so much where you need it the most. The profiler said  this declaration was spending all it's time in TC inference. And looking at the TC trace, it seems that it's ending up with bad goals like <code>Semiring ?m1</code> or <code>AddCommGroup ?m2</code> in various places, and this is even after I tried to add type ascriptions I thought might help in this declaration. To me it seems like TC inference is going on a wild goose chase and it eventually gets the goose and returns home, but it just spends forever doing it.</p>",
        "id": 328908420,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1676877754
    },
    {
        "content": "<p>what flags are you using to debug this? e.g. figure out what stages it's taking the most time in and the TC trace</p>",
        "id": 328919575,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1676881718
    },
    {
        "content": "<p><code>set_option profiler true</code> and <code>set_option trace.Meta.snythInstances true</code> (the latter might not be quite right, just use autocomplete)</p>",
        "id": 329001317,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1676904965
    },
    {
        "content": "<p><code>set_option profiler true</code> seems to indicate a lot of time was also spent in a <code>simp</code>, i'll try to bring that down with <code>simp only</code>s</p>",
        "id": 329079545,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1676934554
    },
    {
        "content": "<p>I'm going to add \"help wanted\" to this PR.<br>\nI wanted to do it myself to practice (since it isn't very critical) but the timeouts are really  hard to solve. I've some idea of what's going wrong, but I still can't speed instance search (I've tried manually adding instances and removing others from the search, and it hasn't helped more than a second).</p>",
        "id": 341026773,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1678519202
    }
]