[
    {
        "content": "<p>Hej! I'm currently taking a Lean course with <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span>  and we thought a neat project for me to work on would be to formalize <a href=\"https://en.wikipedia.org/wiki/Gaussian_elimination\">Gaussian Elimination</a>. But Mario mentioned there might be some specific formats that maintainers would like to see the formalization in before I get started on it myself. Is this the correct place to post in order to get some guidance on how to structure the formalization before I get started on it myself?</p>",
        "id": 502974683,
        "sender_full_name": "George Granberry",
        "timestamp": 1740992923
    },
    {
        "content": "<p>This is definitely a sensible place to post!</p>",
        "id": 502979809,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1740994483
    },
    {
        "content": "<p>It's possible there is some overlap here with <a href=\"https://github.com/leanprover-community/mathlib4/pull/21018\">#21018</a></p>",
        "id": 502979844,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1740994497
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"728771\">@Mark Santa Clara Munro</span> , it looks like you've already done a lot of work on this. Did you want a hand on it? I can't really tell from the PR how much work is roughly left.</p>\n<p>Also <span class=\"user-mention\" data-user-id=\"310045\">@Eric Wieser</span>  if you have anything else Linear Algebra related that you'd like to see formalized I'm always open to project ideas.</p>",
        "id": 503022885,
        "sender_full_name": "George Granberry",
        "timestamp": 1741007552
    },
    {
        "content": "<p>I'd like to see some things related to the numerical range of a continuous linear map formalized. Of course, the Toeplitz-Hausdorff theorem, but there's other stuff that could be done. There are plenty of generalizations one could consider as well. The most general version with nice properties replaces a single vector with a selfadjoint operator, but to prove anything nice about it we would have to develop theory about majorization.</p>",
        "id": 503155028,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1741049987
    },
    {
        "content": "<p>Hi, I apologize for the late response <span class=\"user-mention\" data-user-id=\"871920\">@George Granberry</span>! I talked to my research advisor, <span class=\"user-mention\" data-user-id=\"732195\">@Christopher Lynch</span>, and although in regular situations we would love to combine efforts, but this might be something where we are too far into it. I'm not sure how much work is roughly left, but I'd like to think we're not too far off so I am not sure if it would be worth it.</p>",
        "id": 503340163,
        "sender_full_name": "Mark Santa Clara Munro",
        "timestamp": 1741114237
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197836\">@Jireh Loreaux</span> I'd be happy to work on the Toeplitz-Hausdorff theorem if you think it is doable by someone somewhat new to Lean. If I come up with the general structure for the proof do you mind giving me some feedback to make sure I'm going in the right direction.</p>\n<p><span class=\"user-mention\" data-user-id=\"728771\">@Mark Santa Clara Munro</span> No problem at all! I looked over the code and thought the same thing.</p>",
        "id": 503374490,
        "sender_full_name": "George Granberry",
        "timestamp": 1741126237
    }
]