[
    {
        "content": "<p>When developing Hahn embedding theorem, I created <code>DivisibleCompletion</code> in <a href=\"https://github.com/leanprover-community/mathlib4/pull/25338\">#25338</a>, which embeds an ordered group <code>M</code> into a ordered ℚ-module. I later realized this is equivalent to the existing <code>LocalizedModule (nonZeroDivisors ℤ) M)</code>. The \"only\" thing missing is a linear order on <code>LocalizedModule</code>.</p>\n<p>However when I tried adding that linear order, it became pretty cumbersome as the \"denominator\" of LocalizedModule is in <code>nonZeroDivisors ℤ</code>, and the sign doesn't play well with the ordering in multiplication. Should I continue working in this direction? Or is <code>DivisibleCompletion</code> good enough even though it is somewhat duplicating the theory?</p>\n<p>(I also looked at another equivalent object <code>ℚ ⊗[ℤ] M</code>, which similarly lacks theory for linear order, and I haven't figured out the right definition for ordering on tensor product yet)</p>",
        "id": 529610519,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1752956591
    },
    {
        "content": "<p>(maybe I just got stuck for no reason and it isn't that hard to add the linear order)</p>",
        "id": 529612993,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1752959702
    },
    {
        "content": "<p>I suppose I could add a <code>IsLocalization (Submonoid.pos ℤ) ℚ</code> instance and now <code>LocalizedModule (Submonoid.pos ℤ) M</code> will truly be equivalent to my <code>DivisibleCompletion</code></p>",
        "id": 529622222,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1752974352
    },
    {
        "content": "<p>Alright, so I was able to add linear order and prove properties I wanted to <code>LocalizedModule (Submonoid.pos ℤ) M</code>. The next question would be if I could generalize this to other rings besides ℤ... this sounds really painful. I hope I can just PR the ℤ version?</p>",
        "id": 529694133,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1753023827
    },
    {
        "content": "<p>I think divisible completion (or injective hull) is sufficiently important that you don’t need to generalize to other rings at this time.</p>",
        "id": 529743052,
        "sender_full_name": "Scott Carnahan",
        "timestamp": 1753064567
    }
]