[
    {
        "content": "<p>I want to write the basics of log geometry. The focus won't be on fs log geometry, but rather more general log geometry, e.g. over valuation rings and their extension</p>",
        "id": 536596230,
        "sender_full_name": "Amine Koubaa",
        "timestamp": 1756384573
    },
    {
        "content": "<p>Hi Amine, nice to see you here! Do you already have something specific in mind?</p>",
        "id": 536601209,
        "sender_full_name": "Christian Merten",
        "timestamp": 1756386075
    },
    {
        "content": "<p>Hi Christian. Thanks you too. I was thinking about basing it on some chapters of Ogus book. <a href=\"https://www.cambridge.org/core/books/lectures-on-logarithmic-algebraic-geometry/70AF7196462F4CEC018E2DABA49475F6\">https://www.cambridge.org/core/books/lectures-on-logarithmic-algebraic-geometry/70AF7196462F4CEC018E2DABA49475F6</a><br>\nI do not know how much interest you have in  log schemes, but my objective is checking a proof I did in my phd about the existence of the Cartier operator on valuation rings with log structure.</p>",
        "id": 536643053,
        "sender_full_name": "Amine Koubaa",
        "timestamp": 1756397959
    },
    {
        "content": "<p>For that specific proof, I only need log rings first. But I think log schemes are interesting for a more general population (e.g. for tropical geometry, tori etc.)<br>\nAnyways, I probably need to familiarize myself with monoids in lean. They are defined, but their definition is under Algebra.rings which is quite annoying.</p>",
        "id": 536643695,
        "sender_full_name": "Amine Koubaa",
        "timestamp": 1756398192
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"953033\">@Amine Koubaa</span> note that we're still struggling with quasicoherent sheaves of modules right now, I suspect that log schemes will be quite a challenge! But maybe I'm being pessimistic?</p>",
        "id": 536685736,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1756416255
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>  Then maybe I ll then start with logarithmic rings anyway. I think for the definitions over schemes I do not need quasi-coherence.<br>\nBut then for any reasonable theorem in algebraic geometry, one needs the concept of quasi-coherence! What is the main hurdle for quasi-coherent sheaves?</p>",
        "id": 536686761,
        "sender_full_name": "Amine Koubaa",
        "timestamp": 1756416856
    },
    {
        "content": "<p>There is no technical problem, it's just that we're building mathematics from scratch and nobody is being paid to do it for their job so it can go slowly</p>",
        "id": 536687805,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1756417653
    },
    {
        "content": "<p>Actually I guess I'm being paid to do it but I don't need sheaves right now :-)</p>",
        "id": 536687840,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1756417683
    }
]