[
    {
        "content": "<p>So yesterday I tried making the <code>minImports</code> linter continue working when editing a file, and I made <a href=\"https://github.com/leanprover-community/mathlib4/pull/18914\">#18914</a> which <em>almost</em> works. The idea is that we want to know for each piece of syntax that the linter runs on, what the result was of running the linter on the previous syntax item. Currently, this is done by updating an <code>IORef</code> for the file, which works only if the declarations are elaborated top to bottom.</p>\n<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/18914\">#18914</a> I instead tried to work by syntax position: check the starting position of the syntax we are elaborating, and then look up the last result with ending position before that point. The problem is that by pasting or deleting code in a tricky way, we can end up with the situation that we have a new declaration that has its start position before an old declaration's end position, so the linter gets confused.</p>\n<p>Does anyone have suggestions for how to make a robust fix?</p>",
        "id": 482142262,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1731494979
    },
    {
        "content": "<p>One thing that would work much better is, given a piece of syntax, to look up the command immediately preceding it.</p>",
        "id": 482142488,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1731495045
    },
    {
        "content": "<p>I don't think that <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Lean.DeclarationRanges#doc\">docs#Lean.DeclarationRanges</a> would be exactly the right way to go, since the linter runs on commands, not necessarily named declarations.</p>",
        "id": 482142920,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1731495180
    },
    {
        "content": "<p>And I suppose reparsing the file for each call to the linter would also be an issue...</p>",
        "id": 482143187,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1731495264
    },
    {
        "content": "<p>I would really like to see a solution to this question, since I had also tried to circumvent these issues, but failed.  I find that having a way of consistently \"passing information\" between declarations when running a linter is always tricky.</p>",
        "id": 482143542,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1731495369
    },
    {
        "content": "<p>I think the right conclusion here is:</p>\n<ul>\n<li>passing information between linters is a bad idea for now, and given the demands of parallelism it's unlikely we'll add support for this</li>\n<li>allowing a linter to see that syntax/source of everything up to the current definition seems plausible (although again, maybe made more complicated by parallelism)</li>\n<li><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span>, perhaps you could write an RFC on the lean4 repository asking for a mechanism for a linter to see everything up to the current definition?</li>\n</ul>",
        "id": 482296693,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1731550644
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover/lean4/pull/6076\">lean4#6076</a></p>",
        "id": 482339251,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1731574885
    },
    {
        "content": "<p>Comments on the request for comments are welcome!  <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 482339342,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1731574917
    }
]