[
    {
        "content": "<p>Hi all! I've opened a PR to add Markov categories to mathlib: <a href=\"https://github.com/leanprover-community/mathlib4/pull/29657\">https://github.com/leanprover-community/mathlib4/pull/29657</a></p>\n<p>The PR includes the basic <code>MarkovCategory</code> typeclass, a proof that cartesian categories are Markov categories, and <code>FinStoch</code> (finite stochastic matrices) as a concrete example.</p>\n<p>I'm not an expert in this area; I've been learning it while implementing. I'd appreciate review for mathematical correctness, idiomatic Lean style, and whether mathlib wants this at all. I kept the PR small on purpose, although the FinStoch/Monoidal.lean proofs were a bit tricky for me (I suspect there's an easier way to go about it). If there's interest, future PRs could add conditional independence, sufficient statistics, and connections to existing probability theory.</p>\n<p>Would anyone be willing to take a look? Happy to answer questions or make changes based on feedback.</p>",
        "id": 539465008,
        "sender_full_name": "Jacob Reinhold",
        "timestamp": 1757913083
    },
    {
        "content": "<p>Have you considered doing CD monoidal categories, and then Markov categories as a special case?</p>",
        "id": 539474118,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1757918869
    },
    {
        "content": "<p>I can implement copy-discard categories with Markov as a special case (adding del_natural seems to be the only change in my implementation at least).</p>\n<p>The main consideration here is if anyone would actually be interested in CD monoidal categories and use it; I definitely have use cases for Markov categories—and there appears to be active research on Markov categories—but I don't clearly have a use-case for CD categories, so YAGNI. Implementing only Markov categories requires less work to maintain and is easier to review.</p>\n<p>It's not a hard change though, I can submit another PR with a CopyDiscardCategory and MarkovCategory as a special case for comparison.</p>",
        "id": 539529437,
        "sender_full_name": "Jacob Reinhold",
        "timestamp": 1757935434
    },
    {
        "content": "<p>Great that you are doing this but I have neither the time nor the expertise to review. You might try contacting Paolo Perrone or Sam Staton. They (or maybe just Sam) work on probabilistic programming languages (as well as Markov Categories) with one written in Haskell. I would guess they are sympathetic to formalisation (and maybe they are already working on it).</p>",
        "id": 539549409,
        "sender_full_name": "Dominic Steinitz",
        "timestamp": 1757940832
    },
    {
        "content": "<p>This would be a great addition. In case you have missed it, we also have PF theorem currently being PRd , in particular below version for stochastic matrices could be relevant as it will give some nice properties to FinStoch:<br>\n<a href=\"https://github.com/mkaratarakis/HopfieldNet/blob/master/HopfieldNet/Mathematics/LinearAlgebra/Matrix/PerronFrobenius/Stochastic.lean\">https://github.com/mkaratarakis/HopfieldNet/blob/master/HopfieldNet/Mathematics/LinearAlgebra/Matrix/PerronFrobenius/Stochastic.lean</a> <br>\nYou may want also to keep an eye on <a href=\"https://github.com/leanprover-community/mathlib4/pull/28728\">#28728</a> and future to keep mutual compatibility with some proposed defs in the current PR, like the definitions of Irreducible and Primitive matrices used in the PF and based on Quiver API, and ones on Cyclic Quivers and Aperiodic matrices which are ready and will follow in the next PRs . <br>\n<a class=\"stream-topic\" data-stream-id=\"116395\" href=\"/#narrow/channel/116395-maths/topic/Formalizing.20Perron-Frobenius/with/535478633\">#maths &gt; Formalizing Perron-Frobenius</a></p>",
        "id": 539551373,
        "sender_full_name": "Matteo Cipollina",
        "timestamp": 1757941205
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"961066\">@Jacob Reinhold</span>  it just seems to me to be the mathlib way, that's all.</p>",
        "id": 539656225,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1757975423
    },
    {
        "content": "<p>It feels like formalising AB5 abelian categories without formalising abelian categories, rather than doing abelian categories and adding AB5 as an additional condition.</p>",
        "id": 539656359,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1757975514
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"130272\">@David Michael Roberts</span> Sounds reasonable to me. Working on this.</p>",
        "id": 539680711,
        "sender_full_name": "Jacob Reinhold",
        "timestamp": 1757996852
    },
    {
        "content": "<p>FYI, implemented copy-discard categories and Markov categories as an extension of them <a href=\"https://github.com/leanprover-community/mathlib4/pull/29657\">here</a>.</p>",
        "id": 540908768,
        "sender_full_name": "Jacob Reinhold",
        "timestamp": 1758584610
    },
    {
        "content": "<p>You should obviously split this in smaller PRs. You may tag <a href=\"https://github.com/leanprover-community/mathlib4/pull/29657\">#29657</a> as WIP, and start a new PR which would basically just add <code>Monoidal.CommComonObj</code> and <code>CopyDiscardCategory.Basic</code>. (150-250 lines a reasonable length for a PR; we try to refrain frolm adding significantly more than that at a time.)</p>",
        "id": 541027431,
        "sender_full_name": "Joël Riou",
        "timestamp": 1758637241
    },
    {
        "content": "<p>Figured. Will do</p>",
        "id": 541038965,
        "sender_full_name": "Jacob Reinhold",
        "timestamp": 1758639986
    },
    {
        "content": "<p>Keeping it even smaller for the first of the PR stack: <a href=\"https://github.com/leanprover-community/mathlib4/pull/29919\">https://github.com/leanprover-community/mathlib4/pull/29919</a> <span class=\"user-mention\" data-user-id=\"459699\">@Joël Riou</span></p>",
        "id": 541108551,
        "sender_full_name": "Jacob Reinhold",
        "timestamp": 1758665190
    }
]