[
    {
        "content": "<p>In mathlib is it preferred to prove theorems via special cases of generalizations?</p>\n<p>E.g. we have 1) Cantor's theorem for types proved at <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Logic/Function/Basic.html#Function.cantor_surjective\">Function.cantor_surjective</a>. However we could also 2) prove Lawvere's fixed point theorem in a general cartesian closed category and apply that to the category of types.</p>\n<p>Is there a preference between these options? Do we keep both proofs?</p>",
        "id": 466384181,
        "sender_full_name": "mdnestor",
        "timestamp": 1725061149
    },
    {
        "content": "<p>Note that <code>Function.cantor_surjective</code> is in <code>Mathlib.Logic.Function.Basic</code>, which is an extremely early import. The standard proof needs almost nothing other than the definition of surjectivity and the powerset <code>Set α</code>.</p>",
        "id": 466417567,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1725066085
    },
    {
        "content": "<p>I think having duplicate theorems is an issue to be avoided within Mathlib, but having multiple ways to prove them is an inevitability. Only when the new ways are simpler (in both conceptual terms and in terms of imports) should the old ones be replaced, though.</p>",
        "id": 466417902,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1725066252
    },
    {
        "content": "<p>Of course, even having duplicates in Mathlib is very difficult. Two very slightly different ways to state a result can sometimes take multiple lines of code for the conversion. So in that case the apparent duplication is fine.</p>",
        "id": 466418010,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1725066325
    },
    {
        "content": "<p>That makes sense. Cantor's theorem for types is just a couple lines but proving it as a special case of Lawvere's theorem is much more involved.</p>\n<p>I am working on formalizing a wellknown theorem with a short proof but I have also proved generalizations that depend on more abstractions. My current approach is to do both, 1) prove the theorem in the classic way and 2) prove the theorem using the generalization and append <code>.proof2</code> to the name</p>",
        "id": 466419438,
        "sender_full_name": "mdnestor",
        "timestamp": 1725067341
    },
    {
        "content": "<p>When you're ready to PR, we can discuss which of the proofs should make it into the library.</p>",
        "id": 466438313,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1725077252
    },
    {
        "content": "<p>E.g., lots of analysis is done in normed spaces, then specialized to dimension 1 as needed.</p>",
        "id": 466438400,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1725077277
    }
]