[
    {
        "content": "<p>Hi! I want to generalize <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=MeasureTheory.Filtration.natural#doc\">docs#MeasureTheory.Filtration.natural</a> to take as input a family of measurable functions instead of strongly measurable functions, so that I can define a filtration on a product of measurable spaces without any topology. While I was doing that I realized that all the library about adapted processes was written in terms of strongly measurable functions, which makes the aforementioned generalization painful. I am wondering wether it would make sense be to generalize all the definitions (e.g. <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=MeasureTheory.Adapted#doc\">docs#MeasureTheory.Adapted</a>) to measurable functions? I realized that many proofs are using <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=MeasureTheory.StronglyMeasurable.measurable#doc\">docs#MeasureTheory.StronglyMeasurable.measurable</a>, so it seems to make sense, but maybe we'll lose something here. Maybe define another predicate <code>stronglyAdapted</code>?<br>\nTagging <span class=\"user-mention\" data-user-id=\"243312\">@Kexing Ying</span> and <span class=\"user-mention\" data-user-id=\"350992\">@Rémy Degenne</span> who wrote this part of the library.</p>",
        "id": 502366878,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1740686416
    },
    {
        "content": "<p>I can't give you a quick answer right now. I don't recall why <code>StronglyMeasurable</code> was used instead of <code>Measurable</code>. I'll need to look at the library to look for clues. Perhaps your refactor attempt shows some particular places where <code>StronglyMeasurable</code> seems more useful than <code>Measurable</code>?</p>",
        "id": 502368607,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1740687066
    },
    {
        "content": "<p>I didn't gp far enough to tell you because I wanted to ask before really trying. I'll keep changing defs and see what happens.</p>",
        "id": 502368879,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1740687165
    },
    {
        "content": "<p>I guess the definition of a martingale is the key (it's the central object of the work we did): it's about conditional expectations, so it needs strong measurability.</p>",
        "id": 502369008,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1740687221
    },
    {
        "content": "<p>Yes that makes sense, but on the other hand I did come across lemmas where strong measurability was not needed. This makes me thinks that a second predicate <code>stronglyAdapted</code> might be a solution, because we would have <code>stronglyAdapted =&gt; adapted</code> so it would work nicely.</p>",
        "id": 502370033,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1740687612
    }
]