[
    {
        "content": "<p>I remembered a few days ago that mathlib4 has a <a href=\"https://bit.ly/3cKk3ld\">#queue4</a> ! I had spent months ignoring pretty much everything on it other than porting PRs, and then when the port got done I spent a couple of weeks ignoring it completely (because we were done, right?). But now it's dawning on me that we're back to the good old days and can start writing and reviewing each other's PRs, and growing mathlib in the directions we like. </p>\n<p>I was delighted to see that top of the queue was a PR by Scott (which I was completely oblivious of until recently) on presheaves of modules, and I've just reviewed that one (which drops it to the bottom of the queue).  This now means that the top <em>eight</em> PRs on the queue are all tagged <code>t-meta</code> which means that they're out of my league. It might also indicate that we have a problem with not enough meta reviewers? Is this an issue which other people are concerned about?</p>",
        "id": 379057693,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1690447192
    },
    {
        "content": "<p>To what extend would reviews (together with the <code>maintainers merge</code> command) by non-maintainers be welcomed?</p>",
        "id": 382545825,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1691398498
    },
    {
        "content": "<p>Reviews are certainly always welcome, though <code>maintainer-merge</code> is strictly only recognized by people lists as mathlib reviewers.</p>",
        "id": 382546408,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1691398600
    },
    {
        "content": "<p>ok perfect! <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 382546953,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1691398693
    },
    {
        "content": "<p>Reviews are <em>very</em> welcome from everyone. You can even make an effort to review the PRs of people who provide reviews, initiating a virtuous spiral of mutual reviewing. :-)</p>",
        "id": 382555496,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1691400453
    },
    {
        "content": "<p>Also note that we look at reviews when considering people for addition to the mathlib reviewers and mathlib maintainers teams, so if you are interested in joining these teams then doing reviews will be very helpful!</p>",
        "id": 382560860,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1691401496
    },
    {
        "content": "<p>Here's a fun idea: create a reward system for reviews. Person A would get:</p>\n<ol>\n<li>3 points per review cycle done by A on a PR not open by A</li>\n<li>1 point for each <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> (not given by A) on review comments made by A on a PR not open by A</li>\n<li>1 point for each member (excluding A) that agrees on a <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> given by A on a review comment not made by A on a PR not open by A</li>\n</ol>\n<ul>\n<li>(1) is an incentive to actually review</li>\n<li>(2) is a mechanism for review validation</li>\n<li>(3) is an incentive to strengthen review validation</li>\n</ul>\n<p>For example, suppose there's a certain PR not open by Alice.</p>\n<ul>\n<li>Alice does a review and gains 3 points. She left two comments</li>\n<li>Bob <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> the first comment, so Alice gets an extra point</li>\n<li>Bob does his round of review and leaves one comment (let's not care about Bob's points)</li>\n<li>Alice agrees with that comment and <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> it</li>\n<li>Carl comes in and <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> Bob's comment, so Alice gets an extra point</li>\n</ul>\n<p>This is <em>obviously</em> not bullet proof (I didn't even try for it). The system is based on the trust that collaborators already share (people get invites to be collaborators!). There can be seasons, which are good for celebration and also to iterate/improve on the point system.</p>\n<p>Note: this is pretty much a form of decentralized consensus algorithm for reviews. It's easy to go crazy on the rules, but it's probably better to start off with <em>something</em> to avoid paralysis by analysis scenarios.</p>",
        "id": 382593510,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1691408102
    },
    {
        "content": "<p>I think a more coarse approach would be to just count \"how many PRs was a person involved in reviewing\", and publish that as a stat alongside the commit stats shown in mathlib 3</p>",
        "id": 382596391,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1691408691
    },
    {
        "content": "<p>Review is a very important part of making mathlib work, so if we're going to leaderboard-ize commits, we probably should do so for review also!</p>",
        "id": 382596515,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1691408716
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/stream/287929-mathlib4/topic/meta.20code.20reviewers/near/382596391\">said</a>:</p>\n<blockquote>\n<p>I think a more coarse approach would be to just count \"how many PRs was a person involved in reviewing\", and publish that as a stat alongside the commit stats shown in mathlib 3</p>\n</blockquote>\n<p>That's definitely a nice start. \"being involved\" is a bit vague though. The \"like\"-points I proposed are pretty much incentives to make people <em>really</em> involved with the review process, potentially even increasing review quality. But that's an extra</p>",
        "id": 382597324,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1691408876
    }
]