[
    {
        "content": "<p>For <a href=\"https://github.com/urkud/SardMoreira\">https://github.com/urkud/SardMoreira</a>, I needed two new custom constructors for <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=ImplicitFunctionData#doc\">docs#ImplicitFunctionData</a>. Have you seen these kinds of the Implicit Function Theorem in other context? <a href=\"https://en.wikipedia.org/wiki/XY_problem\">#xy</a>: should I treat them as implementation details or something that deserves a proper API when I upstream the code to Mathlib?</p>\n<h3>Implicit function theorem for maps with non-surjective differential</h3>\n<p>In this case, we choose a projection onto <code>LinearMap.range (fderiv K f a)</code>, then apply the usual theorem to the composition of this projection with our map. As a result, instead of locally conjugating our map to <code>Prod.fst</code>, we locally conjugate it to <code>fun (x, y) =&gt; (x, g x y)</code> for some function with <code>dg/dy = 0</code>.</p>\n<p>This conjugation appears as the first step in most (all?) proofs of variants of the Sard's theorem, but I don't know if it appears in any other context. If yes, then I'll think how to extend the <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=ImplicitFunctionData#doc\">docs#ImplicitFunctionData</a> structure to accomodate for this use case. If no, then I'll just add a custom constructor and prove exactly what I need for Sard's theorem (that's what I already have in my repo).</p>\n<h3>Implicit function preserving the first coordinate</h3>\n<p>Given a function <code>f : E × F → G</code> with surjective <code>df/dy</code>, we can find an implicit function that preserves the first coordinate, see <a href=\"https://urkud.github.io/SardMoreira/docs/SardMoreira/Chart.html#Moreira2001.chartImplicitData\">https://urkud.github.io/SardMoreira/docs/SardMoreira/Chart.html#Moreira2001.chartImplicitData</a> (see source for details) for the case <code>G = Real</code>. Probably, this can be seen as a parametric version of the theorem, so it has greater chances of being useful in other context. How would you call the corresponding constructor to <code>ImplicitFunctionData</code>?</p>",
        "id": 564833573,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1766242128
    },
    {
        "content": "<p>CC: <span class=\"user-mention\" data-user-id=\"110050\">@Sébastien Gouëzel</span> <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> <span class=\"user-mention\" data-user-id=\"111080\">@Floris van Doorn</span></p>",
        "id": 564844487,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1766253678
    }
]