[
    {
        "content": "<p>I was developing my lean3 project (<a href=\"https://github.com/berndlosert/convergence\">https://github.com/berndlosert/convergence</a>) using gitpod. I made a branch called lean4 for migrating to lean4. However, I'm not sure what to do. I updated the gitpod.yml to use lean4. What is the next step? Do I need to update the toml file? Or is there some magic invocation of lake that I need to run?</p>",
        "id": 391998914,
        "sender_full_name": "Bernd Losert",
        "timestamp": 1695159477
    },
    {
        "content": "<p>This is a lot more complicated I'm afraid. You need to use <a href=\"https://github.com/leanprover-community/mathport/#readme\">https://github.com/leanprover-community/mathport/#readme</a></p>",
        "id": 391999447,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1695159768
    },
    {
        "content": "<p>I am willing to rewrite most of my code from scratch if that helps. I just need to get the mathlib4 dependency set up.</p>",
        "id": 392001139,
        "sender_full_name": "Bernd Losert",
        "timestamp": 1695160697
    },
    {
        "content": "<p>Don't do yourself the disservice of rewriting from scratch. Mathport is the way to go. You should be able to use mathport oneshot, and if you <code>#align</code> some names by hand I bet it will be relatively straightforward.</p>",
        "id": 392003239,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1695161679
    },
    {
        "content": "<p>I don't think oneshot is relevant here since it looks like Bernd has many files to port.</p>",
        "id": 392004289,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1695162260
    },
    {
        "content": "<p>But we can help with using mathport. Bernd, the very first step is to upgrade your project to the latest version of mathlib3.</p>",
        "id": 392004360,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1695162312
    },
    {
        "content": "<p>You can just concatentate all the files into one and then use oneshot. It's a <em>bit</em> of extra work, but I find less than using full blown mathport when the number of files is small (as I believe is the case here).</p>",
        "id": 392004472,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1695162366
    },
    {
        "content": "<p>I think it would be better to guide one person through using mathport properly and write more documentation than encourage people to concatenate files</p>",
        "id": 392004565,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1695162428
    },
    {
        "content": "<p>My personal experience is that the instructions to use mathport properly are very clear.</p>",
        "id": 392005015,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1695162658
    },
    {
        "content": "<p>Hi! I see in the instructions for Mathport Oneshot that I can put <code>#align</code> statements in a file <code>Oneshot/lean4-in/Extra.lean</code>. Sorry for being dense, but where should I put them when running Mathport proper?</p>",
        "id": 396123284,
        "sender_full_name": "Alistair Tucker",
        "timestamp": 1697040608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"111433\">@Alistair Tucker</span> If you add <code>\"Extra\"</code> to the <code>\"extraModules\"</code> field in <code>config-project.json</code>, it will use the same file <code>Oneshot/lean4-in/Extra.lean</code>; or you can add a file in another location if you add the path to it to the <code>\"leanPath\"</code>field</p>",
        "id": 396158056,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1697054885
    },
    {
        "content": "<p>I didn't know anyone was actually using this feature!</p>",
        "id": 396158116,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1697054927
    }
]