[
    {
        "content": "<p>As part of the ongoing work to add the proof of the <strong>Effros Theorem</strong> to mathlib (see <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Effros.20Theorem/with/563236825\">#mathlib4 &gt; Effros Theorem</a>), I would like to add a class for the topological spaces such that <code>MeasureTheory.AnalyticSet Set.univ</code>.</p>\n<p>I opened <a href=\"https://github.com/leanprover-community/mathlib4/pull/32742\">#32742</a> with the first try for <code>SuslinSpace</code>, see also <a href=\"https://en.wikipedia.org/wiki/Polish_space#Suslin_spaces\">wikipedia</a>, however I feel it would probably be best to stay clear of proper nouns and use a more descriptive identifier. I believe something like <code>AnalyticSpace</code> would be good. <span class=\"user-mention\" data-user-id=\"268315\">@Anatole Dedecker</span> suggested <code>IsAnalytic/AnalyticSpace</code> among others.</p>\n<p>One issue with this name is that there is already an unrelated concept of algebraic geometry, see <a href=\"https://en.wikipedia.org/wiki/Analytic_space\">https://en.wikipedia.org/wiki/Analytic_space</a>. I feel like there is very little risk of confusion, as long as <code>AnalyticSpace</code> lives in a relevant namespace, for instance <code>MeasureTheory</code> or <code>MeasureTheory.AnalyticSet</code>.</p>\n<p>Descriptive set theory is actually not my area of expertise. Is anyone familiar with the common practice there?</p>",
        "id": 566542510,
        "sender_full_name": "Lara Toledano",
        "timestamp": 1767705796
    },
    {
        "content": "<p>In descriptive set theory and mathematical logic, the term 'analytic space' is standard and the only context I'm aware of in which 'Suslin space' shows up is certain kinds of generalized descriptive set theory in which Suslin sets are no longer the same thing as analytic sets.</p>\n<p>'Suslin space' might be more common in some parts of the measure theory literature, but I'm not as familiar with that.</p>",
        "id": 566547374,
        "sender_full_name": "James E Hanson",
        "timestamp": 1767707582
    }
]