[
    {
        "content": "<p>I am editing a pull request now that formalizes deficient, abundant, and weird numbers in Lean (<a href=\"https://github.com/leanprover-community/mathlib4/pull/14269\">#14269</a>). My reviewer and I ran into an issue with the styling convention. Apparently, definitions like <code>def Deficient</code> should instead be written as <code>def IsDeficient</code>. However, <code>Prime</code> and <code>Nat.Perfect</code> do not follow this convention. Does anyone know what the right convention should be?</p>",
        "id": 449748878,
        "sender_full_name": "Colin Jones ⚛️",
        "timestamp": 1720402786
    },
    {
        "content": "<p>See<br>\n<span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/270676-lean4/topic/.60Antisymm.60.20is.20in.20.60Type.60/near/449659498\">said</a>:</p>\n<blockquote>\n<p>When reviewing a PR adding things like abundant numbers I suggested they be called <code>IsAbundant</code> but then I realised that we had <code>Prime</code> and <code>Perfect</code>. I'd definitely be in favour of enforcing Is for Props, I think it makes for better understanding (for example it helps when trying to figure out how to make things like integral domains)</p>\n</blockquote>",
        "id": 449775679,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1720415339
    },
    {
        "content": "<p>Clarification for myself: I think Yael is meaning to link to a thread with today's discussion about this, rather than saying that Kevin is saying what the convention is (that's still not exactly sorted out).</p>",
        "id": 449781565,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1720418614
    },
    {
        "content": "<p>Yes there's at least one active discussion going on about this somewhere on this site (in a hurry and on mobile, sorry no link, but you can search for the quote above)</p>",
        "id": 449812105,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1720428783
    },
    {
        "content": "<p>Kyle is perfectly right. And in fact I agree more with Kyle than with Kevin in the aforementioned discussion.</p>",
        "id": 449827724,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1720433595
    },
    {
        "content": "<p>My internet connection is currently on and off, so don't expect my messages to always make sense</p>",
        "id": 449827771,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1720433626
    }
]