[
    {
        "content": "<p>Heads up! The new alias syntax <a href=\"#narrow/stream/287929-mathlib4/topic/alias.20command.20ordering/near/378351642\">discussed earlier</a> is about to land in Mathlib!</p>\n<p>It's already active in Std and it will be rolled into Mathlib soon!  There is no need for action on your part, everything currently in Mathlib should be patched all at once. (It's been tested a lot so we don't expect major hiccups.)</p>\n<p>However, if you are working on a project that is using the old alias command it will break and you will have to fix it.  No worries though, the new syntax is designed to be easier to use and closer to the familiar <code>def</code> and <code>theorem</code> commands.</p>\n<p>The basic rules are that:</p>\n<ul>\n<li><code>alias A ← B</code> should become <code>alias B := A</code></li>\n<li><code>alias A ↔ B C</code> should become <code>alias ⟨B,C⟩ := A</code> (blanks are allowed for either direction)</li>\n</ul>\n<p>As a bonus, the new syntax supports attributes <code>@[...]</code> as well as modifiers: <code>protected</code>, <code>private</code>, etc. These work in the same way they do for <code>theorem</code> and <code>def</code>. However, some seldom used features of the old alias command have been dropped: </p>\n<ul>\n<li>You can no longer declare multiple aliases with the same target in the same line.</li>\n<li>The iff variant no longer supports automatic name generation.</li>\n</ul>\n<p>As usual, feel free to ask if you have questions, concerns or run into issues with this transition.</p>",
        "id": 386727689,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1692754611
    },
    {
        "content": "<p>I was actually thinking of making mathlib4 alias commmand into a try this, but it's probably already too late for that</p>",
        "id": 386904270,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1692805833
    },
    {
        "content": "<p>The patch has been merged. Sorry <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span>, I wish I had known of your plan earlier.</p>",
        "id": 386927454,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1692814208
    },
    {
        "content": "<p>I think we need a better system for Mathlib patches from Std. <a href=\"#narrow/stream/348111-std4/topic/Mathlib.20bump.20patches/near/385623850\">https://leanprover.zulipchat.com/#narrow/stream/348111-std4/topic/Mathlib.20bump.20patches/near/385623850</a></p>",
        "id": 386927882,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1692814382
    }
]