[
    {
        "content": "<p>I noticed in the <a href=\"https://leanprover-community.github.io/contribute/doc.html#header-comment\">documentation style guide</a> that files defining notation should contain a docstring header called \"Notations\".</p>\n<p>Upon inspecting mathlib I saw that there are currently 110 such headers. There is a further 187 cases of  \"Notation\" headers. In my mind \"Notation\" sounds better (even in the plural case) than \"Notations\" and I think this explains why the mandated version is less popular.</p>\n<p>I'd personally like to standardize on \"Notation\", but I want to ask for the community's opinion before doing so.</p>",
        "id": 539408505,
        "sender_full_name": "Harald Husum",
        "timestamp": 1757856540
    },
    {
        "content": "<p>/poll Should I<br>\nChange all isntances of \"Notation\" headers to \"Notations\"<br>\nChange all isntances of \"Notations\" headers to \"Notation\" and try to get the style guide updated<br>\nNone of the above (please ellaborate)</p>",
        "id": 539408684,
        "sender_full_name": "Harald Husum",
        "timestamp": 1757856677
    },
    {
        "content": "<p>the module docstring \"workspace snippet\" thing in VSCode generates a section called \"Notation\"</p>",
        "id": 539408864,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1757856858
    },
    {
        "content": "<p>In my mind, \"notation\" is uncountable - so the plural sounds just awkward</p>",
        "id": 539409840,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1757857846
    },
    {
        "content": "<p>I suspect (but am not sure) that English is in a transition from \"notation\" being a countable noun to being a uncountable one. As such, I think it's fine to leave both and this is not worth changing.</p>",
        "id": 539418269,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1757865921
    },
    {
        "content": "<p>I think “notation” can be either countable or uncountable, depending on context, as for many uncountable nouns: uncountable in most cases, when referring to the stuff of a convention (“there’s so much notation used in this file”, “adding more notation is contentious”) and countable when referring to (potentially multiple) whole conventions (“there are various notations for…”, “is there a notation yet for…?”). Similar to “water”/“waters”, “mass”/“masses”.</p>\n<p>I’d tend to consider a single choice of multiple nonoverlapping conventions (e.g. notation for the identity map + notation for the hom type) still a <em>single convention</em>, and so lean towards using “notation” here. Likewise, “notations” connotes multiple alternative, possibly overlapping notations to me. (The boundary is indeed a little fuzzy, though, since collections of conventions can also be conventions!)</p>",
        "id": 539422391,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1757868753
    },
    {
        "content": "<p>I think I share the perspective of <span class=\"user-mention\" data-user-id=\"548935\">@Thomas Murrills</span>  here, that \"notation\" can be both countable and uncountable, depending on context, but that the case of this header seems to lean more in the uncountable direction.</p>\n<p>I'm not sure it means much, but ChatGPT seems to agree:</p>\n<blockquote>\n<p>Is the noun \"notation\" considered countable or uncountable?</p>\n</blockquote>\n<blockquote>\n<p>The noun <strong>“notation”</strong> can be <strong>both countable and uncountable</strong>, depending on context:</p>\n<h3>1. <strong>Uncountable Usage</strong></h3>\n<p>When referring to a <strong>system of symbols or a way of writing things</strong>, “notation” is usually <strong>uncountable</strong>.</p>\n<ul>\n<li><em>Example:</em> “Musical notation has evolved over centuries.”<br>\n  Here, we treat it as a general concept, not something that can be counted.</li>\n</ul>\n<h3>2. <strong>Countable Usage</strong></h3>\n<p>When referring to <strong>specific kinds or instances of notations</strong>, it can be <strong>countable</strong>.</p>\n<ul>\n<li><em>Example:</em> “Different notations are used in physics and mathematics.”<br>\n  In this case, you’re talking about several distinct types of notation.</li>\n</ul>\n</blockquote>\n<p>It seems from the poll that people are either positive or indifferent to the change. Based on that I'll make a few PRs and see what comes out of it.</p>",
        "id": 539500862,
        "sender_full_name": "Harald Husum",
        "timestamp": 1757927306
    },
    {
        "content": "<p>PR updating the style guide: <a href=\"https://github.com/leanprover-community/leanprover-community.github.io/pull/687\">https://github.com/leanprover-community/leanprover-community.github.io/pull/687</a></p>",
        "id": 539501973,
        "sender_full_name": "Harald Husum",
        "timestamp": 1757927595
    },
    {
        "content": "<p>And a PR updating the headers in mathlib: <a href=\"https://github.com/leanprover-community/mathlib4/pull/29666\">#29666</a></p>",
        "id": 539504542,
        "sender_full_name": "Harald Husum",
        "timestamp": 1757928247
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"767479\">Harald Husum</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Notations.20vs.20Notation/near/539504542\">said</a>:</p>\n<blockquote>\n<p>And a PR updating the headers in mathlib: <a href=\"https://github.com/leanprover-community/mathlib4/pull/29666\">#29666</a></p>\n</blockquote>\n<p>Execution LGTM, with one minor comment.</p>",
        "id": 539628839,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1757962522
    }
]