[
    {
        "content": "<p>As in the case of the Fourier transform (see <a href=\"https://github.com/leanprover-community/mathlib4/pull/31115\">#31115</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/31114\">#31114</a>), I think we should embrace notation type-classes more for operators that appear in distribution theory. The refactor for the Fourier transform was rather simple and very obviously necessary, but now I have one which I would like to discuss beforehand since it is not as obvious: <code>lineDeriv</code> (aka partial derivatives). I experimented with the issue of the notation for integrals and partial derivatives colliding, but that is not the case: <a href=\"https://github.com/leanprover-community/mathlib4/pull/31876\">#31876</a> (see also this for the class and notation I am proposing).<br>\nThis has the additional benefit that we usually define operators as CLMs, but then there might be a choice of the scalar multiplication, so this is bad for applied functions as <code>lineDerivCLM R f</code> is equal to <code>lineDerivCLM R' f</code>. Currently (and previously for the FT), we have <code>simp</code>-lemmas that go to the bare functions, but that is bad because we lose the information that these functions are very well-behaved (see <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=SchwartzMap.pderivCLM_apply#doc\">docs#SchwartzMap.pderivCLM_apply</a> or <a href=\"https://github.com/leanprover-community/mathlib4/pull/30240\">#30240</a> for a PR with a similar problem (<code>fderivLM_apply</code>) for examples).<br>\nThe easiest thing would be keeping <code>lineDeriv</code> as it is and only use the notation only for distribution theory. Any opinions? (same question comes up for <code>fderiv</code>, but there I could't think of good notation..)<br>\ncc <span class=\"user-mention\" data-user-id=\"268315\">@Anatole Dedecker</span> <span class=\"user-mention\" data-user-id=\"466290\">@Luigi Massacci</span> <span class=\"user-mention\" data-user-id=\"197836\">@Jireh Loreaux</span></p>",
        "id": 558574689,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1763699304
    },
    {
        "content": "<p>Interesting idea: this could also become relevant for the weak derivative of classical distributions. <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 558593157,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1763710100
    },
    {
        "content": "<p>Yes, this is the point, we will have lots of definitions for the derivative</p>",
        "id": 558597553,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1763711750
    },
    {
        "content": "<p>And proofs that they coincide for nice functions!</p>",
        "id": 558597832,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1763711842
    },
    {
        "content": "<p>This sounds nice indeed (and I would definitely want the same for <code>fderiv</code>), but I am worried about naming. One could argue, for example, that <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=FourierModule.fourier_add#doc\">docs#FourierModule.fourier_add</a> is an overly-ambitious name, since it doesn't cover things like <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=VectorFourier.fourierIntegral_add#doc\">docs#VectorFourier.fourierIntegral_add</a>. Similarly, how would you call the polymorphic analog of <code>fderiv_add</code> if you just call the generic notion \"fderiv\"?</p>",
        "id": 558619930,
        "sender_full_name": "Anatole Dedecker",
        "timestamp": 1763719083
    },
    {
        "content": "<p>So indeed I think that it would be like to keep separate the fully unbundled <code>fderiv</code>/<code>lineDeriv</code>/<code>fourierIntegral</code> form the associated operators between good function spaces. Maybe <code>fderivOp</code>/<code>lineDerivOp</code>/<code>fourierOp</code> is enough though!</p>",
        "id": 558620230,
        "sender_full_name": "Anatole Dedecker",
        "timestamp": 1763719182
    },
    {
        "content": "<p>Yeah, the naming is not easy. I was thinking of using just the namespace to distinguish <code>_root_.fderiv_add</code> from <code>FDeriv.fderiv_add</code> or something similar.<br>\nIn the case of the Fourier transform it is convenient that the original definition is <code>fourierIntegral</code>, not <code>fourier</code> or <code>fourierTransform</code>, so this problem didn't come up</p>",
        "id": 558638113,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1763724697
    },
    {
        "content": "<p>The issue with using namespacing as disambiguation is that we cannot put a specific declaration in a more specific namespace if it is about the specific differentiation operator on a specific space. So I would really prefer a disambiguation in the name itself, and the more I think about it the more I like <code>fderivOp</code>.</p>",
        "id": 558645504,
        "sender_full_name": "Anatole Dedecker",
        "timestamp": 1763727313
    },
    {
        "content": "<p>I think the only theorem that mentions the classic derivative should be something like <code>fderiv_coe</code>, but for derivatives I would be happy with <code>fderivOp</code> (I would like to stick with <code>fourier</code> for the Fourier transform, because I expect it also to be used for Fourier series and DFT and the FT on locally compact groups).</p>",
        "id": 558767994,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1763769109
    },
    {
        "content": "<p>I am all for more concise, readable notations!</p>",
        "id": 558777091,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1763777926
    }
]