[
    {
        "content": "<p>Hello! I am once again formalizing programming languages in Lean, and I have a somewhat irritating nit:</p>\n<ul>\n<li>I have a language whose initial semantics is a _preorder_; we quotient later!</li>\n<li>Which is in fact an omega-complete _preorder_</li>\n<li>But <code>OmegaCompletePartialOrder</code> requires things to be a <code>PartialOrder</code></li>\n</ul>\n<p>The issue is that it turns out it's very helpful to have the <code>OmegaCompletePartialOrder</code> API on both the pre-semantics and the semantics, so we can relate them. And there's nothing about omega-chains which says they need to be on a partial order rather than a preorder (though of course on a preorder ωSup makes a _choice_ of chain!)</p>\n<p>Any nice way to deal with this?</p>\n<p>One option might be to move the <code>ωSup</code> notation to another typeclass (say, <code>OmegaSup</code>) which only depends on <code>LE</code>, like for <code>Inf</code> and <code>Sup</code>, and then have an <code>OmegaCompletePreorder</code> class which takes a <code>[Preorder]</code> parameter and finally have <code>OmegaCompletePartialOrder</code> extend <code>PartialOrder</code> and <code>OmegaCompletePreorder</code>?</p>\n<p>Or we could simplify and just do <code>OmegaCompletePreorder</code> with <code>ωSup</code></p>\n<p>I think most of the theorems in the file remain true for <code>OmegaCompletePreorder</code> with no additional changes.</p>\n<p>Later PRs could then weaken many of the preconditions in <code>Mathlib.Order.FixedPoints</code> to   <code>OmegaCompletePreorder</code> (since this doesn't <code>extend</code> anything this should be forwards-compatible); and the file is only used in <code>Mathlib.SetTheory.Cardinal.SchroederBernstein</code>.</p>\n<p>This would help a lot with some of my formalization work!</p>\n<p>Thoughts?</p>",
        "id": 563635236,
        "sender_full_name": "Jad Ghalayini",
        "timestamp": 1765646539
    },
    {
        "content": "<p>Seems fine.</p>",
        "id": 563666799,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1765692000
    }
]