[
    {
        "content": "<p>Dear Mathlib maintainers:</p>\n<p>I would like to register a protest about how this \"PRs from forks\" business has been handled.</p>\n<ul>\n<li>As far as I'm aware, there was <strong>no discussion with the community</strong> ahead of time, nor any attempt to make a case to the community about why this decision was in everyone's best interests; just a sudden point-blank order \"you will now do X\".</li>\n<li>There was <strong>no clear guidance or documentation</strong> given about how the new PR workflow is supposed to work. As others have pointed out, for many Mathlib contributors (such as myself), Mathlib is the <em>only</em> GitHub project they have experience of contributing to; so \"we're switching to something closer to the usual github workflow\" conveys no information at all.</li>\n<li>The PR migration script appears <strong>not to have been sufficiently tested</strong>; multiple users have reported problems with it (and these appear to be multiple different problems, not just multiple reports of the same issue).</li>\n<li>The announcement was very unclear about the <strong>time-frame for removing write access</strong> to existing PRs. One of the maintainers expressed <em>surprise</em> that the discussion thread had jumped from \"<em>new</em> PR's should be made from forks\" to \"<em>existing</em> PR's should be migrated to forks\"; but when the maintainers have posted in the announcement thread that \"we will be removing write access to the repository from most users\", without any indication of the timeframe, what else did you expect to happen? (If you had written something like \"we will start removing write access in a month's time\" or whatever, it would have been much less disruptive.)</li>\n<li>I haven't yet managed to get the PR migration script to work, so I'm not sure what it's supposed to be doing; but from what I can glean from its source code, it looks like it <strong>doesn't copy across the comment history</strong> on PR's. If so, the loss of the history of previous review comments, and the changes that are made in response, will make it needlessly harder for migrated PR's to be reviewed.</li>\n</ul>\n<p>I feel this has been a regrettable departure from the normally very harmonious way that the mathlib community is run, and I hope it is not a sign of how things will be in the future.</p>\n<p>Yours, David Loeffler</p>",
        "id": 523947047,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749821525
    },
    {
        "content": "<p>I agree with the points that don't have to do with the migration script. (mainly because I've not yet run the script)</p>",
        "id": 523950679,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1749822610
    },
    {
        "content": "<p>Thanks for your appreciation for the huge work that this took (both by volunteers, and by paid employees of the FRO supporting Mathlib), even if you can't understand at this point why this change was essential and urgent. :-)</p>\n<p>The suggestion to try copying the comment history across is a reasonable one. Does anyone have capacity to attempt that? Obviously it couldn't be done on a comment-by-comment basis, but perhaps a single comment containing a \"dialogue\" version of the comments could be constructed.</p>",
        "id": 524020491,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1749852989
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/25892\">#25892</a> attempts to copy comments across while migrating PRs.</p>",
        "id": 524107221,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1749966816
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/25890\">#25890</a> improves windows compatibility</p>",
        "id": 524107226,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1749966829
    },
    {
        "content": "<p>If some non-git experts could suggest changes or improvements to <a href=\"https://github.com/leanprover-community/leanprover-community.github.io/pull/643\">https://github.com/leanprover-community/leanprover-community.github.io/pull/643</a>, that would be very helpful. We will link to this page from the community homepage, as well as create a #git linkifier.</p>",
        "id": 524108583,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1749968697
    },
    {
        "content": "<p>This answers all gut questions I had about git workflows in the new model. Thanks for writing this!</p>",
        "id": 524109014,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1749969207
    },
    {
        "content": "<p>I find that guide to be very much linux oriented (in particular, almost everything is done from the command line). I would suggest something for Win users, but where? Separate file, below that one, other?</p>",
        "id": 524110282,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1749971009
    },
    {
        "content": "<p>I was also thinking of writing a similar guide, more geared towars explaining the basics of <em>what</em> git is, git vocabulary (branch, commit, remotes, etc.) rather than \"the list of commands to run\", and I was thinking it could be part of the GitHub matlib \"wiki\" section. Would that still be welcome even if <span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span>'s guide makes it to the website?</p>",
        "id": 524111725,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1749973083
    },
    {
        "content": "<p>Yes! Very welcome on either the wiki (we can link to it from the community website), or just as a section on the file I wrote.</p>",
        "id": 524112083,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1749973504
    },
    {
        "content": "<p>Definitely room for both IMHO</p>",
        "id": 524112086,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749973506
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"300245\">Filippo A. E. Nuccio</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524110282\">said</a>:</p>\n<blockquote>\n<p>I find that guide to be very much linux oriented (in particular, almost everything is done from the command line). I would suggest something for Win users, but where? Separate file, below that one, other?</p>\n</blockquote>\n<p>The problem here is that once you say you don't want command line instructions, you are committed to using some particular GUI, and there are a million choices, and the instructions will be different for each.</p>",
        "id": 524112215,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1749973669
    },
    {
        "content": "<p>If someone can just pick one, I will write instructions for it.</p>",
        "id": 524112220,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1749973680
    },
    {
        "content": "<p>I'm afraid there isn't just a single command-line interface in the world either.</p>",
        "id": 524112270,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749973751
    },
    {
        "content": "<p>But they're much more similar than the gui ecosystem!</p>",
        "id": 524112334,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1749973840
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524112220\">said</a>:</p>\n<blockquote>\n<p>If someone can just pick one, I will write instructions for it.</p>\n</blockquote>\n<p>GitHub desktop? I find it quite useful and know other people in the Lean community also use this. But have no idea if it's the most popular, but feels like the most official one to me at least (and it's on both Mac and PC).</p>",
        "id": 524112345,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1749973856
    },
    {
        "content": "<p>(Sorry, my remark came without context, it was intended to be read as a follow-up to an observation I just posted on the \"git guide\" pull-request pointing out that it included chunks of shell code written in bash that would likely not work under either zsh or the Windows shell.)</p>",
        "id": 524112390,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749973922
    },
    {
        "content": "<p>It’s been ages since I last used VSCode, but it has a basic git interface iirc? If we’re focusing on people \"just following the instructions\" perhaps we could assume VSCode as an editor and focus the \"gui\"-oriented stuff with VSCode GUI?</p>",
        "id": 524112476,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1749974040
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524112215\">said</a>:</p>\n<blockquote>\n<p>The problem here is that once you say you don't want command line instructions, you are committed to using some particular GUI, and there are a million choices, and the instructions will be different for each.</p>\n</blockquote>\n<p>This is why I think Robin Carlier's earlier proposal is important: rather than focussing exclusively on one particular interface, to prioritize explaining the mental model – what steps need to be done in what order and the vocabularity that is used to describe them. Then users can refer to the docs of whatever interface they prefer in order to find out how to execute those steps.</p>",
        "id": 524112587,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749974155
    },
    {
        "content": "<p>But I think we're missing the point of what to do with a fellow mathematician who has never written a single command line. Should they change their habit even before trying opening a single PR?</p>",
        "id": 524112761,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1749974382
    },
    {
        "content": "<p>I'd advocate for offering instructions using the built-in Git client in VSCode.</p>",
        "id": 524112909,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749974538
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524107221\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/25892\">#25892</a> attempts to copy comments across while migrating PRs.</p>\n</blockquote>\n<p>I have posted some feedback on this in the other thread (<a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Feedback.20on.20scripts.2Fmigrate_to_fork.2Epy/with/523697294\">#mathlib4 &gt; Feedback on scripts/migrate_to_fork.py</a> )</p>",
        "id": 524117243,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749979846
    },
    {
        "content": "<p>FWIW, I find the UI of GitHub Desktop to be much more intuitive than the UI of the Git integration built into VS Code for all basic Git operations, so if you are looking for something that is both easy to use and nicely integrated with GitHub, it's GitHub Desktop. I find the VS Code one to be pretty painful to use.<br>\nThe main limitation of GitHub Desktop is that it won't work for you if you aren't working locally, e.g. in something like Gitpod.</p>\n<p>However, there are a couple of operations that I still find myself reaching to the command line for, most of which is caused by preferring rebasing over merging (so your experience might vary if you prefer merging):</p>\n<ol>\n<li>Hard-resetting to a remote branch when there was a force-push on the remote branch by someone else.</li>\n<li>Using <code>rebase --onto</code> when I have a PR that is based on another PR that was now merged, and I want to move the changes of the stacked PR to be based on master.</li>\n<li>Managing more remotes than <code>upstream</code> and <code>origin</code> (I don't need to do this often).</li>\n</ol>\n<p>1 and 2 are limitations of the VS Code integration as well, while 3 isn't. The VS Code integration has some other limitations, though, like not being able to squash commits. Some of these limitations can probably be lifted with extra extensions like the Git Graph or GitLens ones, but I find those UIs to be really painful as well.</p>",
        "id": 524118963,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1749981696
    },
    {
        "content": "<p>You’re not really the target audience for a getting-started guide, Marc. The great advantage of VSCode’s built -in client is that we can safely assume users have it on their machine already.</p>",
        "id": 524119876,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749982534
    },
    {
        "content": "<p>I’ve often heard from mathematician colleagues that they made an attempt to try out Lean but lost interest because the installation process was too long / too complicated/ involved downloading too much stuff.  So minimizing the number of packages a user needs to install should be a priority.</p>",
        "id": 524121091,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749983560
    },
    {
        "content": "<blockquote>\n<p>preferring rebasing over merging (so your experience might vary if you prefer merging)</p>\n</blockquote>\n<p>FWIW, I don't have a preference in this regard, because <em>I haven't the faintest idea what the difference between them is</em>; and I am unhappy with the implication that this is, or should be, essential knowledge for a Mathlib contributor.</p>\n<p>The Lean community contains both programmers, and mathematicians; the latter, by and large, do not regard details of how to use <code>git</code> as obvious or self-explanatory. The last 48 hours or so have given the distinct impression that those leading this community have either forgotten that the non-programmers exist, or do not value their contributions.</p>",
        "id": 524122329,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749984748
    },
    {
        "content": "<p>That's true. I'm just saying that I believe that the UI of GitHub Desktop might be more intuitive than the one in VS Code, even for beginners. At least I found the former to be usable and the latter to be really hard to use when I didn't know much about Git, since the VS Code UI is just a thin wrapper over the command-line UI and doesn't really put the most common operations front-and-center. So IMO there's a trade-off here: The installation gets more complicated, while using Git becomes easier. Not sure which of these two is preferable :-)</p>\n<p>E.g. the notion of \"staging\" is really intuitive in GitHub Desktop: There's a commit button, and all of your changes will be committed by default. You can unselect some of them using a checkbox if you don't want to commit them. In the VS Code integration, your files aren't staged by default and VS Code will complain when you try to commit without first staging files.</p>\n<p><a href=\"/user_uploads/3121/uW_sgqeORe2Mhqrww3EHXkjf/image.png\">Staging in GitHub Desktop</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/uW_sgqeORe2Mhqrww3EHXkjf/image.png\" title=\"Staging in GitHub Desktop\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"741x439\" src=\"/user_uploads/thumbnail/3121/uW_sgqeORe2Mhqrww3EHXkjf/image.png/840x560.webp\"></a></div><p><a href=\"/user_uploads/3121/Lt3RAHEyv1xKbe7QLDtNj1zW/image.png\">Staging in VS Code</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/Lt3RAHEyv1xKbe7QLDtNj1zW/image.png\" title=\"Staging in VS Code\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"423x541\" src=\"/user_uploads/thumbnail/3121/Lt3RAHEyv1xKbe7QLDtNj1zW/image.png/840x560.webp\"></a></div><p>Similarly, when switching branches while you still have changes on your branch, GitHub Desktop will suggest to either move your changes over to the other branch or stash them on your old branch, while the VS Code integration will always move them over by default, and you need to figure out that stashing is the thing you need to use in its UI to get the other behavior. GitHub Desktop also reminds you that you have stashed changes on your branch when you do.</p>\n<p><a href=\"/user_uploads/3121/HvXyyw6EsqwDnpuvnWAsuinn/image.png\">Stashing in GitHub Desktop</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/HvXyyw6EsqwDnpuvnWAsuinn/image.png\" title=\"Stashing in GitHub Desktop\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"739x436\" src=\"/user_uploads/thumbnail/3121/HvXyyw6EsqwDnpuvnWAsuinn/image.png/840x560.webp\"></a></div><p><a href=\"/user_uploads/3121/4l9wR69krPCDPOsDe6Xm4jUZ/image.png\">Stashing in VS Code (which of these buttons do I click?)</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/4l9wR69krPCDPOsDe6Xm4jUZ/image.png\" title=\"Stashing in VS Code (which of these buttons do I click?)\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"742x679\" src=\"/user_uploads/thumbnail/3121/4l9wR69krPCDPOsDe6Xm4jUZ/image.png/840x560.webp\"></a></div><p><span class=\"user-mention silent\" data-user-id=\"481963\">David Loeffler</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524122329\">said</a>:</p>\n<blockquote>\n<p>FWIW, I don't have a preference in this regard, because <em>I haven't the faintest idea what the difference between them is</em>; and I am unhappy with the implication that this is, or should be, essential knowledge for a Mathlib contributor.</p>\n</blockquote>\n<p>I am not suggesting this implication. It isn't essential knowledge. I'm just providing examples where some users may still need to fall back to the command line to outline some of the limitations of these UIs that I've encountered myself. If you don't know what rebasing is, then great - you were not the intended target audience of my post.</p>",
        "id": 524122767,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1749985185
    },
    {
        "content": "<blockquote>\n<p>If you don't know what rebasing is, then great - you were not the intended target audience of my post.</p>\n</blockquote>\n<p>If so, why did you post your post into a discussion about what UI to prioritize <em>in a guide to first-time git users</em>?</p>",
        "id": 524122948,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749985358
    },
    {
        "content": "<p>David, you're probably right. I'll stop contributing to this discussion and providing information about the options that are available.</p>",
        "id": 524122993,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1749985407
    },
    {
        "content": "<p>My wider point is that there is a huge cultural chasm between what programmers regard as \"obvious\" and what mathematicians regard as \"obvious\". Marc and I clearly live on different sides of this chasm. Clearly the Mathlib community needs both groups, but some care is needed in communicating across the divide.</p>",
        "id": 524123124,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749985547
    },
    {
        "content": "<p>Providing information on available options is clearly valuable, but we need to avoid drowning new users in a flood of unfamiliar concepts, terminology, and tools.</p>",
        "id": 524123207,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749985605
    },
    {
        "content": "<p>David, would you be willing to try writing such a guide? It seems like you might be in the sweet spot. I'm sure we can help revise and proofread or indeed explain things if you have trouble working them out?</p>",
        "id": 524123393,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1749985804
    },
    {
        "content": "<p>@Kim I wouldn't know how to even start writing that. <em>I don't know how git is supposed to work</em>, I've literally never used it except for mathlib contributions – and, for the n-th time, I am quite fed up with it being assumed that everyone in the community knows how git works.</p>",
        "id": 524123878,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749986380
    },
    {
        "content": "<p>I suppose I could write a \"Getting started with Git : A guide for mathematicians\" note, but I cannot commit to keeping it up-to-date long term, and I am wary of getting into a position where I'm coming under fire from both sides (from newbies who are confused by my instructions <em>and</em> from experts who consider my instructions to be The Wrong Thing).</p>",
        "id": 524124477,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749986901
    },
    {
        "content": "<p>Here is a conceptual picture of git: <a href=\"https://eagain.net/articles/git-for-computer-scientists/\">https://eagain.net/articles/git-for-computer-scientists/</a></p>",
        "id": 524128641,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749991400
    },
    {
        "content": "<p>It says “for computer scientists”, basically explains git in terms of labelled directed acyclic graphs</p>",
        "id": 524128666,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749991434
    },
    {
        "content": "<p>And a game to learn git : <a href=\"https://ohmygit.org/\">https://ohmygit.org/</a></p>",
        "id": 524129240,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749992133
    },
    {
        "content": "<p>Another : <a href=\"https://learngitbranching.js.org/\">https://learngitbranching.js.org/</a></p>",
        "id": 524129297,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749992200
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524128641\">said</a>:</p>\n<blockquote>\n<p>Here is a conceptual picture of git: <a href=\"https://eagain.net/articles/git-for-computer-scientists/\">https://eagain.net/articles/git-for-computer-scientists/</a></p>\n</blockquote>\n<p>This is a very nice and clear explanation of how a <em>single</em> Git repo works (in isolation), but it says essentially nothing about working with remotes. The thing that has just changed, from a user's perspective, is suddenly having to manage working with multiple remotes (the master mathlib repo and individual user's forks of it).</p>",
        "id": 524129399,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749992294
    },
    {
        "content": "<p>I am trying to find resources on remotes which are as visual or mathematical as that one. If I don’t find one, and have a bit of time, I might write it. </p>\n<p>Meanwhile, here is a gist :  each remote is another git repository in its own right, and the goal of all the commands is to keep the relevant pieces of the history DAG as identical as possible. </p>\n<p>More precisely your local clone and a GitHub fork (origin) are both DAGs, which are isomorphic to (a subgraph of) the mathlib4 repo DAG called <code>upstream</code>.  The goal is to maintain the isomorphisms between these DAGs, specifically between their subgraphs reachable from the source vertex that is the latest commit on mathlib’s master branch. This needs to be done as you and many others are making changes to their respective DAGs by adding new vertices (called commits)</p>",
        "id": 524130025,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749992947
    },
    {
        "content": "<p>Thanks for the explanation, Shreyas! When you say \"reachable\", \"source vertex\" etc, are we thinking of the orientation of arrows as pointing backwards in time (from each commit to its predecessor) or forwards (from a commit to the later ones building on it)?</p>",
        "id": 524130489,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749993473
    },
    {
        "content": "<p>Yeah</p>",
        "id": 524130525,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749993497
    },
    {
        "content": "<p>Exactly</p>",
        "id": 524130528,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749993502
    },
    {
        "content": "<p>Backwards in time</p>",
        "id": 524130536,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749993508
    },
    {
        "content": "<p>[deleted]</p>",
        "id": 524130547,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749993516
    },
    {
        "content": "<p>Ultimately the chain of commits that begins with the source vertex of the master branch must be identical in all three copies of the DAG</p>",
        "id": 524130617,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749993594
    },
    {
        "content": "<p>That's a good model, but it doesn't seem to reflect what actually happened when I forked mathlib – it looks like I got <em>all</em> the branches and commits in the upstream repo, not just those which were ancestors of the latest commit on master.</p>",
        "id": 524130667,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749993646
    },
    {
        "content": "<p>GitHub provides you the option to copy only the main/master branch</p>",
        "id": 524131450,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749994534
    },
    {
        "content": "<p>and that is also why I said that we are maintaining an isomorphism between “subgraphs”, since it doesn’t preclude one from maintaining isomorphisms between larger subgraphs (subgraph-relation-wise larger) or choosing to ignore certain subgraphs (for example your local branches that you may decide not to push)</p>",
        "id": 524131522,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749994649
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524131450\">said</a>:</p>\n<blockquote>\n<p>GitHub provides you the option to copy only the main/master branch</p>\n</blockquote>\n<p>... but the Mathlib migrate script doesn't, apparently; perhaps it should offer this option, or even make it the default. [Edit: I have posted to suggest this in the \"migrate script feedback\" thread.] Not important, though; I ran a script to delete all the branches in my fork except <code>master</code> and my own.</p>\n<p>Related question: somewhere, there is a mapping being stored from branches in my GitHub fork, to branches in the master mathlib repo, saying \"this branch is based off that one\". How do I edit this mapping? I know how to change the upstream branches for each branch in my local repo; but that's not what I'm asking here – I'm asking about the mapping between branches in my GH fork of Mathlib and in the master Mathlib, not the mapping between branches in my GH fork and my local repo.</p>",
        "id": 524131589,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749994751
    },
    {
        "content": "<p>(The motivation for this is to make the button in GitHub, for pulling new commits from upstream into the PR branches in my fork, work properly. At the moment, it looks for new commits in my old PR branches in the master repo, rather than the master branch of the master repo.)</p>",
        "id": 524131761,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749995020
    },
    {
        "content": "<p>I do not know of an explicit way to change that mapping out of hand. I have never migrated PRs like this before</p>",
        "id": 524132106,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749995430
    },
    {
        "content": "<p>Perhaps someone with more familiarity with Github's interface could help</p>",
        "id": 524132150,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749995492
    },
    {
        "content": "<p>No worries, and many thanks for all your explanations in this thread!</p>",
        "id": 524132260,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749995646
    },
    {
        "content": "<p>The git command is <code>git branch --set-upstream</code>. I don't know of any way to trigger this command through any UI</p>",
        "id": 524133667,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1749997031
    },
    {
        "content": "<p>@Yael, isn't that for changing the mapping between <em>local</em> branches and <em>origin</em> branches, not between <em>origin</em> branches and <em>upstream</em> branches?</p>",
        "id": 524133711,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749997080
    },
    {
        "content": "<p>Quote:</p>\n<blockquote>\n<p>I know how to change the upstream branches for each branch in my local repo; but that's not what I'm asking here – I'm asking about the mapping between branches in my GH fork of Mathlib and in the master Mathlib, not the mapping between branches in my GH fork and my local repo.</p>\n</blockquote>\n<p>I think Yael just answered the question I specifically said I was <em>not</em> asking.</p>",
        "id": 524133819,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749997186
    },
    {
        "content": "<p>No, I read really carefully your message that you quote, and I do believe I am answering your question</p>",
        "id": 524133962,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1749997308
    },
    {
        "content": "<p>... would you care to elaborate how?</p>",
        "id": 524133978,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749997324
    },
    {
        "content": "<p>I am going to state a few facts (I am not sure all of them are correct, feel free to point issues):</p>\n<ol>\n<li>The local repo acts just like any other fork. In the standard mathlib setup until last week, you actually had two forks, the local one and <code>origin</code>, and there was a mapping of branches between them.</li>\n<li>In the new setup, you will typically interact with <em>three</em> forks: your local one, <code>upstream</code> (aka <code>leanprover-community/mathlib4</code>) and <code>origin</code> (aka <code>loefflerd/mathlib4</code>)</li>\n<li><code>git branch --set-upstream</code> works just as well to set the \"upstream branch\" ( <span aria-label=\"warning\" class=\"emoji emoji-26a0\" role=\"img\" title=\"warning\">:warning:</span> not necessarily an <code>upstream</code> branch!)  of a local branch to a branch from <code>origin</code> or a branch from <code>upstream</code>.</li>\n<li>Your question is nonsensical, since even if you could \"link\" a branch from <code>origin</code> to a branch from <code>upstream</code>, you wouldn't be able to push anything to the <code>upstream</code> counterpart since you will soon not have write access anymore.</li>\n</ol>",
        "id": 524134180,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1749997541
    },
    {
        "content": "<p>I would also surprised if git commands run on the local repo change tracking branches between the origin repo and upstream repo</p>",
        "id": 524134222,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749997582
    },
    {
        "content": "<p>Edited</p>",
        "id": 524134348,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1749997690
    },
    {
        "content": "<p>Basically I think you are asking the wrong question. But feel free to explain further what you want to do with this \"linking\" between the <code>origin</code> and <code>upstream</code> branches.</p>",
        "id": 524134469,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1749997807
    },
    {
        "content": "<p>There's a button in the GitHub web interface for each branch in my fork repo, which says \"Sync fork\". Perhaps you can explain to whichever github dev put it there that its existence is apparently nonsensical.</p>",
        "id": 524134482,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749997820
    },
    {
        "content": "<p>I'm trying to change which fork on upstream that button triggers pulling from.</p>",
        "id": 524134514,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749997858
    },
    {
        "content": "<p>I must say I have never witnessed that button on any other branch than <code>master</code>. Can you send a screenshot of this button on a non-<code>master</code> branch?</p>",
        "id": 524134572,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1749997908
    },
    {
        "content": "<p>So point 4 is a bit more nuanced than your messages suggest so far. I can see why David is asking this question.</p>",
        "id": 524134586,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749997922
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"481963\">David Loeffler</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524134482\">said</a>:</p>\n<blockquote>\n<p>There's a button in the GitHub web interface for each branch in my fork repo, which says \"Sync fork\".</p>\n</blockquote>\n<p>Do you have reason to believe that this isn't just based on branch names? So if you look at a branch named <code>branch</code> on your fork, it will offer you to sync with the branch named <code>branch</code> on the upstream, if such a branch exists?</p>",
        "id": 524134594,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1749997925
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524134586\">said</a>:</p>\n<blockquote>\n<p>So point 4 is a bit more nuanced than your messages</p>\n</blockquote>\n<p>I was expecting David to want to push changes through this link, not to pull them (what branches could one want to pull commits from if not <code>master</code>? <code>nightly-testing</code> maybe?)</p>",
        "id": 524134687,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1749998007
    },
    {
        "content": "<p>indeed, according to <a href=\"https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/working-with-forks/syncing-a-fork\">the github docs about this button</a>, it seems it basically syncs the git history from the upstream repo and fast-forward merges <code>upstream/main</code> into <code>origin/main</code>. however, it's a not a <code>main</code> branch only</p>",
        "id": 524134742,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1749998057
    },
    {
        "content": "<p>David is asking a reasonable question because  I just explained git as  a distributed version control system with multiple independent copies of a repository</p>",
        "id": 524134758,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749998073
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/_RV6MUNFfI8_m3dMPmrZeAts/Screenshot-2025-06-15-at-16.33.25.png\">Screenshot 2025-06-15 at 16.33.25.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/_RV6MUNFfI8_m3dMPmrZeAts/Screenshot-2025-06-15-at-16.33.25.png\" title=\"Screenshot 2025-06-15 at 16.33.25.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1868x738\" src=\"/user_uploads/thumbnail/3121/_RV6MUNFfI8_m3dMPmrZeAts/Screenshot-2025-06-15-at-16.33.25.png/840x560.webp\"></a></div>",
        "id": 524134799,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749998107
    },
    {
        "content": "<p>So David is justified in asking why he can't control the repo copy which is his github fork to point some branch there to an upstream branch</p>",
        "id": 524134808,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749998110
    },
    {
        "content": "<p>What if you rename the branch? Does the button still appear?</p>",
        "id": 524134841,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1749998145
    },
    {
        "content": "<p>I genuinely do not know where this button is coming from, but it's most likely a name-based github-only feature</p>",
        "id": 524134876,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1749998176
    },
    {
        "content": "<p>The answer is that github, the currently Microsoft owned service, is separate from git. It allows users to manage repositories such as upstream mathlib4 and the forks we make through a limited interface to produce some workflows. It doesn't seem to let you point a branch from your fork to the corresponding branch in upstream mathlib4 as far as I can tell. This is a github design choice, that other service providers also replicate.</p>\n<p>EDIT : <span class=\"user-mention\" data-user-id=\"481963\">@David Loeffler</span>   I hope I guessed correctly</p>",
        "id": 524134967,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749998274
    },
    {
        "content": "<p>strangely, they do let you do this when you create a new branch</p>",
        "id": 524135150,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1749998431
    },
    {
        "content": "<p>i.e. when you create a branch from an upstream branch via the GH interface, it will trace it</p>",
        "id": 524135174,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1749998456
    },
    {
        "content": "<p>The context is that this branch is not behind the upstream <code>DL_top_sine_curve</code> branch, but it is &gt; 300 commits behind the upstream <code>master</code> branch and I am asking if there is a one-step way to update it with those commits. </p>\n<p>It seems there isn't a way to do this, which is fine. But I am not terribly impressed by being told with great conviction that my question is nonsensical.</p>",
        "id": 524135322,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749998574
    },
    {
        "content": "<p>If you take github's offer to make a pull request from <code>DL_top_sine_curve</code> and make a pull request to the upstream mathlib4's <code>master</code> branch, there is an option that will show up in the pull request to merge master into your PR</p>",
        "id": 524135474,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749998708
    },
    {
        "content": "<p>There is no guarantee that this will not produce a merge conflict however</p>",
        "id": 524135506,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749998732
    },
    {
        "content": "<blockquote>\n<p>If you take github's offer to make a pull request from <code>DL_top_sine_curve</code> and make a pull request to the upstream mathlib4's <code>master</code> branch, there is an option that will show up in the pull request to merge master into your PR</p>\n</blockquote>\n<p>I have done this and I do not see such an option (unless it was part of the PR creation step, in which case I may have overlooked it there)</p>",
        "id": 524135565,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749998792
    },
    {
        "content": "<p>My bad. I think it only shows up for me in repositories where I am a maintainer</p>",
        "id": 524135797,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749999009
    },
    {
        "content": "<p>Or I am the PR author</p>",
        "id": 524135819,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749999032
    },
    {
        "content": "<p>David  :  Do you see the <code>update branch</code> option as in the screenshot (the colours might be different but this is the box at the bottom of the PR page that tells you whether you have a merge conflict or not, just above the squash and merge button. See example:</p>\n<p><a href=\"/user_uploads/3121/JTIk8luF6kZG6yHOfMN6I1NG/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/JTIk8luF6kZG6yHOfMN6I1NG/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"2690x1315\" src=\"/user_uploads/thumbnail/3121/JTIk8luF6kZG6yHOfMN6I1NG/image.png/840x560.webp\"></a></div>",
        "id": 524135970,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749999153
    },
    {
        "content": "<p>I just see a big warning sign \"Merging is blocked: You're not authorized to push to this branch\".</p>",
        "id": 524136055,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749999245
    },
    {
        "content": "<p>Could you screenshot the corresponding part of your webpage and paste it here? If not, then :</p>\n<ol>\n<li>If there are no complaints about a merge conflict, your PR can be safely merged as is.</li>\n<li>If there is an <code>update brranch</code> button, then clicking on that should incorporate those 300 commits in the mathlib4 master branch that you don't have.</li>\n</ol>",
        "id": 524136193,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749999396
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/YLMWoXq2IrYGcmSmB141-PsP/Screenshot-2025-06-15-at-16.57.14.png\">Screenshot 2025-06-15 at 16.57.14.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/YLMWoXq2IrYGcmSmB141-PsP/Screenshot-2025-06-15-at-16.57.14.png\" title=\"Screenshot 2025-06-15 at 16.57.14.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1896x450\" src=\"/user_uploads/thumbnail/3121/YLMWoXq2IrYGcmSmB141-PsP/Screenshot-2025-06-15-at-16.57.14.png/840x560.webp\"></a></div>",
        "id": 524136255,
        "sender_full_name": "David Loeffler",
        "timestamp": 1749999450
    },
    {
        "content": "<p>I don't see a merge conflict, so your PR can be safely merged (modulo CI checks) for now</p>",
        "id": 524136308,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749999528
    },
    {
        "content": "<p>According to the  <a href=\"https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/keeping-your-pull-request-in-sync-with-the-base-branch\">github doc page</a> The \"update branch\" button only shows up when all of the following are true:</p>\n<blockquote>\n<ul>\n<li>There are no merge conflicts between the pull request branch and the base branch.</li>\n<li>The pull request branch is not up to date with the base branch.</li>\n<li>The base branch requires branches to be up to date before merging or the setting to always suggest updating branches is enabled.```</li>\n</ul>\n</blockquote>",
        "id": 524136654,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749999895
    },
    {
        "content": "<p>Maybe one of the mathlib maintainers can tell us whether condition 3 holds or not, but that is the first thing to check.</p>",
        "id": 524136715,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1749999947
    },
    {
        "content": "<blockquote>\n<ol>\n<li>If there are no complaints about a merge conflict, your PR can be safely merged as is.</li>\n</ol>\n</blockquote>\n<p>This isn't quite true, I think [edit to clarify: this just depends how you define \"safely\"]; the check only verifies that git is capable of auto-merging the code, <em>not</em> that the merged code actually compiles without errors. This is why I want to merge master in my PR: so I can let CI run on the merged codebase, and then fix any fallout. And I was hoping this this could be done in one click, without having to use my own local repo as a middle-man between the two repos on GitHub. As I said, if it isn't possible, then I'm totally fine with that.</p>\n<blockquote>\n<p>According to the <a href=\"https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/keeping-your-pull-request-in-sync-with-the-base-branch\">github doc page</a> The \"update branch\" button only shows up when all of the following are true:</p>\n</blockquote>\n<p>Is your screenshot from some other repo, not mathlib? I've never seen such a button in mathlib, so perhaps the mathlib repo has this configuration set differently.</p>",
        "id": 524136761,
        "sender_full_name": "David Loeffler",
        "timestamp": 1750000003
    },
    {
        "content": "<p>Yes the screenshot is from <del>iris-lean</del> equational theories. And yes, by “safety”, I was referring to the absence of merge conflicts. Of course the CI must do its duty.</p>",
        "id": 524137027,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750000309
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"481963\">David Loeffler</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524136761\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Is your screenshot from some other repo, not mathlib? I've never seen such a button in mathlib, so perhaps the mathlib repo has this configuration set differently.</p>\n</blockquote>\n</blockquote>\n<p>This is why I suggested that condition 3 is the first thing to check. I always get the option to “update branch” on my projects if my PR is not up to date with the main branch.</p>",
        "id": 524137080,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750000373
    },
    {
        "content": "<p>Only maintainers can do that</p>",
        "id": 524137690,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750000930
    },
    {
        "content": "<p>Specifically this condition </p>\n<blockquote>\n<ul>\n<li>The base branch requires branches to be up to date before merging or the setting to always suggest updating branches is enabled.</li>\n</ul>\n</blockquote>",
        "id": 524138361,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750001359
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524137027\">said</a>:</p>\n<blockquote>\n<p>Yes the screenshot is from iris-lean. And yes, by “safety”, I was referring to the absence of merge conflicts. Of course the CI must do its duty.</p>\n</blockquote>\n<p>It’d be nice if we could have CI run periodically (every few days?) on all open PRs that are git-mergeable against current master, and post a warning if the result of the merge doesn’t pass the tests. But this is orthogonal to the current discussion.</p>",
        "id": 524139259,
        "sender_full_name": "David Loeffler",
        "timestamp": 1750002110
    },
    {
        "content": "<p>You don’t need CI for git-mergeability. If the maintainers turn on this switch I quoted in my last message, GitHub will show you the panel in my screenshot with an indication of merge conflicts if any.</p>",
        "id": 524139369,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750002211
    },
    {
        "content": "<p>You need CI to be sure that mathlib itself builds according to lean, and docs are generated and so on.</p>",
        "id": 524139393,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750002235
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"481963\">David Loeffler</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524136761\">said</a>:</p>\n<blockquote>\n<p>This is why I want to merge master in my PR: so I can let CI run on the merged codebase, and then fix any fallout. And I was hoping this this could be done in one click, without having to use my own local repo as a middle-man between the two repos on GitHub. As I said, if it isn't possible, then I'm totally fine with that.</p>\n</blockquote>\n<p><del>I don't think it's possible without your local copy of <code>master</code> up-to-date.</del></p>\n<p>So the step for my personal setup is:</p>\n<ol>\n<li>make your local copy of <code>master</code> up-to-date. (In my personal setup, it's 3 steps: (i) click \"Sync fork\" button on the github master webpage of my own fork of mathlib; (ii) <code>git checkout master</code> if it's not already working on <code>master</code> branch; (iii) <code>git pull origin master</code> which downloads newest changes of <code>master</code> branch to local. <strong>NOTE THAT this step is different if you use the recommended setup discussed here. In this case, ask git experts in this thread.</strong>)</li>\n<li>working on my branch again: <code>git checkout my_branch</code></li>\n<li><code>git gui</code> which will launch a default GUI of <code>git</code> where there is an option to merge (menu <code>Merge &gt; Local Merge...</code> then choose <code>master</code> in the list box, then click <code>Merge</code> button).</li>\n<li>Assume that there are no merge conflicts. Then you can click <code>Push</code> button in the git GUI (the last button of 5 buttons in a column), there will be a confirmation dialog, and click <code>Push</code> again. In this way your local edits and merges will be uploaded to your own fork of mathlib on github.</li>\n</ol>",
        "id": 524142132,
        "sender_full_name": "Jz Pan",
        "timestamp": 1750004886
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 524142416,
        "sender_full_name": "Jz Pan",
        "timestamp": 1750005148
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"366779\">Jz Pan</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524142132\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"481963\">David Loeffler</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524136761\">said</a>:</p>\n<blockquote>\n<p>This is why I want to merge master in my PR: so I can let CI run on the merged codebase, and then fix any fallout. And I was hoping this this could be done in one click, without having to use my own local repo as a middle-man between the two repos on GitHub. As I said, if it isn't possible, then I'm totally fine with that.</p>\n</blockquote>\n<p>I don't think it's possible without your local copy of <code>master</code> up-to-date.</p>\n<p>So the step is:</p>\n<ol>\n<li>make your local copy of <code>master</code> up-to-date. (In my personal setup, it's 3 steps: (i) click \"Sync fork\" button on the github master webpage of my own fork of mathlib; (ii) <code>git checkout master</code> if it's not already working on <code>master</code> branch; (iii) <code>git pull origin master</code> which downloads newest changes of <code>master</code> branch to local. <strong>NOTE THAT this step is different if you use the recommended setup discussed here. In this case, ask git experts in this thread.</strong>)</li>\n<li>working on my branch again: <code>git checkout my_branch</code></li>\n<li><code>git gui</code> which will launch a default GUI of <code>git</code> where there is an option to merge (menu <code>Merge &gt; Local Merge...</code> then choose <code>master</code> in the list box, then click <code>Merge</code> button).</li>\n<li>Assume that there are no merge conflicts. Then you can click <code>Push</code> button in the git GUI (the last button of 5 buttons in a column), there will be a confirmation dialog, and click <code>Push</code> again. In this way your local edits and merges will be uploaded to your own fork of mathlib on github.</li>\n</ol>\n</blockquote>\n<p>This is not true. If mathlib maintainers enable the feature that I quoted above from GitHub docs, you get the update branch button</p>",
        "id": 524143306,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750006037
    },
    {
        "content": "<p>As long as there is no merge conflict it will merge master into your PR</p>",
        "id": 524143322,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750006054
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"366779\">@Jz Pan</span> This seems ... more complicated than I expected. Wouldn't something like <code>git fetch; git merge origin/master</code> work (without having to switch branches on the local repo)?</p>",
        "id": 524144304,
        "sender_full_name": "David Loeffler",
        "timestamp": 1750007026
    },
    {
        "content": "<blockquote>\n<ul>\n<li>make your local copy of <code>master</code> up-to-date. (In my personal setup, it's 3 steps: (i) click \"Sync fork\" button on the github master webpage of my own fork of mathlib; (ii) <code>git checkout master</code> if it's not already working on <code>master</code> branch; (iii) <code>git pull origin master</code> which downloads newest changes of <code>master</code> branch to local. <strong>NOTE THAT this step is different if you use the recommended setup discussed here. In this case, ask git experts in this thread.</strong>)</li>\n<li>working on my branch again: <code>git checkout my_branch</code><br>\n<code>git gui</code> which will launch a default GUI of <code>git</code> where there is an option to merge (menu <code>Merge &gt; Local Merge...</code> then choose <code>master</code> in the list box, then click <code>Merge</code> button).</li>\n</ul>\n</blockquote>\n<p>I'm not following this thread, but will point out you don't ever really need to update your master branch if that's not what you're working on at the time -- specifically in this 3 step workflow the more \"direct\" way to merge upstream's master is the two step <code>git fetch upstream &amp;&amp; git merge upstream/master</code> (replace <code>upstream</code> with whatever you or the script calls the leanprover-community remote) all while staying on your <code>my_branch</code> -- it's always in some sense \"safer\" to merge remote branches than local ones, though this is an expert..</p>\n<p>And now I see David knows this already :) so yes David you're right.</p>",
        "id": 524144320,
        "sender_full_name": "Julian Berman",
        "timestamp": 1750007043
    },
    {
        "content": "<p>I'm glad, because I prefer to avoid switching branches on my local repo if I can help it. The problem is that this invalidates all the build output in the local directory (which takes forever to recompile, and a nontrivial time even to un-pack from cache).</p>",
        "id": 524144814,
        "sender_full_name": "David Loeffler",
        "timestamp": 1750007553
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"481963\">David Loeffler</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Open.20letter.20to.20maintainers/near/524131761\">said</a>:</p>\n<blockquote>\n<p>(The motivation for this is to make the button in GitHub, for pulling new commits from upstream into the PR branches in my fork, work properly. At the moment, it looks for new commits in my old PR branches in the master repo, rather than the master branch of the master repo.)</p>\n</blockquote>\n<p>Quite by chance I found out how to solve this problem (and the solution is face-palmingly simple). GitHub matches up branches in the fork to branches in the main mathlib repo based on branch name; but <em>it defaults to master if no upstream branch with that name exists</em>. So the solution was just to delete my old branches in the main mathlib repo, and now everything works exactly as I had wanted: the \"Sync fork\" button pulls the latest mathlib master into my fork PR branch with a single click.</p>",
        "id": 524151259,
        "sender_full_name": "David Loeffler",
        "timestamp": 1750015812
    }
]