[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"320882\">@Damien Thomine</span> just pointed out to me that the [contribution guidelines] are not fully updated for the switch to forks. They indicated that this paragraph (at the very beginning) is incomplete: you also want to configure your fork somehow.</p>\n<blockquote>\n<p>To get started, you'll need a local copy of mathlib. First, you'll need to go to <a href=\"https://github.com/leanprover-community/mathlib4\">https://github.com/leanprover-community/mathlib4</a> and click \"Fork\" in the top right, to make your own fork of the repository. Your fork is at <a href=\"https://github.com/USER/mathlib4\">https://github.com/USER/mathlib4</a>. Now make a local clone of the repository.</p>\n</blockquote>",
        "id": 525553540,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1750781771
    },
    {
        "content": "<p>Looking closely, I found two more bugs on the page:</p>\n<blockquote>\n<p>Sometimes you may not want to create a new branch, but instead work on a branch that someone else created, or you created from a different computer. In that case you need to use git switch their_new_branch (note there is no -c here).</p>\n</blockquote>\n<p>is wrong now, it's not as simple from a fork. <code>gh pr checkout 12345</code> works, as the git guide recommends.</p>\n<blockquote>\n<p>Once you've opened a PR to the main mathlib repository (see below), continuous integration will automatically kick in at this point. You can view the output by visiting <a href=\"https://github.com/leanprover-community/mathlib4/tree/my_new_branch\">https://github.com/leanprover-community/mathlib4/tree/my_new_branch</a> (There will be a green tick on the line describing the most recent commit if everything works, otherwise a yellow circle if CI is still working, or a red cross if something went wrong. Click on the red cross to see details.) You can also check CI status on the command line by installing hub and running hub ci-status.</p>\n</blockquote>\n<p>is also not as simple.</p>\n<p>I'm tempted to say that most of these should be fixed by pointing to the other page instead.</p>",
        "id": 525553559,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1750781774
    },
    {
        "content": "<p>Thanks for the report! I think I was the last person to edit that file so I have some responsibility here, but unfortunately I won't have time to fix this myself in the near future. I will be happy to merge PR(s) improving the text there though!</p>",
        "id": 525554693,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1750782183
    },
    {
        "content": "<p>Some fixes in <a href=\"https://github.com/leanprover-community/leanprover-community.github.io/pull/662\">https://github.com/leanprover-community/leanprover-community.github.io/pull/662</a></p>",
        "id": 525667442,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1750842504
    },
    {
        "content": "<p>I just gave it a look: basically, looks good to me.</p>",
        "id": 525669705,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1750843244
    }
]