[
    {
        "content": "<p>Hi, I'd like to help out with the porting effort. Can I get permission for mathlib4? Or do I already have it since I have it for mathlib3? I'm <code>jakelev</code> on github.</p>",
        "id": 356394678,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1683424656
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"391579\">@Jake Levinson</span>, invite sent!</p>",
        "id": 356413965,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1683438192
    },
    {
        "content": "<p>Okay, I've tried a couple of different files (<code>algebra.category.GroupWithZero</code> and <code>topology.algebra.equicontinuity</code>) and in both cases ran into errors involving coercions and metavariables, where Lean 4 is failing to infer implicit arguments that Lean 3 did automatically.</p>\n<p>I'm not sure how to fix these since it doesn't seem like a matter of just renaming things. Would anyone be up for pair-programming or otherwise helping me debug one of these?</p>\n<p>Or, anyone have a suggestion for how to find an easier first file to port? (I just looked for short, greenlisted files on the porting status page.)</p>",
        "id": 356534364,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1683484146
    },
    {
        "content": "<p>If you make a wip-PR, then I can take a look this evening (i.e. in ~4h). Generally what I am doing is (a) insert the arguments explicitly (b) use some of the workarounds for the instance-eta-problem (c) compare with mathlib3 to see how the goals and lemmas differ. Looking into the porting notes for files that your file directly depends on might help as well since the problems usually are closely related.</p>",
        "id": 356589643,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1683520102
    },
    {
        "content": "<p>Hey thanks! Alright, I will do that. Those sound like good steps though I probably will need help executing them at first - still getting used to the differences between Lean 3 and 4.</p>",
        "id": 356593284,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1683522215
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"412682\">@Moritz Doll</span> see <a href=\"https://github.com/leanprover-community/mathlib4/pull/3841\">!4#3841</a></p>",
        "id": 356614442,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1683530205
    }
]