[
    {
        "content": "<p>I noticed recently that the multigoal linter does not apply inside have or suffices blocks.  This has already been reported as an issue, <a href=\"https://github.com/leanprover-community/mathlib4/pull/20081\">#20081</a>. The problem seems to be that both tactics expand to the focus tactic and currently that's listed under ignoreBranch rather than exclusions in the linter.</p>\n<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/30470\">#30470</a> I tried the simple experiment of moving focus to exclusions rather than ignoreBranch. It appears to be doing the right thing.  It identifies a number of places in Mathlib where multiple goals are created inside of have blocks.  I haven't checked all of them so can't be sure there aren't false positives.</p>\n<p>Please can someone with more expert knowledge comment on whether this change is reasonable or if there's a good reason for having focus in ignoreBranch? If it sounds reasonable then we should make the change and fix the newly identified failures.</p>",
        "id": 544831569,
        "sender_full_name": "Alastair Irving",
        "timestamp": 1760473786
    },
    {
        "content": "<p>I think that the reason for this is just historical.  When developing the linter, there were <em>lots</em> of exceptions, so I made the decision of trying to minimize fixes to existing code.  This helped showcase that the linter was doing the correct thing and also helped making mathlib compliant and merge the linter.</p>",
        "id": 545935102,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1760955721
    },
    {
        "content": "<p>Having looked at your proposed change, I think that it is the correct thing to do and there are two issues to check:</p>\n<ul>\n<li>if there are false positives, think very carefully about whether they are unavoidable;</li>\n<li>make sure that you run <code>!bench</code>, once the PR is stable, to expose any possible performance implication.</li>\n</ul>",
        "id": 545935555,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1760955855
    },
    {
        "content": "<p>Thanks, I'll look at updating my PR when I get time and will follow your suggestions.</p>",
        "id": 546071834,
        "sender_full_name": "Alastair Irving",
        "timestamp": 1760987300
    },
    {
        "content": "<p>OK, I think <a href=\"https://github.com/leanprover-community/mathlib4/pull/30470\">#30470</a> is ready for review.  I fixed all the new instances of the lint (mostly they were trivial) and added a test.  Its just waiting for bench to run now.</p>",
        "id": 546992804,
        "sender_full_name": "Alastair Irving",
        "timestamp": 1761336577
    }
]