[
    {
        "content": "<p>I have made a (rather large) PR as first steps towards \"topological methods in group theory\" in Lean, bypassing Set topology. I am pasting details below. This is (most of) code <span class=\"user-mention\" data-user-id=\"303675\">@Anand Rao Tadipatri</span> and I wrote a while back.</p>\n<p>I realise that smaller PRs are preferred, but in this case I felt that this bigger PR has an advantage as there are many choices in how to formalise (even mathematical choices). So it is best to show that these choice \"work\" in the sense of letting us prove the theorems we want, and that alternatives can be discussed in the context of goals.</p>\n<p>The summary of the PR is as follows:</p>\n<h2>Serre graphs for Topological methods in Group Theory</h2>\n<p>This is basic theory for topological methods in group theory bypassing topology by working with graphs defined following Serre and directly developing fundamental group and covering space theory for this. </p>\n<p>Some of the definitions and results in this PR:</p>\n<ul>\n<li>Graphs (a la Serre)</li>\n<li>Paths; reduced paths, reduction of paths</li>\n<li>Homotopy of paths in graphs (generated by cancellation); homotopy classes.</li>\n<li>Multiplication and inversion of paths and relations to homotopy. Induced operations on homotopy classes.</li>\n<li>Fundamental group of a graph.</li>\n<li>Covering maps of Graphs; path lifting, homotopy lifting.</li>\n<li>Universal cover; Cover corresponding to a subgroup.</li>\n</ul>\n<p>The code in this PR is enough to give a topological proof of a non-trivial result: if two reduced paths are homotopic then they are equal.</p>\n<h2>Potential applications</h2>\n<p>@0art0 and I have proved the Nielsen-Schreier theorem: every subgroup of a free group is free but this PR is only part of the way for this.</p>\n<p>Eventually this approach can be extended to 2-complexes following Lyndon-Schupp. The hope is to formalize Staling's topological proof of Grushko's theorem and also small cancellation theory.</p>",
        "id": 429272710,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1711332812
    }
]