[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/18568\">#18568</a>, I experimented with adding a typeclass for <code>0</code> being a bottom element. This is meant to generalize lemmas like <code>zero_le</code>, <code>pos_iff_ne_zero</code>, etc. which currently take in assumptions that are too strong for e.g. <code>Ordinal</code> or <code>Nimber</code>, and which cause some duplication with other types like <code>Nat</code> or <code>Multiset</code> that need them before the relevant instance is built.</p>",
        "id": 480296457,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1730629567
    },
    {
        "content": "<p>I also made a <code>simp</code> lemma <code>bot_eq_zero</code>. The idea being, <code>bot</code> only has a handful of order properties which can all be taken care of by the instance, while <code>0</code> has lots of important algebraic properties depending on where it's found. So the latter form always conveys more information.</p>",
        "id": 480296629,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1730629778
    },
    {
        "content": "<p>So I was a bit surprised to learn that via <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Submodule.zero_eq_bot#doc\">docs#Submodule.zero_eq_bot</a>, the simp-normal form for <code>0</code> on submodules and ideals is <code>bot</code></p>",
        "id": 480296710,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1730629848
    },
    {
        "content": "<p>Sounds good, but less sure about the simp lemma</p>",
        "id": 480296733,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1730629873
    },
    {
        "content": "<p>This seems to be the only instance of breakage, though it is quite a major one</p>",
        "id": 480296762,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1730629915
    },
    {
        "content": "<p>So I'm wondering if it would make sense to instead spell the zero and one ideals as <code>0</code> and <code>1</code></p>",
        "id": 480296819,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1730629951
    },
    {
        "content": "<p>My take on this is that neither should be declared the simp-normal form; if you want to do lattice theory then you probably want bot, but if you want to work with submodules as a semiring you probably want <code>0</code>.</p>",
        "id": 480296867,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1730630011
    },
    {
        "content": "<blockquote>\n<p>neither should be declared the simp-normal form</p>\n</blockquote>\n<p>This sounds nice in theory but in practice we often need both structures and it is a pain to switch from one to another everytime. <br>\nAnd I'd say the lattice form is more useful because it can prove inequalities while zero can a priori only prove equalities. The only thing about bot being zero that we will need is <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Ideal.bot_mul#doc\">docs#Ideal.bot_mul</a>. And the preferred spelling of <code>I + J</code> is actually <code>I ⊔ J</code> because of basically the same reasons.<br>\nAnd for the unit ideal, most of the ideal API comes from <code>Submodule</code>s where <code>1</code> and <code>⊤</code> are different things and usually we want the latter so <code>1</code> probably won't work.</p>\n<p>But if your new typeclass can take care of the bot part seamlessly, then I don't object the change.</p>",
        "id": 480306250,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1730639337
    },
    {
        "content": "<p>Thinking about it, maybe it's simply cleaner to not have <code>bot_eq_zero</code> as a simp lemma, but instead implement it individually on the types where it makes sense</p>",
        "id": 480316417,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1730648633
    },
    {
        "content": "<p>Which is to say, basically everything besides ideals.</p>",
        "id": 480316474,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1730648657
    },
    {
        "content": "<p>Switching the notation for ideals over is something that can be done later if there's a need for it</p>",
        "id": 480316488,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1730648676
    }
]