[
    {
        "content": "<p>Hi all, </p>\n<p>This is in regard to PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/25491\">#25491</a>, which defines and develops the theory of the free monad in the programming sense (rather than the categorical one), although several of the theorems proven do correspond to categorical properties.</p>\n<p><span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span>  noted that Mathlib is not primarily oriented toward computer science applications, so perhaps this would be better suited to <code>batteries</code>. I initially had the same thought, but seeing that we already have a <code>Control/Monads</code> directory, I decided to propose it for Mathlib. (I’m also unfamiliar with the process of contributing to Batteries.)</p>\n<p>That said, there are some mathematical applications. For instance,  <span class=\"user-mention\" data-user-id=\"246591\">@Quang Dao</span> has used free monads for <a href=\"https://github.com/dtumad/VCV-io/tree/master\">formalizing cryptographic proofs</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/20924\">#20924</a> is implicitly using a free monad for studying query complexity. Also, we could explore the free monad purely categorically by using <code>CategoryTheory.ofTypeMonad (FreeM F)</code> to get a free monad on the category of types.</p>\n<p>I do think the free monad is a foundational and elegant FP abstraction, and since it exists in other FP ecosystems (see <a href=\"https://hackage.haskell.org/package/free\">Haskell</a> and <a href=\"https://typelevel.org/cats/datatypes/freemonad.html\">Scala</a>), I think it should exist <em>somewhere</em> in Lean. But I'd love to get some thoughts from others on where this belongs and whether others would support merging it to Mathlib.</p>",
        "id": 524074024,
        "sender_full_name": "Tanner Duve",
        "timestamp": 1749917449
    },
    {
        "content": "<p>I'm happy with this being in Mathlib, at least as long as the rest of <code>Control</code> is there.</p>",
        "id": 524079969,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1749924821
    },
    {
        "content": "<p>I'd prefer to see someone make a new repo to host things like this. :-)</p>",
        "id": 524107350,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1749967020
    },
    {
        "content": "<p>I am torn between \"mathlib should accept anything because we want growth\" and \"mathlib should stick to maths because it's what the maintainers are competent at\". Note that a lot of the control stuff was written by Hudon who is no longer a contributor.</p>",
        "id": 524112747,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1749974358
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Programming-style.20monads.20in.20Mathlib/near/524107350\">said</a>:</p>\n<blockquote>\n<p>I'd prefer to see someone make a new repo to host things like this. :-)</p>\n</blockquote>\n<p>I'm glad mathlib is breaking out its useful tools into separate pkgs bc that's a big motivation to stay in mathlib's demesne</p>",
        "id": 524115646,
        "sender_full_name": "Alok Singh",
        "timestamp": 1749977834
    },
    {
        "content": "<p>I think some of the control stuff is used in tactics; so If the whole directory were to move out of mathlib, Mathlib would take a dependency on it. I don't think we should let such a refactor get in the way of Tanner's work, nor is it clear to me that the Control folder is particular costly to maintain</p>",
        "id": 524122464,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1749984879
    },
    {
        "content": "<p>Hey all, don't mean to necro this thread but quick update, I've opened this PR up in <a class=\"stream\" data-stream-id=\"513188\" href=\"/#narrow/channel/513188-CSLib\">#CSLib</a> , but for the sake of avoiding duplications the reviewers there want to make sure it gets resolved here before approving it. Should I close the mathlib PR and just have it put in CSLib?</p>",
        "id": 536867221,
        "sender_full_name": "Tanner Duve",
        "timestamp": 1756505311
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"246591\">@Quang Dao</span>  wherever this does eventually get merged is probably also where we want to try and merge the polynomial functor version of free monads as well</p>",
        "id": 536871064,
        "sender_full_name": "Devon Tuma",
        "timestamp": 1756508322
    },
    {
        "content": "<p>For reference, the new PR is <a href=\"https://github.com/leanprover/cslib/pull/53\">cslib#53</a>. A small difference to note is that I encouraged the inclusion of an expression language using this construction, which to me feels more appropriate in Cslib than it would in Mathlib.</p>",
        "id": 536872673,
        "sender_full_name": "Chris Henson",
        "timestamp": 1756509914
    }
]