[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover/lean4/pull/3151\">lean4#3151</a> Leo is proposing modifying the simplifier so that it does not visit instance implicit arguments by default, although this can be turned back on via <code>(config := { instances := true })</code>.</p>\n<p>I've checked that it is possible to compile Mathlib, although quite a few changes are needed. The PR is at <a href=\"https://github.com/leanprover-community/mathlib4/pull/9572\">#9572</a>, although this is stacked on top of another larger adaptation PR: the relevant diff is: <a href=\"https://github.com/leanprover-community/mathlib4/compare/lean-pr-testing-3124...lean-pr-testing-3151\">https://github.com/leanprover-community/mathlib4/compare/lean-pr-testing-3124...lean-pr-testing-3151</a></p>\n<p>There are many cases where it's \"obvious\" from looking at the simp set that the calling is trying to simplify instances (e.g. there is a <code>HSMul.hSMul</code> in the simp set, or a <code>(· • ·)</code>). However often it looks a bit surprising when <code>(config := { instances := true })</code> is needed, so there's a concern about users getting stuck on this.</p>\n<p>Pros and cons:</p>\n<ul>\n<li>It will presumably be faster (I'd like to benchmark, but this will need to wait for some dust to settle).</li>\n<li>There's a lot of abuse of instances in Mathlib, and I suspect that places where <code>(config := { instances := true })</code> is necessary correlates with this, so perhaps it is good for visibility.</li>\n<li>Users will get confused, and may not realise when they are in a situation where they need <code>(config := { instances := true })</code>.</li>\n</ul>\n<p>The most useful response to this post would be if anyone is interested in looking at the examples from the diffs above, and deciding how unobvious the need to <code>instances := true</code> is, and/or thinking about whether there would have been a better proof that didn't need it.</p>",
        "id": 411873655,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1704781979
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span> A lot of the example in the diff above are when a new structure/instance is being defined. Do you agree that this is a legitimate use case of the config option.</p>\n<p>Put differently: do you think it makes sense to mainly investigate the other examples that occur in the middle of \"regular\" proofs?</p>",
        "id": 411878888,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1704785206
    },
    {
        "content": "<p>Yes, that's a good way of thinking about it!</p>",
        "id": 411878958,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1704785240
    }
]