[
    {
        "content": "<p>Hi everyone, I’m a beginner using Lean, and I really hope to contribute to mathlib. My direction is probability and statistics. After organizing some materials, I found myself interested in the independent additivity of common distributions. The main reason is that in <code>gaussianReal</code> there is already a proof of independent additivity that can be used for reference, but for other distributions such as Poisson and Gamma, it seems they are not covered yet (please correct me if I’m wrong).</p>\n<p>I started learning from the Poisson distribution. I found that Poisson is mainly defined from the PMF perspective. If I want to prove independent additivity using convolution like in the Gaussian case, I currently have two ideas:</p>\n<ol>\n<li>directly compute the PMF convolution using the binomial theorem and combinatorial identities.</li>\n<li>find a way to embed <code>ℕ</code> into the existing frameworks such as continuous convolution / <code>charFun</code> / <code>mgf</code>. I didn’t find support for discrete cases (maybe I searched incorrectly), so if there are related files or PRs, I would really appreciate pointers.</li>\n</ol>\n<p>I would be very grateful for any suggestions about which direction might make more sense, or if there are better approaches. Thank you!</p>\n<p>(English is not my first language, so I’m using AI to help translate my text. The technical ideas and questions are my own.)</p>",
        "id": 562114391,
        "sender_full_name": "huaizhangchu",
        "timestamp": 1764945066
    },
    {
        "content": "<p>I suspect the easiest way to do it will be to use <code>charFun</code>. Especially since we will also want to have the <code>charFun</code> in mathlib anyway and once you have that its very easy to prove the result you want. I have some examples of doing this with discrete distributions here: <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Discrete.20Probability.20Proposal/with/556661947\">#mathlib4 &gt; Discrete Probability Proposal</a>  (but none of this is in mathlib). I am not sure I would do things exactly like I do them in that thread but the main insights imo is that for \"embedding\" them into the existing framework the nicest thing to use is a linear combination of diracs (so the Poisson distribution on <code>ℝ</code>will be an (infinite) linear combination of diracs on the natural numbers with the coefficients being given by the \"PMF\" of the Poisson distribution).</p>",
        "id": 562120476,
        "sender_full_name": "David Ledvinka",
        "timestamp": 1764946576
    },
    {
        "content": "<p>If you also want the result for the measures on <code>ℕ</code> directly you can then use the fact that the pushforward of measures from <code>ℕ</code> to <code>ℝ</code> is injective to \"pullback\" the result.</p>",
        "id": 562121088,
        "sender_full_name": "David Ledvinka",
        "timestamp": 1764946730
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"223948\">David Ledvinka</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Question.20about.20proving.20additivity.20of.20the.20Poisson.20distributio/near/562120476\">說</a>：</p>\n<blockquote>\n<p>I suspect the easiest way to do it will be to use <code>charFun</code>. Especially since we will also want to have the <code>charFun</code> in mathlib anyway and once you have that its very easy to prove the result you want. I have some examples of doing this with discrete distributions here: <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Discrete.20Probability.20Proposal/with/556661947\">#mathlib4 &gt; Discrete Probability Proposal</a>  (but none of this is in mathlib). I am not sure I would do things exactly like I do them in that thread but the main insights imo is that for \"embedding\" them into the existing framework the nicest thing to use is a linear combination of diracs (so the Poisson distribution on <code>ℝ</code>will be an (infinite) linear combination of diracs on the natural numbers with the coefficients being given by the \"PMF\" of the Poisson distribution).</p>\n</blockquote>\n<p>Got it! I just took a quick look at your proposal about discrete probability. I think I’ll need some more time to study it carefully. Thank you very much for your help!</p>",
        "id": 562203165,
        "sender_full_name": "huaizhangchu",
        "timestamp": 1764982589
    }
]