[
    {
        "content": "<p>When my PR (<a href=\"https://github.com/leanprover-community/mathlib4/actions/runs/15230039639/job/42836790434?pr=25163\">this one inspired this</a>) experiences CI failure on <code>build mathlib</code> due to some warning like a linter problem, it typically prints out 1000s of lines of logs about all the files it successfully built. This makes it hard to scroll through and find the actual error.</p>\n<p>Could the <code>--quiet</code> flag be passed to the build command for this CI step so that we don't have to look through all of this? Would that harm anything else?</p>",
        "id": 520239070,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1748128741
    },
    {
        "content": "<p>See <a href=\"https://github.com/leanprover-community/mathlib4/pull/25167\">#25167</a> for experimentation</p>",
        "id": 520239853,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1748129542
    },
    {
        "content": "<p>I personally find that <code>quiet</code> options in CI are never a good idea.  So much can go wrong that any form of hint about what the remote computer is doing is valuable.</p>",
        "id": 520241017,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1748131010
    },
    {
        "content": "<p>In the specific case of <code>lake build</code>, the current setup gives a progress report with number of built file/number of files to be built information.  This is very useful to monitor how the build is progressing, potentially catching issues with individual files and informing of whether a problematic file has passed CI or not.</p>",
        "id": 520241026,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1748131023
    },
    {
        "content": "<p>If you want the <code>quiet</code> output, you can download the cache and replay it locally with all the flags that are appropriate.</p>",
        "id": 520241031,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1748131032
    },
    {
        "content": "<p>Alternatively, I would rather explore the possibility of <em>adding</em> a CI step that runs <code>lake build</code> with the quiet option and maybe also <code>no-build</code>, to get a \"cleaner\" output that hopefully does not increase build times significantly.</p>",
        "id": 520241034,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1748131035
    }
]