[
    {
        "content": "<p>I just found out about <code>Mathlib.Order.Quotient</code>, which defines an order instance on any quotient type, whenever the parent type is ordered. </p>\n<p>Is this really a good idea? I'm concerned that it's too general: one might e.g. want to make a quotient of some standard (ordered) type like  <code>ℝ</code> or <code>ℤ</code> and then equip the quotient with a new order structure (different from the one induced by the quotient construction); and if these general order instances are floating around, then the result will be two conflicting order instances on the same type, and hence a world of pain.</p>\n<p>(I found out about this because my student <span class=\"user-mention\" data-user-id=\"895851\">@Daniele Bolla</span> has an extended example involving quotient types in his bachelor thesis, which works fine in Mathlib v4.24, but is broken in current Mathlib for this reason). </p>\n<p>Can I suggest that the definitions in this file be \"hidden\" inside a scope (like we already do for the partial order on  <code>ℂ</code>, which is only an instance if the namespace <code>ComplexOrder</code> is open)? Or that they be relegated to <code>def</code>'s rather than instances?</p>",
        "id": 566995264,
        "sender_full_name": "David Loeffler",
        "timestamp": 1767892852
    },
    {
        "content": "<p>(Tagging <span class=\"user-mention\" data-user-id=\"459227\">@Violeta Hernández</span> who wrote the quotient order stuff)</p>",
        "id": 566995641,
        "sender_full_name": "David Loeffler",
        "timestamp": 1767892975
    },
    {
        "content": "<p>Given that without any assumptions, this order isn't very well-behaved, I agree that this instance should probably not be global.</p>\n<p>As a workaround, if you write <code>def MyQuotient := Quotient ...</code> then this order-instance will invisible on <code>MyQuotient</code>.</p>",
        "id": 567000986,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1767894790
    },
    {
        "content": "<p>Note: this was discussed in <a href=\"https://github.com/leanprover-community/mathlib4/pull/29735\">#29735</a></p>",
        "id": 567001156,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1767894865
    },
    {
        "content": "<p>We had some very long-winded discussion already. The ultimate conclusion was that this was the \"categorically correct\" ordering and that it should be fine to have. Cases like the reals where you want to put a different order are in practice anyways going to be behind a def.</p>",
        "id": 567009059,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1767897697
    },
    {
        "content": "<p>With all that said, I have no problem with just scoping the instance if it's causing problems.</p>",
        "id": 567009104,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1767897714
    }
]