[
    {
        "content": "<p>There is a slight ambiguity in the mathematical literature about what a rank one valuation is.<br>\nIn most cases, this is used to say that the value group of the valuation embeds into the reals, as an ordered abelian group., that is, that the rank is at most one. <br>\nMathlib's <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Valuation.RankOne#doc\">docs#Valuation.RankOne</a> seems to have taken the terminology seriously and further insists that the valuation is nontrivial (so the rank is exactly one).</p>\n<p>This is highly legitimate but might lead to unfortunate discrepancies when translating math literature into Lean. </p>\n<p>For example, this makes the correspondence between valued nonarchimedean fields and fields endowed with a rank one valuation a bit awkward, since the trivial absolute value is allowed in one case and not in the other one. This is more or less visible in <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Valued.norm#doc\">docs#Valued.norm</a>, but not too much yet, because of the inaccurracy in Mathlib's definition of the topology of a ring endowed with a valuation.</p>\n<p>I wonder whether it is more natural to reorganize as</p>\n<ul>\n<li>some <code>RankLeOne</code> type class that corresponds to the embedding into the real</li>\n<li>combined with a <code>Nontrivial</code> condition.</li>\n</ul>",
        "id": 452203954,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1721255219
    },
    {
        "content": "<p>Cc <span class=\"user-mention\" data-user-id=\"300245\">@Filippo A. E. Nuccio</span> and <span class=\"user-mention\" data-user-id=\"406490\">@María Inés de Frutos Fernández</span> and <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span></p>",
        "id": 452204023,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1721255259
    },
    {
        "content": "<p>I think this sounds like a good change; we can create the class <code>RankLeOne</code> and then redefine <code>RankOne</code> as the class extending <code>RankLeOne</code> and <code>Nontrivial</code> (I discussed this with <span class=\"user-mention\" data-user-id=\"300245\">@Filippo A. E. Nuccio</span>  and he agrees).</p>",
        "id": 452284508,
        "sender_full_name": "María Inés de Frutos Fernández",
        "timestamp": 1721291468
    }
]