[
    {
        "content": "<p>In a <a href=\"#narrow/channel/287929-mathlib4/topic/tree.20orders.3A.20.60IsPredArchimedean.60.20vs.20.60LocallyFiniteOrderBot.60/near/510725654\">question</a> related to the equational theories project, I wanted to use <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Set.Iic_pred_eq_Iio_of_not_isMin#doc\">docs#Set.Iic_pred_eq_Iio_of_not_isMin</a> on a <code>PartialOrder</code> instead of a <code>LinearOrder</code>, motivating me to create <a href=\"https://github.com/leanprover-community/mathlib4/pull/23810\">#23810</a>, where the interval lemmas for succ/pred orders are generalized to PartialOrders if possible. The PR hasn't been reviewed yet but recently got a merge conflict, which got me thinking about this again.</p>\n<p>A thing which is a bit tricky for this PR is that at the moment <code>Mathlib/Order/Interval/Set/SuccPred.lean</code> is structured via nested sections with the outer one assuming <code>LinearOrder</code>. My approach has been to double the outer section and creating a new one with only <code>PartialOrder</code> as an assumption. This made it easy to create via copy paste, but probably not easy to review. Here are some alternative ways one could proceed:</p>\n<p>One way would be to \"fold\" the sections first, getting rid of most <code>variable</code> statements by including all type class assumptions into the statements of the lemmas, and adjusting the <code>LinearOrder</code> assumption to <code>PartialOrder</code> when possible. Here we can also easily generalize the lemmas to <code>PreOrder</code> if we want to.</p>\n<p>Or just have one outer <code>PartialOrder</code> section with <code>PartialOrder</code> as a hypothesis, and add <code>LinearOrder</code> assumption in the lemmas if they need it. Here I think we would change the ordering of the type class assumptions, and maybe we want to omit <code>PartialOrder</code> as an assumption if we have <code>LinearOrder</code>.</p>\n<p>Please let me know what you think, in particular, <span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> , would you mind sharing your opinion on this?</p>",
        "id": 514326743,
        "sender_full_name": "Bernhard Reinke",
        "timestamp": 1745571497
    },
    {
        "content": "<p>Oh sorry, this is really a bad time to do this refactor. I am currently spending a lot of time rewriting these files from scratch</p>",
        "id": 514368995,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1745584237
    },
    {
        "content": "<p>In particular, I am not done writing those files. They are in a temporary state and are not ready to be used</p>",
        "id": 514369112,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1745584286
    },
    {
        "content": "<p>Why do you need those results for partial orders? I was explicitly writing these files specialised to linear orders because non-linear orders should be basically irrelevant</p>",
        "id": 514369529,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1745584410
    },
    {
        "content": "<p>It is not really a high priority, see <a href=\"#narrow/channel/287929-mathlib4/topic/tree.20orders.3A.20.60IsPredArchimedean.60.20vs.20.60LocallyFiniteOrderBot.60/near/510725654\">this question</a> for the short answer. Here comes the large answer:</p>\n<p>In one of the <a href=\"https://teorth.github.io/equational_theories/blueprint/1729-chapter.html\">infinite magma constructions</a> of the equational theories project, we use <a href=\"https://teorth.github.io/equational_theories/blueprint/1729-chapter.html#n-prop\">a partial order</a> on a free group <code>N</code> given by <code>x &lt;= y</code> if <code>x</code> is on the geodesic from the identity to <code>y</code> in the Cayley graph (or, and this is how we define it, the reduced word representing <code>x</code> is a suffix of the reduced word for <code>y</code>).</p>\n<p>This partial order is very naturally a <code>PredOrder</code> (and in the rest of the construction, we use the predecessor quite lot). In the rest of the construction we also needed to do an inductive construction over <code>&lt;</code>. For me it seemed natural to show the <code>LocallyFiniteOrderBot</code> instance of the order: we have that <code>Iic g = (List.map (FreeGroup.mk) g.toWord.tails).toFinset</code>. For the inductive construction <span class=\"user-mention\" data-user-id=\"753178\">@Aaron Hill</span> had to <a href=\"https://github.com/teorth/equational_theories/commit/762f8c7d4cfa6cf5b62bf76e21aea7dabb69c84d#diff-c6d6eac0013458b1f765a2d5d9a3dfaad0963d19fa3bd60ad52726a67adfe82aR107-R112\">prove again</a> that <code>&lt;</code> is actually well-founded. From my perspective <code>PartialOrder</code> +  <code>PredOrder</code> + <code>LocallyFiniteOrderBot</code> should already imply that the strict order well-founded, even ranked, with rank of <code>g</code> being the cardinality of <code>Iio g</code>.</p>",
        "id": 514380354,
        "sender_full_name": "Bernhard Reinke",
        "timestamp": 1745587670
    }
]