[
    {
        "content": "<p>Guten tag,</p>\n<p>I often run into docstrings with references to Zulip discussions, but there is almost never a link to the actual thread (eg: <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Seminorm.instSupSet#doc\">docs#Seminorm.instSupSet</a> is what I was looking at right now, but there are other examples too). Is this on purpose? I understand that Zulip links used to be quite brittle, but if I'm not mistaken this has been fixed. Personally I find searching Zulip quite painful as an experience, so I think it would be much easier if threads were linked directly when relevant as opposed to relying on the prodigious memory of some mathlib contributors.</p>",
        "id": 520061208,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1748008862
    },
    {
        "content": "<p>We should link to messages not threads, but indeed not linking is the worst of both worlds</p>",
        "id": 520061653,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1748008971
    },
    {
        "content": "<p>Out of curiosity, why would that be the case?</p>",
        "id": 520062330,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1748009156
    },
    {
        "content": "<p>I think linking to a thread takes you to the last message in the thread</p>",
        "id": 520063451,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1748009492
    },
    {
        "content": "<p>And doesn't always survive thread renames</p>",
        "id": 520063479,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1748009499
    },
    {
        "content": "<p>Message links go to an immutable message id</p>",
        "id": 520063498,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1748009505
    },
    {
        "content": "<p>In particular old links to threads which used to be \"look at this short relevant discussion here\" then become confusing when someone else revives the thread to talk about something a bit different and the link is now linking to the end of an irrelevant conversation</p>",
        "id": 520086712,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1748016594
    },
    {
        "content": "<p>Should we add a tech debt item to go over Zulip links?</p>",
        "id": 520086934,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1748016673
    }
]