[
    {
        "content": "<p>Has there been any consensus on how to cite a result in mathlib in a math paper?</p>\n<p>I'm wrapping up a paper on lattice Yang-Mills theories, and in it we use some very basic facts about Lie groups and Lie algebras. These facts are standard and don't need to be attributed to a single person, e.g. the Lie algebra of a direct product of Lie groups is the direct sum of the Lie algebras, the Haar probability measure on a product of Lie groups is the product of the Haar measures, etc. Since the paper will likely end up in a probability journal, we decided it would be a good idea to put references for these statements since some readers won't have experience with the concepts (we also didn't directly include the proofs in our paper since we wanted the paper to be shorter). </p>\n<p>I was able to find them in Bourbaki and included that as a reference, but since mathlib is supposed to be a math library, I was wondering if there is a standard way of citing theorems from it (particularly for facts such as the ones above that don't need to be attributed an author). </p>\n<p>I also understand it's probably best to cite a book on the subject for pedagogical reasons, but I'm still curious how to cite mathlib if I ever need to.</p>",
        "id": 530233610,
        "sender_full_name": "Fred Rajasekaran",
        "timestamp": 1753223463
    },
    {
        "content": "<p>When I did this in the past, I gave a github permalink to a line of code in mathlib, and explained that all links formatted in a certain way were from mathlib.</p>",
        "id": 530234313,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1753223939
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671055\">Fred Rajasekaran</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Referencing.20Theorems.20in.20Mathlib.20in.20an.20Academic.20Paper/near/530233610\">said</a>:</p>\n<blockquote>\n<p>we use some very basic facts about Lie groups and Lie algebras. These facts are standard and don't need to be attributed to a single person, e.g. the Lie algebra of a direct product of Lie groups is the direct sum of the Lie algebras, the Haar probability measure on a product of Lie groups is the product of the Haar measures, etc. </p>\n</blockquote>\n<p>In my opinion, there's still something to attribute there.  For example, if you are using the \"Lie group\" object in mathlib, I would give attribution to the PR which introduced Lie groups: <a href=\"https://github.com/leanprover-community/mathlib/pull/3529\">!3#3529</a>. I would put this in a footnote, also including Nicolo's name as the author of this PR.</p>\n<p>In an article, I tend to do this for the 3-10 most important mathlib contributions which are prerequisite for my work. If the PR author happens to have written an article about their work then I would cite that instead (for example, Floris wrote an article about his Haar measure contribution, so you could cite that instead of footnooting the PR in which he introduced it, same for Oliver's article about Lie algebras).</p>",
        "id": 530237243,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1753225598
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"260507\">Heather Macbeth</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Referencing.20Theorems.20in.20Mathlib.20in.20an.20Academic.20Paper/near/530237243\">said</a>:</p>\n<blockquote>\n<p>I would put this in a footnote, also including Nicolo's name as the author of this PR.</p>\n</blockquote>\n<p>In my thesis, I additionally attributed the reviewers; often they are much closer to co-authors than they would be in an academic review.</p>",
        "id": 530238425,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1753226371
    },
    {
        "content": "<p>If you're interested I can share some .bib files with every mathlib PR (lean3 + lean4) up to March 2024...</p>",
        "id": 530238516,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1753226438
    },
    {
        "content": "<p>You can have a look at how this is done in the <a href=\"https://afm.episciences.org/\">Annals of Formalized Mathematics</a>.</p>",
        "id": 530286762,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1753258997
    }
]