[
    {
        "content": "<p>I like to start the formalizing for the topic of regularity structures (<a href=\"https://arxiv.org/abs/1303.5113\">https://arxiv.org/abs/1303.5113</a>). In particular, I will start with formalizing the reconstruction theorem \"Hairer's Reconstruction Theorem without Regularity Structures\" from <a href=\"https://arxiv.org/abs/2005.09287\">https://arxiv.org/abs/2005.09287</a>.</p>\n<p>I followed the instructions of forking the Mathlib in my own github account. I was just wondering about the placement of this topic. It is about stochastic pdes and so it is a mixture of probability and analysis. Should I make a new folder called \"Stochastic PDEs\"? Should I work on it somewhere separately and then make a request here to upload?</p>\n<p>I am not sure if this is the right channel to post this question, if not please let me know which one.</p>\n<p>Thank you</p>",
        "id": 531007572,
        "sender_full_name": "Thomas Kojar",
        "timestamp": 1753565806
    },
    {
        "content": "<p>Maybe it's best if you post some code here on zulip first and then ask for advice about where that specific code should go</p>",
        "id": 531021273,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1753572551
    },
    {
        "content": "<p>For example, the article  <a href=\"https://arxiv.org/abs/2005.09287\">https://arxiv.org/abs/2005.09287</a> uses convergence of nonsmoth mollifiers (Lemma 7.4 (Mollifiers).). That is a general classical result that falls slightly outside the bump functions results on Mathlib. So I am guessing, I would have to create a separate file for it that maybe goes under bump functions folder. Correct?</p>",
        "id": 531031730,
        "sender_full_name": "Thomas Kojar",
        "timestamp": 1753577639
    },
    {
        "content": "<p>I will respond to both your questions here and in <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Regularity.20structures/with/530884811\">#mathlib4 &gt; Regularity structures</a> since they are related. </p>\n<p>Firstly see the relevant thread <a class=\"stream-topic\" data-stream-id=\"116395\" href=\"/#narrow/channel/116395-maths/topic/Hairer.20challenge/with/408574954\">#maths &gt; Hairer challenge</a>  (of course Mathlib has progressed since then). </p>\n<p>For a project of this scale I don't think it makes sense to try to develop it in mathlib directly. A good model to follow would be something like the brownian motion project found <a href=\"https://github.com/RemyDegenne/brownian-motion\">here</a>. Note everything in that project is intended to end up in Mathlib but its easier to develop it separately and then port it to Mathlib (which can be a long drawn-out process).  </p>\n<p>I think the best first step for this project would be to develop a blueprint that splits the paper into digestable lemmas, definitions and theorems that reduce to mathlib definitions and theorems (and ideally also their proofs written out in detail that mathematicians with minimal expertise could follow). See for example the brownian motion <a href=\"https://remydegenne.github.io/brownian-motion/blueprint/index.html\">blueprint</a> with  <a href=\"https://remydegenne.github.io/brownian-motion/blueprint/dep_graph_document.html\">dependency graph</a>. Also see <a href=\"https://teorth.github.io/pfr/blueprint/index.html\">PFR</a> or <a href=\"https://florisvandoorn.com/carleson/blueprint/\">Carleson Project</a> for more examples. </p>\n<p>I would definitely be interested in helping out with this project but unfortunately I am a bit busy at the moment to read/understand the paper in depth and help write the blueprint (perhaps in the near future if you don't complete it by then).</p>",
        "id": 531041947,
        "sender_full_name": "David Ledvinka",
        "timestamp": 1753582296
    },
    {
        "content": "<p>I see thank you for the advice.</p>",
        "id": 531052377,
        "sender_full_name": "Thomas Kojar",
        "timestamp": 1753587164
    },
    {
        "content": "<p>I created the github project here: <a href=\"https://github.com/TKojar/Regularity_Structures_Lean\">https://github.com/TKojar/Regularity_Structures_Lean</a></p>\n<p>I also created the blueprint as described here <a href=\"https://github.com/PatrickMassot/leanblueprint\">https://github.com/PatrickMassot/leanblueprint</a></p>\n<p>If anybody is interested to help, please direct message me here at Zulip or at <a href=\"mailto:kojartom@msu.edu\">kojartom@msu.edu</a>.</p>",
        "id": 531248913,
        "sender_full_name": "Thomas Kojar",
        "timestamp": 1753665460
    }
]