[
    {
        "content": "<p>As of a couple of minutes ago, the PR summary comment that is automatically added to PRs should contain a final tab summarizing the change in technical debt of the PR.</p>",
        "id": 482269029,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1731535097
    },
    {
        "content": "<p>The statistics are the same as the ones used by the weekly Technical Debt Report.</p>",
        "id": 482269084,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1731535126
    },
    {
        "content": "<p>Most PRs will say <code>No changes to technical debt.</code>, but some may have a report of something that changed.</p>",
        "id": 482269169,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1731535167
    },
    {
        "content": "<p>If you notice any strange behaviour associated with this new summary, please report it!  In particular, every PR that uses the action that is on current master should have this section, so a missing section might also be a bug (or simply a weird GitHub issue that used an old workflow for a new PR).</p>",
        "id": 482269370,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1731535230
    },
    {
        "content": "<p>Looking at the PRs, the most common issue that arises is that CI reports a failure in the <code>Post PR summary comment</code> step.  This is most likely due to the fact that the file that contains the script is \"old\", while the action that CI runs assumes that it has the \"new\" script.  In such cases, simply merging the current version of master and pushing again should resolve the issue.</p>",
        "id": 482282724,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1731541771
    },
    {
        "content": "<p>This is a great addition, thanks Damiano! However, I think it might be easy to overlook the tech debt message when first opening a PR. What do you think of a label that gets added to a PR if it increases a tech debt counter?</p>",
        "id": 482350384,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1731578151
    },
    {
        "content": "<p>I am indeed heading in that direction: exposing the \"weighted\" technical debt change is a test to see whether adding a label would make sense.</p>",
        "id": 482350561,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1731578202
    },
    {
        "content": "<p>Great :D</p>",
        "id": 482350592,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1731578211
    },
    {
        "content": "<p>(Btw, all this automation is joint with Johan.)</p>",
        "id": 482350607,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1731578215
    },
    {
        "content": "<p>So, basically, I want to see that the measure that is currently used is a good heuristic to add a <code>tech-debt-increase</code>/<code>decrease</code> label.</p>",
        "id": 482350737,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1731578265
    }
]