[
    {
        "content": "<p>Over the recent PRs, the use of autoImplicit in mathlib has shrunk considerably. I think it's feasible to list the remaining uses and discuss them individually. Currently, there are <code>18</code> files left in <code>Mathlib</code> which use <code>autoImplicit</code>:</p>\n<ul>\n<li>three only use it for individual declarations</li>\n<li><del><code>Data/List/EditDistance/{Bounds,Estimator}</code> and almost all of <code>Data/MLLList</code> are handled in <a href=\"https://github.com/leanprover-community/mathlib4/pull/14896\">#14896</a> (and the latter is somewhat deprecated anyway, as I understand it)</del> update: merged now</li>\n<li>3 files are in <code>Data/Vector</code>: <a href=\"https://github.com/leanprover-community/mathlib4/pull/14885\">#14885</a> handles these </li>\n<li>\n<p><del><code>Tactic/Ring/Basic</code> is done in <a href=\"https://github.com/leanprover-community/mathlib4/pull/14709\">#14709</a></del> merged now</p>\n</li>\n<li>\n<p><code>Data/HashMap</code> is fully deprecated (so doesn't really matter either way)</p>\n</li>\n<li><code>Control/Random</code> seems to use autoImplicit pervasively: this seems to be a case where actually allowing it could be fine.</li>\n<li><code>Logic/UnivLE</code> always yields errors in the <code>univLE_of_max</code> instance</li>\n<li><code>Logic/Basic</code> is simply a huge file</li>\n</ul>\n<p>I would like to extend the set_option linter to also complain about autoImplicit being used in <code>Mathlib</code>, effectively enforcing what has been informal policy already. This means disabling the linter on existing usages. Any comments, suggestions, concerns or objections to doing so?</p>",
        "id": 452514283,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1721376549
    },
    {
        "content": "<p>Probably <span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span> will be sad</p>",
        "id": 452514653,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1721376635
    },
    {
        "content": "<p>I am very sad too, but this is too late. This feature of Lean 4 had too many enemies.</p>",
        "id": 452540512,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1721384539
    },
    {
        "content": "<p>I renewed my hatred against it only this week when I mistyped an <code>\\MCX</code> as an <code>X</code> in a lean game repo and was bewildered for several minutes, and even went as far as a partial redesign of the entire set-up of my game before I realised my foolish error (I had edited several files to \"fix\" the problem after misdiagnosing it).</p>",
        "id": 452583326,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1721399185
    },
    {
        "content": "<p>If Lean had a transient message saying \"Hey, this is a new variable!\" the first time that it is \"introduced\", I would probably like it much more.</p>",
        "id": 452583590,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1721399277
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Remaining.20uses.20of.20autoImplicit.20in.20mathlib/near/452583326\">said</a>:</p>\n<blockquote>\n<p>I renewed my hatred against it only this week when I mistyped an <code>\\MCX</code> as an <code>X</code> in a lean game repo and was bewildered for several minutes, and even went as far as a partial redesign of the entire set-up of my game before I realised my foolish error (I had edited several files to \"fix\" the problem after misdiagnosing it).</p>\n</blockquote>\n<p>Never had this happen to me, after the first two or three times. I almost always know when I need to check for autoImplicit as a cause when I encounter an error.</p>",
        "id": 452587176,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1721400242
    },
    {
        "content": "<p>Also, I would never turn off a feature like this in an entire library just because it bothered me. Maybe on a file by file I would turn on a flag and turn it off when I am done. If only there was a way to toggle this feature in the infoview on a per file level, instead of writing the <code>set_option</code> line. EDIT : That has the potential to open a different can of worms about the default setting, but at least it is quicker to tweak.</p>",
        "id": 452587750,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1721400393
    },
    {
        "content": "<p>I remember <span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> demoing a feature which used inlay hints to show autoimplicits, which makes them much noisier / harder to miss. I'm sad that didn't make it in, perhaps it got deprioritized after the initial push (during the Munich meetup IIRC)</p>",
        "id": 452685944,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1721433091
    },
    {
        "content": "<p>I hadn't realized this was a recent-ish decision. Alas. I personally find it extremely useful at least when writing the file, and had thought its non-use was mostly a matter of clarity when reading the resulting code.</p>",
        "id": 452697481,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1721440687
    },
    {
        "content": "<p>Yes, it's still on our wish list, but don't hold your breath, it is rather tricky to implement robustly given CS Code's and the LSP' API, and it's not high priority.</p>",
        "id": 452835910,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1721478749
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Remaining.20uses.20of.20autoImplicit.20in.20mathlib/near/452685944\">said</a>:</p>\n<blockquote>\n<p>I remember <span class=\"user-mention silent\" data-user-id=\"110024\">Sebastian Ullrich</span> demoing a feature which used inlay hints to show autoimplicits, which makes them much noisier / harder to miss. I'm sad that didn't make it in, perhaps it got deprioritized after the initial push (during the Munich meetup IIRC)</p>\n</blockquote>\n<p>There was  a brief discussion on using inlays to show autoImplicit on <del>zulip</del> discord. We had three ideas: </p>\n<ol>\n<li>use haskell style inlays in a line above the def. </li>\n<li>Show it in the infoview when the cursor is on the def using autoImplicit</li>\n<li>Show a hint when another declaration has an error <em>and</em> an upstream def used autoImplicit. This is better because autoImplicit can show up in errors in downstream declarations.</li>\n</ol>",
        "id": 452836014,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1721478852
    },
    {
        "content": "<p>Agreeing with the above, that more work (e.g. inlay hints) is needed to restore the glory of autoImplicits, I am not at all sad that Mathlib is becoming uniform here. </p>\n<ol>\n<li>\n<p>The big benefit of autoImplicits is in development. For finished files it is a more balanced trade-off for readability. </p>\n</li>\n<li>\n<p>Uniformity in language conventions is <em>really</em> valuable. If we can't have it ecosystem wide, it's still good to improve the internal consistency in mathematics projects.</p>\n</li>\n</ol>",
        "id": 452906061,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1721513368
    }
]