[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/channel/287929-mathlib4/topic/How.20do.20you.20decide.20what.20to.20add.20to.20mathlib.3F/near/492012543\">said</a>:</p>\n<blockquote>\n<p>As an example, I think all concrete \"named\" combinatorial games (domineering, hackenbush, etc) should be developed outside of Mathlib.</p>\n</blockquote>\n<p>I agree, actually. Those things do meet my two criteria. They're overly specific and don't really lead to much interesting mathematics (besides potentially some connections to other games).</p>",
        "id": 492171657,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736192626
    },
    {
        "content": "<p>I would make an exception for nim, since it's required for Sprague-Grundy (and it motivates my ongoing work with nimbers). But other than that, all other concrete combinatorial games can be their own self-contained projects within a larger repository.</p>",
        "id": 492171954,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736192748
    },
    {
        "content": "<p>Just one thing. We already have some basic work on <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/SetTheory/Game/Domineering.html\">Domineering</a> on Mathlib (written by Kim themselves!). Would we keep it in Mathlib out of backwards compatibility, or should it eventually be moved to this new repository?</p>",
        "id": 492174222,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736193608
    },
    {
        "content": "<p>Also <span class=\"user-mention\" data-user-id=\"767695\">@Tristan Figueroa-Reid</span></p>",
        "id": 492195366,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736201489
    },
    {
        "content": "<p>Hackenbush is interesting for combinatorial games because it represents the class of cold partisan games. However, no results in CGT depend on Domineering as far as I'm aware.</p>",
        "id": 492196131,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736201763
    },
    {
        "content": "<p>I think if there is going to be a separate repository for combinatorial games, though, it absolutely should take all named games with it.</p>",
        "id": 492197261,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736202157
    },
    {
        "content": "<p>Yes, domineering should move out.</p>",
        "id": 492206348,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1736205542
    },
    {
        "content": "<p>I can host that if you don't mind <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 492206634,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736205637
    },
    {
        "content": "<p>How about this repository exists at <code>leanprover-community/mathlib-combinatorial-games</code> or <code>leanprover-community/combinatorial-games</code>? We can have a quick process to pick some maintainers. I'd propose that implicit in it being part of <code>leanprover-community</code> is that:</p>\n<ul>\n<li>at the end of the day, the Mathlib admin committee has final say if there a political decisions to be made</li>\n<li>the maintainers commit to maintaining \"mathlib like standards\" for the library</li>\n<li>and I'd propose per Joseph's <a href=\"#narrow/channel/287929-mathlib4/topic/How.20do.20you.20decide.20what.20to.20add.20to.20mathlib.3F/near/492179603\">post</a> that said maintainers set up CI to regularly and automatically bump the Mathlib dependency</li>\n</ul>",
        "id": 492208334,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1736206431
    },
    {
        "content": "<p>Not sure if this is implicit in your comment, but:</p>\n<ul>\n<li>(at least) all mathlib maintainers are able to merge PRs to the new repository - if only for refactoring and other changes that are relatively theory-free</li>\n</ul>",
        "id": 492209125,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1736206822
    },
    {
        "content": "<p>Having this as an official leanprover repository would be great!</p>",
        "id": 492209825,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736207191
    },
    {
        "content": "<p>Something like this could certainly be used for incremental development of / experimentation with the infrastructure for multi-repository mathlib (that is, you wouldn't need to have all the infrastructure I described present when you first add such a repository, though it might be a good idea to have it done before we move from two repositories to three).</p>",
        "id": 492215945,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1736210226
    },
    {
        "content": "<p>It's possible multi-repository mathlib might end up having per-repository maintainers/reviewers, but it seems reasonable that the core mathlib maintainers/reviewers should also have those abilities in other mathlib repositories and any per-repository maintainers/reviewers would be additional to that.</p>",
        "id": 492216071,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1736210287
    },
    {
        "content": "<p>One thing that would be useful for more than just multi-repository mathlib is a simple configuration hook (lakefile.toml / lakefile.lean) for \"apply mathlib conventions in all linters\". All mathlib repositories should have the linters enabled that are disabled by default outside mathlib - but the same also applies for external repositories where people are developing code that they intend to contribute to mathlib once ready.</p>",
        "id": 492216290,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1736210411
    },
    {
        "content": "<p>I'd be glad to be a maintainer of this future repo, if you'll let me <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 492251232,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736231763
    },
    {
        "content": "<p>The community (aka <span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span>, <span class=\"user-mention\" data-user-id=\"579936\">@Gareth Ma</span> and myself) now has produced quite a few \"end results\" in additive combinatorics. Should we have <code>leanprover-community/mathlib-additive-combinatorics</code> as well to host those results?</p>",
        "id": 492264589,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1736239146
    },
    {
        "content": "<p>I strongly suggest getting all the infrastructure for two-repository mathlib working (CI, docs, linting, etc.) before moving to three-repository mathlib. Three-repository mathlib is strictly more complicated: it's no longer enough for all the mathlib repositories other than core mathlib to have their mathlib dependency updated frequently, they all need to be updated in sync to the same version of core mathlib so there is always a collection of recent versions of all the mathlib repositories that can be used together.</p>",
        "id": 492387180,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1736283888
    },
    {
        "content": "<p>Most developer tooling is usually made for monorepo setups, and it might just be a better idea to have these separate libraries inside the mathlib4 repository instead of trying to do a polyrepo setup in the first place.</p>",
        "id": 492389792,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736284981
    },
    {
        "content": "<p>Especially GitHub CI/CD: most actions are not designed for polyrepos, and syncing across polyrepos is much messier than just tagging PRs/issues with whichever project they belong in.</p>",
        "id": 492390214,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736285171
    },
    {
        "content": "<p>We’ve read so many times that Mathlib is crazy because it’s a monorepo… It seems whatever we do is always bad software engineering.</p>",
        "id": 492391455,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1736285758
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Repository.20for.20combinatorial.20games/near/492391455\">said</a>:</p>\n<blockquote>\n<p>We’ve read so many times that Mathlib is crazy because it’s a monorepo… It seems whatever we do is always bad software engineering.</p>\n</blockquote>\n<p>Haha, yeah, I guess it really is a differing opinion for many people. I personally have slowly gone to favor monorepos after realizing the weaknesses of polyrepos in terms of developer tooling. My early concern with monorepos would have been the huge intake of differing issues and pull requests (i.e. swc deals with this a lot), but it seems easier to deal with them in one place.</p>",
        "id": 492391803,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736285889
    },
    {
        "content": "<p>Though, it seems best to pick whatever would be suited for lean4 itself, but I don't think lean4 has great tooling for neither monorepos nor polyrepos.</p>",
        "id": 492391875,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736285918
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Repository.20for.20combinatorial.20games/near/492391455\">said</a>:</p>\n<blockquote>\n<p>We’ve read so many times that Mathlib is crazy because it’s a monorepo… It seems whatever we do is always bad software engineering.</p>\n</blockquote>\n<p>Was the discussion against mathlib4 being a monorepo, or against it being a single library?</p>",
        "id": 492393074,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736286410
    },
    {
        "content": "<p>Oh we had lots of people arguing that everything is bad. So the answer is: both.</p>",
        "id": 492393168,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1736286456
    },
    {
        "content": "<p>I actually think Mathlib being a monorepo is one of its biggest strengths. I've been pleasantly surprised more that once in learning that some piece of \"ordinal arithmetic\" is actually some more general order notion that's broadly useful to others.</p>",
        "id": 492393513,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736286600
    },
    {
        "content": "<p>It's just that for niche topics like combinatorial games, the cost ends up outweighing the benefits.</p>",
        "id": 492393599,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736286626
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Repository.20for.20combinatorial.20games/near/492393513\">said</a>:</p>\n<blockquote>\n<p>I actually think Mathlib being a monorepo is one of its biggest strengths. I've been pleasantly surprised more that once in learning that some piece of \"ordinal arithmetic\" is actually some more general order notion that's broadly useful to others.</p>\n</blockquote>\n<p>I absolutely agree. I'm still a fan of monorepos, but it fits particurally well with the way mathlib4 is designed.</p>",
        "id": 492393606,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736286629
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Repository.20for.20combinatorial.20games/near/492393599\">said</a>:</p>\n<blockquote>\n<p>It's just that for niche topics like combinatorial games, the cost ends up outweighing the benefits.</p>\n</blockquote>\n<p>Actually, was there any argument for keeping combinatorial games themselves outside of <code>Archive</code>? Or was it because there might be theory developed on top of specific combinatorial games?</p>",
        "id": 492393753,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736286698
    },
    {
        "content": "<p>The basics of combinatorial games themselves should absolutely be a part of Mathlib. Otherwise we just end up reinventing the wheel every time someone wants to formalize a game. And this is not to mention things like nimbers or surreals that are built on top of this.</p>",
        "id": 492394015,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736286791
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Repository.20for.20combinatorial.20games/near/492394015\">said</a>:</p>\n<blockquote>\n<p>The basics of combinatorial games themselves should absolutely be a part of Mathlib. Otherwise we just end up reinventing the wheel every time someone wants to formalize a game. And this is not to mention things like nimbers or surreals that are built on top of this.</p>\n</blockquote>\n<p>I'm so sorry for the misuse of words. I meant named combinatorial games. I do agree with keeping combinatorial games inside of Mathlib.</p>",
        "id": 492394110,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736286826
    },
    {
        "content": "<p>I remember discussing something about putting it in the Archive earlier.</p>",
        "id": 492395024,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736287198
    },
    {
        "content": "<p>I think the real question we should be asking is, shouldn't the Archive be split into other repositories instead?</p>",
        "id": 492395226,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736287251
    },
    {
        "content": "<p>For instance, an IMO repository would allow us math olympiad nerds to focus on problems more specifically (and would provide useful training material for all the fancy new AIs), while not taking as much time out of the Mathlib maintainers.</p>\n<p>Arguably this already exists as <code>compfiles</code>, the difference would be that our version of it complies to Mathlib quality standards.</p>",
        "id": 492395537,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1736287374
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Repository.20for.20combinatorial.20games/near/492395226\">said</a>:</p>\n<blockquote>\n<p>I think the real question we should be asking is, shouldn't the Archive be split into other repositories instead?</p>\n</blockquote>\n<p>Too many separate repositories for mathlib4 is going to lead to a lot of configuration duplication that would be annoying to update. It is quite nice to also be able to golf a tactic and immediately see results in <code>Archive</code> (since the Archive isn't just useful for AI training, but it gives a better peek into how end users might use mathlib4, which is very useful for testing user experience)</p>",
        "id": 492395997,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736287565
    },
    {
        "content": "<p>This is quite a strange problem: I think the end results of additive combinatorics are still useful enough to keep in mathlib4, but named combinatorial games are useless enough to be unused by essentially every single mathlib4 user, yet they still might have extra theory developed on them since a small but non-neglible amount of research is done on named combinatorial games.</p>\n<p>I think something that would probably solve this is if <code>Archive</code> could be imported as a library: Archive contains a lot of end results and other non-essential extra problems (i.e. IMO), but I think for the small group of people that would be building on top of Archive outside of mathlib4, it makes sense for them to just import the entire folder instead of breaking it up into a series of submodules for maintainability reasons.</p>",
        "id": 492397430,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1736288276
    },
    {
        "content": "<p>A monorepo works fine for mathlib at present (including niche topics), and probably for mathlib at ten times its present size given better infrastructure for only downloading/unpacking those oleans that are actually needed, so there's no hurry to get things working with multiple repositories. But it probably doesn't work well when we're 1000 times the present size.</p>\n<p>Part of the infrastructure for multiple repositories would need to be automation to keep \"configuration duplication\" updated in sync for all repositories.</p>",
        "id": 492495291,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1736339800
    },
    {
        "content": "<p>My only problem with keeping combinatorial games in a separate repository is that many combinatorial game theory tools are developed to analyze specific categories of games: it would make more sense if the entirety of combinatorial game theory were isolated or if games were in the Archive folder.</p>",
        "id": 495171488,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1737505922
    },
    {
        "content": "<p>Any updates on this? I've got <a href=\"https://github.com/leanprover-community/mathlib4/pull/21003\">#21003</a> in the oven and I'd like to know whether this is welcome in Mathilb or whether I should be moving it elsewhere.</p>",
        "id": 497112305,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1738370173
    },
    {
        "content": "<p>I think we are waiting for you creating the repository.</p>",
        "id": 497145990,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1738400276
    },
    {
        "content": "<p>I thought it should live under <code>leanprover-community</code>?</p>",
        "id": 497146123,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1738400370
    },
    {
        "content": "<p>historically I think things are often created elsewhere and then moved?</p>",
        "id": 497149025,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738402723
    },
    {
        "content": "<p>Can you move a repository between two GitHub users without losing the commit history?</p>",
        "id": 497153089,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1738406190
    },
    {
        "content": "<p>You can <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 497153106,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1738406209
    },
    {
        "content": "<p>Should I then create <code>YaelDillies/mathlib-add-combi</code>?</p>",
        "id": 497153245,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1738406340
    },
    {
        "content": "<p>Hi! I'm sorry for completely forgetting about this for the past weeks. The semester hasn't been treating me so kindly...</p>\n<p>What exactly is the scope here? Should I just copy over everything we already have on combinatorial games to this new repository, with the goal of deleting Mathlib's development altogether? Personally I'm not a fan of this since it would mean we'd have to get rid of our development of surreals as well, which are arguably relevant mathematics.</p>\n<p>Or is the idea that we just copy over the \"non-essential\" things, i.e. the development of specific games like domineering or poset games?</p>",
        "id": 501502851,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740393299
    },
    {
        "content": "<p>As an external observer of the development, I see a lot of PRs and a lot of refactors going on.</p>",
        "id": 501506992,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1740393975
    },
    {
        "content": "<p>My personal impression is that it would probably be simpler to excise what is currently being still thought about to a separate repository, where progress, tests and refactors can be done at \"super Mathlib\" speed.</p>",
        "id": 501507020,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1740393983
    },
    {
        "content": "<p>Once things settle in the new repository, it is a good time to PR to mathlib.</p>",
        "id": 501507039,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1740393988
    },
    {
        "content": "<p>By then, the formalisation would be more stable and it will be clearer to see what is in scope and what is better left on the side.</p>",
        "id": 501507048,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1740393990
    },
    {
        "content": "<p>I wouldn't classify the formalization as unstable, but there's certainly a lot of API that can be improved.</p>\n<p>If that's the metric though, then we'd need to move the entirety of the <code>Game</code> and <code>Surreal</code> folders over, as these refactors involve the least common denominator file <code>Game/PGame</code>.</p>",
        "id": 501509566,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740394657
    },
    {
        "content": "<p>(if we're going to take over surreal numbers too, then that could be an opportunity to finally get the surreal division PR merged somewhere)</p>",
        "id": 501509838,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740394712
    },
    {
        "content": "<p>Is that what we want to do? If so, I'll publish the repo in a few hours and I'll copy over all of the relevant Mathlib PRs.</p>",
        "id": 501512069,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740395311
    },
    {
        "content": "<p>To me, this seems like a good idea.  I would wait to see what the other maintainers also think.</p>",
        "id": 501516884,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1740396640
    },
    {
        "content": "<p>I would move <code>Game</code> and <code>Surreal</code>.</p>",
        "id": 501534929,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1740401542
    },
    {
        "content": "<p>unless there is some other part of Mathlib using anything from those folders.</p>",
        "id": 501534984,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1740401559
    },
    {
        "content": "<p>In addition, a good data point is to look at files where you needed to systematically ping the maintainer team on Zulip because no maintainer was interested in the PR.</p>",
        "id": 501535216,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1740401628
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"321459\">Damiano Testa</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Repository.20for.20combinatorial.20games/near/501506992\">said</a>:</p>\n<blockquote>\n<p>As an external observer of the development, I see a lot of PRs and a lot of refactors going on.</p>\n</blockquote>\n<p>To clarify, the refactors are mainly to move to an <code>IGame</code>: the numerous PRs is because two PRs were made that were thousands of lines long about 2 years ago, and they're just now being split down, because reviewing those enormous PRs is hard. However, having <code>IGame</code> unlocks the ability for us to (nicely) formalize end results and open problems in combinatorial game theory, which would make this formalization a very good resource for real <code>proof_wanted</code>s.</p>",
        "id": 501605628,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1740418180
    },
    {
        "content": "<p>There's also the more minor refactor I've been doing of defining game relations generally on preorders, it's the source of some PRs but isn't really anything huge.</p>",
        "id": 501615992,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740420772
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Repository.20for.20combinatorial.20games/near/501535216\">said</a>:</p>\n<blockquote>\n<p>In addition, a good data point is to look at files where you needed to systematically ping the maintainer team on Zulip because no maintainer was interested in the PR.</p>\n</blockquote>\n<p>Yeah, that's the entire game folder, unfortunately.</p>",
        "id": 501637182,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740427433
    },
    {
        "content": "<p>Yeah - combinatorial game theory (I don't think) is used anywhere else in mathlib4. It helps a lot in developing utilities for dealing with classes and order theory (and it is probably the closest so far we have to reaching the end of a field other than additive combinatorics), but I think moving <code>Game</code>/<code>Surreal</code> out of mathlib4 would be permanent if it happens.</p>",
        "id": 501638855,
        "sender_full_name": "Tristan Figueroa-Reid",
        "timestamp": 1740427984
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Repository.20for.20combinatorial.20games/near/501637182\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Repository.20for.20combinatorial.20games/near/501535216\">said</a>:</p>\n<blockquote>\n<p>In addition, a good data point is to look at files where you needed to systematically ping the maintainer team on Zulip because no maintainer was interested in the PR.</p>\n</blockquote>\n<p>Yeah, that's the entire game folder, unfortunately.</p>\n</blockquote>\n<p>You shouldn’t see that as unfortunate. It means you could move it all to the new repository and no longer have to beg for reviews.</p>",
        "id": 501639966,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1740428363
    },
    {
        "content": "<p>Speaking of, who would be the maintainers of the new repo? The Mathlib maintainers + me and Tristan?</p>",
        "id": 501643716,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740429601
    },
    {
        "content": "<p>I'm not sure I would like to be a maintainer for a new repo where I barely know the material -- I'm supposed to be proving Fermat's Last Theorem.</p>",
        "id": 501644140,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1740429749
    },
    {
        "content": "<p>Kevin, I don’t think this would be so different from the situation in Mathlib. Nowadays no single maintainer understands all the math in Mathlib. You would ignore the game repo just like you ignore probability in Mathlib for instance (taking a topic that we are both ignorant about).</p>",
        "id": 501645672,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1740430315
    },
    {
        "content": "<p>I imagine the Mathlib maintainers wouldn't need to interact with the repo if they don't want to, but it'd still be nice to be able to rely on them on matters that relate to both repositories.</p>",
        "id": 501647312,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740430840
    },
    {
        "content": "<p>Yeah, I don't think we should have \"extended mathlib\" repositories like this which the mathlib maintainers <em>can't</em> land things if needed</p>",
        "id": 501647586,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1740430937
    },
    {
        "content": "<p>The authority should carry over even if most of the responsibility need not be.</p>",
        "id": 501647692,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740430983
    },
    {
        "content": "<p>Is there a way to only import part of Mathlib? Copying the relevant files just makes everything conflict with what's already there.</p>",
        "id": 501649712,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740431718
    },
    {
        "content": "<p>? You just import part of mathlib</p>",
        "id": 501651426,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1740432349
    },
    {
        "content": "<p>Whoops you're right, I forgot to update the imports within the copied files.</p>",
        "id": 501675645,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740440529
    },
    {
        "content": "<p>One last thing. I exchanged some DMs with <span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> who recommended I wait for them to create a \"Mathlib sublibrary\" template before having the CGT repo go live, so we could have all of these future sublibraries under a common framework. Their suggestion was to start work on a preliminary repo, before copying everything over to a new repo built from this template. What do others think about this?</p>",
        "id": 501676063,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740440713
    },
    {
        "content": "<p>(I personally think we could just start the repo without the template and update whatever relevant parameters we need later down the line as needed)</p>",
        "id": 501680142,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740442514
    },
    {
        "content": "<p>Repo is up and running!<br>\n<a href=\"https://github.com/vihdzp/combinatorial-games\">https://github.com/vihdzp/combinatorial-games</a></p>",
        "id": 501713760,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740459756
    },
    {
        "content": "<p>Two questions</p>\n<ol>\n<li>Is this going to be an \"official\" Mathlib repo? (as in, do I get to claim this is <em>the</em> official Mathlib combinatorial games library?)</li>\n<li>How do I go about adding all the maintainers? Do I just send an invite to every Mathlib maintainer individually?</li>\n</ol>",
        "id": 501713841,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740459832
    },
    {
        "content": "<p>Actually two further questions</p>\n<ol start=\"3\">\n<li>What's the process for doing PRs going to be like in this new repo? I imagine every PR should still be approved by someone else; will we consider that as sufficient for merging?</li>\n<li>What happens now within \"core\" Mathlib? I'll be moving over a bunch of relevant open PRs, but does that mean they get closed in Mathlib? Will we be deleting the <code>Game</code> / <code>Surreal</code> folders from Mathlib until further notice?</li>\n</ol>",
        "id": 501714555,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740460292
    },
    {
        "content": "<ol start=\"5\">\n<li>Where can I find the Mathlib ruleset for branch protection and how can I implement it?</li>\n</ol>",
        "id": 501717341,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740462158
    },
    {
        "content": "<ol start=\"6\">\n<li>Surely now that <code>PGame</code> is relegated to its own repository we don't need to put it in the ad hoc <code>SetTheory</code> namespace, right?</li>\n</ol>",
        "id": 501719417,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740463396
    },
    {
        "content": "<ol start=\"7\">\n<li>What about deprecations? Since no one is going to be using this new repo yet, surely we can just do a purge of unsupported theorems?</li>\n</ol>",
        "id": 501719567,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740463474
    },
    {
        "content": "<p>Are you also going to take the <code>Nimber</code> directory?</p>",
        "id": 501719879,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1740463666
    },
    {
        "content": "<p>Great question. By Patrick's criterion I definitely should.</p>",
        "id": 501719982,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740463717
    },
    {
        "content": "<p>Yeah, if I'm taking surreals then it only makes sense to take the <em>other</em> algebraic structure based on combinatorial games.</p>",
        "id": 501720039,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740463747
    },
    {
        "content": "<p>Btw <span class=\"user-mention\" data-user-id=\"767695\">@Tristan Figueroa-Reid</span> I sent you the invitation to be a collaborator</p>",
        "id": 501724656,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740466101
    },
    {
        "content": "<p>Oh and </p>\n<ol start=\"8\">\n<li>Should we announce the existence of this new repo at some point?</li>\n</ol>",
        "id": 501730906,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740468946
    },
    {
        "content": "<p>I would wait until you have moved the directories to the new repo and everything compiles and you've written a README with perhaps some future goals and a vision of where you're going, and then dump something in <a class=\"stream\" data-stream-id=\"113486\" href=\"/#narrow/channel/113486-announce\">#announce</a> (and remember to write \"follow-up discussion here in #general\" or whatever, so people don't start spamming #announce with responses which ping thousands of people)</p>\n<p>Note that part of the reason that we're in this situation is that (IMNSHO) mathlib doesn't have a clear vision right now (and we seem to have recently decided \"CGT is not for mathlib\" after a long discussion). The vision initially for mathlib was \"do math and grow\", then \"nail an undergraduate curriculum\", then it became \"grow in arbitrary directions with rate determined by density of whoever is active in the community\" rather than any specific policy. If you start with a policy then it will hopefully make it very clear what you want (and more importantly what you don't want).</p>",
        "id": 501734915,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1740470530
    },
    {
        "content": "<p>I've moved the directories and everything compiles, so I guess that means it's README time.</p>",
        "id": 501735958,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1740470936
    },
    {
        "content": "<p>The CGT repo has been quite successful. We've done a lot of progress relative to the Mathlib version, including but not limited to:</p>\n<ul>\n<li>Defining division and the w-map on surreals</li>\n<li>Proving most of the simplest extension theorems on nimbers</li>\n<li>A more complete treatment of dyadic rationals, as well as defining the map from reals to surreals.</li>\n<li>A tactic able to automatically show comparisons between many small games.</li>\n<li>A definition of loopy games, including basic results.</li>\n</ul>",
        "id": 533203358,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1754531007
    },
    {
        "content": "<p>I bring this up because the material on Mathlib becomes more hopelessly outdated by the day. We still have <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=SetTheory.PGame#doc\">docs#SetTheory.PGame</a> on Mathlib, which has an incorrect definition of equality and is thus very painful to work with. That doesn't even exist anymore in the CGT repo, we found a way to get the correct quotient without even going through <code>PGame</code> (and as a bonus, this gives us a definition of loopy games too!)</p>",
        "id": 533203894,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1754531504
    },
    {
        "content": "<p>So, I'd like for the game theory material on Mathlib to be officially downstreamed, i.e. deprecated from Mathlib. This would encompass the entirety of the folders <code>PGame</code>, <code>Game</code>, <code>Nimber</code>, and <code>Surreal</code> (all in the <code>SetTheory</code> folder), as well as <code>SetTheory.Ordinal.NatOps</code> (which defines game addition/multiplication on ordinals as a type alias)</p>",
        "id": 533204139,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1754531717
    },
    {
        "content": "<p>I can't speak for all the maintainers / reviewers, but my impression is that a PR moving material which is not used elsewhere in mathlib to another actively-maintained repo would be fairly uncontroversial.</p>",
        "id": 533204600,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1754532099
    },
    {
        "content": "<p>Do I need deprecation tags for absolutely everything? Or is the a way to deprecate each file entirely?</p>",
        "id": 533204700,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1754532172
    },
    {
        "content": "<p>You could try using the <code>deprecated_module</code> command, though I'm not 100% sure it works properly for modules that are removed from mathlib, as opposed to split / renamed. It might do something sensible if you replace the file with just:</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"kn\">import</span><span class=\"w\"> </span><span class=\"n\">Mathlib</span><span class=\"bp\">.</span><span class=\"n\">Tactic</span><span class=\"bp\">.</span><span class=\"n\">Linter</span><span class=\"bp\">.</span><span class=\"n\">DeprecatedModule</span>\n<span class=\"n\">deprecated_module</span><span class=\"w\"> </span><span class=\"s2\">\"This module is now at ... in the CGT repo &lt;url&gt;\"</span><span class=\"w\"> </span><span class=\"o\">(</span><span class=\"n\">since</span><span class=\"w\"> </span><span class=\"o\">:=</span><span class=\"w\"> </span><span class=\"s2\">\"yyyy-mm-dd\"</span><span class=\"o\">)</span>\n</code></pre></div>",
        "id": 533205341,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1754532735
    },
    {
        "content": "<p>probably a dumb question, but why isn't the correct definition upstreamed to mathlib?</p>",
        "id": 533205523,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1754532913
    },
    {
        "content": "<p>We tried to add it to Mathlib at some point, but it was a really large refactor (in the thousands of lines of code) and there were very few maintainers with the knowledge/time to review it.</p>",
        "id": 533205876,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1754533231
    },
    {
        "content": "<p>That's actually where the idea of creating a separate CGT repo came from.</p>",
        "id": 533205890,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1754533245
    },
    {
        "content": "<p>I just opened <a href=\"https://github.com/leanprover-community/mathlib4/pull/28063\">#28063</a> adding the deprecation tags.</p>",
        "id": 533209720,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1754536571
    }
]