[
    {
        "content": "<p>I have a very minor dilemma about where to put my scratch files and I'm wondering if someone can give me a trick to solve it.</p>\n<p>If I'm working on a fast machine and someone posts something on the Zulip or if I want to test something, I might fire up a scratch file within Mathlib. The question is where to put those scratch files. If I put them in a new directory <code>scratch</code> on the same level as <code>Mathlib</code> then they do not get <code>set_option autoImplicit false</code> by default and this has burned me so many times that I cannot consider hacking with this option not set to false (I am crap at coding and I need this guardrail; moreover it is sometimes the answer to the Zulip question). But if I put them in a new directory <code>scratch</code> within Mathlib then I can't run <code>lake mk_all</code> (or <code>lake exe mk_all</code> or whatever it is) when making a PR because it adds all the scratch files to <code>Mathlib.lean</code> and I have to manually remove them.</p>\n<p>This is just such a dumb little minor niggle but I'm wondering if someone has a suggestion for a way to me achieve nirvana here.</p>",
        "id": 495968630,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1737899040
    },
    {
        "content": "<p>My approach to this is to create the file in whatever folder of Mathlib I am currently working, test things, then delete the file. Creating and deleting is fast enough. Do you want to keep the things you write in those files?</p>",
        "id": 495969090,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1737899444
    },
    {
        "content": "<p>Not many people know this, but <code>lake exe mk_all --git</code> will work, if you do not stage/commit weird files.</p>",
        "id": 495970050,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1737900301
    },
    {
        "content": "<p>I have gitignored globally files that start with <code>mwe</code> and have littered them across all dirs inside mathlib.</p>",
        "id": 495970092,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1737900338
    },
    {
        "content": "<p>I wanted <code>--git</code> to be the default, but that did not go down well with review.</p>",
        "id": 495970162,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1737900375
    },
    {
        "content": "<p>aah this <code>--git</code> option looks like exactly what I'm looking for!</p>\n<p><span class=\"user-mention\" data-user-id=\"350992\">@Rémy Degenne</span> sometimes the things in these files end up being \"todo\"s and hang around for weeks!</p>",
        "id": 495983867,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1737911314
    },
    {
        "content": "<p>Kevin, let me know how it works for you: I have been using it for as long as <code>mk_all</code> was merged, have all sorts of non-git-tracked stuff in my <code>Mathlib</code> dir, and never had an issue with it.</p>",
        "id": 495986262,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1737913098
    }
]