[
    {
        "content": "<p>I am giving a Lean tutorial at the Logic Colloquium this week, and I was planning to use Gitpod. <br>\nHowever, I realized that setting up Gitpod if you don't have a Github account yet is quite a hassle. I just tried it, and it requires both email and phone number validation, but it is quite confusing, and takes quite a few steps (it even routes you through some of the same pages twice - once before phone number validation and once afterwards).<br>\nI will also try Github codespaces, maybe that is a bit easier.</p>\n<p>In any case, I would to have an alternative for people that prefer to install it locally. How hard would it be to make a Lean 4 bundle with VSCode(/VSCodium)+Lean4+my project (with the right mathlib4 dependency + oleans)? Something like the trylean bundles <a href=\"https://leanprover-community.github.io/get_started.html#maybe-a-couple-of-nights\">that we offer</a> for Lean 3 on the website. I think that is a great way to quickly let people get Lean and work on a single project. Is that harder to do in Lean 4, or can I just adapt the script for Lean 3?</p>",
        "id": 363545433,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1685901225
    },
    {
        "content": "<p>I just tested Github Codespaces, and it is much friendlier to set up for people that still need to create an account with Github. You need to verify your email address, and are asked a few questions, but it's quite smooth.<br>\nAn easy local installation would still be nice, but it's less urgent given how easy it is to set up Codespaces.</p>",
        "id": 363556018,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1685905620
    },
    {
        "content": "<p>What extra steps did gitpod add? I though the setup was the same...</p>",
        "id": 363557667,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1685906338
    },
    {
        "content": "<p>When I tested it on a freshly created account, it required a phone number verification near the end of the process - and after this verification step you were sent back to the start of the process, and you had to re-answer \"how did you learn about gitpod\" and \"how big is your organization\" and things like that.</p>",
        "id": 363557901,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1685906458
    },
    {
        "content": "<p>Weird. Maybe they've changed their sign-up flow since I signed up</p>",
        "id": 363560369,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1685907550
    },
    {
        "content": "<p>You've had a github account for ages and might have told GitHub your phone number ages ago too</p>",
        "id": 363572983,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1685914607
    },
    {
        "content": "<p>My reading was that Floris was saying that you had to give Git<em>pod</em> a phone number too</p>",
        "id": 363574245,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1685915497
    },
    {
        "content": "<p>It was probably Github asking for a phone number, because Gitpod requested that information from Github via the app authorization.</p>",
        "id": 363600659,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1685936241
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"111080\">Floris van Doorn</span> <a href=\"#narrow/stream/287929-mathlib4/topic/setting.20up.20Gitpod/near/363545433\">said</a>:</p>\n<blockquote>\n<p>How hard would it be to make a Lean 4 bundle with VSCode(/VSCodium)+Lean4+my project (with the right mathlib4 dependency + oleans)?</p>\n</blockquote>\n<p>It should work pretty much the same I think</p>",
        "id": 363651947,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1685955411
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"111080\">@Floris van Doorn</span> If you are planning to work on a single file in each session and don't have any imports, you can try the \"Load from URL\" option on the <a href=\"https://lean.math.hhu.de/\">Lean4 Web Editor</a>. I found this very convenient for a few talks that I gave recently since I was using only standalone files for the demonstrations.</p>",
        "id": 363654339,
        "sender_full_name": "Anand Rao Tadipatri",
        "timestamp": 1685955895
    },
    {
        "content": "<p>I did the (first part of my) tutorial, and it worked very well using Github Codespaces. I can definitely recommend codespaces for tutorials. It's easy to set up (a little harder if you don't have a Github account yet, but still very doable), and worked for 95+% of participants.</p>\n<p>The tutorial I'm using is here: <a href=\"https://github.com/fpvandoorn/LogicColloquiumTutorial/\">https://github.com/fpvandoorn/LogicColloquiumTutorial/</a> (or abbreviated as <a href=\"https://tinyurl.com/LeanTutorial\">https://tinyurl.com/LeanTutorial</a> ), and the careful observer will note it's just an adaptation of <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span>'s <a href=\"https://github.com/PatrickMassot/glimpse_of_lean\">Glimpse of Lean</a></p>",
        "id": 364244431,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1686136740
    },
    {
        "content": "<p>Note that if you run the tutorial through GitHub classrooms, then the \"students\" get unlimited codespaces quota</p>",
        "id": 364280382,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1686144737
    },
    {
        "content": "<p>I think you might get close to the hours cap for a week long tutorial otherwise</p>",
        "id": 364280599,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1686144769
    },
    {
        "content": "<p>Yeah, for a week long tutorial you're right. My tutorial is only 2x1.5 hours.</p>",
        "id": 364338622,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1686156297
    }
]