[
    {
        "content": "<p>Currently there are two versions of sheafification in mathlib. There is <code>TopCat.Presheaf.sheafify</code> which is for sheaves of Types on a topological space and there is <code>CategoryTheory.presheafToSheaf</code> which is for any presheaf on a site. The one for TopCat doesn't seemed to be used anywhere and it seems like it could be replaced by the more general one.<br>\nAlso, would people want all of the more general definitions ported over to the TopCat setting? If so, I can open a PR for it.</p>",
        "id": 574592398,
        "sender_full_name": "Brian Nugent",
        "timestamp": 1771444544
    },
    {
        "content": "<p>It seems the file <code>Topology.Sheaves.Sheafify</code> is not imported by any other file.<br>\nI believe that whenever it is possible, the definitions and proofs should be done in the context of general sites, and we could provide a specialized API for topological spaces which just refers to the general API via definitions.<br>\nThere are still a few things for which we do not yet have all the necessary general API, like stalks. I introduced the notion of <code>Point</code> of a site in <a href=\"https://github.com/leanprover-community/mathlib4/pull/31859\">#31859</a>, and <span class=\"user-mention\" data-user-id=\"648495\">@Christian Merten</span> and I have been developing a little bit more about points/fiber functors. At some point, some of the topological constructions for stalks may also be refactored.</p>",
        "id": 574699555,
        "sender_full_name": "Joël Riou",
        "timestamp": 1771498788
    },
    {
        "content": "<p>There is now a bunch of PRs related to points of general sites: <a href=\"https://github.com/leanprover-community/mathlib4/pull/35806\">#35806</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/35773\">#35773</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/35572\">#35572</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/35757\">#35757</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/35175\">#35175</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/35722\">#35722</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/35136\">#35136</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/35719\">#35719</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/35715\">#35715</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/35680\">#35680</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/35584\">#35584</a>.<br>\nI would like to emphasize <a href=\"https://github.com/leanprover-community/mathlib4/pull/35584\">#35584</a> which gives a way to show that the category of sheaves with values in a monoidal category is monoidal when the site has enough points (this was previously known to mathlib only in the case we have an internal hom of (pre)sheaves). Following <a href=\"https://github.com/leanprover-community/mathlib4/pull/35773\">#35773</a>, I intend to show in a future PR that the same applies to categories of sheaves of modules. Ultimately, this will allow constructing the tensor product of quasi-coherent sheaves on a scheme.<br>\nThis still needs a lot of cleaning up, but when all of this is merged, it will be possible to make most of the existing API for sheaves on topological spaces a particular case of the API for sheaves on general sites.</p>",
        "id": 575993574,
        "sender_full_name": "Joël Riou",
        "timestamp": 1772103571
    }
]