[
    {
        "content": "<p>I want to try to formalize the fact that all cartan subalgebras in a lie algebra (over a char 0 alg cl. field) are conjugate (see also <a href=\"https://github.com/leanprover-community/mathlib4/issues/10066\">project</a>).</p>\n<p>One very clean approach, <a href=\"https://math.mit.edu/classes/18.745/Notes/Lecture_9_Notes.pdf\">lecture_9</a> uses input from algebraic geometry (which is proven directly in that file). The proof is very direct, and apart from making this AG input work, I expect it to be very short. For the AG input, one could even prove it by invoking more high-powered AG theorems about smoothness (jacobian criterion and the rank theorem). We do not currently have these in mathlib, but since people are working on smoothness these are hopefully not <em>too</em> far away, and I'm guessing it will take me some time to formalize the glue for treating vector spaces as schemes anyways. This approach would be the most satisfying to me \"math-wise\". However, maybe there is an issue with importing a possibly large amount of AG (smoothness + dependencies) into lie theory.</p>\n<p>There is also a proof (in Humphreys) which doesn't use any AG. However, that proof is considerably more convoluted, and will be significantly longer (but probably shorter in total if one counts all the needed AG imports of the other proof).</p>\n<p>So I have 3 options for formalizing this statement about Lie algebras:</p>\n<ol>\n<li>Go with the very long and convoluted Humphreys proof (which is a purely Lie theoretic proof)</li>\n<li>Go with the AG approach, but try to minimize AG imports by proving the AG statement myself as in the file (although in the end it might be quite painful to develop the theory in this special case, so maybe this option is also not the best).</li>\n<li>Go with the AG approach + use high-powered theorems. This will make the proof itself the shortest, but it will have the most imports. It will also make the proof the most readable.</li>\n</ol>\n<p>What do people think about this? Is there a big drawback with having some of Lie theory depend on AG, and are there good reasons to go through the pain of avoiding this? Or can I just go with the most high-powered and import-heavy proof?</p>\n<p>(cc <span class=\"user-mention\" data-user-id=\"240862\">@Oliver Nash</span> <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> )</p>",
        "id": 468778557,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1725884805
    },
    {
        "content": "<p>My instinct is that if alg geom can be used to do something useful here then go for it and import as much as you need! I'm a bit unclear about the motivations of the minimise-imports crowd though.</p>",
        "id": 468779390,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1725884935
    },
    {
        "content": "<p>I only have a moment for a quick remark as I'm working today but I would mostly ignore any \"heavy import\" considerations.</p>\n<p>For me the main thing is always to have the most general (or at least generalisable) statement / proof. For example, it would certainly be a huge step forward for Mathlib's Lie theory if we got this result only for algebraically-closed fields but one day we might want results for the non-algebraically-closed case so one might prefer a proof for which algebraic closure factors in later. (I have to admit that I'm not really clear on the statement here and for all I know the real case is best dealt with by complexifying anyway.)</p>\n<p>Once you're in a situation where you're proving the result at the \"right\" level of generality I think the next most important thing is to do it in the conceptually nicest way. I think most of the time I'd rather an import-heavy proof that uses the right techniques.</p>\n<p>But really it's up to you: I'd be delighted to see any proof of this result land in Mathlib!</p>",
        "id": 468784361,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1725885864
    },
    {
        "content": "<p>I worry that Lie theory will grind to a halt on your machine with this because AG imports almost everything and Lie theory is already quite slow.</p>",
        "id": 468785054,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1725885999
    },
    {
        "content": "<p>As long as you put it in a new file, import whatever makes sense. (But maybe add a note that a less high-powered proof is available, in case it would become a problem in the future.)</p>",
        "id": 468786479,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1725886216
    },
    {
        "content": "<p>Yes, I would say: definitely do it, but quarantine it as Ruben suggested. I am curious as to the effects.</p>",
        "id": 468825666,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1725893800
    },
    {
        "content": "<p>Also, if the jacobian criterion can only be used within algebraic geometry, I think that there are other issues that need to be addressed...</p>",
        "id": 468826195,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725893924
    },
    {
        "content": "<p>Okay thanks everyone! I will start working on the AG-heavy approach then.</p>",
        "id": 468830154,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1725894731
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"321459\">Damiano Testa</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Should.20.28some.20of.29.20Lie.20theory.20import.20algebraic.20geometry.3F/near/468826195\">said</a>:</p>\n<blockquote>\n<p>Also, if the jacobian criterion can only be used within algebraic geometry, I think that there are other issues that need to be addressed...</p>\n</blockquote>\n<p>Yes and not being able to import Lie theory and AG simultaneously would also be a general issue for e.g. the theory of algebraic groups</p>",
        "id": 468834817,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1725895668
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306577\">Matthew Ballard</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Should.20.28some.20of.29.20Lie.20theory.20import.20algebraic.20geometry.3F/near/468785054\">said</a>:</p>\n<blockquote>\n<p>I worry that Lie theory will grind to a halt on your machine with this because AG imports almost everything and Lie theory is already quite slow.</p>\n</blockquote>\n<p>Of course, such an issue does not need to be resolved within a week, but I worry how a proof of Fermat's Last Theory will be at all possible in lean if Algebraic Geometry, Lie Theory, Number Theory, Differential Geometry and Spectral Theory can't be imported simultaneously.</p>",
        "id": 468910841,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1725914019
    },
    {
        "content": "<p>Neither Lie theory nor algebraic geometry are involved in Mathlib's current longest pole, so I don't think there's anything to worry about for now.</p>",
        "id": 468996433,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1725949839
    },
    {
        "content": "<p>Follow the maths!</p>",
        "id": 468996473,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1725949848
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306577\">Matthew Ballard</span> <a href=\"#narrow/stream/287929-mathlib4/topic/Should.20.28some.20of.29.20Lie.20theory.20import.20algebraic.20geometry.3F/near/468785054\">said</a>:</p>\n<blockquote>\n<p>Lie theory is already quite slow.</p>\n</blockquote>\n<p>Is there a way for me to see this in Speedcenter or somewhere? (I never really notice slowness but then I have a fast laptop.)</p>",
        "id": 469076094,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1725971253
    },
    {
        "content": "<p>Not easily. You can glean facts like: Lie theory accounts for 2-3% of the 200 largest by instruction files while being .8% of the overall library. I think that would be even worse if you weight number of lines in the file.</p>",
        "id": 469080966,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1725972492
    },
    {
        "content": "<p>OK well I'd be happy to help with speed issues in this part of the library if they ever become problematic.</p>",
        "id": 469081838,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1725972695
    }
]