[
    {
        "content": "<p>Hello,<br>\nI'm currently learning geometric topology, and thought it would be fun to try and formalize the simplicial approximation theorem. I see that in mathlib there are definitions of simplicial sets, a basic definition of a topological n-simplex, and (apparently?) an upcoming PR by <span class=\"user-mention\" data-user-id=\"318709\">@Sophie Morel</span> to implement abstract simplicial complexes. Would a mathlib implementation of simplicial complexes and/or PL manifolds have to depend on abstract simplicial complexes? If not, would it be unwise to try and implement them now?</p>",
        "id": 488797846,
        "sender_full_name": "Justin Shaw",
        "timestamp": 1734081613
    },
    {
        "content": "<p>They already exist! <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Geometry.SimplicialComplex#doc\">docs#Geometry.SimplicialComplex</a></p>",
        "id": 488798832,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1734081952
    },
    {
        "content": "<p>I have more stuff in my repo LeanCamCombi. Feel free to PR whatever you need to mathlib</p>",
        "id": 488798933,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1734081976
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/channel/287929-mathlib4/topic/simplicial.20complexes.2FPL.20manifolds/near/488798832\">said</a>:</p>\n<blockquote>\n<p>They already exist! <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Geometry.SimplicialComplex#doc\">docs#Geometry.SimplicialComplex</a></p>\n</blockquote>\n<p>I somehow did not see this, why thank you! This could probably be wrangled into a proof, but it seems like geometric topology would benefit from an embedding-invariant definition (i.e. based purely off of a finset with an associated topological space, a \"default\" metric, etc., also possibly the category of simplicial complexes as well?). On another note, out of curiosity, would this be classified under mathlib/AlgebraicTopology? It might be fun to eventually build up to a formalization of the generalized schoenflies theorem/dehn's lemma/loop theorem, but those feel like they might be a bit out of place folder-wise.</p>",
        "id": 488807113,
        "sender_full_name": "Justin Shaw",
        "timestamp": 1734084790
    }
]