[
    {
        "content": "<p>I was just porting a <code>simp_only</code> line that didn’t do what it did in mathlib3. My (second) approach was to edit the lean3 proof and turn it into many <code>simp_rw […]</code> lines with just one lemma, and permutate and duplicate until it went through. Then that sequence of steps worked fine in lean4 (and some lemmas were not needed at all).</p>\n<p>This made me wish for a variant of <code>squeeze_simp</code> that would not print one <code>simp only […]</code> line, but something like that: A step-by-step reproduction of the proof using simpler tactics (maybe <code>simp_rw</code>, or even simpler), possibly even in an equational reasoning style with all intermediate states included – useful when porting, and in (simple) cases may even be a nicer, more explicit form of the proof altogether.  It is anti-golf, however :-)</p>",
        "id": 325791953,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1675503283
    },
    {
        "content": "<p>Note that it's somewhat misleading to claim<code> simp_rw</code> is a simpler tactic, as it's actually implemented in terms of repeated <code>simp only</code>!</p>",
        "id": 325898654,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1675559585
    },
    {
        "content": "<p>I was also thinking about something like this the other day. A more declarative version of <code>simp only</code> in the middle of the proof could be <code>suffices BLAH, { simpa },</code> where <code>BLAH</code> is whatever the goal is supposed to be after the <code>simp only</code>.</p>",
        "id": 325923442,
        "sender_full_name": "Reid Barton",
        "timestamp": 1675584128
    },
    {
        "content": "<p>And then you can <code>simp only</code>-ify the <code>simpa</code> inside for performance reasons, but you can also throw away and regenerate the lemma list without losing any information.</p>",
        "id": 325923723,
        "sender_full_name": "Reid Barton",
        "timestamp": 1675584388
    }
]