[
    {
        "content": "<p><code>import Mathlib</code> takes several minutes on my machine (MBP 2020 with M1). I found <a href=\"https://github.com/leanprover-community/mathlib4/issues/24020\">#24020</a> from which I concluded that cached builds are not optimized for my machine and decided to rebuild mathlib manually (which took almost 8 hours), but that didn't help. Is there anything I can do to speed up mathlib?</p>",
        "id": 548301458,
        "sender_full_name": "tau",
        "timestamp": 1761998172
    },
    {
        "content": "<p>Yeah, that issue is about when you want to compile a program that uses mathlib. I think you're just hitting the issue that mathlib is quite big. You can start by importing specific modules that look relevant</p>",
        "id": 548302150,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1761998793
    },
    {
        "content": "<p>I'm not really proficient with Lean, currently taking courses on formal verification in my uni. I'm still not sure which tactics come from Lean and which from Mathlib, considering there are some that come from both (e.g. <code>apply x</code> comes from Lean, but <code>apply x at y</code> from Mathlib IIRC). So figuring out which modules I need to import might take even more time than trying to prove a theorem.</p>",
        "id": 548302514,
        "sender_full_name": "tau",
        "timestamp": 1761999073
    },
    {
        "content": "<p>If you use <code>import Mathlib.Tactic</code> you get a good selection of math results and all (most?) mathlib tactics.</p>",
        "id": 548303383,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1761999724
    },
    {
        "content": "<p>It requires you to have a compiling file first so I don't know if it will work for your current issue, but there's also the <code>#min_imports</code> command which will tell you what the minimum imports you need are.</p>",
        "id": 548305482,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1762001485
    }
]