[
    {
        "content": "<p>Recently, there is a new automation for splitting one file from a PR to a separate PR.</p>\n<p>If you add a comment attached to a range of at least one line in a GitHub comment and the comment contains <code>splice-bot</code> as the start of one of the lines, then a bot will create a PR with just the selected file extracted and comment on the original PR, linking the newly opened PR.</p>\n<p>The bot listens to all reviewers and maintainers, as well as the PR author.</p>\n<p>This bot has not been tested very much, so please report any misbehaviour!</p>",
        "id": 576073275,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1772124366
    },
    {
        "content": "<p>See <a href=\"https://github.com/leanprover-community/mathlib4/pull/34215#discussion_r2857794663\">https://github.com/leanprover-community/mathlib4/pull/34215#discussion_r2857794663</a> for the bot in action.</p>",
        "id": 576073430,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1772124404
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> looking forward to using it! To confirm: I assume PR branches will have to merge upstream/master in order for reviewers to utilize this bot, is that right?</p>",
        "id": 576079354,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1772125839
    },
    {
        "content": "<p>I think it should work without merging <code>master</code>, actually. It also tries to rebase the changes in the file onto the latest <code>master</code> automatically, but that might not always work if there are conflicts, etc.</p>",
        "id": 576079655,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1772125926
    },
    {
        "content": "<p>There's no way for a contributor to modify the split PR, is there?</p>",
        "id": 576149316,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1772152573
    },
    {
        "content": "<p>Only reviewers and maintainers have write access to the fork that the split PR is made from. However, other contributors can still make suggestions on the split PR.</p>",
        "id": 576151865,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1772153987
    },
    {
        "content": "<p>I've been getting feedback that a command like <code>splice-bot merge</code> (available only to maintainers) which would have the bot create the PR and automatically put the <code>auto-merge-after-CI</code> label on the PR would be a welcome feature, so I'll be looking into adding that sometime next week.</p>",
        "id": 576152013,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1772154069
    }
]