[
    {
        "content": "<p>As mentioned <a href=\"#narrow/channel/287929-mathlib4/topic/.23stale.20linkifier/near/512756246\">here</a>, I'd like to start a triage group --- just a group of volunteers who go through \"stale\" pull requests regularly and try to move them along for a bit. Often, just a bit of asking/clarifying can help. I've been doing such work on an ad hoc basis, but would really like to make this more organised now. Hence, my idea is to create a triage group. In practice, this could mean that each week, one person looks at the current list of stale PRs and tries to move some of them along. Say, for an hour or so. We take turns, so everybody only needs to do that every N weeks.</p>\n<p>Feel free to comment here, or DM me if you're interested. If there are at least four people overall, I will commit to this for the next three months.</p>",
        "id": 512859202,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1744904778
    },
    {
        "content": "<p>Further remarks</p>\n<ul>\n<li>I can also imagine doing this together (e.g., two people together over chat or a video call). That may be more fun; whatever works :-)</li>\n<li>one could have a \"triage team\" channel, to ask for feedback on communication or thoughts on a particular PR</li>\n<li>I have ideas what \"looking at a PR\" can mean, so you don't need to re-invent the wheel.</li>\n</ul>",
        "id": 512859211,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1744904780
    },
    {
        "content": "<p>I've been reviving PRs myself from time to time, but as you are well aware I am chronically short on time</p>",
        "id": 512859507,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1744904872
    },
    {
        "content": "<p>... and I don't mean to distract you from reviewing, empowering other reviewers or blogging about simprocs :-)</p>",
        "id": 512859701,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1744904929
    },
    {
        "content": "<p>I'd be happy to join this effort, though I also can't make promises as to the amount of time I can devote.</p>",
        "id": 512861135,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1744905339
    },
    {
        "content": "<p>I’d also be happy to help out on this:)</p>",
        "id": 513257562,
        "sender_full_name": "Paul Lezeau",
        "timestamp": 1745141924
    }
]