[
    {
        "content": "<p>What's the current status of <code>Tactic/Sat/FromLRAT</code>? Is this file still relevant and used, with the LeanSAT project being up and coming? The tactic defined there is not used in mathlib, and it is rarely used on github: <a href=\"https://github.com/search?q=lang%3Alean+lrat_proof&amp;type=code\">search results</a><br>\nAll results are either forks of mathlib, a fork of leansat (once) or the</p>\n<ul>\n<li>the <a href=\"https://github.com/leanprover/leanbv\">leanbv repository</a>,</li>\n<li>the <a href=\"https://github.com/cruisesong7/formal_ramsey\">formal Ramsey project</a> which appears not dead,</li>\n</ul>",
        "id": 452292276,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1721293797
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> can answer better, but my understanding is that it is intended for kernel verification/translation of small LRat proofs. (With large LRat proofs implausibly slow to verify in the kernel.)</p>\n<p>By contrast, <a href=\"https://github.com/leanprover/leansat\">https://github.com/leanprover/leansat</a>, which is nearing official release (cc'ing <span class=\"user-mention\" data-user-id=\"395550\">@Henrik Böving</span> to the conversation) targets processing LRat proofs using compiled code (and hence the proofs it generates depends on the <code>ofReduceBool</code> axiom, indicating trust in the compiler), and mostly does not intend to expose the LRat proved statement to the user, but instead provides an end to end bitblasting tactic. It successfully handles realistic size problems.</p>\n<p>My ideal would be that this eventually be moved out to its own repository (or slated for deprecation if there is not energy to do that).</p>",
        "id": 452332954,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1721306135
    },
    {
        "content": "<p>FromLRAT is a proof of concept, which does what it is intended to do and has limited applicability. It's not really replaced by leansat, in particular because it does not rely on any extra axioms like reduceBool or other external trust mechanisms, but lean's kernel is a bit limited in the size of proofs it can handle.</p>",
        "id": 452426589,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1721331543
    },
    {
        "content": "<p>Thanks for clarifying! In particular, I understand this file will stay in mathlib short-term and cleaning it up is worthwhile.</p>",
        "id": 452444169,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1721338467
    }
]