[
    {
        "content": "<p>The topic of this stream still says “porting mathlib to lean 4”, but it’s too noisy for that to still be true, I think.<br>\nAlso, the #maths stream says “maths / mathlib”, which I find a bit unclear. Is it (only) about the maths itself? Or about everything related to mathlib as well? <br>\nAssuming that mathlib-topics should not go into #general (is that true?), where do mathlib discussions go?</p>",
        "id": 386580094,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1692701347
    },
    {
        "content": "<p>Yeah I have been a bit confused these days as to which things should go in #mathlib4 and which in #general, definitely seems like it's not just \"porting\" here, so maybe we can come up with a better topic description.</p>",
        "id": 386585039,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1692703233
    },
    {
        "content": "<p>Yes, it's certainly not about porting anymore.</p>",
        "id": 386585990,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1692703647
    },
    {
        "content": "<p>I've just updated all the descriptions.</p>",
        "id": 386586005,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1692703654
    },
    {
        "content": "<p>dump question, how do I see the full stream description? If I open the stream selection, I only see truncated \"The main mathematics library for Lean. Discuss future changes and contr...\"</p>",
        "id": 386586171,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1692703710
    },
    {
        "content": "<p>My suggestion is:</p>\n<ul>\n<li>if it's about Lean 4 the programming language, it goes in <code>lean4</code></li>\n<li>if it is about the current or future contents of Mathlib, it goes in <code>mathlib4</code></li>\n<li>if it is about mathematics that could/should/would be formalized, but you need to think about some maths to do so, it goes in <code>maths</code></li>\n<li>anything else goes in <code>general</code></li>\n</ul>",
        "id": 386586294,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1692703759
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"385895\">@Jon Eugster</span>, can you click the three dot drop-down menu next to the stream name in the left bar, and then select \"stream settings\"? I can see the full description there.</p>",
        "id": 386586671,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1692703836
    },
    {
        "content": "<p>(For me, it is an <code>i</code> inside a circle, rather than the 3 dots, on Android)</p>",
        "id": 386586755,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1692703884
    }
]