[
    {
        "content": "<p>Lean core seems to have adopted backticks around inline expressions and data in messages (e.g. <code>m!\"`{foo}` must have type `{bar}`\"</code>; see for instance <a href=\"https://github.com/leanprover/lean4/pull/10143\">lean4#10143</a>. From what I can see, the convention is \"names and interpolated data in messages should always be either inline and surrounded by backticks or on their own line and indented (via e.g. <code>indentD</code>)\".</p>\n<p>If I've interpreted it correctly, should Mathlib also adopt this as a style convention (and write it down in the style guide)?</p>\n<p>(Our current noncompliance with this convention is partially from using quotes instead of backticks, but mostly from interpolating expressions and data inline without anything surrounding them at all.)</p>",
        "id": 544841237,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1760478001
    },
    {
        "content": "<p>(Also, have there been any prior discussions on this? I've looked but haven't been able to find anything.)</p>",
        "id": 544841306,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1760478039
    },
    {
        "content": "<p>what's the advantage of writing backticks? they're printed in a monospace font anyway and when i quote an error message i put the message in backticks anyway...</p>",
        "id": 544841436,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1760478119
    },
    {
        "content": "<p>I guess I can think of two things:</p>\n<ol>\n<li>clearly delineate the text which represents code/potentially hoverable expressions from the rest of the message's text</li>\n<li>given that lean core does it, make the message feel the same as existing messages from lean core (i.e. like it's \"supposed to be that way\")</li>\n</ol>",
        "id": 544841672,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1760478254
    },
    {
        "content": "<p>Sounds good to me.</p>",
        "id": 544852975,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1760485213
    },
    {
        "content": "<p>I seem to remember that Mathlib was using backticks mostly, and this made its way into core eventually—then core liked it and decided it would be its convention this year.</p>\n<p>One point in favor of backticks is that <code> `x'` </code> looks better than <code> 'x'' </code>.</p>\n<p>Another (weak) advantage of backticks is that people are generally familiar with markdown so it's a hint that it's quoting code.</p>",
        "id": 544859886,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1760490839
    },
    {
        "content": "<p>This also makes test output for error messages nicer to read in VS Code.</p>",
        "id": 544927735,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1760523015
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/leanprover-community.github.io/pull/705\">https://github.com/leanprover-community/leanprover-community.github.io/pull/705</a> documents this</p>",
        "id": 544935715,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1760525493
    }
]