[
    {
        "content": "<p>A couple of months ago I asked:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"687698\">Chris Henson</span> <a href=\"#narrow/channel/113488-general/topic/releases.20of.20new.20Lean.20versions/near/558639057\">said</a>:</p>\n<blockquote>\n<p>I'm sure it's in the works, but I would like to second the request for more information about the <code>grind</code> interactive mode, especially anchors. For instance, <code>grind?</code> now uses anchors in the suggestions it makes and it is unclear to me what are the style guidelines are around these.</p>\n<p>I think in general (as I mentioned in <a class=\"message-link\" href=\"/#narrow/channel/287929-mathlib4/topic/Mathlib.3A.20the.20Missing.20Manuals/near/556925503\">#mathlib4 &gt; Mathlib: the Missing Manuals @ 💬</a> ) that it would be helpful to have a style guide entry about grind. One I don't mention there is if <code>grind only</code> is analogous to <code>simp only</code> for squeezing purposes, and I am not sure how <code>grind?</code> suggesting interactive mode fits into that.</p>\n</blockquote>\n<p>with the response understandably being that this was too early to consider at the time. However, Mathlib now has uses of interactive <code>grind</code> by <span class=\"user-mention\" data-user-id=\"479299\">@Jovan Gerbscheid</span>  in <a href=\"https://github.com/leanprover-community/mathlib4/pull/34478\">#34478</a> and a handful of squeezed terminal <code>grind</code>. There has also been some recent discussion about when it is preferable not to use <code>grind</code>, such as in <a class=\"stream-topic\" data-stream-id=\"144837\" href=\"/#narrow/channel/144837-PR-reviews/topic/.2334013.20chore.3A.20golf.20with.20grind.20to.20reduce.20explicit.20lemma.20refer/with/570429476\">#PR reviews &gt; #34013 chore: golf with grind to reduce explicit lemma refer</a> .</p>\n<p>Is anyone already working on compiling these emerging standards (not just for the interactive mode, but <code>grind</code> in general) into a section for the style guidelines page? If not, is it still too early or would it be welcome if I started drafting a PR synthesizing what seems to be the consensus so far?</p>",
        "id": 572383256,
        "sender_full_name": "Chris Henson",
        "timestamp": 1770386318
    }
]