[
    {
        "content": "<p>I gather there have been some changes recently to the \"style linter\" mechanism (particularly the part of it that checks for over-long files). I'd like to point out that some of the error messages, and the scripts to fix errors, seem not to have been updated for this change.</p>\n<p>More precisely: for recording which files are known to exceed the 1500-line length limit, the \"old\" mechanism was to maintain a list in <code>scripts/style_exceptions.txt</code>; <span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span>'s PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/15610\">#15610</a> changed this so the \"new\" mechanism is to add a line <code>set_option linter.style.longFile xxx</code> to the offending file.</p>\n<p>So, I had a PR (<a href=\"https://github.com/leanprover-community/mathlib4/pull/13997\">#13997</a>) which failed to build because of this; and the CI output from the linter gave the following message:</p>\n<p><code>error: Mathlib/Data/ZMod/Basic.lean:1: file contains 1505 lines, try to split it up\nerror: found 1 new style error(s)\nrun `lake exe lint-style --update` to ignore all of them</code></p>\n<p>So I ran <code>lake exe lint-style --update</code>, and the error in CI went away, so I thought everything was OK. However (as <span class=\"user-mention\" data-user-id=\"598052\">@Jeremy Tan</span> fortunately spotted), the update script had applied the <strong>old</strong> exceptions mechanism (adding a line to <code>scripts/style_exceptions.txt</code>), not the new one. </p>\n<p>Did someone forget to update <code>lint-style --update</code>? Or did the problem arise because I was running <code>lake exe lint-style --update</code> within a branch based on a pre- <a href=\"https://github.com/leanprover-community/mathlib4/pull/15610\">#15610</a> master, and the problem goes away for PR branches based on more recent master versions? If it's the latter, then the problem will go away with time, but it's possible that others might still get bitten in the meantime.</p>",
        "id": 466751273,
        "sender_full_name": "David Loeffler",
        "timestamp": 1725218896
    },
    {
        "content": "<p>The new linter, the syntax-based one, will complain in the file itself and suggests to use <code>set_option ...</code>.  The command-line version is just for the old version, that should be removed soon from mathlib (or maybe has already been removed).</p>\n<p>The eventual form should be to only have the syntax linter and copy-pasting the \"correct\" <code>set_option</code> from the linter's message.</p>\n<p>I'll ping <span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span>, since he is more knowledgeable of the \"text-based\" linters.</p>",
        "id": 466759472,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725223610
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"321459\">Damiano Testa</span> <a href=\"#narrow/stream/287929-mathlib4/topic/style.20exceptions.20linter/near/466759472\">said</a>:</p>\n<blockquote>\n<p>The new linter, the syntax-based one, will complain in the file itself and suggests to use <code>set_option ...</code>.  The command-line version is just for the old version, that should be removed soon from mathlib (or maybe has already been removed).</p>\n</blockquote>\n<p><del>By \"in the file itself\", do you mean \"when the file is open for editing in VSCode\"?</del></p>\n<p><del>In this particular case, there was never a time when the file was open in VSCode and over-long, because the combination of additions from two separate PR's took the file concerned over the length limit – not either PR individually. So for the file-length linter, it's crucial that it does get executed on every file (or, at least, every modified file) as part of the CI cycle, and that the warnings / suggestions it produces when run in this mode are not misleading.</del></p>\n<p>EDIT. Hold it, I understand what is going on now. The issue is that both linters exist in parallel at the moment, and both of them get fired up during CI; but the old (purely text-based) linter gets executed much earlier in the CI cycle since it doesn't require a complete build first. So the \"run failed\" notification from Bors <em>only</em> relayed the error message from the old linter, because it apparently  only reports the <em>first</em> failing CI step. The error message from the new one, with directions for adding the exception in the new way, is also there in the CI logs, but got \"masked\" by the earlier report from the old text-based linter. So the problem I'm reporting can be solved simply by killing the old text-based line-length linter.</p>",
        "id": 466831308,
        "sender_full_name": "David Loeffler",
        "timestamp": 1725256282
    },
    {
        "content": "<p>I think that your analysis is correct and I also think that overnight the text-based linter was removed.  <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 466837291,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725258049
    },
    {
        "content": "<p>I think you figured it out already: to clarify and summarise,</p>\n<ul>\n<li>the old text-based linter used <code>scripts/style-exceptions.txt</code>; the new syntax-based linter uses <code>set_option linter.style.longFile ...</code></li>\n<li>there was a brief time window when <em>both</em> linters were on master. Your PR created an overly long file during this time window, so <em>both</em> linters would apply...</li>\n<li>the text-based linter has been removed now, so this issue has been resolved.</li>\n</ul>\n<p>Sorry for the inconvenience!</p>",
        "id": 466976163,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1725288917
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> Do we need to do anything with the update-nolints workflow or was that also updated along with the recent changes?</p>",
        "id": 466980970,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1725289986
    },
    {
        "content": "<p>I think the update-nolints workflow should continue to work: the <code>lint style --update</code> step will do nothing in practice, as there are no exceptions in that file any more.</p>",
        "id": 466981605,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1725290160
    },
    {
        "content": "<p>I have considered <em>removing</em> <code>style-exceptions.txt</code> altogether: that would of course require an update to the workflow. (Let me ask about that in a different topic. Edit: <a href=\"#narrow/stream/287929-mathlib4/topic/RFC.3A.20remove.20.60scripts.2Fstyle-exceptions.2Etxt.60\">go here</a>)</p>",
        "id": 466981750,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1725290189
    }
]