[
    {
        "content": "<p>Has anyone had a reason to write down an expression like <code>sup S - inf S</code>, eg for measure theory? If so, was it a pain to work with? Did you have to do a lot of casesplitting or find it frustrating that none of the usual typeclass apply to subtraction except (basically) the data of it? I'm thinking of adding a function <code>Set α → WithBot (WithTop α)</code> which forms this difference when <code>α</code> is a complete commutative monoid with an ordered subtraction (this would include the naturals) and some API for it. But I don't want to reinvent the wheel if this is a problem that's been dealt with before</p>",
        "id": 443693194,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1718001547
    },
    {
        "content": "<p>For subtraction in <code>ENNReal</code> you want to look for lemmas with <code>tsub</code> in the name, see <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=OrderedSub#doc\">docs#OrderedSub</a> and the lemmas below it. That is the notion of truncated subtraction.</p>",
        "id": 443703701,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1718005671
    },
    {
        "content": "<p>Yes, this is not about ENNReal</p>",
        "id": 443703787,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1718005692
    },
    {
        "content": "<p>Oh, that's what the topic name suggests. Using <code>WithBot (WithTop α)</code> is annoying when your type already has a top and/or bot. I recommend working using typeclasses that you expect <code>WithBot (WithTop α)</code> to have, and do it for an arbitrary type using those typeclasses.</p>",
        "id": 443704362,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1718005894
    },
    {
        "content": "<p>But I can't ask for typeclasses that say <code>WithBot (WithTop α)</code> has a well behaved subtraction because it doesn't. However if <code>α</code> does then the formal expression <code>sup S - inf S</code> is well behaved. And subtraction in the \"extended reals\" is not in the \"extended nonnegative reals\"</p>",
        "id": 443704671,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1718006025
    },
    {
        "content": "<p>Please ignore the remark about the natural numbers, the main cases of interest are the integers and the reals (which do not have top or bottom elements)</p>",
        "id": 443704802,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1718006068
    },
    {
        "content": "<p>(though we do sometimes want to talk about the natural numbers union ±infinity, see the defintion of krull dimension)</p>",
        "id": 443704939,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1718006124
    },
    {
        "content": "<p>Why not just work with EReal, which already has a subtraction (defined by hand)? It is probably missing a lot of API because it hasn't been used a lot, but this API would definitely be worth adding.</p>",
        "id": 443705957,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1718006422
    },
    {
        "content": "<p>Because I'm actually more interested in integers</p>",
        "id": 443706086,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1718006448
    },
    {
        "content": "<p>I just figured it was more likely to have come up for reals in some corner of measure theory</p>",
        "id": 443706246,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1718006489
    },
    {
        "content": "<p>In measure theory, we use extended nonegative reals and everything is much better behaved.</p>",
        "id": 443706433,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1718006533
    },
    {
        "content": "<p>Surely we have statements about integrals involving <code>EReal</code>?</p>",
        "id": 443706873,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1718006678
    },
    {
        "content": "<p>I don't actually think we do</p>",
        "id": 443707358,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1718006837
    },
    {
        "content": "<p>Essentially none, no. Interesting functions are most often integrable or nonnegative, in the former case the (Bochner) integral takes values in a Banach space, in the latter case the (Lebesgue) integral takes values in the extended nonnegative reals.</p>",
        "id": 443707656,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1718006944
    },
    {
        "content": "<p>Huh, well that shows you how little I've interacted with that part of the library</p>",
        "id": 443707775,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1718006995
    }
]