[
    {
        "content": "<p>Working with text-based linters, I believe that <code>Mathlib.Tactic.Linter.TextBased</code> is in the wrong place:</p>\n<p>it is only used by the script <code>lake exe lint lint-style</code>, but with its current location, it is automatically imported by <code>Mathlib.Tactic</code>. Therefore, any change to the linter causes an unnecessary rebuild of almost the entire Mathlib.<br>\n(for context, these are the linters which do not need a built mathlib (and no <code>env</code>) as they directly look at the source files)</p>\n<p>I guess it should (similarly to <code>Cache</code>, <code>LongestPole</code>, etc.) live somewhere outside the <code>Mathlib</code> library. <span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> <span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> any opinions?</p>",
        "id": 472916985,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1727362709
    },
    {
        "content": "<p>I would be happy to move them to at least <code>scripts</code>.</p>",
        "id": 472951218,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727374589
    },
    {
        "content": "<p>I've also somehow behaved as though they are technical debts to be converted to syntax linters...  <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 472951294,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727374625
    },
    {
        "content": "<p>Good catch; changing a text-based linter should not cause a rebuild of most of mathlib. That said, I think there's a much simpler fix: there should be no need to import <code>Linter.TextBased</code> anywhere in mathlib; the import in <code>Mathlib.Linter.TextBased</code> can simply be removed. (I think I accidentally introduced this at some point, oops.)</p>",
        "id": 473036115,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1727422820
    },
    {
        "content": "<p>The import of <code>TextBased</code> in <code>Mathlib/Tactic.lean</code> is a red herring: that file is never imported in mathlib (coincidentally, a text-based linter enforces this).</p>",
        "id": 473036212,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1727422863
    },
    {
        "content": "<p>You're ofc right, I thought I looked at the import graph and got the impression that both <code>Mathlib.Tactic.Linter</code> and <code>Mathlib.Tactic</code> where imported early, but I confused it with <code>Mathlib.Tactic.Common</code>.</p>\n<p>Ill PR the fix you propse in a second</p>",
        "id": 473041999,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1727424747
    },
    {
        "content": "<p>I'll be busy today, so cannot approve on github (as the PR is not filed yet). But if the fix is indeed just removing the one line import, let me maintainer delegate that already - i.e. feel free to maintainer merge on my behalf.</p>",
        "id": 473054052,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1727427646
    }
]