[
    {
        "content": "<p>Mathlib doesn't have much theory about differential equations. One thing to add might be the <em>fundamental matrix</em>.</p>\n<p>Consider the differential equation y' = Ay, where y is a vector and A is a matrix, both depending continuously on x. Let S be the space of solutions to this differential equation. This turns out to be a vector space, and each x yields an obvious linear map φ_x given by φ_x(f) = f(x). Existence-uniqueness shows these φ_x are isomorphisms; the fundamental matrix Φ(x,x_0) is the composition φ_x ∘ φ_{x_0}^{-1}.</p>\n<p>This should be reasonably easy to implement, since we already have the existence-uniqueness theorems. But the question is what level of generality to use. As far as I can tell, linearity is mostly a red herring; the concept should work equally well for <em>any</em> differential equation that satisfies existence-uniqueness. The problem is it isn't exactly clear how to express the concept of \"differential equation satisfying existence-uniqueness\" in Mathlib, in a form suitable for use as a hypothesis.</p>\n<p>Alternatively, we could define the fundamental matrix for <em>all</em> differential equations; returning junk values if the solution doesn't exist for long enough. One way to do this might be to construct maximally-extended solutions by constructing the set of all solutions on all intervals, establishing an order by defining f ≤ g if f is a restriction of g to a smaller interval, and applying Zorn's lemma.</p>\n<p>So, to those who know Mathlib better than I do, what do you think would be the right design? I figure that's the hard part; the implementation should be comparatively easy.</p>",
        "id": 492816340,
        "sender_full_name": "finegeometer",
        "timestamp": 1736456040
    },
    {
        "content": "<p>What if you just used the minimal assumptions of existence-uniqueness? There’s <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=IsPicardLindelof#doc\">docs#IsPicardLindelof</a> for example.</p>",
        "id": 494574700,
        "sender_full_name": "Winston Yin (尹維晨)",
        "timestamp": 1737240090
    },
    {
        "content": "<p>Maximal solution is not yet in mathlib. I’m in the process of generalising the existence theorem to flows (<a href=\"https://github.com/leanprover-community/mathlib4/pull/20704\">#20704</a>), so maximal solutions are a natural next step. Would welcome any contribution there!</p>",
        "id": 494575477,
        "sender_full_name": "Winston Yin (尹維晨)",
        "timestamp": 1737240269
    }
]