[
    {
        "content": "<p>I have a big list of stuff that's missing from Mathlib, and I assume others have similar lists.<br>\nI think merging all of those lists would be beneficial, and would let us see at a glance what's missing and who's working on it, and also what's missing from the list of what's missing.</p>\n<p>I then thought about opening a <a href=\"https://trello.com/\">Trello</a> board or a self-hosted <a href=\"https://wekan.fi/\">Wekan</a>, then I thought about GitHub issues &amp; <a href=\"https://github.com/leanprover-community/mathlib4/projects\">projects</a>.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/channel/217875-Is-there-code-for-X.3F/topic/homeomorphism.20of.20EuclideanSpace.20on.20.E2.84.9D/near/564351447\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"933054\">Snir Broshi</span> <a href=\"#narrow/channel/217875-Is-there-code-for-X.3F/topic/homeomorphism.20of.20EuclideanSpace.20on.20.E2.84.9D/near/564351161\">said</a>:</p>\n<blockquote>\n<p>Is there somewhere else the TODO to implement it could live?</p>\n</blockquote>\n<p>An issue on the mathlib repository? (I think we should use that more)</p>\n</blockquote>\n<p>What's your opinion on opening lots and lots of issues? This could be things like small theorems or definitions (e.g. <code>Definition: Edge covers for simple graphs</code>), but also <em>the 981 remaining items</em> from Freek's 1000+ list and <em>the 346 remaining</em> IMO problems.</p>\n<p>I think having a dedicated place to collect discussions for each of these is worthwhile, if only to link to previous Zulip discussions so that they don't get forgotten.</p>\n<p>To keep the issues organized we can use labels and GitHub's <a href=\"https://github.com/leanprover-community/mathlib4/projects\">projects</a> feature.</p>\n<p>This is more issues than Mathlib ever had, including mathlib3. If such \"issue spam\" is problematic, then I'll open a Trello/Wekan.</p>",
        "id": 572561795,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770493048
    },
    {
        "content": "<p>I suggested something vaguely similar a while back (<a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/What.20is.20not.20yet.20in.20mathlib.3F/with/554826942\">#mathlib4 &gt; What is not yet in mathlib?</a>) and would be rather happy to see this happen!</p>",
        "id": 572562363,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1770493465
    },
    {
        "content": "<p>I'd be in favour, but only if there's something useful you can say. For example, I wouldn't open an issue with nothing more than \"Theorem X from 1000.yaml is missing\"</p>",
        "id": 572562397,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1770493497
    },
    {
        "content": "<p>If you can state the theorem and link to x, y, z definitions or theorems that are relevant, or issues #a #b #c to add those results, that would make more sense. Or an issue like \"missing theorems from 100.yaml about Euclidean geometry\" with a checklist might be useful to spot dependencies they have is common</p>",
        "id": 572562603,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1770493659
    },
    {
        "content": "<p>The problem I see is that because there's no such \"nothing\" issue, people don't share info about it.<br>\nWe need empty organized places to collect discussions.</p>",
        "id": 572562638,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770493695
    },
    {
        "content": "<p>A monolithic issue would half work, it requires copying every comment made on it to the appropriate location in the huge issue description.<br>\nAlternatively, that issue could say something like: \"prefix every comment you make here with the list number <code>[ITEM 123]</code> to make it easily searchable\"</p>",
        "id": 572562764,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770493787
    },
    {
        "content": "<p>Ooh dependencies is a good one, GitHub <a href=\"https://github.blog/changelog/2025-08-21-dependencies-on-issues/\">recently added</a> support for creating dependencies between issues, even across repos<br>\n<a href=\"/user_uploads/3121/zXoDo3wCPwKU9cONBVOsByTW/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/zXoDo3wCPwKU9cONBVOsByTW/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"628x298\" src=\"/user_uploads/thumbnail/3121/zXoDo3wCPwKU9cONBVOsByTW/image.png/840x560.webp\"></a></div><p>(example from the vscode repo <a href=\"https://github.com/microsoft/vscode/issues/251621\">https://github.com/microsoft/vscode/issues/251621</a>)</p>",
        "id": 572563225,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770494188
    },
    {
        "content": "<p>As a trial balloon, I would suggest a small collection organized by topic (or by Mathlib folder), where a missing item is associated with the topic or folder to which it should belong.  Also, rather than populate this collection with all the desired items, prioritize from each list (and for each topic/folder) the top two or three (or ten) items, and then add a link to a longer list of items.</p>\n<p>This presents the missing items in a small not overwhelming batch.  Further, if an item links to one or more topics/folders, one has a chance at seeing this and suggesting an appropriate generalization (or referring to an existing one in Mathlib, in which case the work is autoformalized specialization).  Arranging it by topics allows one to find the missing item of interest more quickly. Keeping the lists short allows for efficient (if slow and gradual) merging from other longer lists.</p>\n<p>In updating this list, one can move a \"found\" item off this list and onto a different list to help measure the success of this structure.  One can also quickly estimate the constant in Kevin Buzzard's O(1000) needed definitions for current mathematical development.</p>",
        "id": 572564614,
        "sender_full_name": "J. J. Issai (project started by GRP)",
        "timestamp": 1770495436
    },
    {
        "content": "<p>It is not immediately clear to me that telling the world \"346 IMO problems are missing from Mathlib\" is helpful. The point of the IMO formalizations in mathlib is that they are supposed to be \"model answers\" demonstrating that our library is up to making slick solutions; I fear that just flagging that we seem to accept IMO problems and have hundreds missing might just open the door for people to use AI to write crappy solutions; what we actually want is far more nuanced.</p>\n<p>This question of how to list stuff which is missing from mathlib has of course come up before, and one reason that there is no definitive answer is perhaps because different people have different opinions about whether something is \"missing\" or \"unwanted\".</p>",
        "id": 572564766,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1770495571
    },
    {
        "content": "<p>As a further recommendation, a tag of (easy/medium/hard) could be added to help spur community action to add certain missing items.</p>",
        "id": 572564771,
        "sender_full_name": "J. J. Issai (project started by GRP)",
        "timestamp": 1770495575
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/287929-mathlib4/topic/TODO.20lists/near/572564766\">said</a>:</p>\n<blockquote>\n<p>I fear that just flagging that we seem to accept IMO problems and have hundreds missing might just open the door for people to use AI to write crappy solutions; what we actually want is far more nuanced.</p>\n</blockquote>\n<p>Then perhaps a separate GitHub repo just for issues or a Wekan will be enough to hide such a list from the AI slop people? Avoiding slop is a hard problem, but I don't think we should sacrifice TODO lists to avoid slop.</p>",
        "id": 572564982,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770495804
    },
    {
        "content": "<p>No, the point is that \"solutions to imo problems\" is not something the mathlib community considers a \"todo\"</p>",
        "id": 572565916,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1770496802
    },
    {
        "content": "<p>Okay then let's exclude IMO from the discussion</p>",
        "id": 572565934,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770496828
    },
    {
        "content": "<p>That's definitely a step in the right direction. The next question is: what gives you the authority to claim that something is missing (and hence, implicitly, desired)? And what happens when someone finds your list, spends days making a PR adding something, and then the maintainers say \"actually no we don't want this\" and they say \"but I read on this list that you did\"?</p>",
        "id": 572566199,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1770497183
    },
    {
        "content": "<p>Even the maintainers cannot write a coherent list of what is desired in mathlib (because they have conflicting views on the question).</p>",
        "id": 572566256,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1770497252
    },
    {
        "content": "<p>That's a good question, and the answer is I don't have any authority, but I do think non-authoritative suggestions for what's missing are valuable.</p>",
        "id": 572566268,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770497279
    },
    {
        "content": "<p>ok well my list is here <a class=\"message-link\" href=\"/#narrow/channel/113488-general/topic/O.281000.29.20definitions.20for.20Annals/near/572417365\">#general &gt; O(1000) definitions for Annals @ 💬</a> . And I am not speaking for the maintainers when I say \"I think we want these\", I am speaking for myself.</p>",
        "id": 572566324,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1770497326
    },
    {
        "content": "<p>The problem that you describe can already happen even without issues, e.g. <a href=\"https://github.com/leanprover-community/mathlib4/pull/33921\">#33921</a> started by fixing a TODO left in the code by a <em>maintainer</em> after getting support from <em>multiple maintainers</em>, and then it was decided that this TODO was actually a mistake and Mathlib doesn't want to fix it.</p>",
        "id": 572566390,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770497390
    },
    {
        "content": "<p>I absolutely agree that this is a complex problem and also that people's opinions change and that sometimes things are not updated when opinions change.</p>",
        "id": 572566476,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1770497491
    },
    {
        "content": "<p>And yes it wasn't great getting an \"actually no we don't want this\" response, but it wasn't horrible, and I think it would happen less with GitHub issues vs TODOs sprinkled in the code</p>",
        "id": 572566481,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770497497
    },
    {
        "content": "<p>My idea back then was that the 'definitive' list can only be updated by a PR to mathlib, just like <a href=\"https://leanprover-community.github.io/undergrad_todo.html\">Missing undergraduate mathematics in mathlib</a>. But I appreciate that this is more complex than it would seem at first glance.</p>",
        "id": 572566529,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1770497563
    },
    {
        "content": "<p>Issues aren't meant to be a definitive list, just suggestions from random contributors, much like the RFC issues in core. If the maintainers don't like an issue they can close it at any point.</p>",
        "id": 572566631,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770497678
    },
    {
        "content": "<p>Basically what I'm saying is: I want to make my TODO list public and let people modify it and claim things off of it. Do others want that too?</p>",
        "id": 572566856,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770497982
    },
    {
        "content": "<p>You are also saying \"I might want to open possibly hundreds of issues against the mathlib repo\" which might get a less positive reception than \"I want to create a text file which probably most people will never find\". I do not know what visions the maintainers have for the issues; personally I don't look at them because I am able to generate my own issues so am less focussed on trying to solve other people's issues :-/</p>",
        "id": 572566962,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1770498114
    },
    {
        "content": "<p>Yeah that's why I'm asking for feedback before spamming issues.<br>\n(btw \"text file\" is not what I had in mind)</p>",
        "id": 572567153,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770498265
    },
    {
        "content": "<p>Here are examples where an unofficial list of things to do in graph theory would have been helpful:<br>\n<a class=\"message-link\" href=\"/#narrow/channel/113489-new-members/topic/Looking.20for.20a.20first.20project.20.28Graph.20Theory.20.2F.20Combinatorics.29/near/565955006\">#new members &gt; Looking for a first project (Graph Theory / Combinatorics) @ 💬</a>  <br>\n<a class=\"message-link\" href=\"/#narrow/channel/252551-graph-theory/topic/Newbie.20lurker.20here.2C.20trying.20to.20restart/near/567298482\">#graph theory &gt; Newbie lurker here, trying to restart @ 💬</a> <br>\n<a class=\"message-link\" href=\"/#narrow/channel/113489-new-members/topic/Menger.27s.20theorem/near/569282092\">#new members &gt; Menger's theorem @ 💬</a> <br>\n<a class=\"message-link\" href=\"/#narrow/channel/113489-new-members/topic/edge.20connectivity/near/571290588\">#new members &gt; edge connectivity @ 💬</a> <br>\nAnd by unofficial list I mean a list maintained by all graph theory contributors.</p>",
        "id": 572567662,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770498916
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"930113\">J. J. Issai (project started by GRP)</span> <a href=\"#narrow/channel/287929-mathlib4/topic/TODO.20lists/near/572564614\">said</a>:</p>\n<blockquote>\n<p>As a trial balloon, I would suggest a small collection organized by topic (or by Mathlib folder), where a missing item is associated with the topic or folder to which it should belong.  Also, rather than populate this collection with all the desired items, prioritize from each list (and for each topic/folder) the top two or three (or ten) items, and then add a link to a longer list of items.</p>\n</blockquote>\n<p>Here's my attempt <a href=\"https://github.com/leanprover-community/mathlib4/issues?q=is%3Aissue%20state%3Aopen%20author%3ASnirBroshi\">https://github.com/leanprover-community/mathlib4/issues?q=is%3Aissue%20state%3Aopen%20author%3ASnirBroshi</a></p>",
        "id": 572568857,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770500366
    },
    {
        "content": "<p>I try to solve the problem of having my ideas publicly accessible without spamming the main repo by opening <a href=\"https://github.com/BoltonBailey/mathlib4/issues?q=sort%3Aupdated-desc+is%3Aissue+is%3Aopen\">issues on my fork</a> instead, I don't know if that would meet Snir's goals, but perhaps it's an option to consider.</p>",
        "id": 572573891,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1770506409
    },
    {
        "content": "<p>Here are my thoughts:</p>\n<ol>\n<li>Open one issue per problem, not one issue per list. This way, the issue is more focused and stands a chance of being closed.</li>\n<li>Only open issues for which there is relevant past discussion to summarise.</li>\n<li>When opening an issue, summarise past discussions, link to them and make sure to clarify what qualities are expected for a contribution to close the issue</li>\n</ol>",
        "id": 572574928,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1770507722
    },
    {
        "content": "<p>If you follow these three points, then I expect these issues to act as a useful way to access the community's opinion on some matter!</p>",
        "id": 572575136,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1770507962
    },
    {
        "content": "<p>i think the goal here is not necessarily to ask the community opinion, but just to have a heap/collection of concepts which could reasonably be PRed to mathlib. keeping track of which ones have prior discussion, which ones have been (a priori) blessed/rejected by maintainers, etc. is also important, but having the overview of what isn't but could be is what i understand to be the main point here.</p>\n<p>(let me emphasise that keeping track of <em>rejected</em> topics is useful, as i don't believe this has been mentioned yet)</p>",
        "id": 572577156,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1770510329
    },
    {
        "content": "<p>Sure, but I claim that a rejected topic should be tracked by a closed issue</p>",
        "id": 572598423,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1770535282
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/287929-mathlib4/topic/TODO.20lists/near/572564766\">said</a>:</p>\n<blockquote>\n<p>It is not immediately clear to me that telling the world \"346 IMO problems are missing from Mathlib\" is helpful. The point of the IMO formalizations in mathlib is that they are supposed to be \"model answers\" demonstrating that our library is up to making slick solutions; I fear that just flagging that we seem to accept IMO problems and have hundreds missing might just open the door for people to use AI to write crappy solutions; what we actually want is far more nuanced.</p>\n</blockquote>\n<p>Back when we started writing IMO problems for Mathlib, the infrastructure for creating other projects was far less established. I wonder what we'd lose if we simply told people to contribute on <code>compfiles</code> instead.</p>",
        "id": 572654121,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1770588279
    },
    {
        "content": "<p>I agree that <code>IMO</code> is a natural candidate for a child-of-Mathlib project. We should encourage people to PR supporting lemmas though, or close API gaps they found while working on IMO problems.</p>",
        "id": 572657944,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1770592857
    },
    {
        "content": "<p>The main thing we lose from contributing directly to compfiles is exactly the review process that looks for lemmas that could be extracted to mathlib in appropriately general form and expects them to get through review and be merged before the IMO PR can go in. (The most interesting IMO PRs are those that do lead to such lemmas being added, not the subset of problems, especially algebra and number theory, that don't show up missing lemmas.)</p>\n<p>Also, do cross-repository PR dependencies work so that a compfiles PR could be opened with dependencies on 25 mathlib PRs to illustrate the goal those mathlib PRs are working towards? That would have the added complication of needing to depend on a mathlib branch with the 25 PRs integrated.</p>",
        "id": 572660947,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1770595939
    }
]