[
    {
        "content": "<p>For the longest time I've always found the usage of unbundled relations in the <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Ordinal#doc\">docs#Ordinal</a> API to be quite annoying. Mathematically, ordinals are supposed to be equivalence classes of well-orders, but in practice we can't use this characterization very well because the API is stated in the setting of <code>IsWellOrder α r</code>, rather than <code>LinearOrder α</code> + <code>WellFoundedLT α</code>. And this leads to bespoke theorems like <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Ordinal.bounded_singleton#doc\">docs#Ordinal.bounded_singleton</a> or <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Cardinal.unbounded_of_unbounded_sUnion#doc\">docs#Cardinal.unbounded_of_unbounded_sUnion</a> which are hard to even parse.</p>\n<p>I would like to change the API to one taking bundled well-orders, rather than unbundled ones. I've already taken a first step towards this in <a href=\"https://github.com/leanprover-community/mathlib4/pull/35513\">#35513</a>, which redefines <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Order.cof#doc\">docs#Order.cof</a> to take in a preorder rather than a reflexive relation, which allows us to use the existing API on <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=IsCofinal#doc\">docs#IsCofinal</a> (the changed proofs are much nicer now, in my opinion). But my intention is to eventually redefine even ordinals themselves, as a quotient of a type of bundled well-orders, rather than a type of unbundled ones. </p>\n<p>I see one potential problem with this: we might want to, under some circumstances, define a well-order on a type that already has an order instance. It's not unheard of to see mathematical arguments start with sentences such as \"take a well-ordering of the reals\". Though I'd argue that this could be dealt with via a type alias, perhaps something like <code>WellOrder α</code>, which overrides any order structure on <code>α</code> and declares its own <code>LinearOrder</code> + <code>WellFoundedLT</code> instances.</p>\n<p>I'm mostly just opening this thread as a sanity check that what I'm doing is desirable, and that no one has any major complaints about the new design.</p>\n<p>cc. <span class=\"user-mention\" data-user-id=\"773147\">@Yan Yablonovskiy 🇺🇦</span> <span class=\"user-mention\" data-user-id=\"933054\">@Snir Broshi</span> <span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span></p>",
        "id": 576185905,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1772172279
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span>  you may also be interested in this , as it touches on your idea for the ordinal/order type refactor.</p>",
        "id": 576193255,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1772176671
    }
]