[
    {
        "content": "<p>Hi everyone,</p>\n<p>I'm a final-year undergraduate student very interested in contributing to mathlib as part of my graduation project. My academic background is in Mathematics, with a strong focus on Probability Theory.</p>\n<p>I've been exploring the  Mathlib/Probability  module and find it fascinating. I'm looking for a project idea that:</p>\n<ol>\n<li>Is a foundational proof or construction in probability theory.</li>\n<li>Is suitable in scope and difficulty for an undergraduate thesis (i.e., not cutting-edge research, but still a substantial piece of work).</li>\n<li>Is not yet fully covered or could be significantly extended within mathlib.</li>\n</ol>\n<p>I've done some initial research and here are a few areas I've considered, based on what I believe might be gaps or areas for extension (though I might be mistaken!):<br>\nSpecific Concentration Inequalities: Perhaps more direct proofs for specific simple cases of Hoeffding's or Chernoff Bounds, or other foundational inequalities beyond Markov/Chebyshev.<br>\nAlternative/Stronger WLLN/SLLN versions: For instance, Etemadi's Strong Law of Large Numbers, or WLLN in different Lp spaces, if not already covered comprehensively.<br>\nBasic Poisson Process constructions/properties: Formalizing the definition of a Poisson process and proving its fundamental properties (e.g., independent/stationary increments, exponential inter-arrival times).<br>\nDeeper aspects of convergence relations: Exploring more detailed proofs or equivalences between different modes of convergence (e.g., probability, a.e., Lp, in distribution), possibly involving Egorov's theorem in probability contexts.<br>\nRao-Blackwell Theorem: Formalizing this important result in statistical inference, which relies heavily on conditional expectation.</p>\n<p>I'm open to other suggestions as well! My goal is to make a meaningful and useful contribution to mathlib while learning more about formal verification.</p>\n<p>Could anyone provide guidance on:<br>\nWhich of these (or other) areas would be most suitable and impactful for an undergraduate project?<br>\nAre there existing mathlib TODO s or discussions related to these topics?<br>\nWhere would be a good starting point or relevant mathlib files to investigate further for a chosen project?</p>\n<p>Thank you for any guidance – I'm excited to learn and contribute to this amazing project!</p>",
        "id": 541870399,
        "sender_full_name": "huaizhangchu",
        "timestamp": 1759043590
    },
    {
        "content": "<p>Hi! This is not really an answer to the question of what you should work on, but a few remarks about what's already there or not:</p>\n<ul>\n<li>Our SLLN is Etemadi's: <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Probability/StrongLaw.html#ProbabilityTheory.strong_law_ae\">ProbabilityTheory.strong_law_ae</a></li>\n<li>Egorov's theorem is here: <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/MeasureTheory/Function/Egorov.html#MeasureTheory.tendstoUniformlyOn_of_ae_tendsto\">MeasureTheory.tendstoUniformlyOn_of_ae_tendsto</a></li>\n<li>Rao-Blackwell would be nice, but note that we don't have a definition of sufficient statistic, so it would involve more work than just proving the theorem. I very recently started adding results about statistical estimation but there is almost nothing right now</li>\n<li>More concentration inequalities: yes, please! Bernstein inequality perhaps? I did not think about it much.</li>\n</ul>",
        "id": 541871654,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1759045061
    },
    {
        "content": "<p>Egorov's theorem was also originally written as a final year undergraduate project :-) (but by someone who already had several years of Lean experience).</p>",
        "id": 541879640,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1759053100
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"350992\">Rémy Degenne</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Undergrad.20looking.20for.20Probability.20Theory.20formalization.20ideas/near/541871654\">說</a>：</p>\n<blockquote>\n<p>Hi! This is not really an answer to the question of what you should work on, but a few remarks about what's already there or not:</p>\n<ul>\n<li>Our SLLN is Etemadi's: <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Probability/StrongLaw.html#ProbabilityTheory.strong_law_ae\">ProbabilityTheory.strong_law_ae</a></li>\n<li>Egorov's theorem is here: <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/MeasureTheory/Function/Egorov.html#MeasureTheory.tendstoUniformlyOn_of_ae_tendsto\">MeasureTheory.tendstoUniformlyOn_of_ae_tendsto</a></li>\n<li>Rao-Blackwell would be nice, but note that we don't have a definition of sufficient statistic, so it would involve more work than just proving the theorem. I very recently started adding results about statistical estimation but there is almost nothing right now</li>\n<li>More concentration inequalities: yes, please! Bernstein inequality perhaps? I did not think about it much.</li>\n</ul>\n</blockquote>\n<p>Hi Rémy Degenne，<br>\nThank you so much for this incredibly helpful and clear feedback—this saves me so much time from duplicating work or going down paths that are already covered, and it’s really clarifying for narrowing down my project ideas!<br>\nI really appreciate you pointing out that Etemadi’s SLLN and Egorov’s theorem are already in mathlib—I’d totally missed those in my initial exploration, so that’s a key correction. That helps me cross those off my list and focus on gaps.<br>\nYour suggestion of the Bernstein inequality is really exciting—I’d mentioned concentration inequalities as a top interest, and this feels like a perfect fit. Could you share if there are any existing results in mathlib (e.g., Markov/Chebyshev bounds, moment generating function frameworks) that I could build on for this? Or are there specific files or lemmas I should dive into first to align with mathlib’s existing probability infrastructure?<br>\nFinally, if you or others in the community have thoughts on priority among these feasible options , that would be invaluable. And are there any TODOs, GitHub issues, or Zulip discussions related to these topics I should look up to get more context?<br>\nThanks again for taking the time to share this—your input has already made my project planning so much more focused. I really appreciate the guidance!</p>",
        "id": 541882869,
        "sender_full_name": "huaizhangchu",
        "timestamp": 1759056623
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Undergrad.20looking.20for.20Probability.20Theory.20formalization.20ideas/near/541879640\">說</a>：</p>\n<blockquote>\n<p>Egorov's theorem was also originally written as a final year undergraduate project :-) (but by someone who already had several years of Lean experience).</p>\n</blockquote>\n<p>That’s fascinating to hear! It’s great to know these foundational formalizations do fit into undergrad projects—exactly the kind of sign I was hoping for. I totally get the Lean experience gap, though—right now I’m working through the Lean tutorials and poking around the probability theory files in mathlib to get used to how proofs are structured there. Hearing this just makes me more focused on putting in that groundwork first. Really appreciate you telling me that!</p>",
        "id": 541882939,
        "sender_full_name": "huaizhangchu",
        "timestamp": 1759056691
    }
]