[
    {
        "content": "<p>There are a few unused <code>have</code>s in mathlib, such as the one <a href=\"https://github.com/leanprover-community/mathlib4/pull/28924\">#28924</a> is removing. I thought we have the <code>unusedHave</code> linter for this: did something change so it's no longer catching these? (Is this a regression?)</p>",
        "id": 536111049,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756156806
    },
    {
        "content": "<p>Yeah, I've noticed the same in PNT+</p>",
        "id": 536112799,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1756157635
    },
    {
        "content": "<p>Someone needs to review/rewrite the <code>unusedHave</code> linter.</p>\n<p>There was a change to Lean where <code>have</code> was encoded as an <code>Expr.letE</code> term instead of using the <code>letFun</code> function, and also Lean aggressively turns <code>let</code>s into <code>have</code>s automatically. This caused a lot of false positives, so <code>unusedHave</code> is mostly disabled now. <a href=\"https://github.com/leanprover-community/batteries/blob/6e89c7370ca3a91b7d1f29ef7d727a9d027d7b0d/Batteries/Tactic/Lint/Misc.lean#L231\">https://github.com/leanprover-community/batteries/blob/6e89c7370ca3a91b7d1f29ef7d727a9d027d7b0d/Batteries/Tactic/Lint/Misc.lean#L231</a></p>\n<p>One kind of false positive was from <code>do</code> notation expansion, which puts unused <code>let</code>s places, which get turned to <code>have</code>s.</p>\n<p>The linter is expression-based, which seems really low-level to me. I'm also not sure why it flags only <code>have</code>s. Why not unused <code>let</code>s too?</p>\n<p>Something I wonder is, shouldn't the unused variable linter catch these?</p>\n<p>If not, then I wonder whether it would be better if this linter used some InfoTree-based approach, since then it could find which expressions were from user-authored <code>have</code>s.</p>",
        "id": 536114117,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1756158257
    },
    {
        "content": "<p>Possibly there are some heuristics it could use to continue as an expression-based linter. I'm not sure.</p>",
        "id": 536114411,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1756158401
    },
    {
        "content": "<p>I also found that giving a name to the variable introduced by <code>have</code> gives it a better chance of being picked up by the unusedHave linter, though it is not fail-safe.</p>",
        "id": 536280023,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1756227716
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> Maybe that worked before June — I should have said \"disabled\" not \"mostly disabled\".</p>\n<p>Given how the code used to work, I'm guessing the <code>Name.isInternal</code> check potentially excluded anonymous <code>have</code>s?</p>",
        "id": 536281455,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1756228329
    },
    {
        "content": "<p>Ah, my impression could have originated from an older version of mathlib and I had not picked up that this was obsolete.</p>",
        "id": 536281596,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1756228388
    },
    {
        "content": "<p>The unused variable linter can catch unused <code>have</code>s, but it needs to be told to look at tactics: <code>set_option linter.unusedVariables.analyzeTactics true</code>. This option used to be on by default (or rather, it didn't exist), but was turned off by default because it can apparently lead to bad performance in corner cases.</p>\n<p>A detail I didn't appreciate before I got into this game: a <code>have</code> can be both used and unnecessary, e.g. when a <code>have</code>-introduced hypothesis is used by <code>linarith</code>, but it would also work without that hypothesis. So if you want perfect linting for unused <code>have</code>s, there seems to be no better way than deleting the <code>have</code> and checking whether the proof still compiles.</p>",
        "id": 536391447,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1756290982
    },
    {
        "content": "<p>The issue with <code>have</code> being used and unnecessary is similar to one of the reasons why the inclusion mechanism for <code>variable</code>s changed for <code>theorem</code>: several tactics \"touch\" all local declarations, making them appear to be \"used\", when really they were unnecessary.</p>",
        "id": 536392390,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1756291405
    }
]