[
    {
        "content": "<p>The \"Build (fork)\" CI step on <a href=\"https://github.com/leanprover-community/mathlib4/pull/33893\">#33893</a> shows</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>Waiting for a runner to pick up this job...\n</code></pre></div>\n<p>since about 1 hour. This does not look normal...</p>",
        "id": 567645041,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1768252667
    },
    {
        "content": "<p>This is happening more often lately, perhaps due to <a class=\"message-link\" href=\"/#narrow/channel/287929-mathlib4/topic/slow.20linting.20step.20CI.3F/near/562762483\">#mathlib4 &gt; slow linting step CI? @ 💬</a> wasting a lot of runner hours ...</p>",
        "id": 567645364,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1768252838
    },
    {
        "content": "<p>Right -- until that gets fixed maybe we need a job to cancel those automatically...</p>",
        "id": 567654169,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1768256744
    },
    {
        "content": "<p>I'm vaguely curious what happens if we call <code>IO.Process.exit 0</code> at the end of <code>main</code> in <code>runLinter</code>. It shouldn't have any effect, but the process is not exiting as-is, so I wonder if it actually would...</p>\n<p>Ideally we find out <em>why</em> this is happening instead of just patching around it, though.</p>\n<p>But, should we try it and see what happens, if anything? Or should we try to do more debugging first? (We could also do it under e.g. a debugging-only flag that we could turn off for testing if we try to replicate the issue, either in isolation or CI.)</p>",
        "id": 567654807,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1768257076
    },
    {
        "content": "<p>I wouldn't be opposed to trying more things to get to the bottom of this!</p>",
        "id": 567655598,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1768257501
    },
    {
        "content": "<p>How many runners are doing the normal CI testing? At the moment it seems like there are only 5, which feels very few. Reason is that I have PRs that waited for 2.5hrs to get picked up and that in the middle of the day in AU, which should be low volume (unless all of Europe does their mathlib coding at night). None of the running PRs seem to be hanging on the linting step.</p>",
        "id": 567895091,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1768359435
    },
    {
        "content": "<p>I'm taking a look now. We did take one runner offline to devote to trying to reproduce the stuck linting step in a debug environment.</p>",
        "id": 567898574,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1768362358
    }
]