[
    {
        "content": "<p>Hello everyone,</p>\n<p>My name is Rudy, and I am interested in mechanizing the theory of weighted formal languages for Mathlib4.</p>\n<p>I see there already extensive libraries in the <code>Computability</code> part of Mathlib4 for regular languages and context free grammars, but maybe there's space for weighted languages as well? I would like to primarily consider semiring weighted finite state automata. I am also interested in proving closure properties and transformations for unweighted languages. I am also considering formalizing tree automata.</p>\n<p>Is anybody already working on this? I'd be interested in collaborating if people are already developing these libraries.</p>\n<p>Thanks!<br>\nRudy</p>",
        "id": 502275234,
        "sender_full_name": "Rudy Peterson",
        "timestamp": 1740660546
    },
    {
        "content": "<p>It would very probably be hard to find maintainer reviewing this. I think you will be a lot less frustrated if you create a library depending on Mathlib.</p>",
        "id": 502304293,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1740668043
    },
    {
        "content": "<p>That's not to say you can't ask for help or look for collaborators here, btw. We're always happy to see people formalizing their interests, but getting things into mathlib if none of the maintainers has expertise is an exercise in frustration, unfortunately</p>",
        "id": 502305634,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1740668389
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/channel/287929-mathlib4/topic/Weighted.20Formal.20Languages/near/502305634\">said</a>:</p>\n<blockquote>\n<p>That's not to say you can't ask for help or look for collaborators here, btw. We're always happy to see people formalizing their interests, but getting things into mathlib if none of the maintainers has expertise is an exercise in frustration, unfortunately</p>\n</blockquote>\n<p>Just out of curiosity, how does one go about bootstrapping a not previously covered area of mathematics im marthlib? Since one needs one maintainer to have expertise, I'm assuming one would then aim to <em>become</em> that maintainer. But you can't really self-review your own PRs anyway, so you'd then need to get a grad student to do the coding for you? That is, if only one maintainer is an expert in a certain field, they can't really contribute their expertise to mathlib.</p>\n<p>This isn't a critique: I'm not an active contributor to mathlib and have not experienced the potential frustration mentioned here. I'm just wondering whether there has been put much thought into how to go about these things.</p>",
        "id": 502321769,
        "sender_full_name": "Harald Husum",
        "timestamp": 1740672269
    },
    {
        "content": "<p>I guess you could find at least two persons to start contributing on other subjects and work their way into the maintainers team :)</p>",
        "id": 502329944,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1740674462
    },
    {
        "content": "<p>I am not a maintainer and I cannot speak for them; however, I will be happy to review PRs about weighted formal languages.</p>",
        "id": 502340270,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1740677337
    },
    {
        "content": "<p>Yes, we have thought about this some, and acknowledge that it is a difficult problem. My suggestion is to start (ideally with other people interested in adjacent topics --- but it will take a leader!) a repository down stream of Mathlib. You are very welcome to use this zulip to discuss PRs to it (as well as organizational issues). I think people here will be very happy to help set up the repo, including showing you how to set up good CI, and how to turn on all the Mathlib linters so you get automatic code review based on those.</p>",
        "id": 502370957,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1740687965
    },
    {
        "content": "<p>There are some in progress tools for automatically bumping the Mathlib dependency of downstream projects, and we would really like to keep working on these tools and make them even better.</p>",
        "id": 502371113,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1740688027
    },
    {
        "content": "<p>If/when there's reason to believe the project has a viable critical mass of contributors, we're happy to host it on the <code>leanprover-community</code> GitHub organization if that is preferred.</p>",
        "id": 502371390,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1740688120
    },
    {
        "content": "<p>In case it's relevant: this would be in scope for CSLib for me.</p>",
        "id": 563475112,
        "sender_full_name": "Fabrizio Montesi",
        "timestamp": 1765546417
    }
]