[
    {
        "content": "<p>One of the challenges I discovered in talking to mathematicians about Lean/mathlib is that it is still difficult to tell what is and isn't in Lean/mathlib. This is not helped by the fact that, as we know, there is an extreme variation across subfields. I see that there is a <a href=\"https://leanprover-community.github.io/mathlib-overview.html\">page</a> indicating what definitions/concepts are in mathlib (although I am not sure about the updatedness of this page, and what can be done to keep it up-to-date, but this is not my main point). Now there is also a version for <a href=\"https://leanprover-community.github.io/undergrad.html\">undergraduates</a>, but more importantly, the undergraduate version has a page indicating what is <em><a href=\"https://leanprover-community.github.io/undergrad_todo.html\">not yet</a></em> in mathlib. Why don't we have a 'not yet' page for mathematics in general? I am aware that this is theoretically of infinite length, but I believe that in practice some limit will be reached, especially if we restrict ourselves to just key definitions/concepts which are relevant to modern mathematicians. This would be similar in spirit to the <a href=\"https://leanprover-community.github.io/1000.html\">1000+ theorems</a> page that we have, but for definitions/concepts instead rather than theorems, i.e. a '1000+ definitions' page. My empirical observation is that the 1000+ theorems page is not very helpful to mathematicians in practice, not just because it is not organised by subfield, but also because most mathematicians don't really think about their work in terms of \"what named theorem did I use\", but more \"what definitions/concepts do I need\".</p>",
        "id": 536885358,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1756525735
    },
    {
        "content": "<p>My understanding is that the up-to-date-ness of the overview depends on the field also. I've been keeping the differential geometry section mostly up to date --- I would guess it's outdated in other areas.</p>",
        "id": 536895428,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756536753
    },
    {
        "content": "<p>A \"key concepts not (yet) in mathlib\" page is a nice idea! I can imagine this being very useful. If we curate it well enough, the scope will also stay not too huge. If we add it, I would strongly advocate also having a comment field, where we can point to previous discussion or partial work --- and perhaps a \"last updated\" field which indicates the status of that information.</p>",
        "id": 536895535,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756536870
    },
    {
        "content": "<p>(I'm a bit on the fence about a date field. I want to avoid very outdated comment information giving a false impression. At the same time, the date might increate the incentive for lots of busywork \"just bumping the date\" (when it reality, the work should be 'look if there's further meaningful work or discussion on this', i.e. not an easy contribution for outside people). With clear communication of this fact, perhaps this is fine?)</p>",
        "id": 536895641,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756537023
    },
    {
        "content": "<p>Relatedly, Floris van Doorn and I were discussing if there should be a venue for summaries \"here's the current status of X in Lean/mathlib\" updates. (I've been writing these for differential geometry since people asked, but having them in a discoverable place would actually be nice.)<br>\nIf you have such summaries, linking them from such a \"concepts not in mathlib yet\" page would also go a long way.</p>",
        "id": 536895696,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756537104
    },
    {
        "content": "<p>Ideally we'd have some place where you could find \"next steps in subject X\", with references to earlier discussions/ maybe textbooks / people who could help / recent progress / relevant projects outside mathlib. But that's only useful if it's up to date, as you noted</p>",
        "id": 536905293,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1756549818
    },
    {
        "content": "<p>How feasible is it to create \"1000+ definitions\" from wikipedia like 1000+ theorems did?</p>",
        "id": 536913901,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1756559282
    },
    {
        "content": "<p>Part of my starting-in-October project to formalise statements of recent theorems from the top journals will inevitably lead to a list like this but I'm not sure it will have length anywhere near 1000</p>",
        "id": 536921471,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1756567558
    },
    {
        "content": "<p>I thought you already had a project <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span></p>",
        "id": 536926889,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1756572823
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"873350\">Weiyi Wang</span> <a href=\"#narrow/channel/287929-mathlib4/topic/What.20is.20not.20yet.20in.20mathlib.3F/near/536913901\">said</a>:</p>\n<blockquote>\n<p>How feasible is it to create \"1000+ definitions\" from wikipedia like 1000+ theorems did?</p>\n</blockquote>\n<p>Depending on what you mean, quite feasible. The infrastructure for labelling \"this is in mathlib\" is not difficult; I could help you with that. The hard part is collecting a list of key definitions (and perhaps asking for feedback on the overall idea).</p>",
        "id": 536934126,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756580745
    },
    {
        "content": "<p>That said: the 1000+ theorems data was gathered from wikipedia's list of theorems. (<span class=\"user-mention\" data-user-id=\"217807\">@Freek Wiedijk</span> has a script for that, which they could presumably share.)<br>\nIf there is a similar list of definitions (that's a bit if; I'm not sure if that exists!!) you could use that as a starting point.</p>",
        "id": 536934487,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756581196
    },
    {
        "content": "<p>I tried to type up a little sparql query for that, but I dont know if there's a metaclass for \"mathematical defintions\". I did write a query up for any wikidata object instance of a subclass* of \"mathematical term\" which returned quite a few things like \"Natural number\", \"operator\", and \"without loss of generality\"</p>",
        "id": 536934670,
        "sender_full_name": "Julia Scheaffer",
        "timestamp": 1756581441
    },
    {
        "content": "<p>This list <a href=\"https://en.wikipedia.org/wiki/Lists_of_mathematics_topics\">https://en.wikipedia.org/wiki/Lists_of_mathematics_topics</a> could also be a start to explore. It contains some terms which are much broader than a definition --- but between this and the previous, some useful list can probably be produced. In any case, my impression is that this requires significant manual curation.</p>",
        "id": 536935643,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756582451
    },
    {
        "content": "<p>As a starting point we can do <a href=\"https://en.wikipedia.org/wiki/List_of_topics_named_after_Leonhard_Euler\">\"100+ Euler\"</a> <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 536936017,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1756582860
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/287929-mathlib4/topic/What.20is.20not.20yet.20in.20mathlib.3F/near/536921471\">said</a>:</p>\n<blockquote>\n<p>Part of my starting-in-October project to formalise statements of recent theorems from the top journals will inevitably lead to a list like this but I'm not sure it will have length anywhere near 1000</p>\n</blockquote>\n<p>Such a list would certainly be welcome. I know 100 theorems is biased (e.g. towards elementary geometry, and many proofs are relatively small projects); 1000+ theorems is surely biased in other way. I'd be happy about lists biased towards contemporary research :-)</p>",
        "id": 536936196,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756583043
    },
    {
        "content": "<p>Right, that's exactly the point. If we just scrape the internet for 1000 mathematical definitions including recreational ones which were made in some random paper and nobody cares about then it will cause more harm than good!</p>",
        "id": 536979104,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1756642974
    },
    {
        "content": "<p>Just a random thought, but how about using the <a href=\"https://mathscinet.ams.org/mathscinet/msc/msc2020.html\">MSC</a>?</p>",
        "id": 536979480,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1756643393
    },
    {
        "content": "<p>That's just a list of subjects (in the sense of \"areas\"), not of definitions/concepts, right?</p>",
        "id": 536979543,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756643435
    },
    {
        "content": "<p>I'm not sure about \"more harm than good\": if somebody formalises a piece of recreational mathematics, a priori I consider this good. If everybody wants to submit to mathlib and the review queue becomes even more overwhelmed... well, we need to find more money to pay reviewers. That's already a problem we want to solve :-)</p>",
        "id": 536979596,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756643478
    },
    {
        "content": "<p>Ah, or do you mean \"the list will do more harm than good\" (by steering people to formalise that list)? Gotcha, that makes a lot more sense. I can definitely relate.</p>",
        "id": 536979670,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756643525
    },
    {
        "content": "<p>Yes my fear is that we encourage people to formalise useless stuff and then PR it to mathlib</p>",
        "id": 536979697,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1756643557
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"634338\">Michael Rothgang</span> <a href=\"#narrow/stream/287929-mathlib4/topic/What.20is.20not.20yet.20in.20mathlib.3F/near/536979543\">said</a>:</p>\n<blockquote>\n<p>That's just a list of subjects (in the sense of \"areas\"), not of definitions/concepts, right?</p>\n</blockquote>\n<p>Yep, but a good proportion of them are definitions/concepts. It would need some filtering, but maybe a good starting point</p>",
        "id": 536979710,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1756643567
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/287929-mathlib4/topic/What.20is.20not.20yet.20in.20mathlib.3F/near/536979697\">said</a>:</p>\n<blockquote>\n<p>Yes my fear is that we encourage people to formalise useless stuff and then PR it to mathlib</p>\n</blockquote>\n<p>I think we should make contribution guidelines for what's in scope. I already feel like I'm threading the needle every time I PR something about ordinal arithmetic.</p>",
        "id": 537556523,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1756934580
    },
    {
        "content": "<p>The maintainers seem to have several different opinions about this question, which I agree is important. Perhaps the Initiative will take the initiative on this?</p>",
        "id": 537557034,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1756934837
    },
    {
        "content": "<p>You mean \"drive a discussion\", not \"make a decision\", right?</p>",
        "id": 537570984,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756944923
    },
    {
        "content": "<p>Yes, the maintainer team still has authority on the content and scope of Mathlib. This has not been relinquished to the Mathlib Initiative.</p>",
        "id": 537576663,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1756950288
    },
    {
        "content": "<p>I see now that perhaps the original question may be better phrased as \"what is not yet in Lean?\", rather than mathlib specifically. For example the 1000+ theorems list is not specific to mathlib, but rather to Lean, indeed some entries have links which point to external repos, and it probably won't be the case that <em>all</em> 1000+ theorems will eventually make it to mathlib. The massive advantage that Lean offers is that one can feel free to use anything from anywhere, regardless of whether it is in mathlib or not, without having to believe in anything more than the Lean kernel. If something in Lean has sufficiently many people wanting to use it sufficiently often, then that should be enough to justify its inclusion in mathlib. But first, we need to make a way for the \"sufficiently many people who want to use these things\" (i.e. mathematicians) to figure out the status of all these things that they want and which are not already in mathlib. Hence the motivation for my original post!</p>",
        "id": 537582893,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1756955852
    },
    {
        "content": "<p>I have a question: does anyone know how up-to-date the <a href=\"https://1000-plus.github.io/all\">1000+ list</a> is regarding the tags telling if a given theorem was formalized in Lean? I and collaborators were thinking that this list could be a good guide for selecting theorems to a new benchmark for AI evals, and this is why I wanted to make sure about it.</p>",
        "id": 554749788,
        "sender_full_name": "Bartosz Piotrowski",
        "timestamp": 1762793954
    },
    {
        "content": "<p>Probably it's incomplete</p>",
        "id": 554750442,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1762794109
    },
    {
        "content": "<p>Note that there is also <a href=\"https://leanprover-community.github.io/1000.html\">https://leanprover-community.github.io/1000.html</a>, which lists all theorems formalised in Lean/mathlib (as opposed to the big project page, which is for any proof assistant - with the tagging for most other proof assistants being really incomplete or not merged yet). The list at <a href=\"https://leanprover-community.github.io/1000.html\">https://leanprover-community.github.io/1000.html</a> is updated much more often (the other webpage update happens every once in a while, when I decide that a fair number of results have been added so an update could be nice).</p>",
        "id": 554792174,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762809031
    },
    {
        "content": "<p>The last update was merged today, so right now the pages should coincide (but they will draft apart again).</p>",
        "id": 554792235,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762809060
    },
    {
        "content": "<p>Regarding the tagging in mathlib: I made a reasonable effort to tag proven theorems, but I'm not an expert on all areas --- I'm sure some results are in mathlib, but missing from that list. Pull requests adding them are very welcome!</p>",
        "id": 554792390,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762809113
    },
    {
        "content": "<p>(Also, let me reiterate that the 1000+ list is not representative of interesting research mathematics --- so might not be a good benchmark in the first place.)</p>",
        "id": 554792603,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762809200
    },
    {
        "content": "<p>Thank you for useful explanations! Yes, I'm aware that 1000+ list may not be representative of research math. Still, I feel that there is a gap between benchmarks like miniF2F, PutnamBench (Olympiad-style math), ProofNet (undergraduate math), and advanced stuff like <a href=\"https://github.com/google-deepmind/formal-conjectures\">formal-conjectures</a> project provides. And I think that the 1000+ list contains many theorems that are established mathematical results, and going beyond undergrad material. Is it correct? And are you perhaps aware of some areas of mathematics that may be underrepresented on this list?</p>",
        "id": 554795856,
        "sender_full_name": "Bartosz Piotrowski",
        "timestamp": 1762810511
    },
    {
        "content": "<p>First off, note that wikipedia is inconsistent: the list does not include every named theorem (about 900 entries are missing; fixing that and getting the list on the 1000+ webpage updated would be useful).</p>",
        "id": 554797094,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762811012
    },
    {
        "content": "<p>Indeed, 1000+ goes beyond undergraduate material... but not systematically so. I would say it's systematically behind current research: cutting-edge results usually don't have a fancy name. Fundamental theorems in any one area might (but don't always do). And of course, named results includes lots of mathematics that was cutting edge at some point in the past, but is a mere lemma nowadays (such as, Liouville's theorem in complex analysis).</p>",
        "id": 554797280,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762811110
    },
    {
        "content": "<p>I haven't looked if particular areas are underrepresented. I can imagine e.g. elementary geometry or number theory being <em>over</em>represented.</p>",
        "id": 554797352,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762811141
    },
    {
        "content": "<p>The Wikipedia list does have entries pointing to parts of pages rather than to a named theorem with its own page. For example, an entry for \"<a href=\"https://en.wikipedia.org/wiki/Sphere_packing#Hypersphere_packing\">Sphere packing theorems in dimensions 8 and 24</a>\" (which is one of those that postdates the last update of 1000+ from Wikipedia, and is of course really two theorems not one). If a cutting-edge result is significant enough in its field to be worth discussing in a section of a broader article, but doesn't have its own \"X's theorem\" page, that's one approach for getting it on the list (with a suitable descriptive phrase in place of a name). (Since the pages that would be linked to don't generally appear in a theorem category at all, unlike those for many named theorems with their own pages, it's hard to find such missing theorems in any automated way, however.)</p>",
        "id": 554806255,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1762815166
    },
    {
        "content": "<p>To fill out such material in the list more systematically, maybe you'd need to find sources reviewing significant developments in mathematics as a whole, or in particular areas of mathematics, over the past few decades.</p>",
        "id": 554806527,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1762815354
    },
    {
        "content": "<p>It feels like that would put a lot of pressure on the \"+\" part of \"1000+\"</p>",
        "id": 554807521,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1762815941
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"257492\">Bartosz Piotrowski</span> <a href=\"#narrow/channel/287929-mathlib4/topic/What.20is.20not.20yet.20in.20mathlib.3F/near/554795856\">said</a>:</p>\n<blockquote>\n<p>Thank you for useful explanations! Yes, I'm aware that 1000+ list may not be representative of research math. Still, I feel that there is a gap between benchmarks like miniF2F, PutnamBench (Olympiad-style math), ProofNet (undergraduate math), and advanced stuff like <a href=\"https://github.com/google-deepmind/formal-conjectures\">formal-conjectures</a> project provides. And I think that the 1000+ list contains many theorems that are established mathematical results, and going beyond undergrad material. Is it correct? And are you perhaps aware of some areas of mathematics that may be underrepresented on this list?</p>\n</blockquote>\n<p>For part of the algebra section (abstract algebra &amp; commutative algebra), I guess <a href=\"#narrow/channel/113488-general/topic/Discussion.3A.20FATE/with/536167280\">#general &gt; Discussion: FATE</a> might help in this direction?</p>",
        "id": 554826942,
        "sender_full_name": "Wang Jingting",
        "timestamp": 1762829966
    }
]