[
    {
        "content": "<p>I was thinking it might be nice for many purposes to have a widget that allows one to visualize a graph of the instances within a file in a way that can be expanded by clicking on nodes. Does such a thing exist anywhere?</p>",
        "id": 488136636,
        "sender_full_name": "Jon Bannon",
        "timestamp": 1733933999
    },
    {
        "content": "<p>Can you give an example of an instance and what you'd want to visualize about it?</p>",
        "id": 488161362,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1733941901
    },
    {
        "content": "<p>I'm asking mostly because I've wanted some way to quickly visualize typeclasses in introductory talks, but recently found myself looking to reduce an overly strong typeclass inference in a file, and so unpacked this instance into its constituent parts and started sorting the various results I was proving according to the minimal assumptions necessary. </p>\n<p>For a primitive example, we might have <code>OrderedSemiring α</code> that extends <code>Semiring α</code> and  <code>OrderedAddCommMonoid α</code>. If we only take the <code>extends</code> keyword to indicate adjacency, we would get a pretty simple directed graph. One could then click on the individual notes to extend them further. This is probably too primitive, though. It may be a good idea to include more than just the <code>extends</code> keyword...maybe one would want to link to all instances that appear in the declaration of <code>[OrderedSemiring α]</code>...I am not sure what I am saying here is clear, though, sorry.</p>\n<p>I was kind of wondering if there was a well-known tool that allowed one to look at the interdependencies of instances to aid in \"pruning\" and reorganizing assumptions. If this was doable, I figured something was bound to exist.</p>",
        "id": 488169886,
        "sender_full_name": "Jon Bannon",
        "timestamp": 1733944880
    },
    {
        "content": "<p>I just found this old post: <a href=\"https://leanprover-community.github.io/archive/stream/270676-lean4/topic/Visualization.20of.20typeclass.20inference.html\">https://leanprover-community.github.io/archive/stream/270676-lean4/topic/Visualization.20of.20typeclass.20inference.html</a></p>",
        "id": 488537647,
        "sender_full_name": "Jon Bannon",
        "timestamp": 1733969408
    },
    {
        "content": "<p>I <em>thought</em> I had seen something like this before. There is an example of the kind of thing I'm looking for in this paper : <a href=\"https://arxiv.org/pdf/2001.04301\">https://arxiv.org/pdf/2001.04301</a></p>",
        "id": 488537712,
        "sender_full_name": "Jon Bannon",
        "timestamp": 1733969490
    }
]