[
    {
        "content": "<p>I wrote some code on a mathlib branch and after I pushed I got many linter errors of this type:<br>\n<code>Error: Mathlib/Probability/Independence/Conditional.lean#L184: ERR_DOT: Line is an isolated focusing dot or uses . instead of ·</code><br>\nThe dots are not isolated, so the error is the type of dot used. Before that, I never even saw that the dots at the beginning of tactic blocs were not the standard one. That raised several questions:</p>\n<ul>\n<li>how do I type the strange middle dot? It's not \\cdot . The linter message could include that information.</li>\n<li>that's not an error in local, when typing <code>#lint</code>. Perhaps it could be? (or not, because it's perhaps a mathlib thing and we don't want to impose it to other projects?)</li>\n<li>and the obvious question: why don't we want to use the usual dot?  It looks like TPIL uses the normal dot, for example.</li>\n</ul>\n<p>I am not at all against using a middle dot for that purpose. It's just that I never realized that we were using a special character and I am curious about why that character was chosen.</p>",
        "id": 373483651,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1688822442
    },
    {
        "content": "<p>I guess I never realized the difference because it was not a linter error until <a href=\"https://github.com/leanprover-community/mathlib4/pull/5708\">#5708</a>, which was merged two days ago</p>",
        "id": 373485248,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1688822851
    },
    {
        "content": "<p>On my keyboard, the \"middle dot\" is <code>AltGr + .</code> where the <code>.</code> is the regular dot.</p>",
        "id": 373485726,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1688822972
    },
    {
        "content": "<p>It should be <code>\\.</code></p>",
        "id": 373485994,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1688823035
    },
    {
        "content": "<p>Thanks! In the meantime, I opened a file in VSCode and hovered above a dot: it tells me it's <code>\\.</code></p>",
        "id": 373486008,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1688823038
    },
    {
        "content": "<blockquote>\n<p>I am curious about why that character was chosen</p>\n</blockquote>\n<p>Because it looked nice, as a sort of bullet point list (which existed before in Coq, just with ASCII). This was introduced after the implicit lambdas already making use of \\.</p>",
        "id": 373487390,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1688823405
    },
    {
        "content": "<p>The style linters can also be run locally, but they are separate to the <code>#lint</code> framework, mostly just because they are normally simpler and written in python (so more of a lightweight check that runs even on code that doesn't actually build). There should be scripts to run these linters in the scripts folder and you could even set up your editor or git to run them at appropriate times for you as they should be very fast</p>",
        "id": 373784446,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1688939138
    }
]