[
    {
        "content": "<p>I was about to whinge that <code>xor</code> should be the <code>Bool</code> function and not the <code>Prop</code> version (in my version of mathlib4 <code>xor</code> was a Proppy <code>xor</code>), but when I was composing the whinge I created a link to github and discovered that as of 19 hours ago it has been changed to <code>Xor'</code>. What's the point of the <code>'</code> <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> ? I'm going to add <code>xor</code> on Bools in the WIP branch <code>kbuzzard-data-bool-basic</code>.</p>",
        "id": 305910892,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1666644256
    },
    {
        "content": "<p>The <code>'</code>, as ever, is a disambiguation marker: <code>Xor</code> refers to the notation typeclass from core which supplies the notation <code>^^^</code> for \"bitwise XOR\". I'm thinking of PR'ing to change that to <code>XorOp</code> instead (to make it consistent with <code>AndOp</code> and <code>OrOp</code> which have similar conflicts to deal with)</p>",
        "id": 305915572,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1666646387
    },
    {
        "content": "<p>Out of curiosity, what's going on with <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Xor%27#doc\">docs#Xor'</a> ? Is it something one should be using? If so, how come I barely ever see it? Why don't we have notation for it? And, why not just write <code>p ≠ q</code>?</p>",
        "id": 505994506,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1742157706
    },
    {
        "content": "<p>One reason for not using <code>Ne</code> is that you may want to avoid unnecessary uses of <code>propext</code></p>",
        "id": 506155212,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1742218943
    },
    {
        "content": "<p>(which is an axiom)</p>",
        "id": 506155275,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1742218961
    },
    {
        "content": "<p>Most of Mathlib uses classical reasoning, so this is not a valid point in terms of Mathlib coding style discussion.</p>",
        "id": 506159465,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1742219874
    },
    {
        "content": "<p>mathlib coding style does not tell you how to decide between formulations which are equivalent up to axioms, so your point about my point being invalid is invalid. (in particular, it doesn't say to use the formulation which <em>uses</em> and/or <em>forces the use of</em> the most of mathlibs acceptable axioms)</p>",
        "id": 506161462,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1742220263
    },
    {
        "content": "<p>anywho, the reason why you don't come across it might be that <code>p ↔ ¬q</code> is a more common spelling</p>",
        "id": 506162049,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1742220387
    },
    {
        "content": "<p>E.g., we actively remove <code>[Decidable _]</code> assumptions from theorems that don't need them for the statement (and don't live in a namespace like <code>Decidable</code> or <code>Encodable</code>).</p>",
        "id": 506164644,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1742220928
    },
    {
        "content": "<p>indeed, but that's not applicable here</p>",
        "id": 506165328,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1742221069
    },
    {
        "content": "<p>the coding style doesn't tell you to write <code>∀ x, f x = g x</code> or <code>f = g</code>.</p>",
        "id": 506165567,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1742221115
    },
    {
        "content": "<p>in particular, the <a href=\"https://leanprover-community.github.io/contribute/style.html#normal-forms\">style guide</a> basically says \"there should be a consistent choice made\", but <em>doesn't say how to decide which one is right</em></p>",
        "id": 506167034,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1742221425
    },
    {
        "content": "<p>When Yury says \"coding style\" he's not referring to <a href=\"https://leanprover-community.github.io/contribute/style.html\">#style</a>. Perhaps a more precise phrase would have been \"Mathlib coding <em>practice</em>\". His point is that in Mathlib, there is absolutely no reason to avoid uses of <code>propext</code>.</p>",
        "id": 506171814,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1742222406
    },
    {
        "content": "<p>other than code golf</p>",
        "id": 506176460,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1742223380
    },
    {
        "content": "<p>It's nice to be able to avoid writing <code>propext</code> literally in a golfed proof where its noise, but I don't think there is any interest in \"golfing\" it away from the list of axioms</p>",
        "id": 506176973,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1742223496
    },
    {
        "content": "<p>indeed, but my point still stands: \"if it helps write a shorter proof, avoid <code>propext</code>\" definitely seems to be among code practice to me?</p>",
        "id": 506177281,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1742223570
    },
    {
        "content": "<p>That aside, saying that \"X reason is invalid\" simply because 'code practice' doesn't motivate X seems very narrow-minded to me; contributors can have many reasons for design decisions other than those which follow from 'code practice', and saying it's \"invalid\" completely dismisses the opinion as not worth considering</p>",
        "id": 506178433,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1742223775
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"684366\">Edward van de Meent</span> <a href=\"#narrow/channel/287929-mathlib4/topic/xor/near/506177281\">said</a>:</p>\n<blockquote>\n<p>indeed, but my point still stands: \"if it helps write a shorter proof, avoid <code>propext</code>\" definitely seems to be among code practice to me?</p>\n</blockquote>\n<p>Not really, you could stop at \"if it helps write a shorter proof, do it\". The interesting case of axiom elimination is when it requires writing longer proofs, and in this case there is no evidence of mathlib practice supporting doing a longer proof in order to save on axioms</p>",
        "id": 506180465,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1742224219
    },
    {
        "content": "<p>I personally think that small increases in proof length in exchange for axiom reduction is acceptable but by no means required or on any review checklist</p>",
        "id": 506181166,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1742224353
    },
    {
        "content": "<p>Personally I think we should use <code>propext</code> as much as possible, to make it clear we are not interested in axiom reduction in Mathlib. :-)</p>\n<p>But seriously, let's not waste oxygen on <code>propext</code> of all things.</p>",
        "id": 506282671,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1742253815
    },
    {
        "content": "<blockquote>\n<p>Personally I think we should use <code>propext</code> as much as possible, to make it clear we are not interested in axiom reduction in Mathlib. :-)</p>\n</blockquote>\n<p>I know you say this as a joke, but I really don't want people doing this even as a joke. Ambivalence I can take, but active action against people who actually look at what <code>#print axioms</code> prints and do some basic cause/effect analysis just to... stick it to the man or something... is not nice.</p>",
        "id": 506296855,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1742260291
    },
    {
        "content": "<p>believe it or not, there are reasons to avoid <code>propext</code>. It breaks canonicity (all <code>axiom</code>s do)</p>",
        "id": 506297102,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1742260404
    },
    {
        "content": "<p>I generally tell people that lean doesn't have canonicity, but this is technically only true for lean-with-axioms. For Lean-without-axioms it's an open question but could well be true. (I don't usually spend much effort looking at lean-without-axioms because it's not very interesting to the community, but it is a lot closer to a type theory that a type theorist can get behind, so I should probably figure it out at some point. In particular I'd love to know if it's equiconsistent with Lean-with-axioms - my gut feeling is yes, most of the axiomatically strong things in lean already happen in lean-without-axioms, like big inductive types like <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=PSet#doc\">docs#PSet</a> and impredicative <code>Prop</code>.)</p>",
        "id": 506297364,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1742260535
    },
    {
        "content": "<p>Agreed, it was a joke, and I wouldn't want to people to do that either as a joke or otherwise.</p>\n<p>But I do want to make sure that no one in reviews, or golf suggestions, etc, brings up the topic of reducing axioms <em>unless</em> the original author has expressly indicated they are interested in this. Doing so would be just be unnecessary noise.</p>",
        "id": 506305043,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1742263959
    }
]