[
    {
        "content": "<p>Heya,</p>\n<p>I wanted to see if I can use Aristotle to solve some of PNT, at least some open already defined equations.</p>\n<p>At the moment, I focused on Consequences.lean, but I find it quite an ugly solve, requiring many exact? tactics and the like (simpa's which are not needed, etc etc). I've tried for some time to manually find better representations for many parts, but to be honest, with being new to lean and my mediocre mathematics compared to many here, I am struggling.</p>\n<p>Additionally, Aristotle requires an environment of 4.24, so porting and backporting some theorems from 4.26 was quite a challenge. I finally have both environments setup, (not how well as I'd want to, but oh well)</p>\n<p>My question:</p>\n<ol>\n<li>I have mu_pnt and mu_pnt_alt  now fully defined, without errors compiling in lean 4.24; Can I port this over with relative ease to lean 4.26? Additionally, would the backbone lemmas for the port also require blueprints?</li>\n<li>The current solves are done with quite a few exact? tactics, and two of the lemmas also required an additional maxHeartbeats to compile without errors. Would this be an issue when creating a PR?</li>\n<li>Is this even useful, or is this project solely based on fully human derived .lean code? I'd understand if what I'm writing is complete slop that just compiles, that that is not what is desired.</li>\n</ol>\n<p>Hope I'm not intruding too much...</p>",
        "id": 566269275,
        "sender_full_name": "(Tom de Groot) Tomodovodoo",
        "timestamp": 1767582685
    },
    {
        "content": "<p>At least any <code>exact?</code> calls need to be replaced by their output</p>",
        "id": 566285095,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767596327
    },
    {
        "content": "<p>As for going back and forth between 4.24 and 4.26, I forsee no fundamental issues, but perhaps some tedious adjustments. You can check my bump pull requests to see what kinds of changes are needed</p>",
        "id": 566285328,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767596436
    },
    {
        "content": "<p>Update, worked through the refine' and exact? tactics so they're worked out at least; just 2 of them now depend on the (in the .lean file defined) GeneralizeProofs (Harmonic.GeneralizeProofs). Is it a requirement or good practise to refine the proofs to not rely on this?</p>",
        "id": 566285598,
        "sender_full_name": "(Tom de Groot) Tomodovodoo",
        "timestamp": 1767596663
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/channel/423402-PrimeNumberTheorem.2B/topic/Aristotle.20as.20solver.20for.20mu_pnt.20and.20mu_pnt_alt/near/566285095\">said</a>:</p>\n<blockquote>\n<p>At least any <code>exact?</code> calls need to be replaced by their output</p>\n</blockquote>\n<p>yeah, got so far luckily :P</p>",
        "id": 566285610,
        "sender_full_name": "(Tom de Groot) Tomodovodoo",
        "timestamp": 1767596677
    },
    {
        "content": "<p>Is that something else than the <code>generalize_proofs</code> tactic from mathlib?</p>",
        "id": 566286294,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767597067
    },
    {
        "content": "<p>I believe Aristotle uses a slightly modified version of generalize_proofs from mathlib, and to ensure correct compilation, they include it in the output .lean file when needed. Additionally, they're still on 4.24 so I've just been busy with fixing mismatches between them</p>",
        "id": 566293355,
        "sender_full_name": "(Tom de Groot) Tomodovodoo",
        "timestamp": 1767600276
    },
    {
        "content": "<p>For example I have to rewire some stuff since in mathlib the ArithmaticFuntion library changed quite a bit, and that's the current struggle</p>",
        "id": 566294601,
        "sender_full_name": "(Tom de Groot) Tomodovodoo",
        "timestamp": 1767600755
    },
    {
        "content": "<p>Got at least the 4.24 version fully running without any warnings; Port to 4.26 is more than tedious, I got it compiled but a PR will take some time...</p>",
        "id": 566316716,
        "sender_full_name": "(Tom de Groot) Tomodovodoo",
        "timestamp": 1767607976
    },
    {
        "content": "<p>is a higher set maxHeartbeats allowed for PNTA? Currently, I have two lemmas which rely on a simp which doesn't resolve in the base amount of 200000. (set to 800000 for now)</p>",
        "id": 566340974,
        "sender_full_name": "(Tom de Groot) Tomodovodoo",
        "timestamp": 1767615760
    },
    {
        "content": "<p>added PR here for review; unsure about the feedback on this one, so please give as much as possible :P.</p>\n<p><a href=\"https://github.com/AlexKontorovich/PrimeNumberTheoremAnd/pull/456\">https://github.com/AlexKontorovich/PrimeNumberTheoremAnd/pull/456</a></p>",
        "id": 566344617,
        "sender_full_name": "(Tom de Groot) Tomodovodoo",
        "timestamp": 1767617016
    },
    {
        "content": "<p>Refactored as best to my ability to cut down on unallowed tactics for PNTA like exact? and refine', couldn't improve on the max heartbeats myself, but im sure this is suboptimal and can be (heavily) improved</p>",
        "id": 566345085,
        "sender_full_name": "(Tom de Groot) Tomodovodoo",
        "timestamp": 1767617177
    },
    {
        "content": "<p>There's already a few files that are very painfully slow, I wouldn't look forward to having more of them. But it's not my call to make</p>",
        "id": 566364134,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767622980
    },
    {
        "content": "<p>I'm expecting the formalization of the explicit prime number theorem estimates to be heavily AI assisted and likely full of slow, heartbeat-intensive proofs.  But this doesn't mean that we should abandon any effort at possible efficiency improvements.  One possible compromise is to accept these proofs for now but add a task later to \"golf\" the proof to make it faster.  (One could imagine that this latter golfing is also something that AI tools might be good at...)</p>",
        "id": 566406496,
        "sender_full_name": "Terence Tao",
        "timestamp": 1767634414
    },
    {
        "content": "<p>Its not my call but personally I wouldn't be in favour of adding so much untidy AI generated code to the repo.  If we were going to do that then we could have just taken the existing AI proof of strong PNT.  The issue with these AI proofs is that they often seem to miss existing Mathlib API and reprove things from first principals.  I only looked at the start of the PR but it feels like many of the manipulations of sums of arithmetic functions could be done much more cleanly.</p>\n<p>At a minimum I think we should require all the warnings from the linters to be fixed before this is merged.</p>",
        "id": 566413836,
        "sender_full_name": "Alastair Irving",
        "timestamp": 1767637012
    },
    {
        "content": "<p>Even in the non-formal regime, \"golfing\" (golfing little lemmas, that is; it's pointless to ask AI to do much more at this stage) is something at which AI is worse than a competent human mathematician, but the two working together can do a faster and arguably better job than the mathematician working alone.</p>",
        "id": 566420799,
        "sender_full_name": "Harald Helfgott",
        "timestamp": 1767639779
    },
    {
        "content": "<p>Ah sorry, it seems during the build compared to my simple <code>lake env lean</code> command there are additional linter warnings that locally did not show up for me, I'll do my best to fix those of course. I only had the linter warning for \"warning: unused variable <code>x</code>\" remaining, but the build revealed much more.</p>\n<p>Of course, I'll fix all the additional linter warnings, also I have one question;</p>\n<p>For the function mu_pnt_alt, currently it is defined as follows:<br>\ntheorem mu_pnt_alt : (fun x : ℝ ↦ ∑ n ∈ range ⌊x⌋₊, (μ n : ℝ) / n) =o[atTop] fun x ↦ (1 : ℝ) := by<br>\nhowever, the linter also recognizes that x is unused here; .\\PrimeNumberTheoremAnd\\Consequences.lean:2503:81: warning: unused variable <code>x</code><br>\nI kept the definition like this for now since i figured it wouldn't do any harm, does anyone have some better insights as to keep or remove the variable?</p>\n<p>Additionally, unlike many of the great mathematicians here, I am not properly proficient in lean yet (or as in-depth in the mathematics as you are).  I'll try to reduce the amount of unnecessary code as much as I'm able, since it seems the current PR is not up to standard yet.</p>",
        "id": 566449011,
        "sender_full_name": "(Tom de Groot) Tomodovodoo",
        "timestamp": 1767652420
    },
    {
        "content": "<p>You can write <code>fun _</code> instead</p>",
        "id": 566450422,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767653164
    },
    {
        "content": "<p>Yeah I know, just didn't want to mess with the definition, if it aint broken dont fix it was my idea</p>",
        "id": 566452970,
        "sender_full_name": "(Tom de Groot) Tomodovodoo",
        "timestamp": 1767654347
    }
]