[
    {
        "content": "<p>Perhaps it was a matter of finding the (excellent) textbook we needed, written at the right label of detail -</p>\n<p>Aristotle is able to formalize passages of Wheeden-Zygmund (well, two passages, so far) essentially verbatim. I've only used ChatGPT to translate well-chosen sequences of screenshots into LaTeX, which I then proofread before giving to Aristotle. What is more, Aristotle found and corrected an actual (and harmless) typo in Wheeden-Zygmund. (That is not the most surprising part, but I am still impressed.) S<br>\n<a href=\"/user_uploads/3121/KiZYcmnSIrUC8tgCt4N8vTz1/Hardy-Tauberian-theorem.lean\">Hardy Tauberian theorem.lean</a><br>\n<a href=\"/user_uploads/3121/_78zVcDDuuR02zGhOOqoYn6E/Hardys-Tauberian-theorem.md\">Hardy's Tauberian theorem.md</a><br>\nSee attached.</p>",
        "id": 569143166,
        "sender_full_name": "Harald Helfgott",
        "timestamp": 1768950325
    },
    {
        "content": "<p>In general, Wheedon-Zygmund loks like something that Aristotle (or other AIs) could formalize with great profit to the community - and possibly only relatively minor human intervention. I'm about to ask Aristotle to formalize Thm. 12.50 (Dirichlet-Jordan) in W-Z - we need that to prove a more general version of Poisson summation than the one in Mathlib.</p>",
        "id": 569145866,
        "sender_full_name": "Harald Helfgott",
        "timestamp": 1768952142
    },
    {
        "content": "<p>I guess one could plan to upstream these results directly to Mathlib, rather than funnel them through PNT+, and then use these results once upstreamed (and Mathlib is bumped) to fill in the relevant sorries at PNT+?  We could have them live temporarily at PNT+ just to have the sorries filled in faster, but I'm not sure this actually saves much time in the long run.</p>",
        "id": 569148461,
        "sender_full_name": "Terence Tao",
        "timestamp": 1768953927
    },
    {
        "content": "<p>Is Aristotle writing mathlib-ready code though? Mathlib has infamously high standards for code quality.</p>",
        "id": 569193096,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1768983644
    },
    {
        "content": "<p>Fair enough.  In which case it makes sense to formalize these results within PNT+, perhaps starting directly in the Mathlib folder to emphasize the intent to upstream the results once they reach a suitable quality standard of writing.</p>",
        "id": 569294472,
        "sender_full_name": "Terence Tao",
        "timestamp": 1769011720
    },
    {
        "content": "<p>I'm still trying to coax Aristotle into formalizing the proof of Dirichlet-Jordan in W-Z. So far, it has formalized the proof of Fejer's theorem for continuous f, but, for whatever reason, it has not yet proved it for f continuous in an interval, or for f having a jump discontinuity. Let us see.</p>",
        "id": 569326557,
        "sender_full_name": "Harald Helfgott",
        "timestamp": 1769020136
    }
]