[
    {
        "content": "<p>I haven't followed the details of the project, but I have seen that you have some Fourier theory somewhere. I don't know if you will need it, but I have just PRed the Fourier inversion formula to mathlib (in inner product spaces, which includes the particular case of the line), in <a href=\"https://github.com/leanprover-community/mathlib4/pull/10810\">#10810</a>. Don't hold your breath, though, because it will take some time before it gets in (I will need to cut it into smaller PRs for easier reviews).</p>",
        "id": 422640946,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1708528774
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110050\">@Sébastien Gouëzel</span> please don’t forget to edit the overview and undergrad yaml files in this PR.</p>",
        "id": 422659501,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1708533295
    },
    {
        "content": "<p>Hi Sebastian, this is splendid! if there is anything I can do to help in the reviewing process please ping me. Can Mathlib's results on Fourier <em>series</em> also be sharpened this way (i.e. getting pointwise convergence at continuity points without assuming global continuity of the function as we presently do)?</p>",
        "id": 422958131,
        "sender_full_name": "David Loeffler",
        "timestamp": 1708670477
    },
    {
        "content": "<p>If you want to help with the review, you can definitely review the PRs yourself: anyone can review PRs, not only the official maintainers, and this is very much appreciated! In fact, you would probably be the ideal reviewer for <a href=\"https://github.com/leanprover-community/mathlib4/pull/10833\">#10833</a>, since it's based on a file you have authored.</p>",
        "id": 422960943,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1708672354
    },
    {
        "content": "<p>Sure, I'll take a look at it!</p>",
        "id": 422964482,
        "sender_full_name": "David Loeffler",
        "timestamp": 1708674226
    }
]