[
    {
        "content": "<p>As anticipated <a href=\"#narrow/channel/116395-maths/topic/Repository.20for.20formalizations.20related.20.20to.20RH.2Fzeta/near/567473278\">here</a> we have completed a formalization of the Hadamard factorization theorem (<a href=\"https://github.com/jonwashburn/riemann/blob/main/Riemann/academic_framework/HadamardFactorization/Main.lean\">here</a>) and of its application to the riemannZeta (<a href=\"https://github.com/jonwashburn/riemann/blob/main/Riemann/academic_framework/ZetaFiniteOrder.lean\">here</a>). Since the Hadamard factorization is supposed to play a key role in the formalization of the third path to PNT in PNT+ we thought it may be of interest  that we have now refactored it to be more Mathlib/PNT+ idiomatic and self-contained, and we would be glad to  PR it to PNT+.<br>\nWe have tried to follow closely the main proof step and statement given by Terence Tao <a href=\"https://terrytao.wordpress.com/tag/hadamard-factorisation-theorem/\">here</a> (and we hav tried to leverage PNT+ and StrongPNT API as much as we could, though certainly a deeper integration could be achieved) to ensure the API could match the expectations in PNT+.<br>\nWe haven’t directly PR’d the code to the main repository yet, since the very recent official contribution guidelines formally require contribution on open issues or tasks, but we are happy to proceed as you deem it fit, including connecting the code to the blueprint and doing additional refactor or golfing of the lengthier proofs, as well as helping porting idiomatically the parts of StrongPNT used.<br>\nHowever we have PR’d it to <a href=\"https://github.com/leibniz-rs/PrimeNumberTheoremAnd/tree/leibniz-rs-patch-1/PrimeNumberTheoremAnd\">this</a> fork of PNT+, ready to be upstreamed to main if, as and when deemed appropriate by <span class=\"user-mention\" data-user-id=\"252920\">@Alex Kontorovich</span>  and <span class=\"user-mention\" data-user-id=\"657719\">@Terence Tao</span> .<br>\nIn this refactor we have removed the ZeroData structure (useful but not mathlib idiomatic) so that the final theorem takes intrinsic hypotheses on an entire function <code>f</code>, e.g. <code>EntireOfFiniteOrder ρ f</code>, and do not require a user-supplied <code>ZeroData</code>. The proof now internally obtains an enumeration of zeros (or an appropriate divisor) and then applies canonical product API developed in the <a href=\"https://github.com/leibniz-rs/PrimeNumberTheoremAnd/blob/leibniz-rs-patch-1/PrimeNumberTheoremAnd/Mathlib/Analysis/Complex/WeierstrassFactor.lean\">WeierstarssFactor</a>, <a href=\"https://github.com/leibniz-rs/PrimeNumberTheoremAnd/blob/leibniz-rs-patch-1/PrimeNumberTheoremAnd/Mathlib/Analysis/Complex/CanonicalProduct.lean\">CanonicalProduct</a>, <a href=\"https://github.com/leibniz-rs/PrimeNumberTheoremAnd/blob/leibniz-rs-patch-1/PrimeNumberTheoremAnd/Mathlib/Analysis/Complex/Divisor.lean\">Divisor</a>, <a href=\"https://github.com/leibniz-rs/PrimeNumberTheoremAnd/blob/leibniz-rs-patch-1/PrimeNumberTheoremAnd/Mathlib/Analysis/Complex/LogSingularity.lean\">LogSingularity</a>, <a href=\"https://github.com/leibniz-rs/PrimeNumberTheoremAnd/blob/leibniz-rs-patch-1/PrimeNumberTheoremAnd/Mathlib/Analysis/Complex/CartanBound.lean\">CartanBound</a>, <a href=\"https://github.com/leibniz-rs/PrimeNumberTheoremAnd/blob/leibniz-rs-patch-1/PrimeNumberTheoremAnd/Mathlib/Analysis/Complex/ExpPoly.lean\">ExpPoly</a> and the <a href=\"https://github.com/leibniz-rs/PrimeNumberTheoremAnd/blob/leibniz-rs-patch-1/PrimeNumberTheoremAnd/Mathlib/Analysis/Complex/Hadamard.lean\">main</a> files.</p>\n<p>There are prerequisites that we aim to submit to Mathlib soon and that we have temporarily added them to the Mathlib folder. They also include 2 files from Carleson that we have used to avoid reduplicating API for Annuli and which seem to be meant to be upstreamed to Mathlib at some point.<br>\nUpstreaming the application of this refactored version of Hadamard factorization to the zeta function would require an additional <a href=\"https://github.com/leibniz-rs/PrimeNumberTheoremAnd/tree/leibniz-rs-patch-1/PrimeNumberTheoremAnd/Mathlib/Analysis/SpecialFunctions\">set</a> of prerequisites involving the Gamma function and Stirling bounds that we have also added in the Mathlib folder, to which we would need to add some extracts from StrongPNT.Complex; as they would be too much to swallow in one cycle the zeta corollaries are probably better suited for a subsequent cycle of PRs.</p>",
        "id": 568504263,
        "sender_full_name": "Matteo Cipollina",
        "timestamp": 1768590206
    },
    {
        "content": "<p>This looks great!  Definitely this factorization will be useful later in the explicit PNT project.  I haven't been as involved with StrongPNT, so I'll let Alex speak to how it would fit in there, but assuming it is compatible, I for one would be happy to have it PR'ed.</p>",
        "id": 568515615,
        "sender_full_name": "Terence Tao",
        "timestamp": 1768594349
    },
    {
        "content": "<p>Indeed this is great! Since we already have Borel-Caratheodory, we no longer \"need\" Hadamard, but of course it would be good to have in general, and I'd be very happy if you decided to upstream it to PNT+. (I suppose even better, as long as you're upstreaming, would be to upstream to Mathlib, so that PNT+ gets it automatically at the next bump. But maybe it's a big file and not Mathlib-ready, in which case, we'd be happy to help host it!)</p>",
        "id": 568516429,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1768594647
    }
]