[
    {
        "content": "<p>I'd like to suggest contributors consider PRing to Mathlib as much as possible. It's a lot more work but work that lands in Mathlib is a huge benefit to everyone.</p>",
        "id": 418872098,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1706631028
    },
    {
        "content": "<p>I cannot agree more. We did this for flt-regular (at least until it was reasonable), and the benefits are much bigger than the drawbacks.</p>",
        "id": 418872438,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1706631129
    },
    {
        "content": "<p>That's the plan! We are working on a separate repo to host the blueprint, but everything will be PR'd to mathlib as it becomes ready</p>",
        "id": 418878103,
        "sender_full_name": "Ian Jauslin",
        "timestamp": 1706632697
    },
    {
        "content": "<p>I haven't paid proper attention to what has been upstreamed and what has not. Is there a rough estimate for the size of the upstreaming effort at the moment?</p>",
        "id": 432166632,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1712651550
    },
    {
        "content": "<p>I didn't really look at that - is the folder <code>Mathlib</code> in PNT+ intended as a staging area for PRs? (I used it to import contents from PRs to Mathlib that were not yet in because it felt most convenient, sorry if that was not the point.) If indeed it is a staging area then it is at least 3k lines of code ready for PR.</p>",
        "id": 432214012,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1712663330
    },
    {
        "content": "<p>It seems like the repo is nearly up to date with mathlib, so everything should be upstreamable</p>",
        "id": 432218946,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1712664469
    },
    {
        "content": "<p>Yes I last bumped Mathlib version on Sunday</p>",
        "id": 432219339,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1712664541
    }
]