[
    {
        "content": "<p>This thread is dedicated to sharing photos from the conference. A selection of images has already been published on the <a href=\"https://pitmonticone.github.io/ItaLean2025\">conference website</a>, and participants are warmly encouraged to contribute additional photos by posting them here.</p>",
        "id": 563718713,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1765755316
    },
    {
        "content": "<p>Here's a picture of one of my favorite slides from the conference. </p>\n<p><a href=\"/user_uploads/3121/bNK4mVphSbxhzWy7vaPJDY7g/IMG_3874.HEIC\">IMG_3874.HEIC</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/bNK4mVphSbxhzWy7vaPJDY7g/IMG_3874.HEIC\" title=\"IMG_3874.HEIC\"><img data-original-content-type=\"image/heic\" data-original-dimensions=\"3024x4032\" data-transcoded-image=\"3024x4032.webp\" src=\"/user_uploads/thumbnail/3121/bNK4mVphSbxhzWy7vaPJDY7g/IMG_3874.HEIC/840x560.webp\"></a></div><p>Edit: I worry I should've included the context. As a newcomer who wants to contribute to mathlib, I'm not sure which type I am yet but we were assured it was one of them, so I will be finding out <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span> .</p>",
        "id": 564089406,
        "sender_full_name": "Hang Lu Su",
        "timestamp": 1765903753
    },
    {
        "content": "<p>6 months later we had completed LTE and were featured in Nature :-) Johan Commelin and Adam Topaz took a big gamble, putting aside their original research for 6 months to hack on Scholze's challenge, not knowing whether the mathematical community would even recognise the work, but they believed in Leo's vision.</p>",
        "id": 564091892,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765904463
    },
    {
        "content": "<p>I think this was a turning point -- I don't think it was immediately clear to people in the CS community in early 2021 that the mathematicians using Lean were doing anything different to anything else happening in any other formal mathematics communities. But we were targetting mathematics which the math experts were currently thinking about and this turned out to make a big difference.</p>",
        "id": 564092918,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765904747
    }
]