[
    {
        "content": "<p>I've just received a message containing a slide template, and asking to \"deliver a copy of your PowerPoint presentation (saved on your USB pen drive) to our technician upon your arrival at the Conference venue\".<br>\nI guess we are all in the same boat wanting to connect our computer or at least having a computer with a working VS Code. Can the organizers check this?</p>",
        "id": 561665329,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1764771977
    },
    {
        "content": "<p>Done. You will be able to use your own laptop of course.</p>",
        "id": 561691242,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1764777371
    },
    {
        "content": "<p>I presume that using a .pdf file will also be fine?</p>",
        "id": 561732817,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1764788792
    },
    {
        "content": "<p>(I mostly use LateX with beamer, I may switch to typst at some point, but I don't anticipate switching to powerpoint.)</p>",
        "id": 561732902,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1764788824
    },
    {
        "content": "<p>Sure, there is no problem with everyone using their laptop with their preferred setup and format.</p>",
        "id": 561743791,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1764792712
    },
    {
        "content": "<p>All speakers will be asked to test their laptop before the start of their sessions to ensure that all presentations run smoothly.</p>",
        "id": 561843960,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1764844768
    },
    {
        "content": "<p>Just to be sure: the intended audience are Lean beginners, right? Like someone that played the NNG but not much than that?</p>",
        "id": 561869716,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1764852674
    },
    {
        "content": "<p>A good part of the audience will indeed be quite new to Lean.  <br>\nAt the same time, there will also be many advanced users.</p>\n<p>To keep things interesting for everyone, one suggestion for talks of the type “X in Mathlib” is to give a bit of context on how that part of Mathlib is structured, what is already in Mathlib, what isn’t yet and why, what the main design choices or quirks are (for instance the use of filters in analysis), and some guidance on how to work with it in practice.  <br>\nOf course, we want to leave speakers full freedom on how to frame their talk.</p>",
        "id": 561899872,
        "sender_full_name": "Lorenzo Luccioli",
        "timestamp": 1764860079
    },
    {
        "content": "<p>OK, thanks</p>",
        "id": 561900128,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1764860133
    }
]