[
    {
        "content": "<p>Hi everyone,</p>\n<p>A quick note about the social dinner on Wednesday evening.</p>\n<p>When you register on Tuesday morning, you will receive a short form to sign for the dinner. We kindly ask you to fill it in and return it to the reception as soon as possible so that we can confirm everything with the restaurant.</p>\n<p>If you have food related intolerances, allergies, or any dietary restrictions that may affect the dinner, you will be asked to complete an additional form.</p>\n<p>More details about the social dinner, including the menu and venue information, are available on the <a href=\"https://pitmonticone.github.io/ItaLean2025/\">website</a>.</p>\n<p>If you have any questions, feel free to reply here.</p>\n<p>Looking forward to seeing you all soon in Bologna.</p>",
        "id": 562258789,
        "sender_full_name": "Lorenzo Luccioli",
        "timestamp": 1765047159
    },
    {
        "content": "<p>Hi Lorenzo,<br>\nI won’t be there tomorrow, but I am interested in attending the conference dinner. Can I fill in the form on Wednesday morning? Or maybe remotely?</p>",
        "id": 562503989,
        "sender_full_name": "Fabrizio Barroero",
        "timestamp": 1765209463
    },
    {
        "content": "<p>Hi Fabrizio, no problem at all.  <br>\nYou can fill in the form directly when you arrive on Wednesday.</p>\n<p>In the meantime, if you have any allergies or food-related needs, just let me know so I can pass the information to the restaurant.</p>\n<p>This applies to everyone: if you will arrive after the Tuesday morning registration but would still like to join the social dinner, please send me a quick message by tomorrow morning, especially if you have any dietary requirements.</p>\n<p>Looking forward to seeing you in Bologna.</p>",
        "id": 562512331,
        "sender_full_name": "Lorenzo Luccioli",
        "timestamp": 1765211989
    },
    {
        "content": "<p>I'm in the same category, I'll arrive on Wednesday and would like to join the dinner! I eat everything except meat. Thanks!</p>",
        "id": 562516860,
        "sender_full_name": "Oliver Butterley",
        "timestamp": 1765213321
    },
    {
        "content": "<p>Got it.</p>",
        "id": 562520529,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1765214532
    }
]