[
    {
        "content": "<p>Hi everyone, just to clarify the logistics for all invited speakers:</p>\n<ul>\n<li><strong>Travel:</strong> each speaker is asked to book and cover their own travel arrangements. At the moment, we have limited funds available for travel reimbursements, so we cannot guarantee travel coverage for all speakers.  However, if you would like to request a reimbursement, you can write to <a href=\"mailto:italean2025@gmail.com\">italean2025@gmail.com</a> with your completed itinerary and receipts. Requests will be reviewed case by case depending on available funds.</li>\n<li><strong>Accommodation:</strong> the conference team will book and pay for your hotel stay in Bologna for the duration of your participation in the conference.</li>\n</ul>",
        "id": 554291471,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1762512498
    },
    {
        "content": "<p>Hi all, just a quick reminder for those whose accommodation is being arranged by us:</p>\n<ul>\n<li>You should have been contacted (by email or on Zulip) to confirm your arrival and departure dates. If you haven’t had the chance to reply yet, please do so as soon as possible.</li>\n<li>We’re now sharing the confirmed dates with our planning agency, which will get in touch in the next few days with your hotel details and any further information.</li>\n<li>For any questions or clarifications, feel free to write to <a href=\"mailto:italean2025@gmail.com\">italean2025@gmail.com</a> or ask here on Zulip.</li>\n</ul>",
        "id": 555141558,
        "sender_full_name": "Lorenzo Luccioli",
        "timestamp": 1762959539
    },
    {
        "content": "<p>Hi everyone, quick heads-up for those whose accommodation we’re arranging: the planning agency (with email <a href=\"mailto:events@mccstudio.org\">events@mccstudio.org</a>) will contact you within the next few days to confirm your hotel in Bologna. Please watch your inbox and reply to them directly if needed.</p>",
        "id": 558251787,
        "sender_full_name": "Eugenio Cainelli",
        "timestamp": 1763569951
    }
]