[
    {
        "content": "<p>The first idea that comes to mind is solving system of linear equations over field, ring, something else too, maybe.</p>\n<p>One provides coefficient matrix and vector of constant terms with in the structure with all necessary operations computable, then Lean provides the solution. Which should be the simplest case of SLE solving.</p>\n<p>Does this make any sense? <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 540126653,
        "sender_full_name": "Ilm훮rs C카rulis",
        "timestamp": 1758157704
    },
    {
        "content": "<p>It's this overwhelming silence from the 4th of February that motivated me to post here.</p>\n<p>And it could be interesting for me to implement something relatively easy.</p>",
        "id": 540127153,
        "sender_full_name": "Ilm훮rs C카rulis",
        "timestamp": 1758158036
    },
    {
        "content": "<p>In CAS circles, people make a difference between \"computational algebra\" and \"symbolic computation\". Computational algebra has sophisticated algorithms but straightforward semantics -- and thus indeed 'low hanging fruit' for mathlib.  </p>\n<p>Symbolic computation is a very different kettle of fish as the semantics is often ill-defined. More precisely, a lot of algorithms are only defined operationally with vague (at best) denotational semantics. And since mathlib does extensional mathematics, a lack of denotational semantics is a serious problem.</p>",
        "id": 541307592,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1758740358
    },
    {
        "content": "<p>Factoring polynomials over finite fields (an effective algorithm, with a computational representation of polynomials) seems like one of the obvious next steps, that I would love to see progress on.</p>",
        "id": 541342967,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1758755362
    },
    {
        "content": "<blockquote>\n<p>Factoring polynomials over finite fields</p>\n</blockquote>\n<p>This is indeed one of the foundational cornerstones of modern CASes.</p>",
        "id": 541679951,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1758896495
    }
]