[
    {
        "content": "<p><strong>David Roe</strong>: We're planning on a few changes to the knowl infrastructure to help support this project:</p>\n<ul>\n<li>Currently we just use bold to indicate a definition in a knowl.  We'd like to replace that with a jinja macro (maybe called <code>DEFINES</code>) that will allow us to include more semantic information as keyword arguments, such as an id for the definition (some knowls include multiple definitions), a link to the corresponding mathlib definition, a link to a wikidata id (for more general alignment purposes), and another knowl that explains how the LMFDB definition is related to those elsewhere (useful, for example, if the mathlib definition has been made in greater generality and looks superficially different).</li>\n<li>When formalizing definitions, it's often helpful to have theorems that use them; the LMFDB already has statements of many theorems and conjectures across the knowl database.  We plan to add parallel macros (e.g. <code>THEOREM</code> and <code>CONJECTURE</code>) that can hold connections to mathlib and wikidata.  It's a bit less clear to me how these should show up in the UI (we don't have a single term that can be bolded), but that question can be addressed a bit later.</li>\n</ul>",
        "id": 541234091,
        "sender_full_name": "lmfdb-tunnel",
        "timestamp": 1758721560
    },
    {
        "content": "<p><strong>David Roe</strong>: The <code>DEFINES</code> macro is now live: there is documentation about its use <a href=\"https://beta.lmfdb.org/knowledge/show/doc.knowl.guidelines\">here</a> and you can see it in action <a href=\"https://beta.lmfdb.org/knowledge/show/group.abelian\">here</a>.  In particular, you can now add links to mathlib by doing something like</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">DEFINES</span><span class=\"o\">(</span><span class=\"s2\">\"group\"</span><span class=\"o\">,</span><span class=\"w\"> </span><span class=\"n\">mathlib</span><span class=\"bp\">=</span><span class=\"s2\">\"Algebra/Group/Defs.html#Group\"</span><span class=\"o\">)</span>\n</code></pre></div>\n<p>For <code>THEOREM</code> and <code>CONJECTURE</code>, I decided that these were already best supported by the existing <code>\\cites</code> macro.  I added all of the same external sites to this macro as are supported by <code>DEFINES</code>, so if you want to reference a mathlib theorem you can do something like</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"bp\">\\</span><span class=\"n\">cite</span><span class=\"o\">{</span><span class=\"n\">mathlib</span><span class=\"o\">:</span><span class=\"n\">Algebra</span><span class=\"bp\">/</span><span class=\"n\">Group</span><span class=\"bp\">/</span><span class=\"n\">Defs</span><span class=\"bp\">.</span><span class=\"n\">html</span><span class=\"bp\">#</span><span class=\"n\">inv_mul_cancel_comm</span><span class=\"o\">}</span>\n</code></pre></div>\n<p>Unfortunately, this doesn't currently work (because our <a href=\"https://github.com/LMFDB/lmfdb/blob/main/lmfdb/knowledge/main.py#L99\">hashtag pattern replacer</a> replaces the second part of the url with an internal search link; this is resolved by <a href=\"https://github.com/LMFDB/lmfdb/pull/6728\">#6728</a>.</p>\n<p>Next week I will work on updating the process for modifying the project blueprint from LMFDB knowls, but for now everyone should feel free to start adding mathlib links.  Let me know if you have questions or need an account for editing LMFDB knowls.</p>",
        "id": 544236489,
        "sender_full_name": "lmfdb-tunnel",
        "timestamp": 1760125353
    },
    {
        "content": "<p>This is great, thanks for this! I'll have a look later today and see if I can start getting some links added.</p>",
        "id": 544526978,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1760355264
    },
    {
        "content": "<p>Ok I think I get how this works. But we'll need to wait until 6728 is done to get the links into the mathlib docs since they all use # at the end.</p>",
        "id": 544561169,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1760364063
    },
    {
        "content": "<p><strong>David Roe</strong>: I think I have a slightly safer approach for <a href=\"https://github.com/leanprover-community/mathlib4/pull/6728\">#6728</a>, but probably won't have time to do it until Wednesday.</p>",
        "id": 544573701,
        "sender_full_name": "lmfdb-tunnel",
        "timestamp": 1760367495
    },
    {
        "content": "<p><strong>David Roe</strong>: I updated the PR, so it's just waiting for review now.</p>",
        "id": 544645297,
        "sender_full_name": "lmfdb-tunnel",
        "timestamp": 1760407611
    },
    {
        "content": "<p><strong>David Roe</strong>: The PR is merged, so everyone is welcome to add links from LMFDB knowls to analogous Mathlib definitions.  I've updated the <a href=\"https://github.com/CBirkbeck/LeanBridge/blob/main/README.md\">README</a> on our blueprint with instructions.  Let me know if anything is unclear, or if you want an LMFDB account in order to help!</p>",
        "id": 546713168,
        "sender_full_name": "lmfdb-tunnel",
        "timestamp": 1761233923
    }
]