[
    {
        "content": "<p>Hey guys! Hope you all had a good start into the summer. <span aria-label=\"sunny\" class=\"emoji emoji-2600\" role=\"img\" title=\"sunny\">:sunny:</span><br>\nDuring the upcoming weekend, I will have the honor to teach some math undergraduates. I decided I want to teach them some Lean. <span aria-label=\"octopus\" class=\"emoji emoji-1f419\" role=\"img\" title=\"octopus\">:octopus:</span> Since I am not an expert yet, I am not sure whether I will be able to answer all their questions. Do you mind if I put some questions here? Of course, I will also try to convince them to register to Zulip, so maybe they could also post their questions in the \"general\" or \"is there code for X?\" stream.</p>",
        "id": 438540058,
        "sender_full_name": "Jana Göken",
        "timestamp": 1715680250
    },
    {
        "content": "<p>Hi Jana! Of course, please do feel free to post questions here. For them, I think it would be much better to post questions in the \"new members\" stream, unless they are specific.</p>",
        "id": 438542133,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1715680999
    },
    {
        "content": "<p>Ah perfect, thanks for the suggestion Filippo!</p>",
        "id": 438755788,
        "sender_full_name": "Jana Göken",
        "timestamp": 1715763357
    },
    {
        "content": "<p>Hey guys! A small update. Some of the undergraduates would like to get a bit further into lean in the future and are interested in events similar to LFTCM. Any suggestions?^^</p>",
        "id": 439543772,
        "sender_full_name": "Jana Göken",
        "timestamp": 1716200316
    },
    {
        "content": "<p>They are a few upcoming workshops and conferences listed on the website, although they are not necessarily very similar to LFTCM: <a href=\"https://leanprover-community.github.io/events.html\">https://leanprover-community.github.io/events.html</a></p>",
        "id": 439545778,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1716201129
    },
    {
        "content": "<p>Thanks! Yeah I think a tutorial would be best :) I will try to remind them when there is something coming up!</p>",
        "id": 439785411,
        "sender_full_name": "Jana Göken",
        "timestamp": 1716288352
    }
]