[
    {
        "content": "<p>Tomorrow afternoon is free and the canonical thing to do is to hike down to the Sugiton calanque, which is very picturesque.</p>\n<p>I brought some rock climbing gear (enough for myself plus someone else), is anyone interested in this?</p>",
        "id": 429617545,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1711446619
    },
    {
        "content": "<p>Me and <span class=\"user-mention\" data-user-id=\"598091\">@Edgar Costa</span> are interested (myself I have to be back at CIRM by 5 unfortunately) but if we all and anyone else can meet and chat sometime that would be nice (I have a guidebook and gear also)</p>",
        "id": 429626294,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1711449514
    },
    {
        "content": "<p>This would be fun (and possibly beginner-friendly):<br>\n<a href=\"https://www.camptocamp.org/routes/193880/fr/calanques-sugiton-aiguille-de-sugiton-arete-du-vallon\">https://www.camptocamp.org/routes/193880/fr/calanques-sugiton-aiguille-de-sugiton-arete-du-vallon</a></p>",
        "id": 429626817,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1711449696
    },
    {
        "content": "<p>We have a 70 meter rope, plenty of quick draws, and other gear</p>",
        "id": 429742891,
        "sender_full_name": "Edgar Costa",
        "timestamp": 1711488524
    },
    {
        "content": "<p>I'm interested too but I've never done it before. Let me know if you have gear for one more person</p>",
        "id": 429743355,
        "sender_full_name": "Omar Haddad",
        "timestamp": 1711488740
    },
    {
        "content": "<p>I have a 2x50m double rope (twin rope? not sure about the English terms ...), usually that's better for rappelling around here - and I brought one extra harness, 12 quickdraws and other stuff, and the quidebook. </p>\n<p>Let's all interested participants meet tomorrow at the coffee break?</p>",
        "id": 429744883,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1711489483
    },
    {
        "content": "<p>Putting it here for reference just in case:</p>\n<p>Du parking de Luminy, rejoindre vers le S le col de Sugiton puis descendre en direction de la calanque de Sugiton (repérer l'arête et le départ de la voie depuis la route). 2 solutions alors : Prendre dans la combe (juste avant les rambardes bétons de la descente) qui rejoint directement le pied de l'arête. Ou sinon, descendre jusqu'à la plage et partir à droite en direction de la calanque de Morgiou. Juste avant l'échelle métallique, prendre une trace à droite, qui remonte le vallon.</p>\n<p>L'arête est très saillante, avec une bonne terrasse au pied. Les prermières broches scellées qui jalonnent la voie sont visibles de l'attaque, ainsi que quelques pitons scellés.</p>\n<p>Voie</p>\n<p>Le départ de la voie est juste au pied de l'arête (repérer les points).</p>\n<p>L1  4b  Franchir un premier ressaut assez raide, éviter un petit gendarme par la droite. Relais au collet juste derrière, deux spits et un maillon.</p>\n<p>L2  4b  Démarrer sur la droite du fil, puis à un tout petit gendarme, on prend côté gauche. Relais intermédiaire facultatif (sinon attention au tirage). Relais au pied du ressaut terminal, dans une espèce de conque un peu abritée du vent. Deux spits non rouillés l'un au-dessus de l'autre.</p>\n<p>L3  4b  On reprend à droite le fil, aérien jusqu'au sommet N. Relais intermédiaire facultatif. Nombreux relais équipés de voies récentes au sommet.</p>\n<p>L4  2   Traverser sur le fil de l'arête esthétique et aérienne (équipée) jusqu'au sommet S.</p>\n<p>Retour</p>\n<p>Du sommet S, poursuivre vers le S jusqu'au rappel équipé (environ 80 m). On croise un premier relais composé de deux broches sur un bloc, puis 25 m plus loin, un relais sur une petite terrasse en léger contrebas de l'arête, côté E. Deux spits avec des maillons. Le rappel fait 50 m, et on rejoint en tirant à droite le sentier qui ramène à l'échelle métallique.<br>\nRemarques</p>\n<p>Équipement : Scellements. Rappels propres avec chaîne et anneau<br>\nMatériel</p>\n<p>Prévoir de quoi relier les relais.</p>",
        "id": 429825996,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1711534769
    },
    {
        "content": "<p>Putting it here for reference just in case:</p>\n<p>From the Luminy car park, head south towards the Col de Sugiton then go down towards the Calanque de Sugiton (identify the ridge and the start of the route from the road).  2 solutions then: Take the valley (just before the concrete guardrails of the descent) which directly joins the foot of the ridge.  Or otherwise, go down to the beach and turn right towards the Morgiou cove.  Just before the metal ladder, take a path to the right, which goes up the valley.</p>\n<p>The ridge is very prominent, with a good terrace at the foot.  The first sealed pins which mark the route are visible from the attack, as well as a few sealed pitons.</p>\n<p>Way</p>\n<p>The start of the route is just at the foot of the ridge (mark the points).</p>\n<p>L1 4b Cross a first fairly steep step, avoid a small policeman on the right.  Relay at the collar just behind, two bolts and a link.</p>\n<p>L2 4b Start on the right of the wire, then at a very small gendarme, we take the left side.  Optional intermediate relay (otherwise be careful with the draw).  Relay at the foot of the terminal jump, in a kind of conch shell somewhat sheltered from the wind.  Two unrusted bolts one above the other.</p>\n<p>L3 4b We take the wire to the right, aerial to the summit N. Optional intermediate relay.  Numerous relays equipped with recent routes at the summit.</p>\n<p>L4 2 Cross on the wire of the aesthetic and aerial ridge (equipped) to the S summit.</p>\n<p>Back</p>\n<p>From the S summit, continue towards the S until the equipped rappel (around 80 m).  We come across a first belay composed of two pins on a block, then 25 m further, a belay on a small terrace slightly below the ridge, on the E side. Two bolts with links.  The abseil is 50 m long, and by pulling to the right you reach the path which leads back to the metal ladder.<br>\n Remarks</p>\n<p>Equipment: Sealings.  Clean reminders with chain and ring<br>\n Material</p>\n<p>Provide something to connect the relays.</p>",
        "id": 429826323,
        "sender_full_name": "Edgar Costa",
        "timestamp": 1711534881
    },
    {
        "content": "<p>\"Clean reminders\" <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 429835574,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1711538075
    }
]