[
    {
        "content": "<p>We just had a broken <code>main</code>: <a href=\"https://github.com/leanprover/std4/pull/533\">std4#533</a> was green, but after hitting <code>main</code> it failed. I fixed it in <a href=\"https://github.com/leanprover-community/mathlib4/pull/541\">#541</a>, which I merged myself.</p>",
        "id": 416473434,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1705539160
    },
    {
        "content": "<p>Might be time for bors or mergify!</p>",
        "id": 416473452,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1705539168
    },
    {
        "content": "<p>We can also use GHMQ, std has fairly low CI requirements</p>",
        "id": 416488185,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1705548226
    },
    {
        "content": "<p>I think that's what lean core is using?</p>",
        "id": 416488293,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1705548245
    },
    {
        "content": "<p>Yes, we use the GHMQ and it has been fine for us there.</p>",
        "id": 416488344,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1705548265
    },
    {
        "content": "<p>I’d be in favor of unifying the CI and repo setup for lean and std as far as possible, given that <code>std</code> is becoming more and more an inalienable part of “lean” from the user point of view, and ideally contributers shouldn’t learn different workflows.</p>",
        "id": 416531450,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1705570591
    },
    {
        "content": "<p>I'm not sure I would go that far. Lean has an unusual CI setup for a lot of reasons related to bootstrapping, and it also produces releases unlike std (because it's a compiler not a library), and it has bots running stuff on std and mathlib (maybe we'll borrow some of that)</p>",
        "id": 416533931,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1705571409
    },
    {
        "content": "<p>(Furthermore I have major qualms regarding the contribution pipeline in lean4 core, and do my best to promote a more open model in std)</p>",
        "id": 416534286,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1705571521
    },
    {
        "content": "<p>I expect that <code>std</code> will have to be part of releases in the future anyways, so the release process somehow has to straddle both repos anyways.</p>\n<p>Of course the bootstrapping issue remain core-specific – but even more reasons to make contributions to std at least as pleasant as to core, so that little code as possible is affected by the bootstrapping complications.</p>\n<p>In particular, the CI integration with mathlib should also be available on std, shouldn’t it?</p>\n<p>I would hope that we find a way that contributions to either repo are as qualm-free as possible :-)</p>\n<p>(This is all my opinion here, nothing official.)</p>",
        "id": 416536521,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1705572186
    }
]