[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"873547\">@Robin Arnez</span> <a href=\"https://github.com/leanprover/lean4/pull/8435#discussion_r2105759702\">noticed</a> that the <code>MonadLift Id m</code> instance has some problems.  The gist:</p>\n<ul>\n<li>This instance is tried lots of times whenever a <code>MonadListT</code> instance is being synthesized.</li>\n<li>It also causes lots of non-canonical instances -- at least one non-canonical instance for every <code>MonadList</code> instance.</li>\n</ul>\n<p>I wonder what we could do to improve this situation. Robin has made an interesting suggestion: If we only provide a (high-priority) <code>MonadLiftT Id m</code> instance (<strong>T</strong>), the first problem disappears and the second problem hopefully less worse due to the priority.</p>\n<p>This proposal makes a lot of sense and I think this is by far the best idea I know regarding how to address this issue, but it still has problems. I don't like that we manually create a <code>MonadLiftT</code> instance, even though the docstring says that <code>MonadLiftT</code> is the reflexive-transitive closure of <code>MonadLift</code>. The part about using priorities to handle canonicity violations might work but could be a bit fragile.</p>\n<p>Hence, I'd like to ask you all to think about <code>MonadLift Id m</code>. What would be the best way forward in your opinion?</p>",
        "id": 520445994,
        "sender_full_name": "Paul Reichert",
        "timestamp": 1748264225
    },
    {
        "content": "<p>Is it even possible to make the instance canonical?</p>\n<p>I agree with your solution, though my knowledge of this topic is very limited</p>",
        "id": 520452516,
        "sender_full_name": "Quang Dao",
        "timestamp": 1748265895
    },
    {
        "content": "<p>This is similar to the <code>Coe</code> mayhem from long ago. The solution there was a complex web of classes: <a href=\"https://github.com/leanprover/lean4/blob/1e752b0a01bafdbcea6496ac4add09226b92aa99/src/Init/Coe.lean#L12\">https://github.com/leanprover/lean4/blob/1e752b0a01bafdbcea6496ac4add09226b92aa99/src/Init/Coe.lean#L12</a></p>\n<p><code>MonadLift</code> probably doesn't need as complex solution (at least not right now). The first attempt at solving the <code>Coe</code> problem was to insert some problematic coercions directly in <code>CoeT</code>, which is similar to what is proposed.  That can probably work for a while, as it did for <code>Coe</code>.  Anyway, I think it's worthwhile to revisit the <code>Coe</code> story to avoid early mistakes.</p>",
        "id": 520492912,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1748277281
    },
    {
        "content": "<p>Interesting, thanks for the backstory.</p>",
        "id": 520493935,
        "sender_full_name": "Paul Reichert",
        "timestamp": 1748277653
    },
    {
        "content": "<p>Even worse than causing non-canonical instances, the instance <code>MonadLift Id m</code> causes a looping instance search (which doesn't loop forever in lean4 luckily). It seems that the <code>CoeTail</code> class was made to solve this problem for coercions. So I think the same can be done here, making a <code>MonadLiftTail</code> class, with the instance <code>MonadLiftTail Id m</code>. And then the current <code>MonadLiftT</code> should be renamed to <code>MonadLiftTC</code>, and we define the class <code>MonadLiftT</code> to have an instance coming either directly from <code>MonadLiftTC</code>, or from that combined with <code>MonadLiftTail</code>. So then if we really wanted, we could chain <code>MonadLiftTail Id m</code> with an instance of <code>MonadLift _ Id</code>.</p>",
        "id": 520927526,
        "sender_full_name": "Jovan Gerbscheid",
        "timestamp": 1748448155
    },
    {
        "content": "<p>Is there a reason to though? Using <code>Tail</code> implies that there would be a situation where you would want to lift to <code>Id</code> (and then use the <code>Tail</code> to lift into an arbitrary monad). However, <code>Id</code> doesn't have any inner monads so  using it in <code>MonadLiftT</code> should be enough.</p>",
        "id": 521060965,
        "sender_full_name": "Robin Arnez",
        "timestamp": 1748512772
    },
    {
        "content": "<p>After this discussion, I think <a href=\"https://github.com/leanprover-community/batteries/pull/1242\">batteries#1242</a> should be closed in favor of a core solution. Agreed?</p>",
        "id": 522221906,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1748987887
    },
    {
        "content": "<p>Note that this is a PR into a PR-testing branch. The base PR upstreamed <code>LawfulMonadLift</code> into core, initially originally including <code>MonadLift Id m</code>. However, having noticed its complications and having removed <code>MonadLift Id m</code> from the upstreaming PR, I strongly prefer decoupling these topics instead of piggybacking on the <code>LawfulMonadLift</code> topic. That's why said PR reverts the deletion of <code>MonadLift Id m</code> in Batteries as part of the (yet unmerged) PR-testing branch.</p>\n<p>Right now, Batteries contains <code>MonadLift Id m</code>. Just closing above PR will have the effect of actively deleting it from <code>Batteries</code> with the next toolchain bump, without solving the problem that there's no core solution yet.</p>",
        "id": 522275311,
        "sender_full_name": "Paul Reichert",
        "timestamp": 1749018705
    },
    {
        "content": "<p>Update: I turns out that Batteries already has been bumped. (It was probably not a good idea to merge the <code>lean4</code> PR without waiting for the PR-testing pull request being accepted, sorry!) Closed it now and opened a new PR restoring the instance: <a href=\"https://github.com/leanprover-community/batteries/pull/1259\">https://github.com/leanprover-community/batteries/pull/1259</a></p>\n<p>Because some people might depend on this instance, I think we should restore the old instance and can improve it afterwards.</p>",
        "id": 522308823,
        "sender_full_name": "Paul Reichert",
        "timestamp": 1749028999
    },
    {
        "content": "<p>Note that PRs marked WIP never get merged.</p>",
        "id": 522344349,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1749039792
    },
    {
        "content": "<p>I don't see why reintroducing this instance is necessary. Nobody has complained that it went missing.</p>",
        "id": 522344722,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1749039898
    },
    {
        "content": "<p>My bad regarding the WIP label! Besides that, it would be fine for me to close <a href=\"https://github.com/leanprover-community/batteries/pull/1259\">1259</a> if you think that the instance isn't needed. (Update: Closed for now.)</p>",
        "id": 522358834,
        "sender_full_name": "Paul Reichert",
        "timestamp": 1749043703
    }
]