[
    {
        "content": "<p>What is the process for moving stuff out of Mathlib and into Batteries? </p>\n<p>I'm finding myself copy-pasting a bunch of stuff from <a href=\"https://github.com/leanprover-community/mathlib4/blob/fdca716c87cb52e20ea0a94f93ac69750151f419/Mathlib/Data/List/Nodup.lean\">Mathlib/Data/List/Nodup.lean</a> just to work with the lemmas in <a href=\"https://github.com/leanprover-community/batteries/blob/77d10578945b31d794214a66937b75a6d4311674/Batteries/Data/List/Perm.lean#L138\">Batteries/Data/List/Perm.lean</a>, and it feels like these should be combined.</p>",
        "id": 574971819,
        "sender_full_name": "Markus de Medeiros",
        "timestamp": 1771602279
    },
    {
        "content": "<p>I also have found myself wishing for Multiset in Batteries when e.g. doing the formal verification of BinaryHeap</p>",
        "id": 575033732,
        "sender_full_name": "cmlsharp",
        "timestamp": 1771624442
    },
    {
        "content": "<p>To move stuff from Mathlib to Batteries, just make a PR: Create a new branch on your Batteries fork, copy the items you need from Mathlib. Adapt until it works, then contribute a PR to Batteries.</p>\n<p>Things to keep in mind:</p>\n<ul>\n<li>As you fix imports, your PR will get larger and larger. Split it into logical pieces. While PRs can be too big, there is no such thing as a PR that is too small!</li>\n<li>There will need to be a companion Mathlib adaptation PR. Ask Kim for write access to Mathlib Testing so you can edit the <code>batteries-pr-testing-nnnn</code> branch and rely on CI to build Mathlib.</li>\n</ul>",
        "id": 575102570,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1771695516
    },
    {
        "content": "<p>I'm not sure if our automation treats Mathlib Testing as a more priviledged fork. Is it bad for some reason to add it as a remote and make PRs to the corresponding <code>batteries-pr-testing-nnnn</code>?</p>",
        "id": 575109640,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1771703286
    },
    {
        "content": "<p>AFAIK, Mathlib Testing is not privileged in the ecosystem. Besides, the testing branches don't make PRs to Mathlib Testing, they make PRs to Mathlib. The only difference is that Mathlib Testing branches still do CI when Mathlib would reject them because of irregular dependencies.</p>",
        "id": 575109904,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1771703625
    },
    {
        "content": "<p>No, the nightly-testing fork is privileged, and only known community members should be given access to it.</p>",
        "id": 575213711,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1771812177
    },
    {
        "content": "<p>It's in the Batteries README to ask for write access to Mathlib Nightly Testing but there are no instructions how to do that.</p>",
        "id": 575650088,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1771970550
    },
    {
        "content": "<p>I think that we should change that. Instead, people should fork nightly testing and open a PR to the testing branch. Then a maintainer should merge that PR.</p>",
        "id": 575706866,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1772005153
    },
    {
        "content": "<p>I'm happy to give write access there to people who are regularly helping maintain nightly-testing itself, but would prefer that we use PRs from forks for battery adaptations, despite the overhead.</p>",
        "id": 576391441,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1772255856
    }
]