[
    {
        "content": "<p>I'm putting upstreaming <code>Sublist</code>, <code>Pairwise</code> and <code>Nodup</code> on my TODO list, for the <a href=\"https://github.com/leanprover/leansat\">leansat</a> project (which won't be able to depend on Batteries).</p>\n<p>My intention is that these will initially only have the minimal API needed to support leansat, and further down the track as I finish completing the List API for the existing functions/predicates in Lean I will return to these.</p>",
        "id": 449730803,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1720391621
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/stream/348111-batteries/topic/Upstreaming.20.60List.2ESublist.60.2C.20.60Pairwise.60.2C.20and.20.60Nodup.60.2E/near/449730803\">said</a>:</p>\n<blockquote>\n<p>for the <a href=\"https://github.com/leanprover/leansat\">leansat</a> project (which won't be able to depend on Batteries).</p>\n</blockquote>\n<p>I'm not going to push too hard on this, but why?</p>",
        "id": 449734130,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1720394678
    },
    {
        "content": "<p>in any case it sounds fine by me, I'm sure you will need this anyway for some hashmap lemmas. (You probably should have taken Sublist already in the first wave instead of rewriting proofs to avoid it)</p>",
        "id": 449734322,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1720394819
    },
    {
        "content": "<p>Okay, no major issues. But you do realize that you're also upstreaming maintenance and putting it behind a FRO wall (to coin a phrase).</p>",
        "id": 449749760,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1720403299
    },
    {
        "content": "<p>Why can't these projects depend on batteries?</p>",
        "id": 449814442,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1720429438
    },
    {
        "content": "<p>The plan for LeanSAT is to move it into the core repository. This is in line with the general vision for core to have good support for the core types, among which we have <code>BitVec</code>. Once LeanSAT lands in core users will get both a nice <code>BitVec</code> library in terms of available lemmas (this is what core already has, for the past few months the lemmas that LeanSAT demands to verify its decision procedures have been pushing the <code>BitVec</code> theory in core a lot further), as well as a complete decision procedure for fixed width <code>BitVec</code> things which is of course very interesting for software and hardware verifiaction purposes.</p>",
        "id": 449816855,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1720430168
    },
    {
        "content": "<p>I hope we won't regret this close coupling with the compiler</p>",
        "id": 449817785,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1720430499
    },
    {
        "content": "<p>What close coupling with the compiler are you thinking about here? The idea is to merely put <code>LeanSAT</code> into core such that it is available out of the box, not to make any core specific changes.</p>\n<p>Note that, to our knowledge, the ability to have a verified decision procedure for fixed width <code>BitVec</code> would be <em>unique</em> to Lean among the ITP world. Isabelle doesn't have this, Agda doesn't have this, Coq does actually have a verified bitblaster but it targets SMTLIB and is not available as a tactic. Given that software and hardware verification users are very interested in fixed width <code>BitVec</code> reasoning this is hopefully going to be a notable point in favor of using Lean in the future.</p>",
        "id": 449818789,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1720430771
    },
    {
        "content": "<p>Do we have a <code>lake new my_project batteries</code> command for creating a larger box for new users to start with?</p>",
        "id": 449837676,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1720436580
    },
    {
        "content": "<p>(since we have <code>lake new my_project math</code>)</p>",
        "id": 449837731,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1720436590
    },
    {
        "content": "<p>That would be really nice. Adding a cache would also be nice (at least local cache).</p>",
        "id": 449844822,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1720439127
    }
]