[
    {
        "content": "<p>I'm currently working on the theorem <code>uniformIntegrable_of_dominated_singleton</code>, and running into trouble trying to prove the uniform integrability of a constant sequence <code>fun _ ↦ Y</code> where <code>Y</code> is <code>MemLp</code>. The existing theorems in mathlib to prove something like this, for example <code>uniformIntegrable_const</code> or <code>unifIntegrable_const</code> require the additional hypothesis that <code>p ≠ ∞</code>, which we do not have here. You can find my work in progress in <a href=\"https://github.com/RemyDegenne/brownian-motion/pull/293\">PR #293</a>. </p>\n<p>Can anyone suggest how to proceed in the case when <code>p = ∞</code>? Or, alternatively, would it be alright to add the hypothesis <code>p ≠ ∞</code> to the theorem, and then refactor the uses of <code>uniformIntegrable_of_dominated_singleton</code> to include this condition?</p>",
        "id": 558119984,
        "sender_full_name": "Jack McCarthy",
        "timestamp": 1763530882
    },
    {
        "content": "<p>You have to assume that p is finite yes.</p>",
        "id": 558123975,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1763533859
    },
    {
        "content": "<p>Actually I am not sure uniform integrability even makes sense when p is infinite, I think one might be able to prove that if one of the function is non zero then the sequence cannot be uniformly integrable if p is infinite.</p>",
        "id": 558124423,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1763534110
    },
    {
        "content": "<p>Ok thanks for confirmation, I will add the assumption that p is infinite</p>",
        "id": 558125664,
        "sender_full_name": "Jack McCarthy",
        "timestamp": 1763534791
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"703970\">Etienne Marion</span> <a href=\"#narrow/channel/509433-Brownian-motion/topic/Uniform.20Integrability.20of.20Constant.20Sequence.20in.20Lp.20when.20p.20.3D.20.E2.88.9E/near/558124423\">said</a>:</p>\n<blockquote>\n<p>Actually I am not sure uniform integrability even makes sense when p is infinite, I think one might be able to prove that if one of the function is non zero then the sequence cannot be uniformly integrable if p is infinite.</p>\n</blockquote>\n<p>How about measures with atoms? If your probability space <code>Ω</code> is a singleton, then any bounded collection of random variables is uniformly integrable for <code>p = ∞</code>.</p>",
        "id": 558160207,
        "sender_full_name": "Yongxi Lin (Aaron)",
        "timestamp": 1763546975
    },
    {
        "content": "<p>Yes I did not intend to make a precise statement. It's just that if the function is not zero ae it is bounded below on a set of positive measure. If this set contains measurable sets of arbitrary small and positive measure, then you don't get uniform integrability. The fact that a singleton might not be uniformly integrable I think suggests that this notion is not interesting when p is infinite. Actually in the project we will most likely not care about <code>p ≠ 1</code> I think, because <code>p=1</code> is the right assumption to have nice properties of martingale (eg convergence in L1), and for convergence in Lp it suffices to be bounded in Lp I think (at least it's true in the discrete case)?</p>",
        "id": 558165162,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1763548404
    }
]