[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/31133\">#31133</a>, I wrote a linter combinator <code>whenLinterActivated</code> which is intended to be used to reduce linter boilerplate, so that the body of a linter could be provided as<code>run := whenLinterActivated linter.foo fun stx =&gt; do ...</code>. </p>\n<p>However, this caused issues when the option <code>linter.foo</code> was registered in the same module as the linter was defined. For example, if the module <code>Foo</code> registered the option <code>linter.foo</code> and defined <code>def fooLinter where run := whenLinterActivated linter.foo fun stx ...</code>, then any module <code>Bar</code> importing <code>Foo</code> would panic (with the usual message when you try to evaluate an <code>@[init]</code> declaration in the same module). I was a bit surprised, but I figured that Lean probably tried to be eager in some way, and the issue was probably having the linter option as an argument at the top level rather than inside some thunkish context such as a <code>CommandElabM</code> action (where it does not cause any issues).</p>\n<p>To get around this, I tagged <code>whenLinterActivated</code> with <code>@[macro_inline]</code>, since I wanted to support this common pattern instead of insisting we separate files just to use this combinator. My question is: is this a reasonable approach, or is there a better one?</p>",
        "id": 553922697,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1762364159
    },
    {
        "content": "<p>I assume <code>@[inline]</code> alone is not enough? How does <code>always_inline</code> compare?</p>",
        "id": 553945870,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1762370989
    },
    {
        "content": "<p>(For what it's worth, I've run into this issue before too)</p>",
        "id": 553945904,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1762371001
    },
    {
        "content": "<p><code>@[always_inline]</code> doesn't work, unfortunately. (Nor <code>@[inline]</code>, nor, for good measure, <code>@[inline_if_reduce]</code>!) It seems like <code>@[macro_inline]</code> is the only one that works.</p>",
        "id": 553950489,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1762372601
    }
]