[
    {
        "content": "<p>Two years ago <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> made a very important RFC <a href=\"https://github.com/leanprover/lean4/pull/3129\">lean#3129</a> and, simultaneously, she provided a PR solving the issue. We agree that it is undesirable that <code>constructor</code> proceeds in situations where more than one constructor is applicable. Unfortunately, it has not been fixed yet.</p>\n<p>Since I, as well as many other people, will teach Lean again next year, I would really like to see it fixed soon. I would feel very uncomfortable explaining to my students, again, why <code>constructor</code> works on disjunctions. Will it help if more people thumb the RFC up?</p>",
        "id": 564819208,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1766226941
    },
    {
        "content": "<p>The last activity I can see on this is my comment:</p>\n<blockquote>\n<p><a href=\"https://github.com/hrmacbeth\">@hrmacbeth</a>, if you (or anyone else) have the time to add some test cases exercising the new behaviour, I would be happy to proceed with this PR.</p>\n</blockquote>\n<p>(That said, it has been long enough that I am now quite fearful about changing this behaviour. We would at the very least need to preserve the current behaviour for at least a full release, but with a warning advising using <code>constructor!</code> in ambiguous cases. )</p>",
        "id": 564821203,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1766229341
    },
    {
        "content": "<p>(That is, saying that there's \"a PR solving the issue\" is fairly inaccurate.)</p>",
        "id": 564821234,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1766229384
    },
    {
        "content": "<p>Do you want tests that will be conducted once (before merging), or tests to be permanently added to the repository?</p>\n<p>Is it possible to write unit tests for \"this tactic has to fail now\"? I suppose I can <code>#guard_msgs</code> but, in case where the desired output is a failure, can it stay in the repository?</p>",
        "id": 564821660,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1766229889
    },
    {
        "content": "<p>There's the <code>fail_if_success</code> tactic combinator: <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Lean.Elab.Tactic.evalFailIfSuccess#doc\">docs#Lean.Elab.Tactic.evalFailIfSuccess</a></p>",
        "id": 564834957,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1766243585
    },
    {
        "content": "<p>iirc there's also a success if fail with message</p>",
        "id": 564835033,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1766243670
    },
    {
        "content": "<p>I think about this RFC periodically.</p>\n<p>Here's a rough design I have in mind:</p>\n<ul>\n<li>add options to <code>constructor</code> to configure its behavior, including whether to allow multiple applicable constructors</li>\n<li>independently, add syntax to be able to control which constructor is selected, along with <em>structured</em> handling of the resulting goals (like <code>cases</code>/<code>induction</code>), which is notably missing</li>\n<li>evaluate whether we could treat <code>constructor</code> as a low-level tactic and whether there is a better name for a higher-level constructor tactic (one that we could use more restrictive defaults for); potentially this tactic could even be <em>only</em> for one-constructor types — for various conjunction-like types</li>\n</ul>\n<p>One reason I've held off on implementing the PR is that I worry about <code>constructor</code> being used in low-level macro automation, and I don't want to break it. Having some new higher-level structured tactic that uses a shorter word seems better for everyone.</p>",
        "id": 564843839,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1766252891
    },
    {
        "content": "<p>I'd love to see a new less permissive tactic called by a shorter word!</p>",
        "id": 564844228,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1766253326
    },
    {
        "content": "<p>Is <code>make</code> available?</p>",
        "id": 564844979,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1766254154
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/channel/270676-lean4/topic/.60constructor.60.20papercut/near/564844228\">said</a>:</p>\n<blockquote>\n<p>I'd love to see a new less permissive tactic called by a shorter word!</p>\n</blockquote>\n<p>Cheeky suggestion:</p>\n<div class=\"codehilite\" data-code-language=\"Diff\"><pre><span></span><code><span class=\"gd\">-constructor</span>\n<span class=\"gi\">+construct</span>\n</code></pre></div>\n<p>:)</p>",
        "id": 564860914,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1766275225
    },
    {
        "content": "<p>I'd like to repeat my suggestion that it would be great to create a tactic <code>make</code> on top of <code>constructor</code> that would succeed iff there is exactly one applicable constructor. Subsequently, all occurrences of <code>constructor</code> would be replaced by <code>make</code> in tutorials for beginners.</p>",
        "id": 568398576,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1768558259
    }
]