[
    {
        "content": "<p>Is there any particular reason why we can't give the <code>grind</code> attribute to Surjective and Injective, given we do give it to, say, LeftInverse and RightInverse?</p>",
        "id": 569482293,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1769086515
    },
    {
        "content": "<p><code>grind</code> has special support for <code>Injective</code> lemmas so tagging it probably isn't a good idea. Maybe <code>Surjective</code> would be worth tagging <code>grind</code> though?</p>",
        "id": 569482804,
        "sender_full_name": "Robin Arnez",
        "timestamp": 1769086662
    },
    {
        "content": "<p>Or maybe tagging <code>Injective</code> grind would not actually pose any problems? not sure</p>",
        "id": 569482917,
        "sender_full_name": "Robin Arnez",
        "timestamp": 1769086693
    },
    {
        "content": "<p>I just find sometimes I want to prove things about both and I end up needing to get to the meaning underneath.</p>",
        "id": 569482926,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1769086695
    },
    {
        "content": "<p>And locally putting it in works, but is often kinda ugly, and it feels weird.</p>",
        "id": 569483004,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1769086718
    },
    {
        "content": "<p>In certain cases I think it could make <code>grind</code> more inefficient to add this tag, for instance it will create existential hypotheses which <code>grind</code> will do cases on (and therefore increasing the number of <code>split</code>), and may end up avoiding higher-level reasoning steps using <code>Surjective</code> instead. So my instinct is to keep adding it locally, or having a local attribute in your file. In contrast, <code>LeftInverse</code> and <code>RightInverse</code> are just equalities, and having more of those in the context doesn't really make things much worse.</p>",
        "id": 569493115,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1769089447
    },
    {
        "content": "<p>In case it's helpful to have the context, by the way, it was in this: <a href=\"#narrow/channel/270676-lean4/topic/.60Surjective.60.20iff.20.60Injective.60.20for.20.60Fin.20n.60\">#lean4 &gt; &#96;Surjective&#96; iff &#96;Injective&#96; for &#96;Fin n&#96;</a></p>",
        "id": 569493235,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1769089484
    }
]