[
    {
        "content": "<p>FRO Roadmap Year 1 ( <a href=\"https://lean-fro.org/about/roadmap/\">https://lean-fro.org/about/roadmap/</a> ) says that:</p>\n<blockquote>\n<ol start=\"10\">\n<li>Language Extensibility</li>\n</ol>\n<p>Description: A key goal for Lean is to enhance its extensibility to support complex standalone and embedded languages effectively. This aspect of development focuses on making Lean adaptable and versatile in handling a variety of programming and markup languages, which is essential for its broader applicability and user engagement.</p>\n<p>Inspiration from Racket: Drawing inspiration from the #lang feature in Racket, which allows a source file to indicate that it's written in a separate language with its own syntax, we aim to bring similar functionality to Lean. This feature would allow users to seamlessly integrate and switch between different languages within Lean, enhancing its flexibility and usability for diverse programming needs.</p>\n</blockquote>\n<p>But Year 2 Roadmap ( <a href=\"https://lean-fro.org/about/roadmap-y2/\">https://lean-fro.org/about/roadmap-y2/</a> ) does not contain this. </p>\n<p>I was looking forward to seeing this #lang-inspired feature implemented. Are there no longer any plans to implement it?</p>",
        "id": 467007071,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1725297583
    },
    {
        "content": "<p>We have moved to using Lean's existing functionality for this, see how <a href=\"https://github.com/leanprover/verso/blob/main/examples/textbook/DemoTextbook.lean#L15\">Verso does it</a>. With incrementality, for which Verso contains a higher-level wrapper as a  prototype, the distinction between taking full control of the elaborator and contributing an elaborator for a single command has diminished.</p>",
        "id": 467008444,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1725298000
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> Thank you!</p>",
        "id": 467008650,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1725298069
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"626349\">Asei Inoue</span> has marked this topic as resolved.</p>",
        "id": 468562733,
        "sender_full_name": "Notification Bot",
        "timestamp": 1725800290
    }
]