[
    {
        "content": "<p>I just updated my code to Lean 4.9.0 and am adapting it to use the new <code>Lean.AssocList</code> instead of the old <code>Std.AssocList</code> (now batteries). The conversion of List of pairs to AssocList was usually done by toAssocList, But the Lean standard library calls it <code>toAssocList'</code>. Any special reason for ending it with <code>'</code>?</p>",
        "id": 449310397,
        "sender_full_name": "Alexandre Rademaker",
        "timestamp": 1720184858
    },
    {
        "content": "<p>What gave you the idea that there is a new <code>Lean.AssocList</code>? Nothing has fundamentally changed about the two types called <code>AssocList</code> in a long time, except that what used to be called <code>Std.AssocList</code> is now called <code>Batteries.AssocList</code>. The name <code>List.toAssocList</code> can only be used by one function, and it seems that batteries uses it for the function that returns a <code>Batteries.AssocList</code>, so the function that returns a <code>Lean.AssocList</code> must use a different name, and that different name is <code>List.toAssocList'</code>.</p>",
        "id": 449323943,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1720189370
    },
    {
        "content": "<p>I see, so the answer to my question is that the <code>'</code> in the name does not have any special meaning that could suggest any tendency to a deprecated status. I got that <code>toAssocList</code> needs to be in the <code>List</code> namespace to be used in the dot notation, so this forces the existence of the two names.</p>",
        "id": 449328480,
        "sender_full_name": "Alexandre Rademaker",
        "timestamp": 1720190872
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"121542\">Alexandre Rademaker</span> has marked this topic as resolved.</p>",
        "id": 449328582,
        "sender_full_name": "Notification Bot",
        "timestamp": 1720190895
    }
]