[
    {
        "content": "<p>Hi, I have a complex Lean project that takes too long to build (~20 minutes), so I'm considering having a build cache on GitHub where users who depend on this package can download the build result instead of waiting for half an hour.</p>\n<p>I noticed the <code>lake upload</code> command and the <a href=\"https://lean-lang.org/doc/reference/latest//Build-Tools-and-Distribution/Lake/#lake-facets\"><code>optCache</code> Facet</a> from the Lean reference manual, where it specifically says \"A package's optional cached build archive (e.g., from Reservoir or GitHub)\". It seems like there is indeed a way to upload my build artifact to GitHub and let <code>lake build</code> pick up the artifact automatically, but I have no idea how to do this and can't find any guides online. Running <code>lake upload</code> is fairly straightforward but I don't know what I have to add in the <code>lakefile.toml</code> (of my package and/or of projects that depend on my package) to make <code>lake build</code> use the artifact. I'd greatly appreciate any assistance in setting it up!</p>\n<p>Regarding why I can't upload to the Reservoir, this project is the Lean code generated from <a href=\"https://github.com/riscv/sail-riscv\">riscv/sail-riscv</a>, so I'm pretty sure I don't have the permission to upload it.</p>\n<p>I'm not sure if this is the right channel to ask, so feel free to move this post!</p>",
        "id": 522941196,
        "sender_full_name": "Gavin Zhao",
        "timestamp": 1749365358
    },
    {
        "content": "<p>Have you taken a look at the <a href=\"https://github.com/leanprover/lean4/blob/4ec5dad05faa0f21f09e2089aafdb2805bac4f16/src/lake/README.md#github-release-builds\">GitHub Release Builds</a> section of the Lake README?</p>",
        "id": 522941343,
        "sender_full_name": "Mac Malone",
        "timestamp": 1749365614
    },
    {
        "content": "<p>Thank you, that's what I missed! Just needed to add <code>preferReleaseBuild = true</code>. I managed to trigger the build of the<code>optRelease</code> facet. Is there a way to pass (authorization) headers to the <code>curl</code> command used to fetch the artifact? The build artifact is private.</p>",
        "id": 522996116,
        "sender_full_name": "Gavin Zhao",
        "timestamp": 1749410908
    },
    {
        "content": "<p>I managed to write a script that intercepts <code>curl</code> and replace the command with <code>gh release download</code>, but I hope that either I can pass the authorization header to <code>curl</code> directly or tell Lake to use <code>gh</code> to fetch the artifact.</p>",
        "id": 522996884,
        "sender_full_name": "Gavin Zhao",
        "timestamp": 1749411907
    },
    {
        "content": "<p>Unfortunately, no, Lake does not currently provide a builtin way to fetch release artifacts from a private repo.</p>",
        "id": 522996954,
        "sender_full_name": "Mac Malone",
        "timestamp": 1749411996
    },
    {
        "content": "<p>I see. Thank you so much for the quick answers!</p>",
        "id": 522998150,
        "sender_full_name": "Gavin Zhao",
        "timestamp": 1749413416
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"766285\">Gavin Zhao</span> has marked this topic as resolved.</p>",
        "id": 523024631,
        "sender_full_name": "Notification Bot",
        "timestamp": 1749444943
    }
]