[
    {
        "content": "<p>Dear <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span> , <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> <br>\nHello, I am interested in learning mathematics with theorem prover, and <code>Mathematics in Lean</code> is very good book for exactly the purpose.<br>\nSo to be available for accessing this book easily for Japanese, I would like to translate <code>Mathematics in Lean</code> into Japanese and release it (to the public with the credit as it is now) on web with the volunteers I have gathered.<br>\nThe translation repository and release page is hosted on <a href=\"https://github.com/lean-ja\">lean-ja</a>, and the entire process is non-profit.<br>\nCould you please permit us to do so?</p>",
        "id": 395294386,
        "sender_full_name": "t-shibata",
        "timestamp": 1696609766
    },
    {
        "content": "<p>I'll talk with Jeremy, but I fear this effort comes too early. The book still needs a lot of work. Keeping the translation up to date would be very unrewarding.</p>",
        "id": 395305828,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1696614901
    },
    {
        "content": "<p>Would the books \"Theorem Proving in Lean\" or \"Functional Programming in Lean\" be better candidates at the moment?</p>",
        "id": 395312164,
        "sender_full_name": "Ioannis Konstantoulas",
        "timestamp": 1696617839
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span> , <span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span> <span aria-label=\"up\" class=\"emoji emoji-2b06\" role=\"img\" title=\"up\">:up:</span></p>",
        "id": 395312271,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1696617888
    },
    {
        "content": "<p><em>Functional Programming in Lean</em> is under an open Creative Commons license, so no permission is necessary so long as you credit it appropriately. However, I don't have a way to check the quality of the translation, and it will receive ongoing updates as Lean evolves, so I don't think I'd feel comfortable endorsing a translation, which involves taking some responsibility for it.</p>",
        "id": 395312539,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1696618038
    },
    {
        "content": "<p>This is a great initiative, though!</p>",
        "id": 395312564,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1696618051
    },
    {
        "content": "<p>@t-shibata I share Patrick's concerns that we are not only planning to add chapters but also to revise the chapters that already exist. But if that doesn't bother you, I have no objection to translating it.</p>",
        "id": 395331556,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1696627988
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span> <br>\nThank you for replying!<br>\nAnd I understood your concerns, so I will discuss them with others.</p>",
        "id": 395386447,
        "sender_full_name": "t-shibata",
        "timestamp": 1696664878
    },
    {
        "content": "<p>My personal opinion is that if a translation is made of the current version of MIL and then MIL diverges -- who cares? I think MIL can be regarded as the \"missing link\" in terms of introducing theorem provers to mathematicians, there's nothing else really like it, and the advantages of introducing the topic to a Japanese audience outweigh the perceived issues above.</p>",
        "id": 395387974,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1696665544
    },
    {
        "content": "<p>Is there some clever way to manage combining machine-translation and manual corrections with git such that accepting upstream MIL changes is easy?</p>",
        "id": 395389105,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1696666156
    },
    {
        "content": "<p>Or is machine translation too awful for that to be useful?</p>",
        "id": 395389137,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1696666185
    },
    {
        "content": "<p>There are technical solutions (e.g. on <a href=\"https://github.com/crowdin/github-action\">Crowdin</a> which is free for open-source projects, there are also other self-hostable open-source solutions like weblate etc.) to detect updates from the source text, then remind the translator to update the translation accordingly, even with translation suggestion automatically adjusted from the original translation or pre-translated via a combination of machine-translation, user-defined glossary and translation memory (i.e. translation for similar terms, phrases etc.).</p>",
        "id": 395389446,
        "sender_full_name": "Utensil Song",
        "timestamp": 1696666403
    },
    {
        "content": "<p>These technical solutions arise from the industrial need for localizing Apps, but also work well with contents as long as the contents are authored in plain-text (e.g. LaTeX, markdown, yaml, etc.) or supported binary format (e.g. docx etc.).</p>",
        "id": 395390057,
        "sender_full_name": "Utensil Song",
        "timestamp": 1696666663
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span> <br>\nWe discussed this with our members and decided to translate MIL.<br>\nThe reasons are pretty much the same as what <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>  mentioned.<br>\nThat being said, we are also very excited about the new changes coming to MIL in the future!<br>\nI thank you again for your kind attention.</p>",
        "id": 396243715,
        "sender_full_name": "t-shibata",
        "timestamp": 1697100663
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"656978\">t-shibata</span> has marked this topic as resolved.</p>",
        "id": 396243737,
        "sender_full_name": "Notification Bot",
        "timestamp": 1697100672
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"656978\">@t-shibata</span> It will be an honor to have MIL in Japanese! Please let us know if there is anything we can do to help.</p>",
        "id": 396281305,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1697114980
    }
]