[
    {
        "content": "<p>I want to build a binary using a personal package (that depends on mathlib). Is there a way to link everything that it needs to run statically in the binary? In a way that I could run it on a machine that doesn't have Lean installed. I don't mind if the binary gets big.</p>",
        "id": 368048595,
        "sender_full_name": "Tomaz Gomes",
        "timestamp": 1687293395
    },
    {
        "content": "<p>I forgot to mention, I also import the <code>Lean</code> module and use some meta functions, as described in <a href=\"#narrow/stream/270676-lean4/topic/.E2.9C.94.20Running.20CoreM.20on.20a.20Binary\">this post</a></p>",
        "id": 368054903,
        "sender_full_name": "Tomaz Gomes",
        "timestamp": 1687295450
    },
    {
        "content": "<p>If you import Lean modules at run time, you have to ship those .olean files with your binary, there are no ways around that currently</p>",
        "id": 368058921,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1687296953
    },
    {
        "content": "<p>But apart from that, the compiler output should already be a mostly (as appropriate on each platform) static binary</p>",
        "id": 368059131,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1687297024
    },
    {
        "content": "<p>I'm sorry, could you elaborate on what you mean by \"ship those .olean files with my binary\"? I'm not sure how I could integrate those two things</p>",
        "id": 368073195,
        "sender_full_name": "Tomaz Gomes",
        "timestamp": 1687304108
    },
    {
        "content": "<p>the binary will, at run time, need to look up an .olean file somewhere on the file system</p>",
        "id": 368073974,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1687304602
    },
    {
        "content": "<p>so if you are building a standalone application then those oleans need to be provided alongside the executable</p>",
        "id": 368074009,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1687304637
    },
    {
        "content": "<p>Got it. I could specify a path in which the oleans are searched using the other argument of the <code>initSearchPath</code> function. But this function requires me to specify a path to lean, which won't be installed in my case, so I had to do <code>searchPathRef.set</code> directly, which seems to work. Thanks!</p>",
        "id": 368100605,
        "sender_full_name": "Tomaz Gomes",
        "timestamp": 1687318468
    },
    {
        "content": "<p>you will probably need the oleans in the lean install too, for the prelude etc</p>",
        "id": 368101272,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1687318911
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"360938\">Tomaz Gomes</span> has marked this topic as resolved.</p>",
        "id": 368343331,
        "sender_full_name": "Notification Bot",
        "timestamp": 1687375957
    }
]