[
    {
        "content": "<p>Hi all,</p>\n<p>I've been working to understand the backend of Lean4 and how it is built, in order to see if I can't work on doing side-channel analysis of Lean4. I was wondering, what is the initialize_Init function? I've tried looking for a function declaration, but I can't seem to find it, at least not initially. Is this generated in the later stages using CMake? I also think in the nightly builds its declaration is stored in the libleanshared .so file, and if it is, is there any way I can find out what else is in the .so file?</p>\n<p>If there is any additional information I need to provide, I'd be happy to help! Thanks!</p>",
        "id": 388186269,
        "sender_full_name": "Stone Olguin",
        "timestamp": 1693425548
    },
    {
        "content": "<p>It is a function that gets auto generated by the compiler to call the other initialization functions of the <code>Init</code> module and do other possible initialization work for <code>Init</code>. In general each Lean module will get an automatically generated <code>initialize_$MODULE</code> function to do setup work for the modules such as calling other module's initializers, setting up the values of extracted closed terms etc.</p>",
        "id": 388187465,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1693426015
    },
    {
        "content": "<p>You can find the function declaration itself in the stage0 directory</p>",
        "id": 388194467,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693429152
    },
    {
        "content": "<p>Thank you both so much! I was able to find it!</p>",
        "id": 388352770,
        "sender_full_name": "Stone Olguin",
        "timestamp": 1693496464
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306964\">Stone Olguin</span> has marked this topic as resolved.</p>",
        "id": 388352783,
        "sender_full_name": "Notification Bot",
        "timestamp": 1693496465
    }
]