[
    {
        "content": "<p>The <em><code>do</code> Unchained</em> paper describes the desugaring of <code>for</code> loops in terms of <code>forM</code>, but the Lean implementation itself has the somewhat more complicated <code>forIn</code> that serves the same role. It doesn't seem to me that <code>forIn</code> is more expressive - there is an adapter <code>ForM.forIn</code> that makes it easy to write a <code>ForIn</code> instance in terms of a <code>ForM</code> instance. That adapter is itself expressed in terms of <code>StateT</code> and <code>ExceptT</code>, akin to the translation given in the paper.  The <code>forIn</code> itself looks to me to be basically a version of the state-and-exception transformers, inlined and specialized.</p>\n<p>How should I think about this difference? Is the existence of <code>ForIn</code> due to efficiency concerns? Does it improve the linearity of the mutable variables, leading to more actual mutation? Should I think of the adapter as something suitable for quick prototyping, or more as something suitable for most production uses?</p>\n<p>Thanks!</p>",
        "id": 323574104,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1674676857
    },
    {
        "content": "<p>This is a delayed (low priority) refactor</p>",
        "id": 323574250,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1674676905
    },
    {
        "content": "<p>What should we expect the refactored version to be? Is <code>ForM</code> or <code>ForIn</code> the more sustainable choice?</p>",
        "id": 323574474,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1674676961
    },
    {
        "content": "<p><code>ForM</code> will be used in the next version of the <code>do</code> notation</p>",
        "id": 323574522,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1674676980
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 323574562,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1674676993
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"354934\">David Thrane Christiansen</span> has marked this topic as resolved.</p>",
        "id": 323574589,
        "sender_full_name": "Notification Bot",
        "timestamp": 1674677003
    }
]