[
    {
        "content": "<p>Hi,<br>\nI noticed Lean does not accept bold face Unicode characters (𝐀𝐁𝐂...𝐙) as identifiers. Hower, <a href=\"https://github.com/leanprover/vscode-lean4/blob/c5293e4f25527f1434d67c05dde35bc21dd649f2/lean4-unicode-input/src/abbreviations.json#L1392-L1704\">the unicode-input extension that ships with vscode-lean4 does</a>.<br>\nTurns out <a href=\"https://github.com/leanprover/lean4/blob/97d07a54a353cc467e34470ca5417243cf3f9d9f/src/util/name.cpp#L33-L40\">this function from lean4</a> could accept more characters.</p>\n<p>I think it would be nice if vscode-lean4 and lean4 regained consistency with respect to Unicode characters. There are two possibilities:</p>\n<ul>\n<li>Either <strong>extend the accepted Unicode range</strong> (my personal favorite)</li>\n<li>Or deprecate these characters from unicode-input (bummer but might make sense).</li>\n</ul>\n<p><strong>Proposal: extend the accepted Unicode range.</strong></p>\n<table>\n<thead>\n<tr>\n<th>characters</th>\n<th>current range</th>\n<th>proposed range</th>\n<th>reference</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Mathematical Alphanumeric Symbols</td>\n<td>1D49C--1D59F</td>\n<td>1D400-1D7ff</td>\n<td><a href=\"https://www.unicode.org/charts/PDF/U1D400.pdf\">https://www.unicode.org/charts/PDF/U1D400.pdf</a></td>\n</tr>\n<tr>\n<td>Greek and Coptic</td>\n<td>391-3A9\\{3A0;3A3}; 3B1-3C9\\{3BB}; 3CA-3FB</td>\n<td>370-3FF\\{3BB;3A0;3A3}</td>\n<td><a href=\"https://www.unicode.org/charts/PDF/U0370.pdf\">https://www.unicode.org/charts/PDF/U0370.pdf</a></td>\n</tr>\n<tr>\n<td>Greek Extended</td>\n<td>fully accepted</td>\n<td>nothing to change</td>\n<td><a href=\"https://www.unicode.org/charts/PDF/U1F00.pdf\">https://www.unicode.org/charts/PDF/U1F00.pdf</a></td>\n</tr>\n<tr>\n<td>Letterlike Symbols</td>\n<td>fully accepted</td>\n<td>nothing to change</td>\n<td><a href=\"https://www.unicode.org/charts/PDF/U2100.pdf\">https://www.unicode.org/charts/PDF/U2100.pdf</a></td>\n</tr>\n</tbody>\n</table>\n<p>(For _Greek and Coptic_, the excluded symbols are <code>3A0 Π</code>, <code>3A3 Σ</code>, and <code>3BB λ</code>.)</p>\n<p>Any thoughts? If (a subset of) these changes are acceptable I'll write a PR <span aria-label=\"rocket\" class=\"emoji emoji-1f680\" role=\"img\" title=\"rocket\">:rocket:</span></p>",
        "id": 492314583,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736258246
    },
    {
        "content": "<p>Why should <code>unicode-input</code> restrict itself to unicode characters that are legal in identifiers? Unicode characters are used for notation and docstrings too</p>",
        "id": 492315199,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1736258438
    },
    {
        "content": "<p>True, I forgot about that when I wrote.</p>",
        "id": 492315551,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736258553
    },
    {
        "content": "<p>Also maybe there's a way to \"register an identifier\" that I don't know of?</p>",
        "id": 492315710,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736258611
    },
    {
        "content": "<p>though the feeling that prompted me to write all this is that it's kind of frustrating to be able to input <code>\\bfA</code> and to have  a weird \"unexpected token\" error :/ hence just not allowing <code>\\bfA</code> would _technically_ get us rid of the issue.</p>",
        "id": 492316689,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736258977
    },
    {
        "content": "<p>I would expect <code>\\bfA</code> to be notation for something, rather than being used in its own right as part of an identifier. Even <code>ℕ</code> is an unexpected token, and this is used all over the place in mathlib (edit: this last sentence is incorrect, see below)</p>",
        "id": 492317863,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1736259403
    },
    {
        "content": "<p><code>ℕ</code> is actually accepted (it's <code>2115</code> in Letterlike Symbols).</p>\n<p>I'd say it makes sense to accept blackboard bold symbols, for instance you might want to be able to write about 𝕜-modules, and (𝔸, 𝔹)-bimodules (though I believe this does not fit in Mathlib's style).</p>",
        "id": 492319272,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736259924
    },
    {
        "content": "<p>I guess the reason why <code>ℕ</code> is a notation in Mathlib is that <code>Nat</code> is actually defined in Lean's standard library. Though <em>technically</em> it would be possible to rename <code>Nat</code> to <code>ℕ</code> (I wouldn't say it's a great idea to do so, too much of a breaking change).</p>",
        "id": 492320153,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736260202
    },
    {
        "content": "<p>I think, as noted above, you're just conflating tokens with tokens-allowed-in-identifiers. It's quite useful to be able to take a token which is not currently recognized by any parser and then turn it into notation for something. Not being about to easily type that token would just be painful, not helpful.</p>",
        "id": 492329231,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1736263029
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"385405\">Julien Marquet</span> <a href=\"#narrow/channel/270676-lean4/topic/Accept.20more.20Unicode.20in.20identifiers.3F/near/492319272\">said</a>:</p>\n<blockquote>\n<p><code>ℕ</code> is actually accepted (it's <code>2115</code> in Letterlike Symbols).</p>\n</blockquote>\n<p>Aah yes, apologies. I tried <code>def ℕ := 37</code> and got an error about tokens, but this was because I had mathlib already imported.</p>",
        "id": 492334072,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1736264346
    },
    {
        "content": "<p>Back to my original proposal: I guess I'll create an issue about it on GitHub, then PR this if it makes sense and hopefully it'll get merged :)</p>",
        "id": 492357750,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736272211
    },
    {
        "content": "<p>I'll let this topic live a little more before creating an issue, in case someone comes with more feedback</p>",
        "id": 492357977,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736272312
    },
    {
        "content": "<p>It's still not clear to me <em>why</em> you want to enable these extra characters in identifiers? (I'm not necessarily arguing against it, but I don't see an explicit reason for it.)</p>",
        "id": 492360068,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1736273045
    },
    {
        "content": "<p>In the interest of keeping related requests together, could you add your request to <a href=\"https://github.com/leanprover/lean4/pull/3330\">lean4#3330</a> instead of creating a new issue? Also, as Jireh mentions, it's much more likely that your propsal is accepted if you have a real use case where your proposed change is required. Also note that we won't merge any PRs until the corresponding RFC is accepted, so it's best to not invest any time into a PR until the RFC is accepted.</p>",
        "id": 492369458,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1736276708
    },
    {
        "content": "<p>My suggestion is still to start with one of the recommendations from <a href=\"https://www.unicode.org/reports/tr31/\">UAX#31</a> for what Unicode characters should be allowed in identifiers in programming languages, then add whatever currently accepted characters are needed for compatibility with existing code and remove whatever currently rejected characters break existing code if allowed in identifiers.</p>",
        "id": 492388222,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1736284307
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197836\">Jireh Loreaux</span> <a href=\"#narrow/channel/270676-lean4/topic/Accept.20more.20Unicode.20in.20identifiers.3F/near/492360068\">said</a>:</p>\n<blockquote>\n<p>It's still not clear to me <em>why</em> you want to enable these extra characters in identifiers? (I'm not necessarily arguing against it, but I don't see an explicit reason for it.)</p>\n</blockquote>\n<p>The _original_ reason is that I want to be able to use bold letters in identifiers for a project of mine. This is reason enough for me, but clearly that's not enough for a RFC.</p>\n<p>The first thing is that the change has <em>no negative impact</em>:</p>\n<ul>\n<li>It's cheap enough: it only touches 5 lines of Lean's source (that's a really small PR!), and performance-wise it even yields <em>an improvement</em>.</li>\n<li>It won't break anything (I can't think of a case where code relies on Lean <em>not</em> accepting <code>𝐀</code> in identifiers)</li>\n</ul>\n<p>It benefits some users:</p>\n<ul>\n<li>\n<p>As pointed out by <span class=\"user-mention\" data-user-id=\"260921\">@Markus Himmel</span>, <a href=\"https://github.com/leanprover/lean4/pull/3330\">lean4#3330</a> and <a href=\"#narrow/stream/270676-lean4/topic/.E2.9C.94.20.E2.B1.BC.20.28U.2B2C7C.29.20in.20identifiers\">the accompanying Zulip thread</a> received some positive feedback.<br>\nNote: <code>ⱼ</code> wouldn't be accepted in an identifier with the changes I propose.</p>\n</li>\n<li>\n<p><span class=\"user-mention\" data-user-id=\"266253\">@Joseph Myers</span>'s remark also brings another argument: it would bring us closer to the Unicode standard.</p>\n</li>\n</ul>\n<p>So I guess the rationale is: it's a <em>small change</em> that has <em>not downsides</em> and <em>positively affects some users</em>. The benefit is small, but the cost is none in performance and small in terms of labor. In the end, the question to me is \"why refuse this change?\" rather than \"why do it\"?</p>",
        "id": 492473875,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736331633
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"266253\">Joseph Myers</span> <a href=\"#narrow/channel/270676-lean4/topic/Accept.20more.20Unicode.20in.20identifiers.3F/near/492388222\">said</a>:</p>\n<blockquote>\n<p>My suggestion is still to start with one of the recommendations from <a href=\"https://www.unicode.org/reports/tr31/\">UAX#31</a> for what Unicode characters should be allowed in identifiers in programming languages, then add whatever currently accepted characters are needed for compatibility with existing code and remove whatever currently rejected characters break existing code if allowed in identifiers.</p>\n</blockquote>\n<p>This is very relevant, thanks!</p>\n<p>Another option would be to <em>make Lean comply with <a href=\"https://www.unicode.org/reports/tr31/\">UAX#31</a></em>.<br>\nImplementing <a href=\"https://www.unicode.org/reports/tr31/\">UAX#31</a> isn't trivial, but it would make for a better RFC. I guess it's possible to implement it <em>without negative impact on performance</em>, but I'd have to actually write the code to be sure. Fortunately, the changes would be small (if I'm right saying that the only place that needs changes is <a href=\"https://github.com/leanprover/lean4/blob/97d07a54a353cc467e34470ca5417243cf3f9d9f/src/util/name.cpp#L33-L40\">here</a>). There is a slightly nontrivial issue: currently, Lean identifiers are <code>&lt;Start&gt; &lt;Continue&gt;*</code> but would ideally need to be <code>&lt;Start&gt; &lt;Continue&gt;* (&lt;Medial&gt; &lt;Continue&gt;+)*</code>. The standard would accept <code>&lt;Medial&gt; = {}</code> though.</p>",
        "id": 492473887,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736331640
    },
    {
        "content": "<p>So, two questions:</p>\n<ul>\n<li>Is my point convincing?</li>\n<li>What sould I RFC?<ul>\n<li>Either the original proposal</li>\n<li>Or compliance with <a href=\"https://www.unicode.org/reports/tr31/\">UAX#31</a></li>\n</ul>\n</li>\n</ul>",
        "id": 492474543,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736331849
    },
    {
        "content": "<p>I don't think that just because something is written in a document, it's necessarily better, especially for somewhat unconventional parsing setups that have different tradeoffs than might otherwise be seen. I won't tell you whether to write up a <a href=\"https://github.com/leanprover-community/UAX/pull/31\">UAX#31</a>-based proposal or  one not based on that, because I think part of the job of the person writing the proposal is to evaluate the alternatives and explain why they picked the one they did.</p>\n<p>The inability to use <code>mængde</code> (Danish for \"set\") as an identifier is unfortunate, as is the lack of subscript-<code>j</code>. One limiting factor right now is that we don't have a representation of Unicode tables in the compiler, which would make it easy to say \"all letters are allowed\". I think there's clearly room to expand the set of identifiers.</p>\n<p>Some things I'd like to see in a proposal are:</p>\n<ul>\n<li>a set of rules that are easy to explain and don't feel too arbitrary</li>\n<li>reasonable performance</li>\n<li>backwards compatibility</li>\n</ul>\n<p>It'd also be good to consider the issue of RTL scripts (e.g. Arabic, Hebrew), lookalike characters (Cyrillic <a href=\"https://en.wikipedia.org/wiki/Es_(Cyrillic)\"><code>С</code></a> vs Latin <code>C</code>, Ossetian <a href=\"https://en.wikipedia.org/wiki/%D3%94_(Cyrillic)\"><code>Ӕ</code></a> vs Latin <a href=\"https://en.m.wikipedia.org/wiki/%C3%86\"><code>Æ</code></a>) and whether any special considerations are needed. If you propose something like <a href=\"https://github.com/leanprover-community/UAX/pull/31\">UAX#31</a>, then should we also accept full-width question mark characters to accommodate identifiers written in Chinese or Japanese? And what about Unicode normalization and character comparison? It's fine to punt on an issue and say \"this RFC doesn't fix this particular subproblem\", but it's good to be upfront about that and consider the impact. It's also OK to say \"In the idea world, we'd do thing X with Unicode - for now, we're doing approximation Y that delivers much of the benefit and can later be expanded\".</p>\n<p>As far as your point: I don't find arguments like \"why refuse this change?\" to be particularly convincing. And every change has negative impact, if only by taking mental bandwidth from other tasks. The point of the RFC is to put together a good case for your change, and let interested parties review it. If the case is easy, so much the better! But the highly polemic rhetoric is not convincing, just exhausting.</p>",
        "id": 492477925,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1736333074
    },
    {
        "content": "<p>Normalization forms are discussed in <a href=\"https://www.unicode.org/reports/tr31/\">UAX#31</a> (section 5). For confusables, see <a href=\"https://www.unicode.org/reports/tr39/\">UTS#39</a> - but since we make heavy, deliberate use of confusable characters in mathlib (not in identifiers), I doubt we want Lean to exclude them.</p>",
        "id": 492501300,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1736341755
    },
    {
        "content": "<p>Great! But an RFC that starts with \"Go read and internalize this big ol' document\" is not one that's likely to be acted much upon, because now the cost of the change has gone up greatly. It's good to base the work on what others have done, and cite the sources along the way, but there's got to be some digestion and presentation of it as well.</p>",
        "id": 492502580,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1736342164
    },
    {
        "content": "<p>I found <a href=\"https://github.com/leanprover/lean4/commit/1538615e8c20ec2cf2932e2324fdf067a853b237\">the commit that initially enabled math characters</a>. I don't really know what the rationale was for this change (especially, why allow only <code>Latin letters, Script, Double-struck, Fractur</code>?). I guess extending the accepted characters to the full <a href=\"https://www.unicode.org/charts/PDF/U1D400.pdf\">Mathematical Alphanumeric Symbols</a> block could be considered as <em>more a fix than a new feature</em>.</p>\n<p>So what I'm going to do is</p>\n<ul>\n<li>Propose to <em>fix</em> the issue that not all alphabetic mathematical symbols are accepted.<ul>\n<li>This makes sense because it's in the spirit of the original commit that added mathematical alphanumeric characters. It looks to me like there was no reason to restrict the symbols to latin, script, double-struck and Fraktur. It also seems to me like it's in the spirit of this same commit to accept the whole Greek and Coptic table.</li>\n<li>This seems reasonable as <em>it changes nothing at the granularity of Unicode character sets</em>.</li>\n<li>This only adds \"non-exotic\" characters, which, from the looks of this discussion, I believe isn't concerning for anyone.</li>\n</ul>\n</li>\n<li>Open a RFC on whether Lean should comply with <a href=\"https://www.unicode.org/reports/tr31/\">UAX#31</a>. I honestly have no strong opinion on whether this should be done, nor how it should be done. I guess a RFC is would be the right place to discuss the technicalities that were pointed out here.<ul>\n<li>A baseline would be to accept <a href=\"https://www.unicode.org/reports/tr31/#Table_Recommended_Scripts\">recommended scripts</a> as defined by the Unicode Standard. (By the way, Section 2.4 <a href=\"https://www.unicode.org/reports/tr31/#Specific_Character_Adjustments\">Specific Character Adjustments</a> of <a href=\"https://github.com/leanprover-community/UAX/pull/31\">UAX#31</a> already covers much ground on what characters to exclude because of security issues and/or limited use in practice).</li>\n<li>The implementation may be non-trivial: depending on the complexity of the logic, this could cause a performance hit if not done cleverly enough.</li>\n</ul>\n</li>\n</ul>\n<p>In short, a bug report + a PR that fixes it, to add \"reasonable\" characters, and a RFC for more difficult questions.</p>",
        "id": 492533263,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736351656
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260921\">@Markus Himmel</span>  The issue of subscript characters is a bit complicated: these characters aren't defined in a coherent manner in Unicode, parts of the alphabet belong to different Unicode blocks. Plus, should capital subscripts be included? And superscripts?<br>\nMaybe the reasonable answer is to split in</p>\n<ul>\n<li>add <code>ⱼ</code> as part of the issue+fix (along with the rest of the lowercase alphabet if need be).<ul>\n<li>Once again, this is in line with the spirit of <a href=\"https://github.com/leanprover/lean4/commit/426f1afb4e3a9b3d54cdb5a36249736c156249b1\">a previous commit</a></li>\n</ul>\n</li>\n<li>discuss the issue of the rest of the subscripts/superscripts in the RFC.<ul>\n<li>This means the Unicode RFC would also cover <a href=\"https://github.com/leanprover/lean4/pull/3330\">lean4#3330</a></li>\n</ul>\n</li>\n</ul>",
        "id": 492535813,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736352418
    },
    {
        "content": "<p>The commit you linked states in the commit message and the changelog that it adds the Script, Double-struck, and Fractur blocks, and that is exactly what it does. There is nothing to \"fix\". It is reasonable to want to be able to use additional characters in identifiers, but the way to get there is to add a convincing comment to <a href=\"https://github.com/leanprover/lean4/pull/3330\">lean4#3330</a> that makes a clear suggestion and argues why it is a good idea, and then to be patient until the FRO accepts the RFC. Opening a bug ticket and a PR will not accelerate the process.</p>",
        "id": 492538575,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1736353350
    },
    {
        "content": "<p>Yeah, true. What I have in mind is that there are really two different topics: that of coherence of the current behavior, and that of complying with the Unicode standard. I believe this separation of issues is relevant. Also, the \"small\" issue is easy to review (and pretty uncontroversial, I think), while the \"big\" one isn't at all.</p>\n<p>That's why I think it's relevant to separate in two RFCs/issues.</p>",
        "id": 492541568,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736354352
    },
    {
        "content": "<p>Also, the changes I propose go further than <a href=\"https://github.com/leanprover/lean4/pull/3330\">lean4#3330</a>. Do you think I should still plug my contributions on this RFC? The upside is that it already exists and already has received some positive feedback.</p>",
        "id": 492542289,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736354581
    },
    {
        "content": "<p><a href=\"https://github.com/thejohncrafter/lean4/commit/3118dbf3acc02bdb88e1e2c8f1d3e6600b9e0938\">Here's what the changes I originally proposed would look like.</a></p>",
        "id": 492543788,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736354891
    },
    {
        "content": "<p>I don't think anyone is really questioning whether the change is simple; the challenge is \"how do we end up with consensus on which set of characters are the ones lean should allow in identifiers\".</p>",
        "id": 492545233,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1736355143
    },
    {
        "content": "<p>Did you check the rest of the repository <span class=\"user-mention\" data-user-id=\"385405\">@Julien Marquet</span> for these ranges? <code>Lean.isLetterLike</code> needs to be kept in sync too. There's also checking with existing editor extensions to see if they need any modification. You mentioned that it's just a ~five line change, but that's optimistic. There's also documentation in <code>doc/lexical_structure.md</code>.</p>",
        "id": 492558150,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1736359255
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> I made the mistaken assumption that <a href=\"https://github.com/leanprover/lean4/blob/97d07a54a353cc467e34470ca5417243cf3f9d9f/src/util/name.cpp#L33\">is_letter_like</a> was the only place that governed this based on the commit history. Thanks for pointing that out.</p>",
        "id": 492559008,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736359595
    },
    {
        "content": "<p>The basic idea of my proposal is: since Unicode experts have already thought about characters in identifiers and written up their conclusions, delegating as far as possible to those experts (with only those changes needed to work with existing practice in Lean and mathlib) seems like a good idea to avoid needing to try to reach consensus separately on lots of separate character groups.</p>",
        "id": 492615900,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1736388353
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"266253\">@Joseph Myers</span> Makes sense. The discussion then becomes about what <em>profile</em> to implement from <a href=\"https://www.unicode.org/reports/tr31/\">UAX#31</a>.</p>\n<blockquote>\n<p>The formulations allow for extensions, also known as <em>profiles</em>. That is, the particular set of code points or sequences of code points for each category used by the syntax can be customized according to the requirements of the environment.</p>\n</blockquote>\n<p>There's even already the  <a href=\"https://www.unicode.org/reports/tr31/#Mathematical_Compatibility_Notation_Profile\">Mathematical Compatibility Notation Profile</a> in the standard.</p>",
        "id": 492689281,
        "sender_full_name": "Julien Marquet-Wagner",
        "timestamp": 1736419475
    },
    {
        "content": "<p>Lean should allow other natural languages in identifiers, like Korean. It would help for more multilingual use case, is more inclusive, and is unlikely to cause real problems in practice.</p>\n<p>Lean should allow mathematical italic variants of letters. Just as it is common in literature to use Greek symbols, it's also common to use italicized versions of letters.</p>",
        "id": 573806758,
        "sender_full_name": "Marvin",
        "timestamp": 1771007365
    },
    {
        "content": "<p>Won't notation do for this?</p>",
        "id": 573836430,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1771021056
    },
    {
        "content": "<p>i doubt it, i imagine you might want to be able to write any variable using a different alphabet, and currently i think that means you need to write a <code>notation</code> command for every name you intend to use...</p>",
        "id": 573836866,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1771021325
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/270676-lean4/topic/Accept.20more.20Unicode.20in.20identifiers.3F/near/573836430\">said</a>:</p>\n<blockquote>\n<p>Won't notation do for this?</p>\n</blockquote>\n<p>I still am unclear on the reasoning behind the distinction between allowing symbols in an identifier vs allowing symbols in a notation string. Why would we want to restrict Korean to only the notation workaround?</p>",
        "id": 573866729,
        "sender_full_name": "Marvin",
        "timestamp": 1771046445
    },
    {
        "content": "<p>Also:<br>\n<a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general/topic/Emoji.20as.20variable.20names/with/523545016\">#general &gt; Emoji as variable names</a></p>\n<p>I don't think emoji is just a quirk. I find them genuinely useful. I'd love to have variable names look as different from other code as possible.</p>",
        "id": 573896042,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1771074145
    },
    {
        "content": "<p>I'm in favor of allowing using scripts from Table 5. <a href=\"https://www.unicode.org/reports/tr31/#Table_Recommended_Scripts\">Recommended Scripts</a></p>\n<p>that's allow have better pedagogical representation of the Lean, since you can have identifiers in your language. If supporting all these symbols are too much, then maybe it can be taken as principled stance to support them, and implement only these characters which people care right now and by these persons who can have meaningful conversatoin about language, and give examples just in case.</p>\n<p>For example, I can have conversation about hypotetical errors in Cyrillic/Russian/Ukrainian/Kazakh but not for other languages. Somebody else know Korean and can validate that his language is supported etc.</p>",
        "id": 576039827,
        "sender_full_name": "Andrii Kurdiumov",
        "timestamp": 1772116531
    },
    {
        "content": "<p>The main blocker to this is of technical nature as I have explained <a href=\"https://github.com/leanprover/lean4/pull/10139#issuecomment-3225013045\">here</a>. I do hope that I will get around to fixing this technical blocker this or next week (pure coincidence actually :D). Hopefully after these changes are through we can move forward with the XID proposal which should cover most of if not all the needs voiced in this channel</p>",
        "id": 576053045,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1772119646
    },
    {
        "content": "<p>It's also my understanding that implementing XID itself should be quite easy once we have the Array literal issue solved. At least looking at the  responsible Rust crate: <a href=\"https://github.com/unicode-rs/unicode-xid/blob/master/src/tables.rs\">https://github.com/unicode-rs/unicode-xid/blob/master/src/tables.rs</a> there is just a table that you have and then you binary search over the table and that's it.</p>",
        "id": 576054007,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1772119865
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"395550\">Henrik Böving</span> <a href=\"#narrow/channel/270676-lean4/topic/Accept.20more.20Unicode.20in.20identifiers.3F/near/576053045\">said</a>:</p>\n<blockquote>\n<p>The main blocker to this is of technical nature as I have explained <a href=\"https://github.com/leanprover/lean4/pull/10139#issuecomment-3225013045\">here</a>. I do hope that I will get around to fixing this technical blocker this or next week (pure coincidence actually :D).</p>\n</blockquote>\n<p>Do you mean that you plan on fixing the static data issue before the next release?</p>",
        "id": 576055701,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1772120274
    },
    {
        "content": "<p>In general 70% of the extracted closed terms are statically initialized data in the binary since a while. The remaining issue is specifically with <code>Array</code> (or <code>ByteArray</code>) literals as they require a more involved kind of handling.</p>",
        "id": 576056977,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1772120562
    },
    {
        "content": "<p>(for reference I did that <a href=\"https://github.com/leanprover/lean4/pull/12082\">here</a>)</p>",
        "id": 576067430,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1772122963
    },
    {
        "content": "<p>I'm looking forward to the <code>Array</code> and <code>ByteArray</code> part!</p>",
        "id": 576075652,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1772124927
    }
]