[
    {
        "content": "<p><a href=\"https://github.com/leanprover/lean4/pull/10307\">lean4#10307</a> restricts the previously monad-polymorphic API for adding docstrings, which worked in <code>AttrM</code>, to <code>TermElabM</code>. This causes issues for attributes like <code>@[to_additive /-- example docstring -/]</code>, which allow specifying docstrings for generated declarations, and need a way to attach them to declarations within <code>abbrev AttrM := CoreM</code>.</p>\n<p>How should docstrings be added to generated declarations from within attributes? To put some possibilities out there, I can think of three ways, depending on the details of verso docstring parsing/elaboration and future plans:</p>\n<ol>\n<li>Make <code>addMarkdownDocString</code> monad-polymorphic such that it works in <code>CoreM</code>. However, this runs the risk of adding verso-styled docstrings <em>as</em> markdown docstrings incorrectly; so, is there a quick way to check if a docstring is intended to be \"verso-style\" (i.e. without actually elaborating it)? If so, some version of <code>addMarkdownDocString</code> could log an error on verso-style <code>docComment</code>s. (But this is only relevant if <code>addMarkdownDocString</code> will be staying around.)</li>\n<li>Just <code>runTermElabM</code> in <code>CoreM</code> to elaborate the docstring. But when is it safe to do this? What parts of the ambient <code>TermElabM</code> state might verso docstrings depend on, and when might its absence cause unexpected behavior?</li>\n<li>A more complex change: allow attributes to optionally access the <code>TermElabM</code> state. This would require some thought, but could mean equipping <code>AttrM</code> with a readable value of e.g. type <code>Option Term.State</code> (etc.) which would be passed when called from a high enough monad (and, maybe, only if the attribute opted-in to receiving it via some flag). Not sure if this would be a problem for performance or parallelism somehow, though. (I'm only suggesting this because I can imagine it being more generally useful; other attributes might want to process their syntax in <code>TermElabM</code> too.)</li>\n</ol>",
        "id": 538985868,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1757655533
    },
    {
        "content": "<p>Thanks for checking!</p>\n<p>I'll see what I can do to make this work polymorphically again, and failing that, provide an <code>AttrM</code> wrapper that makes sure the state is set up as it should be.</p>\n<p>The way to check if a docstring should be Verso is to check the value of the option <code>doc.verso</code>. You should take a bit of care - when docstrings are processed separately (e.g. delayed by some other process), the value of the option should be saved with them, so that it's truly the value at the time the docstring is encountered that is used.</p>",
        "id": 538991010,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1757658701
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover/lean4/pull/10357\">https://github.com/leanprover/lean4/pull/10357</a> makes the Markdown docstring API monad-polymorphic again. It's not the right long-term solution, but it will fix the short-term adaptation hassle.</p>",
        "id": 538993243,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1757659796
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"354934\">David Thrane Christiansen</span> <a href=\"#narrow/channel/270676-lean4/topic/Adding.20docstrings.20from.20within.20attributes.20after.20lean4.2310307/near/538991010\">said</a>:</p>\n<blockquote>\n<p>The way to check if a docstring should be Verso is to check the value of the option <code>doc.verso</code>.</p>\n</blockquote>\n<p>Ah, I think I see; so the responsibility is with the docstring writer to ensure <code>doc.verso</code> is <code>true</code> when they want to use verso syntax, right?</p>\n<p>Do you think there's an easy way to tell if a docstring \"would be fine\" if included as a markdown docstring even when <code>doc.verso</code> is true (i.e. to easily detect that it has no special verso syntax)? (Or should we not take that approach anyway, for other reasons, e.g. a docstring is unlikely to work as both markdown and verso/etc.?)</p>",
        "id": 539168815,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1757714533
    }
]