[
    {
        "content": "<p>I want to experiment with making some changes to lean4 (just locally on my machine). I followed the instructions on the reference guide: I built forked and cloned the repo, built from source, set elan to use stage0 in <code>src</code>, etc. When I open <code>src</code> in vscode, everything seems to work as expected. But if I change something in one file, say <code>A.lean</code>, I can’t get the changes to be reflected in any other file in <code>src</code> which imports <code>A.lean</code>. I’ve tried restarting the server, and even restarting the editor. Is there a step I’m missing here?</p>",
        "id": 398366355,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1698184675
    },
    {
        "content": "<p>Unless I am misunderstanding, that is how it's supposed to work: <code>src</code> is built using stage0, whose entire sources are the C files committed to <code>stage0/</code>. Your changes to <code>A.lean</code> under <code>src/</code> only affect stage1. If they affected stage0 automatically, your Lean would be broken most of the time while working on <code>src/</code> (speaking from experience here).</p>",
        "id": 398366764,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1698184877
    },
    {
        "content": "<p>One way to test the changes is to open a folder that does use stage1, e.g. the <code>tests/</code> directory.</p>",
        "id": 398366791,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1698184900
    },
    {
        "content": "<p>I am talking about the compiler itself here. Changes to modules such as adding new definitions <em>should</em> be visible when working on <code>src/</code> using stage0, afaict.</p>",
        "id": 398366919,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1698184956
    },
    {
        "content": "<p>Running <code>make -C build/release/stage1</code> (or similar, I'm on mobile) might help updating the <code>A.olean</code> so that the other file sees the changes (of course they won't affect the compiler you are developing with, but I didn't think that's what you mean)</p>",
        "id": 398367124,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1698185082
    },
    {
        "content": "<p>I changed a definition in a lean file from <code>src</code>, and I’m trying to see the change in another file that imports it, also in <code>src</code>. So do I understand correctly that it should just work?</p>",
        "id": 398367604,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1698185348
    },
    {
        "content": "<p>No, \"refresh file dependencies\" inside lean core is spelled <code>cd build/release; make</code></p>",
        "id": 398367846,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1698185507
    },
    {
        "content": "<p>Aha ok</p>",
        "id": 398368955,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1698186171
    },
    {
        "content": "<p>Thanks Mario. that works!</p>",
        "id": 398369539,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1698186539
    }
]