[
    {
        "content": "<p>I have this draft PR, <a href=\"https://github.com/leanprover/lean4/pull/12166\">lean4#12166</a>. I think this makes a genuine improvement to Core in that it removes an unecessary dependence of a key theorem characterising <code>List.Pairwise</code> that then naturally allows for some missing (arguably, existent downstream) theorems about <code>List.Nodup</code>.</p>\n<p>However I am consious that standards for core are very high and I don't want to just submit this and hope it is good enough for maintainers to seriously review. I was wondering if I can get some advice on if there are any obvious pitfalls that I ought to avoid, or simple improvements I can make?</p>",
        "id": 570309511,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1769517584
    },
    {
        "content": "<p>If you've read through <a href=\"https://github.com/leanprover/lean4/blob/master/doc/std/style.md\">https://github.com/leanprover/lean4/blob/master/doc/std/style.md</a> and <a href=\"https://github.com/leanprover/lean4/blob/master/doc/std/naming.md\">https://github.com/leanprover/lean4/blob/master/doc/std/naming.md</a>, don't be afraid to mark your PR as ready for review. The kinds of standard library PRs that are least likely to be accepted are those that increase the maintenance burden or that include significant design work that hasn't been cleared with a maintainer beforehand, but from a quick look your PR just seems to add a bunch of lemmas which are clearly desirable, so I'm looking forward to merging it.</p>",
        "id": 570312106,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1769518361
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260921\">@Markus Himmel</span> Thank you. Having given them a re-read, and also made some improvements (unrelated), I have opened it for review.</p>",
        "id": 570325916,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1769521995
    }
]