[
    {
        "content": "<p>Hello.</p>\n<p>I want to translate the internal of a C++ program into a modelisation of a studiable proof demonstration in order to make a thesis. I checked out frama-c. It is good but does not work with C++.</p>\n<p>I checked out the tool z3 and according to this line, it seems it could be used as a wrapper to test values:  <a href=\"https://github.com/Z3Prover/z3/blob/master/examples/c%2B%2B/example.cpp#L32\">https://github.com/Z3Prover/z3/blob/master/examples/c%2B%2B/example.cpp#L32</a> . It is not as perfect as frama-ci but it works for c++.</p>\n<p>I am wondering if you knew a tool that could set annotation upon C++ function like C++17 with a good support please? Might it be possible with lean please? </p>\n<p>Best regards.</p>",
        "id": 518803511,
        "sender_full_name": "D.E",
        "timestamp": 1747475129
    },
    {
        "content": "<p>I can't help you with C++, but I can recommend <a href=\"https://github.com/creusot-rs/creusot\">Creusot</a> and <a href=\"https://github.com/verifast/verifast\">VeriFast</a> for verifying Rust code. There's also RefinedRust and in the future there will be also Gillan-Rust for <a href=\"https://arxiv.org/abs/2403.15122\">hybrid safe/unsafe verification</a> of Rust code.</p>\n<p>Maybe rewriting it in Rust is not a bad idea after all.</p>",
        "id": 518834694,
        "sender_full_name": "suhr",
        "timestamp": 1747500326
    },
    {
        "content": "<blockquote>\n<p>I want to translate the internal of a C++ program into a modelisation</p>\n</blockquote>\n<p>Wait, do you want to verify a C++ program or you want to analyze it yourself in some way?</p>",
        "id": 518835100,
        "sender_full_name": "suhr",
        "timestamp": 1747500709
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"394485\">@suhr</span> </p>\n<p>The verifast devs disrecommend me the tool for C++ as not fully supported for each C++ version. creusot seems to be pure rust as verus.</p>\n<p>I still hesistate between verifast and z3 wrapper to wrap my function manually.  Thank you very much for your help. I really need to choose between these 2 tools.</p>",
        "id": 518850011,
        "sender_full_name": "D.E",
        "timestamp": 1747511795
    },
    {
        "content": "<p>Note, this is a zulip instance for the Lean theorem prover, which is not really related to either of those tools and is solving a different kind of problem. Probably you would be best served asking this question elsewhere.</p>",
        "id": 519365505,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1747742251
    },
    {
        "content": "<blockquote>\n<p>Might it be possible with lean please?</p>\n</blockquote>\n<p>No, lean does not do anything about C++ formal verification. You could in principle build such a tool but it would be a multi-year project.</p>",
        "id": 519365709,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1747742304
    }
]