[
    {
        "content": "<p>I have started formalizing Algebraic Weak Factorization Systems (AWFS) in Lean.  So far I have done some basic stuff in <code>Lean3</code> taking advantage of the category theory library there. Unfortunately, I have not followed how much category theory there is in <code>Lean4</code>, where can I find about this? Does it make sense to directly formalize AWFS directly in <code>Lean4</code>? I need adjunctions, mondas, and comondas, algebras and coalgebras, double categories, and limit/colimit stuff. Most of these exist in Lean3, but i was wondering if a good portion of these exist in Lean4, it might make more sense to use Lean4 (which I like more).</p>",
        "id": 344061642,
        "sender_full_name": "Sina",
        "timestamp": 1679594478
    },
    {
        "content": "<p>You can see which parts of category theory have been ported to Lean 4 on this website: <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/CategoryTheory/Arrow.html\">https://leanprover-community.github.io/mathlib4_docs/Mathlib/CategoryTheory/Arrow.html</a></p>",
        "id": 344064296,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1679595109
    },
    {
        "content": "<p>Note that Mathlib is currently being ported to Lean 4, so sooner or later all the definitions you've used in Lean 3 will be available in Lean 4.</p>",
        "id": 344064735,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1679595228
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib-port-status\">#port-dashboard</a> can also show you how far away currently-unavailable things are</p>",
        "id": 344065339,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1679595397
    },
    {
        "content": "<p>From your list, I would guess it is mostly ported. The sooner people come over to the light side, the better. :-)</p>",
        "id": 344120690,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1679613357
    }
]