[
    {
        "content": "<p>Just wondering if there are plans to support popcount and/or parity for BitVec. They are not essential but they are common enough to even get hardware support on some architectures.</p>",
        "id": 494655684,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1737303964
    },
    {
        "content": "<p>Currently the <code>BitVec</code> API is modelled almost 1:1 after what is found in SMTLIB (which does notably not have a popcount/parity notion afaik). That being said I believe having an RFC that proposes the inclusion of these functions would be sensible, here are a bunch of things to consider:</p>\n<ul>\n<li>should they be defined in terms of other <code>BitVec</code> operations or, like most other current functionality, in terms of the <code>toNat</code>/<code>toInt</code> semantics?</li>\n<li>what about signed/unsigned versions? Does the distinction exists practically or does everyone just assume unsigned?</li>\n<li>should we pull them through to <code>UIntX</code>/<code>IntX</code>? Potentially along with an efficient C implementation?</li>\n<li>\n<p>We need to support them in <code>bv_decide</code>, this can mean two things:</p>\n<ul>\n<li>providing lemmas that reduce them to already exists <code>BitVec</code> operations</li>\n<li>providing lemmas that describe efficient circuits that we can implement in <code>bv_decide</code><br>\nIn particular we can of course also go two steps here, first providing unfolding lemmas and then at a later point integrate with more optimized circuits into <code>bv_decide</code>.</li>\n</ul>\n</li>\n<li>\n<p>How do they interact with the rest of the <code>BitVec</code> API? Do we want e.g. lemmas about what happens when you <code>|||</code> when you <code>&amp;&amp;&amp;</code> when you <code>+</code>?</p>\n</li>\n</ul>",
        "id": 494656031,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1737304222
    },
    {
        "content": "<p>Thanks! Before I'm ready to PR to core, I'll incubate in Batteries and answer these questions there.</p>",
        "id": 494658604,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1737306210
    }
]