[
    {
        "content": "<p>disclaimer: I am by no means an lean4 expert, and this brief is not for experts, just a doc I wished to see 2 weeks ago. I spent some time reading code in lean4 core and want to write sth for google to index. </p>\n<h2>a dive into lean4 core (lean-prover/lean4)</h2>\n<p>the core 2 things: type-dependent arrow (-&gt;) and inductive type</p>\n<p>set up a working environment and make a full build of the codebase. so hints and links can be conveniently accessed. <code>lake exe cache get</code> can usually save compile time.</p>\n<p>everything ending with M is a <code>monad</code>, or <code>state</code>, to keep track of stuff and allow ordinary programming in a purely functional language.</p>\n<p>the 1st file in the hierarchy is init/prelude.lean</p>\n<p>if you find code hard to read, Sebastian Ulrich's papers is worth a read.</p>\n<p>Universe level (Sort _) is used for nearly technical purposes. can skip unless main usecase is category theory.</p>\n<h2>structure of codebase</h2>\n<p>start reading <code>src/Elab</code>. it <code>elaborates</code> the <code>syntax</code> into an <code>Expr</code>. a glimpse at Expr.lean can clear things.</p>\n<p>src/Compiler is purely for functional programming. everything up to theory verification is done in <code>Elab</code>. if you are mainly interested in this part, <code>ir_interpreter.cpp</code> is a standalone interpreter.</p>\n<p>a keyword first goes through parsing (<code>syntax</code>, which is almost reg expression), then assigned a function to <code>elab</code> it.</p>",
        "id": 532550432,
        "sender_full_name": "Ping J",
        "timestamp": 1754223044
    },
    {
        "content": "<p>Google doesn't index the Lean Zulip to the best of our knowledge</p>",
        "id": 532551293,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1754223737
    },
    {
        "content": "<p>And what you are writing is also partially wrong for example <code>lake exe cache get</code> doesn't work in core and <code>syntax</code> covers a much more powerful class of languages than regular expressions.</p>",
        "id": 532551443,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1754223864
    }
]