[
    {
        "content": "<p>I had a request to the creators, I used lean couple of months back and came back now to learn it better and write maths stuff with it. What I encountered was a problem I had before in my first attempt. </p>\n<p>lean in general is very hard to install. Not from a technical perspective rather from an user perspective. the installation process is all over the place and I am often confused what went wrong and what might be broken. VS Code installation module is amazing yet without the proper windows binaries, VS code installation does not work much. </p>\n<p>I have currently elan, lean etc installed yet can't seem to use it for a single bit. </p>\n<p>Complains: I don't mind having to install modules manually. I think most does not because anyone who wants to use lean have a relatively good technical background and obviously not starting out with programming. </p>\n<p>Second, if common issues with elan and updates are presented in a singular website that will be extremely helpful. I know the community is fantastic yet asking questions everytime is not the best way of resolving something. (if something is too simple)</p>\n<p>Third, could we get a single standalone lean guide. And a detail documentation like we receive with Python? Because I am extremely confused what to learn and what not because something seems to not work on my VS code setup yet works on the online lean editor. And there's so much tutorials and all were greatly different from each other. I am constantly struggling to keep up, rather than to learn and focus on my work, my productivity is low and I am trying to grasp what works anyways in the first place. </p>\n<p>Pointers: I understand those who maintain the language \"lean\" they have other important activities. Yet, I will highlight, lean is powerful and a great tool to do proof of mathematical concepts yet the tool is of no-use, if the basics can't be learnt Or known. </p>\n<p>Suggestions:</p>\n<ol>\n<li>Can we receive a simple install and uninstallation process for lean</li>\n<li>Standard errors be documented and listed in the official website</li>\n<li>A proper documentation about the modules of the language</li>\n<li>A good documentation about the libraries</li>\n<li>VS Code installation method be deprecated? </li>\n</ol>\n<p>I would be happy, if the authors take a look into the suggestions, looking forward what the community has to comment about this</p>",
        "id": 418418034,
        "sender_full_name": "TAWSIF AHMED",
        "timestamp": 1706362363
    },
    {
        "content": "<p>Take a look at the community pages <a href=\"https://leanprover-community.github.io/get_started.html\">here</a> and see if they're what you want.</p>",
        "id": 418425712,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1706369294
    },
    {
        "content": "<p>It would be helpful to describe more precisely what you read, what you tried, and what you saw as a result</p>",
        "id": 418430521,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1706373549
    }
]