[
    {
        "content": "<p>On my mac reviewing an FLT PR I ran into the following colour glitch which, for a nice change, I could reproduce:</p>\n<p><a href=\"/user_uploads/3121/Cr-pBeT3957DGTJIRt7vfIXh/colours.gif\">colours.gif</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/Cr-pBeT3957DGTJIRt7vfIXh/colours.gif\" title=\"colours.gif\"><img data-animated=\"true\" data-original-content-type=\"image/gif\" data-original-dimensions=\"720x465\" src=\"/user_uploads/thumbnail/3121/Cr-pBeT3957DGTJIRt7vfIXh/colours.gif/840x560-anim.webp\"></a></div><p>I restart the file in VS Code and <code>attribute</code> on line 266 goes from blue to yellow (while the orange bars are there) and back to blue (when they disappear). I occasionally see colour glitches but they're usually transient; this one I can reproduce on my mac laptop and ubuntu desktop (it's <a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/773\">FLT#773</a>, apologies if this is a known issue, I couldn't find anything like it in the open issues on <a href=\"https://github.com/leanprover/vscode-lean4\">https://github.com/leanprover/vscode-lean4</a> which I am assuming is the right place to report this if people want me to)</p>",
        "id": 561000263,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764510546
    },
    {
        "content": "<p>Isn’t it simply the usual thing that semantic syntax highlighting is more accurate than the crude approximation you get before the server is ready?</p>",
        "id": 561008917,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1764517145
    },
    {
        "content": "<p>Yeah along perhaps with that I think just because file progress is done for a section (i.e. orange bars go away) that doesn't mean token information has been sent for that section, that's a separate thing sent by Lean to the editor.</p>",
        "id": 561012720,
        "sender_full_name": "Julian Berman",
        "timestamp": 1764519941
    },
    {
        "content": "<p>Got it, thanks. I hadn't realised that syntax highlighting was that hard (i.e. that it was using the server at all).</p>",
        "id": 561015722,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764522461
    },
    {
        "content": "<p>Because of lean's syntax flexibility, the only thing that can really parse lean accurately is lean itself</p>",
        "id": 561016332,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1764523003
    },
    {
        "content": "<p>I see. I'd heard this phrase before but I hadn't realised that it went as far as colours.</p>",
        "id": 561018081,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764524566
    }
]