[
    {
        "content": "<p>Hi all! </p>\n<p>First, a motivation: Popular programming languages, such as C++ or Rust, use compilers to produce low-level intermediate representation of code, which is passed to LLVM and subsequently final assembly is produced. <br>\nWhile many local heuristic optimizations have been implemented over decades by experts, end-to-end optimization of code translation is only a recent topic, and typically limited in scope (ie optimize computational graphs of neural networks for GPUs)</p>\n<p>Here comes the connection to Lean: if you treat assembly operations as \"axioms\" in your logical system, and build language on top of them, you could use theorem proving to compile the code (ie take advantage of the  curry-howard isomorphism). Compilation can be than cast as theorem proving to axioms / assembly, and optimization is finding the shortest proof.</p>\n<p>However, the Lean core is implemented in C++, not Lean. Are there some projects that go in this direction that could help reformulate programs as theorems?</p>",
        "id": 519373178,
        "sender_full_name": "Michal Šustr",
        "timestamp": 1747744451
    },
    {
        "content": "<p>What do you mean by \"Lean core\"? From my understanding, the Lean compiler and standard library is written predominantly in Lean itself, with mainly the kernel and optimized representations of some types (e.g. Array) being written in C++.</p>",
        "id": 519423985,
        "sender_full_name": "Niels Voss",
        "timestamp": 1747757038
    },
    {
        "content": "<p>One small correction: the old/currently used compiler is indeed in C++ but there is a new compiler in the works that is written in Lean.</p>",
        "id": 519454113,
        "sender_full_name": "Robin Arnez",
        "timestamp": 1747767107
    },
    {
        "content": "<p>the old compiler is only half in C++, everything from the IR down to printing strings of C code is in lean</p>",
        "id": 519455070,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1747767447
    },
    {
        "content": "<blockquote>\n<p>everything from the IR down to printing strings of C code is in lean</p>\n</blockquote>\n<p>Very interesting, thanks!</p>\n<blockquote>\n<p>there is a new compiler in the works that is written in Lean.</p>\n</blockquote>\n<p>Is this for Lean 4, or would that be in a new version of the language?</p>",
        "id": 519535397,
        "sender_full_name": "fishooter",
        "timestamp": 1747810162
    },
    {
        "content": "<p>This is for lean 4.</p>",
        "id": 519538401,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747811391
    }
]