[
    {
        "content": "<p>In the new String API, what’s the most performant way to copy the substring between two positions in <code>s1 : String</code> onto the end of some <code>s2 : String</code>? (Here I mean the colloquial “substring”, not necessarily <code>Substring</code>.)</p>\n<p>Should I extract (copy) the slice from <code>s1</code> into its own string, then append to <code>s2</code>? Or should I iterate through positions of <code>s1</code> from the starting position to the final one and push the new characters onto <code>s2</code> one-by-one? (Or something else? Have I simply missed the API for this?)</p>\n<p>Note: my broader goal here is to apply a bunch of edits (defined by ranges of positions together with the new string that should replace that range) to create <code>s2</code> from the source <code>s1</code>, so I will still need access to <code>s1</code> after copying unmodified stretches over to <code>s2</code>. (I am open to completely different approaches to modifying multiple regions in <code>s1</code>, though.)</p>\n<p>I could just test, but I’d like to build some understanding of “why” if possible, which might be useful more generally. :)</p>\n<p>Thanks! :)</p>",
        "id": 558017723,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1763491735
    },
    {
        "content": "<p>In recent enough versions of Lean there is a <code>HAppend String String.Slice String</code> instance for this use case. Its implementation is currently not the best it could be, but it will be improved.</p>",
        "id": 558027938,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1763494956
    },
    {
        "content": "<p>Great! I'll rely on that, and let the performance improvements come when they come. <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 558029068,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1763495349
    }
]