[
    {
        "content": "<p>Hi everyone.</p>\n<p>Is it possible to have a common project on several computers?</p>\n<p>I want to work with a couple of collegues in the same project, so we would like to have a common project uploaded to Github in such a way that:</p>\n<ul>\n<li>When someone wants to work on it, should be able to upload the project in its computer without having to clone the whole project again every time some other person makes a change.</li>\n<li>Any change, by any member of the team can be uploaded to the same Github repository (from different computers, of course)</li>\n</ul>\n<p>Can this be done in some way?</p>\n<p>Thanks in advance.</p>",
        "id": 481720372,
        "sender_full_name": "Esteban Martínez Vañó",
        "timestamp": 1731331276
    },
    {
        "content": "<p>Isn't what you are describing exactly what <code>git</code> gets you?</p>",
        "id": 481720767,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1731331391
    },
    {
        "content": "<p>you can add collaborators/contributors to a github project, if that's what you mean...</p>",
        "id": 481720984,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1731331450
    },
    {
        "content": "<p>But, if someone else changes something in the project, how can I recover the changes with git in my own computer?</p>",
        "id": 481721051,
        "sender_full_name": "Esteban Martínez Vañó",
        "timestamp": 1731331480
    },
    {
        "content": "<p><code>git pull</code></p>",
        "id": 481721092,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1731331493
    },
    {
        "content": "<p>they create commits locally, <code>git push</code> them to the repo, you checkout the branch, and <code>git pull</code> them to your local version.</p>",
        "id": 481721389,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1731331567
    },
    {
        "content": "<p>If you're not so familiar with git maybe a git GUI client like Github Desktop might be sensible. If you want to stick to the git CLI I'd suggest you read some git tutorials, this is not a problem unique to Lean and has been solved many years ago.</p>",
        "id": 481721526,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1731331608
    },
    {
        "content": "<p>Okay, I'll look for it then and, if I have some specific doubt, I'll come back here. Thanks!</p>",
        "id": 481721736,
        "sender_full_name": "Esteban Martínez Vañó",
        "timestamp": 1731331668
    }
]