[
    {
        "content": "<p>Various Lean project ship with defaut VSCode settings, for instance saying whether the “expected type” panel is open by default, or whether to emphasize the first goal. See for instance <a href=\"https://github.com/leanprover-community/mathematics_in_lean/blob/master/.vscode/settings.json#L38-L39\">https://github.com/leanprover-community/mathematics_in_lean/blob/master/.vscode/settings.json#L38-L39</a>. This is especially relevant to projects aimed at beginners. We could try to ship those projects with a file talking to emacs and one talking to vim. </p>\n<p>But maybe it would be nicer to have something editor-agnostic, for instance in the <code>lakefile</code>. I’m really not sure, but I think this is worth discussing. Note that with <code>lakefile.</code><strong>toml</strong> when we don’t even need much cooperation from Lean itself, we could simply drop some <code>editor_settings</code> configuration section and let editors read it, after defining a couple of fields that can be in this section. It could even be open-ended, with editors ignoring settings they don’t understand. </p>\n<p><span class=\"user-mention\" data-user-id=\"315577\">@Mac Malone</span> <span class=\"user-mention\" data-user-id=\"221921\">@Marc Huisinga</span></p>",
        "id": 501613536,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1740420114
    },
    {
        "content": "<p>I don't think editor plugins should standardize on a set of configuration options for Lean 4. It doesn't seem like much of a benefit anyways, given that the only two plugins with extensive support are the VS Code and NeoVim plugins.</p>",
        "id": 501615517,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1740420633
    },
    {
        "content": "<p>In any case, something like this should <em>definitely</em> not be part of the Lakefile. The semantics of the Lakefile depend on the Lean version of your project. The semantics of editor plugin settings depend on the plugin version.</p>",
        "id": 501615954,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1740420758
    },
    {
        "content": "<p>Ok, that’s a good point.</p>",
        "id": 501616513,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1740420927
    },
    {
        "content": "<p>But, as far as I know, we do nothing to enforce an editor plugin version when writing those <code>.vscode/settings.json</code>.</p>",
        "id": 501616633,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1740420962
    }
]