[
    {
        "content": "<p>I need a routine to delete \"unused\" files to reduce the size of the <code>.lake</code> folder. As my old routine is failing, I would like to ask if anybody knows how to achieve that in a more robust way.</p>\n<p>The use case is the following: A project (NNG) imports Mathlib and downloads the entire cache (multiple GB worth of <code>.olean</code>s), but it only imports <code>Mathlib.Tactic.Common</code>. I know that the user can't/doesn't modify the imports, so I would like to get rid of anything that hasn't been used (in the sense that it is not built by running <code>lake build</code> inside the project, i.e. not imported by the project's main file).</p>\n<p>What's the best way to determine which oleans I should delete? My ideas so far were</p>\n<ul>\n<li>use unix timestamps to see which files were touched during <code>lake build</code>. Obviously that's buggy and broken now.</li>\n<li>write a tool copying most of <code>import-graph</code>'s logic to get a list of all used files, then delete the rest.</li>\n</ul>\n<p>Is there a better approach? Maybe there are parts of the lake API that could be used?</p>",
        "id": 432521869,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1712760509
    },
    {
        "content": "<p>Can you just have it run <code>lake exe cache get Mathlib.Tactic.Common</code>?</p>",
        "id": 433195824,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1713153875
    },
    {
        "content": "<p>In theory, that's a good shout! I see two issues:</p>\n<p>1) the post-update-hook calls the entire <code>lake exe cache get</code>. I assume I can work around that disabling Mathlib's post-update hook.</p>\n<p>2) The typical usage scenario is the following: Kevin edits the NNG and imports a bit more of Mathlib; CI then builds everything and sends the built stuff to the server. Ideally Kevin does not need to manually update the CI build script to specify which parts of the cache it needs to download.</p>",
        "id": 433334538,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1713198213
    }
]