[
    {
        "content": "<p>The 4.11.0 release note <a href=\"https://lean-lang.org/blog/2024-9-1-lean-4110/\">states</a>:</p>\n<blockquote>\n<p>Lean 4.11 features a brand-new implementation of hash tables, concretely usable as both dictionaries (<code>Std.HashMap</code>) and sets (<code>Std.HashSet</code>). This new implementation has been designed from the ground up for both efficiency and correctness, and it features an extensible, carefully-engineered framework for specifying and proving properties of its API.</p>\n</blockquote>\n<p>I'm curious about the design principle and challenges faced during the development of the new hash map implementation. Were there any trade off between speed, verification of correctness, and usability of API?  I would love to hear more about the thought process behind these decisions, especially how you set up a framework for specification and verification purposes.</p>\n<p>Thanks!</p>",
        "id": 468746270,
        "sender_full_name": "pandaman",
        "timestamp": 1725877123
    },
    {
        "content": "<p>Perhaps you would find the implementation notes, in <code>Std.Data.DHashMap.Internal.Defs</code> helpful!</p>",
        "id": 468747300,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1725877410
    },
    {
        "content": "<p>Very briefly: Markus did a lot of engineering so that all operations have a corresponding operation on a List-based reference model, and there is infrastructure in place to uniformly transfer results from the reference model to the runtime model. (This was a lot of work!) But the result is that there are essentially no tradeoffs of performance or user facing API in exchange for verifiability. The cost to this was the work (done now), and that whenever we want to add more operations it has to be done inside this reference model framework, which is slightly cumbersome, but doesn't pose any particular challenge.</p>",
        "id": 468748042,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1725877616
    },
    {
        "content": "<p>Hi. Are you referring to <a href=\"https://github.com/leanprover/lean4/blob/c2761dc27041d4be6b30da23e8c113c6ecee13a9/src/Std/Data/DHashMap/Internal/Defs.lean#L12\">this comment</a>? This indeed looks good read. Thank you for the summary and pointer!</p>",
        "id": 468748721,
        "sender_full_name": "pandaman",
        "timestamp": 1725877786
    },
    {
        "content": "<p>You can see the comment in action here: <a href=\"https://github.com/leanprover/lean4/pull/5244\">https://github.com/leanprover/lean4/pull/5244</a>, even though the PR is large it is mostly copying theorems around so that all variations of the HashMap type have the theorems, the actual implementation work is rather miniscule.</p>",
        "id": 468758492,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1725880430
    }
]