[
    {
        "content": "<p>Hello - How can one disable the unused variable linter in VS Code. </p>\n<div class=\"codehilite\" data-code-language=\"unused\"><pre><span></span><code>note: this linter can be disabled with \"set_option linter.unusedVariables false\"\n</code></pre></div>",
        "id": 443700643,
        "sender_full_name": "CK",
        "timestamp": 1718004590
    },
    {
        "content": "<p>You are supposed to paste the <code>set_option linter.unusedVariables false</code> into the file that you wish to disable it in.</p>",
        "id": 443701568,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1718004914
    },
    {
        "content": "<p>Thanks, this works! Maybe we might need to specify somewhere in the infoview that one needs to add that line to the file itself rather than setting it on VSCode preferences etc..</p>",
        "id": 444394051,
        "sender_full_name": "CK",
        "timestamp": 1718260846
    },
    {
        "content": "<p>Note that linters do not have anything to do with vscode at all, they are parts of Lean, the program, VSCode merely shows them to you.</p>",
        "id": 444403656,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1718264578
    },
    {
        "content": "<p>Another option is to prefix the corresponding variable with a <code>_</code> in the code, e.g. <code>_myVar</code>.</p>\n<p>I think this is the preferred way to indicate that you are intentionally not using that specific variable (but sometimes it's not possible to do that, e.g. for names of function arguments).</p>",
        "id": 444403780,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1718264641
    },
    {
        "content": "<p>I think the separation between Lean and its various editor integration is something that is very confusing to beginners, and very hard to keep in mind for existing users who write documentation. For us it is completely obvious that linters have nothing to do with the VSCode or vim or emacs support, and we would never think of saying it. But for beginners the whole Lean experience is one giant blob and it is not obvious at all. The issue also arise with the separation between Core Lean, batteries and Mathlib.</p>",
        "id": 444422234,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1718271198
    },
    {
        "content": "<p>And maybe the standard teaching resources do not discuss any <code>set_option</code> early. If you have never seen <code>set_option</code> anywhere then it is not clear at all where they should go.</p>",
        "id": 444422495,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1718271284
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"725407\">@CK</span>  what are you reading to learn Lean? We could check whether we can add an explanation of <code>set_option</code> there.</p>",
        "id": 444422587,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1718271320
    },
    {
        "content": "<p>Going back to the actual question, I strongly advise you to very rarely disable this linter. It is very useful for mathematics and completely crucial for programming.</p>",
        "id": 444422818,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1718271385
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span> I just checked and we never explain <code>set_option</code> in <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a>. So users who learn Lean using our book will not know where to put it if they see it in an error message or on zulip (see this thread for an example).</p>",
        "id": 444423311,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1718271531
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> Thank you for understanding. I am a beginner to Lean programming and loving the journey so far. I started using it at SRI SSFT '24 where we had lecture and lab sessions with David Christiansen and Leo De Moura. In so far as the material, I am primarily using the following two books: </p>\n<ol>\n<li><a href=\"https://leanprover.github.io/theorem_proving_in_lean/\">https://leanprover.github.io/theorem_proving_in_lean/</a></li>\n<li>Theorem Proving in Lean - Jeremy Avigad, Leo De Moura, and Soonho Kong<br>\nHowever, I was looking into the book (second link) and there is a chapter on setting options. Which is what I should have referred before asking here.</li>\n</ol>",
        "id": 444527406,
        "sender_full_name": "CK",
        "timestamp": 1718301946
    },
    {
        "content": "<p>Those are the same book, right?</p>",
        "id": 444670422,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1718361444
    },
    {
        "content": "<p>They are different versions of the same book. The link points to the latest version of the book (2023 edit) and the PDF is an older version (2016). <a href=\"/user_uploads/3121/xVONTXxZpdoPSyIZtQSADs45/Define-Predicate-Lean.pdf\">Define-Predicate-Lean.pdf</a></p>",
        "id": 444774669,
        "sender_full_name": "CK",
        "timestamp": 1718393689
    },
    {
        "content": "<p>What is the point of reading the old version?</p>",
        "id": 444778403,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1718395110
    },
    {
        "content": "<p>That was the version shared during the seminar.</p>",
        "id": 444788099,
        "sender_full_name": "CK",
        "timestamp": 1718398658
    }
]