[
    {
        "content": "<p>I was helping <span class=\"user-mention\" data-user-id=\"467926\">@Joseph O</span> with his <a href=\"https://github.com/crabbo-rave/lean4-Hangman\">Hangman</a> package and Lean was complaining about an error when parsing <code>lakefile.lean</code>:</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"bp\">`/</span><span class=\"n\">home</span><span class=\"bp\">/</span><span class=\"n\">arthur</span><span class=\"bp\">/.</span><span class=\"n\">elan</span><span class=\"bp\">/</span><span class=\"n\">toolchains</span><span class=\"bp\">/</span><span class=\"n\">leanprover</span><span class=\"c1\">--lean4---nightly-2022-03-06/bin/lake print-paths Init` failed:</span>\n\n<span class=\"n\">stderr</span><span class=\"o\">:</span>\n<span class=\"n\">Error</span> <span class=\"n\">parsing</span> <span class=\"bp\">'./</span><span class=\"n\">lakefile.lean'.</span>  <span class=\"n\">Please</span> <span class=\"n\">restart</span> <span class=\"n\">the</span> <span class=\"n\">lean</span> <span class=\"n\">server</span> <span class=\"n\">after</span> <span class=\"n\">fixing</span> <span class=\"n\">the</span> <span class=\"n\">Lake</span> <span class=\"n\">configuration</span> <span class=\"n\">file.</span>\n</code></pre></div>\n<p>Turns out the error was because he added the <code>doc-gen4</code> dependency named as <code>docgen4</code>. Changing it to <code>«doc-gen4»</code> solved the issue. However, I thought about three things:</p>\n<ul>\n<li>The current doc-gen4 package name with french brackets and a dash isn't very straightforward (just my opinion)</li>\n<li>The error message was pretty misleading, making me think there was something wrong with the formatting when the error was just a misspelled package name</li>\n<li>Would it be nice if the package name were inferred instead of inputted manually?</li>\n</ul>",
        "id": 274766198,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1646867370
    },
    {
        "content": "<p>The package name was mainly chosen like this to reflect the doc-gen naming from Lean 3, also the french brackets are general lean sytnax for making stuff that can usually not be an identifier an identifier so that's the reason lake generated the project this way. If you have an alternative idea feel free, I don't think we have really agreed upon a naming scheme for packages though? So we should probably do that.</p>\n<p>Did you actually build this with lake build or just in the server? For me when I try to build software with lake build it will actually inform me that I imported a package as <code>xy</code> but it found <code>yz</code> in the directory, at least when I last made this mistake.</p>\n<p>this also answers question 3 i guess? At least there is a check for this right now</p>",
        "id": 274769424,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1646869483
    },
    {
        "content": "<p>Also doc-gen4 is not really meant to be used as a dependency in this way, my hope was that it would eventually be shipped with a lean install and maybe even as a lake subcommand.</p>",
        "id": 274769466,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1646869547
    },
    {
        "content": "<p>I didn't build it with <code>lake build</code>. I just cloned the repo, opened it with VS Code and every Lean file had a red bar with that error message.</p>\n<p>If <code>doc-gen4</code> won't be meant to be used as a dependency like that, then the package name doesn't matter much.</p>\n<p>The error message from <code>lake build</code> indeed helps (and it has helped me in the past), but the error message that I got without building, just from opening the project, ended up getting me confused.</p>\n<p>Question 3 wasn't fully answered because I was thinking about not needing to provide the <code>name</code> attribute at all. You'd just provide the <code>src</code> attribute because the package name can be inferred from its respective <code>lakefile.lean</code>.</p>",
        "id": 274771537,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1646870686
    },
    {
        "content": "<p>As a point of comparison, Rust uses crates which are often named with hyphens, but the hyphens are transposed to underscore when referencing them in code so that the french quotes aren't necessary</p>",
        "id": 274926669,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1646968059
    }
]