[
    {
        "content": "<p>Hi! I'm trying to obtain the success rate of different tactics (e.g. simp, aesop, duper, auto) on <code>Mathlib</code>, but I've met some difficulties.<br>\nThe basic setup for the evaluation is as follows: for each theorem <code>T</code>, we find the module <code>M</code> where <code>T</code> is declared, replay the header (import statements) of <code>M</code> and all the commands before the declaration of <code>T</code> in <code>M</code>, then run the tactic on the type of <code>T</code>. This replay is to exclude the effect of the command that declares <code>T</code> and the commands after the declaration of <code>T</code> (if they're not excluded, then e.g. <code>T</code> may be tagged with <code>@[simp]</code>, which will cause <code>simp</code> to immediately succeed when we run <code>simp</code> on the type of <code>T</code>).<br>\nThe difficulty I met is that there are cases where I cannot pose time limits on the execution of certain tactics (see <a class=\"stream-topic\" data-stream-id=\"270676\" href=\"/#narrow/channel/270676-lean4/topic/aesop.20nontermination\">#lean4 &gt; aesop nontermination</a>, there are several theorems in the same Mathlib file with the same issue). When I run certain tactics on certain constants, they may loop forever even with reasonable <code>maxHeartbeats</code>. If I run my evaluation code on a Mathlib file which contains such constants, the evaluation code will be stuck.<br>\nI'm trying to figure out a workaround, but I feel like I need help from more experienced hands. An idea is to run evaluation on a file for multiple times to determine where the timeout occurs, but this might be unreasonably inefficient (considering that the file <code>Mathlib.RingTheory.FiniteType</code> mentioned in <a class=\"stream-topic\" data-stream-id=\"270676\" href=\"/#narrow/channel/270676-lean4/topic/aesop.20nontermination\">#lean4 &gt; aesop nontermination</a> contains several consecutive theorems that causes nontermination for <code>aesop</code>).<br>\nAnother thing I noticed is that when editing in VSCode, it's very easy to terminate the execution of any command (e.g. by commenting it out). I tried looking into <code>src/lean/Lean/Server</code> but I'm not getting a clear idea how that's done. Would this be helpful?<br>\nAnyways, if you have any ideas for a workaround, please let me know.</p>",
        "id": 491951334,
        "sender_full_name": "Yicheng Qian",
        "timestamp": 1736068458
    },
    {
        "content": "<p>My understanding is that commenting out a tactic does not terminate its execution, it just lets it continue in a background thread that no one is waiting for any more</p>",
        "id": 491959906,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1736076768
    },
    {
        "content": "<p>No, it also triggers <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Lean.Core.Context.cancelTk%3F#doc\">docs#Lean.Core.Context.cancelTk?</a>. So if you see CPU use drop after inserting the comment, then passing and triggering such a token from a different thread after a timeout might be a better approach than heartbeats.</p>",
        "id": 491962590,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1736079496
    },
    {
        "content": "<p>Ah indeed, I got confused there. What I should have said is that if the tactic is not responding to the heartbeats limit (due to being in a tight loop without a call to <code>checkSystem</code>), it probably won't respond to cancellation tokens either</p>",
        "id": 491962888,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1736079796
    },
    {
        "content": "<p>I managed to come up with a more concrete problem which is essentially what I'm trying to solve. Suppose I'm replaying a Mathlib file. Before elaboration of the command <code>cmd</code> the environment is <code>env</code>. Elaborating <code>cmd</code> creates a new theorem <code>ci : ConstantInfo</code>. Suppose <code>prover : Expr -&gt; CoreM Bool</code> attempts to find a proof of the input expression. How do I run <code>prover</code> on <code>ci.type</code> efficiently and asynchronously? And how do I cancel it if it times out (e.g. after 30s)? (Note that <code>prover</code> need to have access to <code>env</code>)</p>",
        "id": 491963773,
        "sender_full_name": "Yicheng Qian",
        "timestamp": 1736080590
    },
    {
        "content": "<p>I think <code>IO.Process.spawn</code> is impractical because that would require passing the <code>env</code> between processes.</p>",
        "id": 491964874,
        "sender_full_name": "Yicheng Qian",
        "timestamp": 1736081657
    },
    {
        "content": "<p>Ok, the original <code>mem_adjoin_support</code> issue in <a class=\"stream-topic\" data-stream-id=\"270676\" href=\"/#narrow/channel/270676-lean4/topic/aesop.20nontermination\">#lean4 &gt; aesop nontermination</a> is solved :)</p>",
        "id": 491966456,
        "sender_full_name": "Yicheng Qian",
        "timestamp": 1736083088
    }
]