[
    {
        "content": "<p>Hi, I was looking at Lean's proof of <code>Classical.em</code> and I think it can be simplified a bit. It seems that the two <code>Prop → Prop</code>s <code>U</code> and <code>V</code> are being chosen as a trick to make them equal iff <code>p</code>.</p>\n<p>I think it would be much more direct to just take <code>Bool</code> and quotient it by <code>p</code>, giving us a projection <code>π : Bool → A</code>. Then, the proof that <code>π true = π false</code> iff <code>p</code> is trivial and comes from <code>Quotient.sound</code> and <code>Quotient.exact</code>. Using choice, we get a section <code>σ : A → Bool</code>, and we can decide <code>p</code> by deciding <code>σ (π true) = σ (π false)</code>, since <code>Bool</code> has  decidable equality.</p>\n<p>I think that such a proof shows what's really going on better and is easier to follow. I made a PR here to show my idea: <a href=\"https://github.com/leanprover/lean4/pull/2625\">https://github.com/leanprover/lean4/pull/2625</a></p>\n<p>What are your thoughts?</p>",
        "id": 395037616,
        "sender_full_name": "James Smith",
        "timestamp": 1696510634
    },
    {
        "content": "<p>Aren't you supposed to make an RFC before a PR? </p>\n<p>Does the current proof use the <code>Quotient.sound</code> axiom?</p>",
        "id": 395044870,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1696512864
    },
    {
        "content": "<p>Sorry, I can make an RFC. I thought it would be easier to just show the new proof since it's a small change. </p>\n<p>The current proof uses <code>Quotient.sound</code> indirectly through <code>funext</code>. The new one does not use <code>funext</code>.</p>",
        "id": 395045589,
        "sender_full_name": "James Smith",
        "timestamp": 1696513074
    },
    {
        "content": "<p>I think the current proof is kind of like your one, if you think of the set <code>{U, V}</code> as a funny construction of the quotient of <code>{True, False}</code> (not <code>Prop</code>) by <code>p</code> (in fact it's just the traditional set theoretic construction of the quotient).</p>\n<p>Personally I do prefer the proof using <code>Quot</code>, but I think this is a matter of taste and other people might prefer the current proof.</p>",
        "id": 395070054,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1696520263
    }
]