[
    {
        "content": "<p>I would be great if we could make grind output the working proof path and not just the initial e-matched theorems. In many cases users (me included) would prefer not to have <code>grind</code> as a proof of each and every theorem they define (assuming best outcomes from the tool) but self-documenting steps of theorems that were applied and how the proof was achieved. The <code>aesop?</code> for instance can easily suggest a proof path that one can still verify manually and/or refine for compactness and customization. It would be great if <code>grind?</code> could expand similarly or at least provide grind-free replacement of its output that described the found proof.</p>\n<p>What are your thoughts about this? Has something in this direction already been developed and/or worked on?</p>",
        "id": 572751375,
        "sender_full_name": "Plamen Dimitrov",
        "timestamp": 1770637130
    },
    {
        "content": "<p>No, an entirely <code>grind</code> free proof would not be possible: there do not exist the primitives required to concisely express a grind proof! (Beyond, of course, the proof term, which in principle you can get with <code>show_term grind</code>.)</p>",
        "id": 572753152,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1770637619
    },
    {
        "content": "<p>But IIUC as the proofs grind finds are all in essence mathematical proofs still fully utilizing dependent type theory, CoC, etc. it could indicate where it found a contradiction in the proof-by-contradiction search it does? While it would expand the whiteboard with collected theorems it should be possible to trace back how a given contradiction was reached, i.e. to describe the proof \"trace\" that was reached and not how the entire search process. Or do you mean something more fundamental with \"no primitives to express a grind proof\"?</p>",
        "id": 572755682,
        "sender_full_name": "Plamen Dimitrov",
        "timestamp": 1770638270
    },
    {
        "content": "<p>The closest to that explanation you can get is the fully expanded grind-mode proof that <code>grind?</code> gives you.</p>",
        "id": 572760060,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1770639386
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/channel/270676-lean4/topic/Explicit.20and.20grind-free.20suggestions.20from.20the.20grind.20tool/near/572753152\">said</a>:</p>\n<blockquote>\n<p>(Beyond, of course, the proof term, which in principle you can get with <code>show_term grind</code>.)</p>\n</blockquote>\n<p>Or <code>show_term grind -abstractProof</code> to avoid the <code>foo._proof_1_1</code> stuff</p>",
        "id": 572772056,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1770642416
    }
]