[
    {
        "content": "<p>Does anyone know of a reference that offers an overview of the different types of \"exportable\" data from a given Lean file?</p>",
        "id": 478107953,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1729529738
    },
    {
        "content": "<p>What kind of exportable data are you looking for here? Just what's in <code>Environment</code>? Or something more semantically rich?</p>",
        "id": 478117998,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1729533082
    },
    {
        "content": "<p>The point is precisely that I’m not knowledgeable enough to look for a specific kind of exportable data just yet. </p>\n<p>My question is more general: I’m trying to understand what types of data I could potentially export from a Lean file. </p>\n<p>Is there any resource or reference that could help me get an overview of what kind of data is available? </p>\n<p>Essentially, I’m interested in understanding both the breadth and depth of data I can access or export from a Lean project.</p>",
        "id": 478121378,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1729534258
    },
    {
        "content": "<p>Right, most generally speaking as a raw data source you can somewhat easily access:</p>\n<ul>\n<li>the parsed <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Lean.Syntax#doc\">docs#Lean.Syntax</a> by well, runnign parsing on the file</li>\n<li>the <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Lean.Elab.InfoTree#doc\">docs#Lean.Elab.InfoTree</a>, this contains a ton of information. The majority of features that the LSP provides to you are constructed based on InfoTrees</li>\n<li>if you want to elaborate the file or load its <code>olean</code> you get an <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Lean.Environment#doc\">docs#Lean.Environment</a>. Besides all declarations from the file this also contains the data of persistent extensions. A ton of stuff is stored in these environment extensions. What things are instances, what things are linked to external code, simp lemmas etc. etc. Given that people can also add environment extensions on their own it's not really possible to pinpoint the exact kind of data that you can get from them. An interesting starting point might be tools like doc-gen or verso as they operate a lot on data provided by the Environment. doc-gen in particular is a very heavy user of built-in environment extensiosn.</li>\n</ul>",
        "id": 478122268,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1729534595
    },
    {
        "content": "<p>Thanks a lot for the clarification!</p>",
        "id": 478130095,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1729537420
    }
]