[
    {
        "content": "<p>When writing (java|type)script for widgets, it would be useful to be able to employ standard lean tooltips. For example, if some graphical element in a widget represents an <code>Expr</code>, we could show that <code>Expr</code> on hover. In my case, I'd like to typeset lean expressions as math, and show the original expression on hover.</p>\n<p>Am I right in thinking that this would be achievable by adding <code>export * from './infoview/tooltips'</code> to the extension's <code>index.tsx</code>? Are any of these exports unnecessary, and should the set be restricted? (The exports would be <code>TooltipProps</code>, <code>Tooltip</code>, <code>HoverState</code>, <code>DetectHoverSpan</code>, and <code>WithTooltipOnHover</code>.) Also, would this work as expected when not hovering over code, or are any assumptions made of the hovered-over content that could break in a custom widget?</p>\n<p>If adding the above <code>export</code> is reasonable, I'd be happy to PR the extension if it's convenient. :)</p>",
        "id": 381633747,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1691107794
    },
    {
        "content": "<blockquote>\n<p>Also, would this work as expected when not hovering over code, or are any assumptions made of the hovered-over content that could break in a custom widget?</p>\n</blockquote>\n<p>Good question. The hover components are built to be reasonably composable with each other and with other components, but there may be assumptions that are true in the infoview that wouldn't be true of arbitrary widgets. It would be a test for the code at least!</p>\n<p>I would suggest the following thing: add the <code>export</code> in your local copy of the extension, and try to develop a widget using the new exported functionality. If it works as expected, we can add it to the published version of <code>@leanprover/infoview</code>.</p>",
        "id": 381656671,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1691117835
    },
    {
        "content": "<p>Sounds good! :) I’ll try to test it out that way over the next few days (I might not have a chance until after Sunday or Monday).</p>",
        "id": 381661919,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1691120772
    }
]