[
    {
        "content": "<p>Currently, no preprocessing can be added to the contradiction tactic. Thus, for example, even if a ≤ b and a &gt; b are assumed, contradiction does not immediately close the goal.</p>\n<p>Currently, this type of rule can be handled by simp. So, if we create a simp wrapper using register_simp_attr, we can make the contradiction tactic extendable with @[contradiction] tag. Implementation would probably be easy.</p>\n<p>Is this a good idea? Let me know what you think.</p>",
        "id": 505776735,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1741991334
    },
    {
        "content": "<p>Compared to simply registering in the simp rules, this would have the advantage of being easier to read and understand.</p>",
        "id": 505776785,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1741991376
    },
    {
        "content": "<p>I don't think <code>contradiction</code> per se should be extensible, it's supposed to be a very fast tactic and adding too much would decrease performance. It might be better to use tactics that were made for specific circumstances, e.g. something like <code>linarith</code> or <code>order</code> perhaps for what you suggest here. As an example,<code>linarith</code> is also a tactic that tries to find a contradiction but in a more sophisticated way. Otherwise, you could make your own tactic which aims to be a slower but more powerful <code>contradiction</code> which maybe does simple preprocessing and then calls <code>contradiction</code>. Not sure how useful that'd be though</p>",
        "id": 505780393,
        "sender_full_name": "Robin Arnez",
        "timestamp": 1741993300
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 505859792,
        "sender_full_name": "Jovan Gerbscheid",
        "timestamp": 1742053644
    },
    {
        "content": "<p>Possibly the future of a powerful <code>contradiction</code> will be the in-development <code>grind</code> tactic. <a class=\"message-link\" href=\"/#narrow/channel/116290-rss/topic/Recent.20Commits.20to.20lean4.3Amaster/near/505979396\">#rss &gt; Recent Commits to lean4:master @ 💬</a></p>",
        "id": 505995959,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1742158803
    }
]