[
    {
        "content": "<p>I have just bought a new laptop (yay!), and I'm trying to set up Lean on it, and the elan installation script doesn't work for some reason. Here's what I'm getting from <code>elan-init.sh</code> (I get the same thing when running it in VSCode like in the <a href=\"https://docs.lean-lang.org/lean4/doc/quickstart.html\">instructions</a>):</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>Welcome to Lean!\n\nThis will download and install Elan, a tool for managing different Lean\nversions used in packages you create or download. It will also install a\ndefault version of Lean and its package manager, lake, for editing files not\nbelonging to any package.\n\nIt will add the lake, lean, and elan commands to Elan's bin directory, located\nat:\n\n  /home/fred/.elan/bin\n\nThis path will then be added to your PATH environment variable by modifying the\nprofile files located at:\n\n  /home/fred/.profile\n  /home/fred/.zprofile\n  /home/fred/.bash_profile\n\nYou can uninstall at any time with elan self uninstall and these changes will\nbe reverted.\n\nCurrent installation options:\n\n     default toolchain: stable\n  modify PATH variable: yes\n\n1) Proceed with installation (default)\n2) Customize installation\n3) Cancel installation\n\n\nerror: error during download\ninfo: caused by: [6] Could not resolve hostname (Could not resolve host: release.lean-lang.org)\n</code></pre></div>\n<p>My internet connection is working, and I can in fact reach <code>release.lean-lang.org</code> in my browser. I have both curl and git installed. Any idea what's going on?</p>",
        "id": 519674766,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1747851525
    },
    {
        "content": "<p>What does <code>curl -v https://release.lean-lang.org</code> show?</p>",
        "id": 519694502,
        "sender_full_name": "Julian Berman",
        "timestamp": 1747858633
    },
    {
        "content": "<p>A massive json file with all previous releases.</p>",
        "id": 519696421,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1747859421
    },
    {
        "content": "<p>OK that's .. a good sign clearly.</p>",
        "id": 519697257,
        "sender_full_name": "Julian Berman",
        "timestamp": 1747859728
    },
    {
        "content": "<p>Ah, that error comes from rust (calling out to libcurl), not curl (the binary) -- so somehow the former isn't working and the latter is. I'm not sure offhand why that'd be -- perhaps a step is to compare the output of <code>ldd $(which curl)</code> and <code>ldd $(which elan)</code> and see which libcurls they're using.</p>",
        "id": 519697617,
        "sender_full_name": "Julian Berman",
        "timestamp": 1747859861
    },
    {
        "content": "<p>The <code>elan-init</code> executable that gets run by the script is statically linked according to <code>ldd</code>, so presumably my version of libcurl shouldn't matter...?</p>",
        "id": 519703108,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1747862227
    },
    {
        "content": "<p>I'm currently running into a similar issue on my linux laptop: I've used lean on it before and in the repositories I already have installed commands like <code>lake build</code> in <code>lake exe cache get</code> still work fine, but in newly-cloned repositories and repositories where my installed toolchain is outdated any attempts to use lake or install the correct toolchain result in that <code>[6] Could not resolve hostname (Could not resolve host: github.com)</code> error, even though loading github in the browser, pinging it, and running commands like <code>curl https://github.com</code> all work. It does seem like a network issue, but like one that is very specific to whatever <code>elan</code> does / uses under the hood - does anyone have an idea what I can do to fix it? I already tried e.g. temporarily disabling my firewall (it didn't help) and updating elan via <code>curl https://elan.lean-lang.org/elan-init.sh -sSf | sh -s -- -y</code> (turns out I already had the most recent version 4.1.12).</p>",
        "id": 566989826,
        "sender_full_name": "Ben Eltschig",
        "timestamp": 1767891360
    },
    {
        "content": "<p>Just to give an update to this in case anyone else encounters a similar issue in the future - in my case the issue resolved itself after just waiting for a few weeks and then installing updates. Maybe a bug in one of the dependencies like libcurl produced this issue and was patched out a bit later, I don't know.</p>",
        "id": 570607978,
        "sender_full_name": "Ben Eltschig",
        "timestamp": 1769618284
    }
]