[
    {
        "content": "<p>I'm trying to make use of recursion schemes directly in Lean without explicitly making a theory of polynomial functors in which to express W-types as objects distinct from Lean's normal types, and I'm trying to express the articles that discuss recursion schemes in this setting. In the HoTT book, for an inductively defined type <code>T</code> it seems like either the recursor or the induction principle for <code>T</code> plays the role of the map <code>f</code> in the pair <code>(T,f)</code> that forms the initial algebra for the type <code>T</code>, and it seems to be guaranteed that such an initial algebra exists by virtue of <code>T</code> being a W-type. That's in the HoTT setting but according to Mario Carneiro's thesis, Lean inductive types can also be reduced to W-types.</p>\n<p>Given these bits of info, do we know if all Lean inductive types have a canonical initial algebra?</p>",
        "id": 475399485,
        "sender_full_name": "nrs",
        "timestamp": 1728335626
    },
    {
        "content": "<p>Can anyone confirm whether <code>.rec</code> is the type-theoretical dependent eliminator? In which case it is maybe the above-mentioned <code>f</code>?</p>",
        "id": 475412548,
        "sender_full_name": "nrs",
        "timestamp": 1728340018
    },
    {
        "content": "<p>The question is slightly confusing to me. An inductive type <em>is</em> the initial object of the algebra of types having functions with the type of the constructors</p>",
        "id": 476429121,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728666926
    },
    {
        "content": "<p><code>.rec</code> is the unique map out of the initial object into another object of the category</p>",
        "id": 476429176,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728666957
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/270676-lean4/topic/For.20inductive.20type.20.60T.60.20what.20is.20its.20initial.20algebra.3F/near/476429176\">said</a>:</p>\n<blockquote>\n<p><code>.rec</code> is the unique map out of the initial object into another object of the category</p>\n</blockquote>\n<p>Thank you very much for all your answers I have still not been able to digest most of them but it is my main focus right now to understand them fully, also very big fan of your work!!</p>",
        "id": 476429502,
        "sender_full_name": "nrs",
        "timestamp": 1728667089
    }
]