[
    {
        "content": "<p>I want to be very naughty, and introduce a global variable somewhere in my <code>MetaM</code> code. Can this be done?</p>",
        "id": 567050360,
        "sender_full_name": "Cody Roux",
        "timestamp": 1767915378
    },
    {
        "content": "<p>I think you might be looking for <code>IO.Ref</code> (and <code>IO.mkRef</code>, <code>.get</code>, <code>.modify</code>, <code>.set</code>), but don't tell anyone I told you...</p>\n<p>However, you do need to have access to the ref. If you want to introduce it somewhere and read it somewhere completely different, where it's not in scope, you're out of luck—but you can introduce it via <code>initialize myRef : IO.Ref _ &lt;- IO.mkRef _</code> at the start of elaboration, and then everything has access to it. But note that this will not behave well interactively, as it's never reset when you edit part of a file!</p>",
        "id": 567050697,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1767915595
    },
    {
        "content": "<p>Can you (ab)use <code>Lean.EnvExtension</code> maybe?</p>",
        "id": 567050869,
        "sender_full_name": "Chris Henson",
        "timestamp": 1767915708
    },
    {
        "content": "<p>You might also want to consider running in a <code>StateRefT MyState MetaM _</code> monad depending on how global the variable should be exactly.</p>",
        "id": 567050944,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1767915744
    },
    {
        "content": "<p>Sweet! I'll try this. Not sure I understand the scope comment though. Can't I declare the <code>Ref</code> as a <code>def</code>? (That was fun to say)</p>",
        "id": 567050952,
        "sender_full_name": "Cody Roux",
        "timestamp": 1767915753
    },
    {
        "content": "<p>Using <code>initialize</code> will be what you want there! That declares it as a def (in the file it's written) and sets it up when elaboration starts (in any downstream files). Note the <code>&lt;-</code>: that monadically creates the ref in <code>IO</code> (\"setting it up\"), which is what you need. A <code>def</code> couldn't do that.</p>",
        "id": 567051071,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1767915837
    },
    {
        "content": "<p>I see. I'll try this, but I'd also love to hear about the <code>EnvExtension</code> abuse.</p>",
        "id": 567051153,
        "sender_full_name": "Cody Roux",
        "timestamp": 1767915899
    },
    {
        "content": "<p><code>EnvExtension</code> (ab)use would probably work too! I think it would have the advantage of working <em>correctly</em> interactively, but the potential disadvantage of destroying async performance if this env extension had to be accessed on the global environment branch (to be truly \"global\"). (Note that this also involves initializing the env extension itself in a similar way, but the updates/accesses are different in nature.)</p>",
        "id": 567051526,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1767916211
    },
    {
        "content": "<p>Yeah, I basically had in mind that depending on the complexity of your use case it <em>eventually</em> boils down to something using <code>IO.Ref</code>, so it could be simpler.</p>",
        "id": 567051726,
        "sender_full_name": "Chris Henson",
        "timestamp": 1767916405
    }
]