[
    {
        "content": "<ol>\n<li>\n<p>Is it worthwhile to spend so much time fixing each error in Lean for a simple proof of a simple theorem in natural language?</p>\n</li>\n<li>\n<p>Is Lean really useful?</p>\n</li>\n</ol>\n<p>Thanks.</p>",
        "id": 448339958,
        "sender_full_name": "Oliver",
        "timestamp": 1719842214
    },
    {
        "content": "<p>This looks like a subjective question. For some things (like checking correctness of a mathematical argument) is surely useful. It depends on what you want yo do, and \"worthwhile\" depends on one's goals.</p>",
        "id": 448342632,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1719842629
    },
    {
        "content": "<p>With systems like Lean that give you a specific benefit in exchange for quite a bit of overhead the question is mostly whether you need the benefits enough to accept the overhead. </p>\n<p>The benefits are mostly that you have additional (almost absolute) certainity in the correctness of your arguments. Furthermore as Terence Tao has noted it allows larger scale collaborative mathematical projects than is usually possible just on paper. For computer science applications its mostly about the absolute certainty as projects are usually already large and collaborative.</p>\n<p>The overhead is that you have to...well deal with the pickiness of a computer system like Lean, if you are willing to do that to achieve the benefits its worth it.</p>\n<p>This is of course disregarding factors like Lean simply not supporting a use case such as Homotopy Type Theory.</p>",
        "id": 448343602,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1719842813
    },
    {
        "content": "<p>Just to hammer home the subjectivity: one can also ask \"Is Bourbaki really useful\" and also \"is modern algebraic geometry really useful\" or \"is Fermat's Last Theorem really useful\" or \"is the Stacks Project really useful\". You can't really make much sense of the question unless you have some baseline. For me as a professional mathematician Bourbaki and the proof of FLT and the Stacks Project are all very useful, for entirely different reasons, and Lean is also useful in my professional career.</p>",
        "id": 448352032,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1719844842
    }
]