[
    {
        "content": "<p>A few mathematicians (like <span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> and <span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span>  afaik - quiet tags there) have a policy, I know, of not accepting <code>native_decide</code> proofs. While I understand the reasoning, I also think it's a bit unfortunate because I think it's a very nice feature.</p>\n<p>But: my understanding is that it <em>isn't</em> to do with the substantially larger trusted codebase, but rather it's about the <code>implemented_by</code> attribute. It's easy to throw that attribute on anything and get ridiculous behavior. It's necessary to the language of course, but usually not to mathematical theorem proving; when performance is a big concern, <code>csimp</code> covers it quite well.</p>\n<p>How hard would it be to have an option on native_decide that says \"I don't want any <code>implemented_by</code> or <code>extern</code> functions used\"? To be clear, I'm not suggesting a flag that stops them from being in the compiler -- that would be a big change -- just a flag that, at the <em>end</em> of compilation, checks if any were used, and if so, throws an error on the native_decide tactic instead of closing the proof out. But, @csimp should be allowed in.</p>\n<p>I think this would then make it \"hard enough to prove False\" that this would get wider acceptance among mathematicians.</p>\n<p>Ideally there would also be a different axiom to differentiate between a native_decide call that used impl/extern functions, and one that didn't, so that at the end of very a long proof repo it's easy to check by the axioms whether all native_decide calls were of the correct setting.</p>",
        "id": 499697842,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1739528722
    },
    {
        "content": "<p>Note that removing <code>implementedBy</code> would prevent you adding natural numbers</p>",
        "id": 499703285,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1739529998
    },
    {
        "content": "<p>I don’t think making this change will result in people trusting native_decide any more than at present. And then there is the fact that you might not get the performance benefits of native_decide if you remove those implemented_bys</p>",
        "id": 499703472,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1739530045
    },
    {
        "content": "<p>Also, at least in equational theories, the objection to native_decide came from me since it wouldn’t pass lean4checker</p>",
        "id": 499703788,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1739530117
    },
    {
        "content": "<p>And I was not too keen to turn off that checker and wanted to fix the code instead. There is some thread in that channel where Mario explores some alternatives</p>",
        "id": 499703921,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1739530151
    },
    {
        "content": "<p>Also back in ICFP, I asked Joachim about the idea of having two kernels, one which is more efficient and less trusted but doesn’t include the whole compiler, and another which is slower and more trusted. I don’t recall how far that discussion went. This would make native_decide potentially less necessary</p>",
        "id": 499704670,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1739530330
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/channel/270676-lean4/topic/idea.3A.20.60native_decide.20.2Bno_implementedBy.60/near/499703285\">said</a>:</p>\n<blockquote>\n<p>Note that removing <code>implementedBy</code> would prevent you adding natural numbers</p>\n</blockquote>\n<p>Fair point - but, actually those are all <code>externs</code>. For an all-Lean codebase, I could see allowing extern's to be ok, and it's really just the implementedBy that's the problem. I tried looking around and the only functions with implBy that I could reasonably see cropping up in a theorem were <code>(List/Vector/Array).attachWith</code> and <code>(List/Array).mapMonoM</code> -- and <code>Nat.repr</code>, but that should really be changed to a <code>csimp</code>.</p>",
        "id": 499709077,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1739531422
    },
    {
        "content": "<p><code>implementedBy</code> can be hacked around with <code>extern</code> + <code>export</code></p>",
        "id": 499713755,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1739532615
    },
    {
        "content": "<p>Ahh shoot! True <span aria-label=\"sweat\" class=\"emoji emoji-1f613\" role=\"img\" title=\"sweat\">:sweat:</span></p>",
        "id": 499714572,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1739532882
    },
    {
        "content": "<p>Well, I'm all for other ideas, I'm sure there is some reasonable version of this that captures \"I trust the Lean compiler + core, but not any of my own code\" well</p>",
        "id": 499715148,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1739533041
    },
    {
        "content": "<p>It might be worth adding that I cannot immediately see any situation where <code>native_decide</code> would help me prove FLT (the proof is conceptual, not calculational), so my announcing \"I won't have it in my repo\" is very cheap for me.</p>",
        "id": 499719747,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1739534239
    },
    {
        "content": "<p>I think what you actually want here is just a way to track what <code>extern</code>s and <code>implementedBy</code>s are used in a <code>native_decide</code> execution, in the style of <code>#print axioms</code>. All the ones involved in the definition of <code>Nat</code> can be whitelisted</p>",
        "id": 499735789,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1739538348
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"448405\">Alex Meiburg</span> <a href=\"#narrow/channel/270676-lean4/topic/idea.3A.20.60native_decide.20.2Bno_implementedBy.60/near/499697842\">said</a>:</p>\n<blockquote>\n<p>But, @csimp should be allowed in.</p>\n</blockquote>\n<p><a href=\"#narrow/channel/270676-lean4/topic/Axioms.20used.20by.20csimp.20are.20not.20reported/near/505140945\"><code>csimp</code> is unsafe too</a></p>",
        "id": 505140526,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1741787764
    },
    {
        "content": "<p>This seems pretty fixable, and shouldn't get in the way of someone thinking about Mario's suggestion above.</p>\n<p>But at the moment this seems pretty low priority to me.</p>",
        "id": 505268591,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1741819890
    },
    {
        "content": "<p>If fixing this is low priority (which is reasonable), I think we should throw <code>csimp</code> in with the warnings in docstrings about <code>implemented_by</code> and <code>extern</code>.</p>",
        "id": 505269090,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1741820092
    },
    {
        "content": "<p>Note that unlike <code>#print axioms</code>, it's not possible to implement <code>#print axioms_and_extern_and_implemented_by</code> externally because the compiler can use simp rules during compilation, which have no trace in the cstage1 or cstage2 definitions, so post hoc by looking at the environment there is no way to know the dependencies (including proof dependencies) of a native decide proof.</p>\n<p>For me this came up as a problem when I contemplated what it would take to implement (a sound version of) native_decide in lean4lean: even if I had a model of the whole lean IR semantics, the equivalence proof between the IR and the original def depends on unknown axioms which have been forgotten.</p>",
        "id": 505389422,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1741864054
    },
    {
        "content": "<p>I think the most likely implementation route for this is to do something like the <code>simp?</code> implementation: track usage of csimp lemmas during compilation and write them down in some kind of permanent export object like an internal def</p>",
        "id": 505389811,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1741864151
    }
]