[
    {
        "content": "<p>I happened upon the Lean v4.6.0 release notes, where simprocs were first announced. It suggested the advent of</p>\n<blockquote>\n<p>Simplification procedures for custom theories, such as using ring axioms or performing polynomial factorization<br>\nAnd I mean, that sounds great! I could imagine a world where <code>simp</code> turns <code>(x + y) * a + (z - a * x)</code> into <code>y * a + z</code> using some ring-based simproc that says, I'll cancel out terms when it definitely leaves the whole thing strictly simpler, but leave other terms unchanged. (So, less aggressive that <code>ring_nf</code>, which we definitely would not want being a default simproc.)</p>\n</blockquote>\n<p>But I'm not aware of any such simproc existing. Has anyone looked at making such powerful simprocs? What simprocs even _exist_? I realized I have no idea!</p>\n<p>So, is there a list/guide of simprocs somewhere?</p>",
        "id": 543053215,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1759546706
    },
    {
        "content": "<p>There's three in Mathlib/Tactics/Simproc, I don't know where to find them in core Lean or Batteries... but anyway, since there's now so much ring-y type typeclasses in core lean because of grind, I could see such a simproc even existing in core</p>",
        "id": 543053340,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1759546828
    },
    {
        "content": "<p>Via a mix of loogle and grep, I see for Nat there is in core <code>src/Init/Data/Nat/Simproc.lean</code> that is then used for simprocs in <code>src/Lean/Meta/Tactic/Simp/BuiltinSimprocs/Nat.lean</code>, not sure exactly what is all there.</p>",
        "id": 543054596,
        "sender_full_name": "Chris Henson",
        "timestamp": 1759548321
    },
    {
        "content": "<p>Oh I see it says rings in the quote, sorry. Not sure about that.</p>",
        "id": 543054703,
        "sender_full_name": "Chris Henson",
        "timestamp": 1759548472
    },
    {
        "content": "<p>A simproc index would be a nice thing to have in the language reference. I've <a href=\"https://github.com/leanprover/reference-manual/issues/604\">created an issue</a> to track it.</p>\n<p>This is not at the top of the priority list right now, but it's good to track these things!</p>",
        "id": 543238671,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1759736845
    },
    {
        "content": "<p>Somewhat related: I implemented a command to list simprocs that match against a given pattern here: <a href=\"https://github.com/leanprover-community/mathlib4/pull/27392\">#27392</a></p>",
        "id": 543308035,
        "sender_full_name": "Paul Lezeau",
        "timestamp": 1759755674
    }
]