[
    {
        "content": "<p>Just another small question with respect to our Lean support in <a href=\"https://impermeable.github.io\">Waterproof</a>. We would like to provide an easy install experience for students. What the Lean 4 extension provides would be perfect. Currently, we have our own LSP client, but have to disable any active Lean 4 extension, to prevent doubling of error messages and other conflicts. The current instructions are \"Follow the official installation instructions\", but we would like to activate these through the Waterproof extension.</p>\n<p>I see a couple of options:</p>\n<ol>\n<li>Vendor the relevant files from the Lean 4 extension and duplicate the installation code</li>\n<li>Refactor to a runtime dependency on the Lean 4 extension</li>\n<li>Roll our own (not my preference)</li>\n<li>Stick with \"Install Lean 4 using official instructions\"</li>\n<li>Something else?</li>\n</ol>\n<p>Option 1 seems least effort, but also introduces some technical debt/the need to synchronize every once in a while.<br>\nOption 2 might have some additional benefits, such as being able to rely on the Lean 4 extension for part of our functionality. </p>\n<p><span class=\"user-mention\" data-user-id=\"221921\">@Marc Huisinga</span> (or others with good ideas): Any thoughts? In particular, I'm wondering if having a runtime dependency on the Lean 4 extension is something that you think is feasible from a stability point of view.</p>",
        "id": 573218775,
        "sender_full_name": "Pim Otte",
        "timestamp": 1770796696
    },
    {
        "content": "<p>Please stick with 4 for now. </p>\n<p>We might make the extension more modular in the future so that 2 becomes more feasible (or perhaps even factor out some components into separate packages so that they do not depend on VS Code at all anymore), but it is not feasible at the moment.</p>",
        "id": 573229123,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1770799929
    },
    {
        "content": "<p>Cc <span class=\"user-mention\" data-user-id=\"662452\">@Jason Reed</span> , the upcoming workbench could be a great fit for the Waterproof use case.</p>\n<p>I'm really looking forward to LeanWaterproof!</p>",
        "id": 573275247,
        "sender_full_name": "Emilio Jesús Gallego Arias",
        "timestamp": 1770813737
    }
]