[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"122318\">Tobias Grosser</span> <a href=\"#narrow/channel/270676-lean4/topic/.E2.9C.94.20.22.28kernel.29.20deterministic.20timeout.22.20after.20simp/near/491028656\">said</a>:</p>\n<blockquote>\n<p>Perfect. This resolved the issue (when applied strategically). It took me a moment to realize that <code>-implicitDefEqProofs</code> followed by a <code>config</code> option has no effect.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> is that interaction between config and new style options know and intended (or at least tolerated)?</p>",
        "id": 491034763,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1735335779
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"470149\">@Joachim Breitner</span> Yes, this is known. Configuration options are processed-left-to-right, and if you have <code>(config := ...)</code> then that overrides everything.</p>\n<p>I had considered special casing <code>(config := { fields* })</code> to be like doing <code>(config := { cfg_so_far with fields* })</code>, but that seemed a bit hacky and potentially more surprising than the current behavior.</p>",
        "id": 491039572,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1735339865
    },
    {
        "content": "<p>Hmm, I think I'd have expected that latter behavior, or at least a warning if I mix the two syntaxes in ways that are likely not as intended. Or maybe we can simply change the syntax so that <code>(config := … )</code> can only come first and once, to sidestep the issue?</p>\n<p>Is that related to how config options work with simp variants like <code>dsimp</code> are defined right now as a macro? Does <code>simp_arith (config := {contextual := true})</code> work as it looks, or does that override the config adjustments done by <code>simp_arith</code>?</p>\n<p>It's not pressing, but maybe worth tracking as a UX issue, I'd say.</p>",
        "id": 491072290,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1735373491
    },
    {
        "content": "<p>Ah, <code>declare_simp_like_tactic</code> uses <code>appendConfig</code> which works syntactically.  Maybe this mechanism could be unified with merging new style options and old style options, so that all three ways of setting flags (simp-like tactics, old style, new style) interact the same way. Maybe this would allow the simplification (heh) of simp-like tactics implementation or be a simple macro expansion of <code>simp_arith</code> to <code>simp +arith</code>, removing a bunch of code there.</p>",
        "id": 491075947,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1735376636
    },
    {
        "content": "<p>For <code>(config := { ... })</code> syntax, I would think we should leave it alone and discourage using it anymore. We still want to support <code>(config := ...)</code> however, since it's used for presets. Search mathlib for <code>(config := .</code> (with the dot) to see examples.</p>\n<p>I think it could make sense to make any <code>(config := ...)</code> that appears after the first configuration item result in a warning. One oddity though is that if a tactic macro initializes the configuration list with a <code>(config := ...)</code> preset, then a side effect is that any additional user-specified <code>(config := ...)</code> would be a warning. Probably for the best, though; the \"right\" way to handle a tactic-specific default configuration is to <code>extend</code> the configuration structure and set new default values. There's a bit of boilerplate there, since currently there's no macro-accessible way to change which structure type to use for elaboration of the config — you need to make a tactic elaborator and make use of a programmatic interface for the tactic.</p>\n<p>Re <code>simp_arith</code> and friends, the way they expand <code>simp_arith $items*</code> is <code>simp $items +arith</code>, so <code>(config := ...)</code> does the right thing. (Before new-style configurations, <a href=\"https://github.com/leanprover/lean4/blob/7730ddd1a0809e0b8f79d907566e49c2599bfe4c/src/Init/Meta.lean#L1437\">the way it used to work</a> is that <code>(config := $e)</code> would expand to <code>(config := $f $e)</code> for some configuration-updating function <code>$f$</code>.) The <code>appendConfig</code> system is primarily there to make it convenient to concatenate the underlying arrays in an <code>optConfig</code> (I couldn't get <code>simp $cfg* +arith</code> to work in quotations), but it turned out to also be a convenient way to coerce <code>config?</code> to <code>optConfig</code> as well for backwards compatibility.</p>\n<p>I'm not sure what code you see for <code>declare_simp_like_tactic</code> that would be simplified?</p>",
        "id": 491111693,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1735411394
    },
    {
        "content": "<p>Re the macro limitation: one solution could be to have an additional special case <code>(config.type := S)</code> that overrides which structure to use for elaboration of the configuration items, for the purpose of adjusting the default values. The assumption is that <code>S</code> is compatible in the <code>{ e with }</code> casting sense.</p>",
        "id": 491113323,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1735413099
    }
]