[
    {
        "content": "<p>From the docs:</p>\n<p>One public important non-theorem is the analogue of <code>[congr](https://leanprover-community.github.io/mathlib4_docs/Init/Prelude.html#congr)</code>: If <code>f ≍ g</code> and <code>x ≍ y</code> and <code>f x</code> and <code>g y</code> are well typed it does not follow that One public important non-theorem is the analogue of congr: If f ≍ g and x ≍ y and f x and g y are well typed it does not follow that f x ≍ g y. (This does follow if you have f = g instead.) However if a and b have the same type then a = b and a ≍ b are equivalent.. (This does follow if you have <code>f = g</code> instead.) However if <code>a</code> and <code>b</code> have the same type then <code>a = b</code> and <code>a ≍ b</code> are equivalent.</p>\n<p>This makes me wonder if you can actually prove that HEq congr is false? Do there exist f,g that are HEq and x and y that are HEq such that  f x ≍ g y is false? Or is it simply undecidable and you can't prove either statement.</p>",
        "id": 556628529,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1763234712
    },
    {
        "content": "<p>You can't prove it's true and you can't prove it's false</p>",
        "id": 556630025,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1763236021
    },
    {
        "content": "<p>unless Lean's type theory is inconsistent in which case you can do both</p>",
        "id": 556630080,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1763236066
    },
    {
        "content": "<p>Do you have any reference of the undecidability? I couldn't find anything.</p>",
        "id": 556630112,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1763236096
    },
    {
        "content": "<p>There was a thread I'll see if I can find it</p>",
        "id": 556630148,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1763236138
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"725717\">@metakuntyyy</span> there's no need to complicate everything, it boils down to the fact that <code>((α → β) = (α → γ)) → (β = γ)</code> is independent of Lean, and the way to understand it is \"I can't prove it\", or \"I could come up with a way to assign types so that it's true, and another way so it's false\"</p>",
        "id": 556631749,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1763237744
    },
    {
        "content": "<p>Thanks. I figured that it's independent. There was a topic that discussed that Nat = Int is undecidable because there are two models in which one is true and the other one is false. I don't remember the details of it but surely the same assignment could be done for HEq.</p>\n<p>Why I'm asking is I worked with some API regarding cycles and I stumbled upon heterogeneous recursors, which made me wonder how important that concept is. I think the main use is that it makes certain definitions possible. This is the definition in question <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Data/List/Cycle.html#Cycle.next\">https://leanprover-community.github.io/mathlib4_docs/Mathlib/Data/List/Cycle.html#Cycle.next</a>. I assume it's to deal with dependent functions and to be more flexible.</p>",
        "id": 556632366,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1763238375
    },
    {
        "content": "<p>An argument that's good enough for me is \"if Mat=Int is independent then surely this more complicated thing is\"</p>",
        "id": 556636701,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1763241828
    }
]