[
    {
        "content": "<p>I'm not Seriously Considering this yet (and it may be a foolish idea anyway) but I'm curious to try making a <a href=\"https://medium.com/@fvictorio/how-to-write-a-plugin-for-prettier-a0d98c845e70\">Prettier plugin</a> for Lean.</p>\n<p>I know there's an in-progress official pretty formatter effort written purely in Lean. From what I gathered, it's far from finished. The reason I'm curious about trying to integrate with Prettier is that Prettier has some interesting know-how (like nuances about \"fitting things into a line\" etc) and I'm wondering whether its abstractions are sufficient to overcome these difficulties. (The core is not JS-specific.) If anything, it would be a fun exercise for me to get to know the Lean syntax better.</p>\n<p>To even take a stab at it, I'd need two things:</p>\n<ul>\n<li>A way to get Lean AST from a Lean file into a JSON format (so I can consume it from my JS code)</li>\n<li>A way to print individual AST tokens later (while using Prettier's abstractions for \"soft line breaks\" and other layout)</li>\n</ul>\n<p>I can probably take a stab at writing the latter (which would be the majority of my learning exercise) but I really need the former.</p>\n<p>To conclude: is there a command I can shell out to that does this for me? Just the AST, in a JSON form. The key requirement is that it needs to be a standalone program I can call from JS — I'm not proficient at Lean yet so I don't want to write the glue code in Lean. I've seen mentions of <code>--ast</code> flag but it doesn't seem to work anymore.</p>\n<p>Thanks!</p>",
        "id": 499617291,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1739496179
    },
    {
        "content": "<p>I guess ideally I'd want an executable that can read Lean source code via stdin and output an AST in the JSON form via stdout.</p>",
        "id": 499618057,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1739496587
    },
    {
        "content": "<p>Oops I maybe should have posted this into <a class=\"stream\" data-stream-id=\"341532\" href=\"/#narrow/channel/341532-lean4-dev\">#lean4 dev</a> instead. Doesn't seem like there's a way to move...</p>",
        "id": 499620298,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1739497891
    },
    {
        "content": "<p>There does not currently exist such a program but it could probably be written out in a reasonable amount of time. The key reason that the formatter would have to be written in Lean itself is that Lean users can extend the Lean syntax dynamically as the program is being elaborated so they also need to be able to dynamically register formatting rules, otherwise the custom syntax cannot be handled properly by a potential formatting tool.</p>",
        "id": 499671322,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1739521798
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"418569\">Dan Abramov</span> <a href=\"#narrow/channel/270676-lean4/topic/Is.20there.20a.20way.20to.20get.20Lean.20AST.20into.20JSON.20from.20CLI.3F/near/499617291\">said</a>:</p>\n<blockquote>\n<p>The reason I'm curious about trying to integrate with Prettier is that Prettier has some interesting know-how (like nuances about \"fitting things into a line\" etc</p>\n</blockquote>\n<p>I think that unfortunately Lean syntax is permitted to be sensitive to the exact placement of line breaks and indents, so it's possible that prettier's attempt to fit things into a line would violate these constraints</p>",
        "id": 499690108,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1739526801
    },
    {
        "content": "<p>I'd also really love to see an autoformatter for Lean (I think it was also one of my first asks when I joined the community, many years ago!). Is there a tracking issue for this already and/or is it on the current FRO roadmap?</p>",
        "id": 499733456,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1739537764
    },
    {
        "content": "<p>There's discussion on this matter over here <a class=\"message-link\" href=\"/#narrow/channel/113488-general/topic/paper.3A.20pretty.20expressive.20printer/near/497487298\">#general &gt; paper: pretty expressive printer @ 💬</a></p>",
        "id": 499735446,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1739538264
    },
    {
        "content": "<p>my impression of the pretty expressive paper is that it's not about a lean formatter at all, it's just a formalization of a new pretty printing algorithm which is not language specific</p>",
        "id": 499736093,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1739538421
    },
    {
        "content": "<p>if that's all that is needed we have one in lean already, it's <code>Lean.Format</code> and it's been around ~forever</p>",
        "id": 499736308,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1739538474
    },
    {
        "content": "<p>Sounds like a great plan of attack. I can try to help out if there are subtasks that are parallelisable (I have a bit of experience is TS language tooling).</p>\n<p>Having significant white-space shouldn't be a deal breaker for prettier (fun fact JS also has significant white space technically due to semicolon insertion), it just means it needs to have harder rules around indentation, but from what I gather prettier's pluggable whitespace logic is expressive enough for that. It's exactly what <a href=\"https://github.com/prettier/plugin-python\">https://github.com/prettier/plugin-python</a> does.</p>",
        "id": 499962088,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1739664732
    },
    {
        "content": "<p>From the FRO side I can reassure that a robust and extensible code formatter is still part of our 5-year roadmap and of continued interest to us though at this point I can't give a specific date for its delivery. However, we do hear the significant interest from users and are looking into getting to it sooner rather than later.</p>",
        "id": 501076467,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1740135126
    },
    {
        "content": "<p>Just curious what's the current practice on enforcing format on the code being merged into Lean4 master branch? Is there any check on that in the merging pipeline? I would like to replicate that practice (and hopefully it is semi-automated) locally while waiting for the formatter.</p>",
        "id": 504147556,
        "sender_full_name": "Zeyuan Hu",
        "timestamp": 1741368900
    },
    {
        "content": "<p>The formatting check is currently human-driven :) . Otherwise all linting etc is the same as in a local build.</p>",
        "id": 504156841,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1741371862
    },
    {
        "content": "<p>I think this file does exactly what you are asking for <a href=\"https://github.com/lean-dojo/LeanDojo/blob/main/src/lean_dojo/data_extraction/ExtractData.lean\">https://github.com/lean-dojo/LeanDojo/blob/main/src/lean_dojo/data_extraction/ExtractData.lean</a> . Here is the output on the first one line file in MIL - <a href=\"https://gist.github.com/rkirov/b85e53225cae4a59c253158b1110a950\">https://gist.github.com/rkirov/b85e53225cae4a59c253158b1110a950</a> . For unknown to me reason it crashes on other files.</p>\n<p>It also looks like it doesn't contain comments, which I think is in theory correct for AST (you want a \"concrete\" syntax tree for a formatter?) Can Prettier deal with missing comments some how (additional parsing on the blocks outside what the ones in the AST ?)</p>",
        "id": 504230669,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1741408603
    }
]