[
    {
        "content": "<p>This is technically user error on my part, but I did the following in my lakefile: <code>require stuff from \"../Stuff\"</code>, ran <code>lake update</code>, and the next thing I see is my entire <code>Stuff</code> folder getting deleted, including its <code>.git</code> subdirectory. I'm on Lean 4.12. I imagine those files are now unrecoverable?</p>",
        "id": 492984519,
        "sender_full_name": "Max Nowak 🐉",
        "timestamp": 1736526612
    },
    {
        "content": "<p>Those files should certainly be recoverable. A mere <code>rm</code> does not actually touch the content on disk but just marks it as \"overwriteable if required\" so unless you continued doing a lot of writes afterwards and have bad luck we should certainly be able to recover stuff. I would recommend to shutdown your system and boot from a live distro, then run recovery tools such as photorec to try and see if they are still on your drive.</p>",
        "id": 492985105,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1736526816
    },
    {
        "content": "<p>Ah, oof. I lost my last commit, but I think it'll be less effort to just re-do that by hand. Thanks though</p>",
        "id": 492985360,
        "sender_full_name": "Max Nowak 🐉",
        "timestamp": 1736526902
    },
    {
        "content": "<p>The second time this bug was <a href=\"#narrow/channel/113488-general/topic/lake.20update.20nukes.20entire.20project/near/492331826\">rediscovered</a> recently. I assume no server is still distributing the buggy lake version now, but it might still be present on many people's local machines? I forgot whether and when this appeared in the <a class=\"stream\" data-stream-id=\"113486\" href=\"/#narrow/channel/113486-announce\">#announce</a> channel; maybe the topic should be pinned to remind everyone to check their lake version?</p>",
        "id": 492988422,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1736527996
    }
]