[
    {
        "content": "<p>I'm working on a <a href=\"https://github.com/leanprover-community/duper\">project</a> that can take awhile to build, so I was hoping to upload built packages (e.g. using <code>lake upload</code>) to a Github release. I'm able to build the project on Mac, Linux, and in <br>\nVSCode on any platform, but encountered an unexpected error when I attempt to build it in Windows.</p>\n<p>When I navigate to my project's folder in Windows PowerShell and run <code>lake build</code>, I get the error <code>ld.lld: error: too many exported symbols (got 78102, max 65535)</code> which prevents the project from successfully building. Given that VSCode can build the project on Windows, I assume there's some way to get around this problem, but it's unclear to me how to do so.</p>\n<p>My main questions are:</p>\n<ol>\n<li>What does VSCode do differently from <code>lake build</code> in PowerShell that allows VSCode to succeed where <code>lake build</code> in PowerShell fails? And is there a different command or set of commands I can use in PowerShell to achieve the same effect?</li>\n<li>How should I interpret the \"too many exported symbols\" error? And is there anything I can do to better understand why my project has so many exported symbols and if there's anything I can do to fix the error?</li>\n</ol>",
        "id": 407825568,
        "sender_full_name": "Josh Clune",
        "timestamp": 1702508498
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover/lean4/issues/2346\">https://github.com/leanprover/lean4/issues/2346</a></p>",
        "id": 407845603,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1702518954
    },
    {
        "content": "<p>Unfortunately this is a known problem on Windows, and we don't yet have a solution.</p>",
        "id": 407845694,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1702518978
    },
    {
        "content": "<p>This is concerning. Is Std by itself now too big? I just realized its CI does not test a Windows build, so it would be interesting to give that a try. (I may do that myself sometime soon if no one else does.) If not, how many symbols is it?</p>",
        "id": 407849834,
        "sender_full_name": "Mac Malone",
        "timestamp": 1702520459
    },
    {
        "content": "<p>This has always been an issue, even for <code>Lean</code></p>",
        "id": 407852816,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1702521423
    },
    {
        "content": "<p>(oops, I thought this only affected projected importing mathlib, my mistake)</p>",
        "id": 407857759,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1702523221
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> I'm with <span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span>, I was pretty sure we had managed to keep <code>Lean</code> below this threshold. I know I can build it on Windows.</p>",
        "id": 407866052,
        "sender_full_name": "Mac Malone",
        "timestamp": 1702526328
    },
    {
        "content": "<p>I recall measuring these numbers to find out where the problem is coming from and <code>Lean</code> already has too many symbols by some count</p>",
        "id": 407866307,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1702526406
    },
    {
        "content": "<p>either way it's uncomfortably close to the limit before we even get to user code</p>",
        "id": 407866551,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1702526468
    },
    {
        "content": "<p>It's comforting (for me) to know that this is a known issue and not one that specifically arose due to something I did in my project. </p>\n<p>Perhaps the only thing I can do is let it be and trust that the issue will be resolved at some point, but, just in case, I'm wondering whether there's anything I can do on my end to reduce the number of symbols generated by my project. For those who have experience measuring those numbers for <code>Lean</code> itself, would it be possible to point me to the tools and/or references you used so I can see whether there's low-hanging fruit I can fix in my project for now? Or would you say this is an inadvisable course of action and that the best thing for me to do is leave it be in the short term?</p>",
        "id": 407870688,
        "sender_full_name": "Josh Clune",
        "timestamp": 1702527517
    },
    {
        "content": "<p>You may want to take a look at the discussion <a href=\"#narrow/stream/287929-mathlib4/topic/error.20building.20windows.20exe.20.20proj\">here</a> and try the workaround to make it export less symbols.</p>",
        "id": 407874485,
        "sender_full_name": "Utensil Song",
        "timestamp": 1702529272
    },
    {
        "content": "<p>Thanks for the link, I missed that discussion. I'll take a look.</p>",
        "id": 407875145,
        "sender_full_name": "Josh Clune",
        "timestamp": 1702529502
    }
]