[
    {
        "content": "<p>I encountered the following today:</p>\n<p>I only have 4.28 toolchain installed and i just cloned a mathlib-dependent project that's using 4.26.<br>\nRunning <code>lake exe cache get</code> fails with an error(some String function was there in 4.26 but got removed in 4.28), because it just uses the default/only toolchain I have(4.28).</p>\n<p>But when I run <code>lake build</code> it correctly identifies that i don't have the needed toolchain installed and starts downloading it.</p>\n<p>So my question is, why doesn't <code>lake exe...</code> respect <code>lean-toolchain</code> file? Or maybe my story just doesn't add up and I missed something? I understand I can probably find the answer in the reference if I read it long enough, still some help would be appreciated.</p>\n<p>Another perhaps important detail is that the project didn't have lake-manifest.json in it.</p>",
        "id": 574933045,
        "sender_full_name": "Mikhail Mayorov",
        "timestamp": 1771591880
    },
    {
        "content": "<p>I don't think we can say anything more than \"this is supposed to work\" from your description</p>",
        "id": 574959037,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1771599080
    },
    {
        "content": "<p>Yes, I apologize, it was indeed a mistake on my end. The project had an unversioned dependency on another project that got bumped to 4.28(and my description of what happened was not totally accurate).</p>\n<p>Still I was surprised to learn that building a project without lake-manifest can just bump its toolchain.</p>",
        "id": 574976093,
        "sender_full_name": "Mikhail Mayorov",
        "timestamp": 1771603301
    },
    {
        "content": "<p>indeed, I find <code>lake --keep-toolchain ...</code> much more predictable and have yet to find a use case where I would want lake to interfere with the project's toolchain... </p>\n<p>I think the feature would be much better if there was a way to prioritise the toolchain required by <code>mathlib</code> over toolchains from other dependencies, but I doubt lake would want to hardcode that so it would need to be yet another configuration option</p>",
        "id": 575067683,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1771658539
    }
]