[
    {
        "content": "<p>Is it possible to put lean3 and lean4 code within the same git repository? I don't need them to interact with each other, I just want to be able to present them side-by-side.</p>\n<p>I tried this at <a href=\"https://github.com/eric-wieser/lean-multiple-inheritance\">https://github.com/eric-wieser/lean-multiple-inheritance</a>, but when I open it with vscode (say, through gitpod), I can't seem to get the Lean4 extension to work unless I deactivate the Lean3 one</p>",
        "id": 350708968,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1681807294
    },
    {
        "content": "<p>How is this set-up any different to the <code>lean-projects</code> directory on my computer which contains some lean 3 projects and some lean 4 projects? Are you opening the <code>lean3</code> and <code>lean4</code> directories in two different VS Code instances, or trying to do something else?</p>",
        "id": 350725481,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1681811199
    },
    {
        "content": "<p>Perhaps the problem is I'd like to open them both within the same vscode instance.</p>",
        "id": 350728084,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1681811835
    },
    {
        "content": "<p>Yes, a single vscode window cannot run both the Lean 3 and Lean 4 extensions at the same time.</p>",
        "id": 351122873,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1681928114
    },
    {
        "content": "<p>Not directly related, but sometimes VSCode gets confused and opens <code>lean3</code> files as <code>lean4</code> ones (and then complains a lot).  What I typically do is to temporary disable the <code>lean4</code>extension, and then everything is OK again. Does this happen to someone else, is there a way to avoid this VSCode confusion?</p>",
        "id": 351402717,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1682015869
    }
]