[
    {
        "content": "<p>At the Lean FRO, we want to improve our communication on external contributions, be they bug reports, PRs, or RFCs, and especially more clearly communicate the priority by which we plan to address such a contribution. Please see <a href=\"https://github.com/leanprover/lean4/blob/master/CONTRIBUTING.md#reviews-and-feedback\">Reviews and Feedback</a> in the contribution guidelines for details on this new triaging process that has now started.</p>",
        "id": 454333599,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1722011418
    },
    {
        "content": "<p>I'm confused about the meaning of this part:</p>\n<blockquote>\n<p>Accepted RFCs are marked with the label <code>RFC accepted</code> and afterwards assigned a new \"implementation\" priority as with bug reports.</p>\n</blockquote>\n<p>Why is the word implementation in quotes here? It's also unclear exactly what \"as with bug reports\" is referring to: the interpretation of the new priority or the assignment process itself.</p>",
        "id": 454462558,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1722078657
    },
    {
        "content": "<p>Let me try to repharase: An accepted RFC becomes an open bug.<br>\nSo while an RFC is not accepted the priority indicates how pressing we think it is to discuss the RFC and decide upon a design (or against the RFC). Once accepted, there is coding to do.<br>\nIt’s feasible that some RFC looks important, but then the discussion shows that there is something to do (so we have an accepted design), but actually not that pressing (maybe good work-arounds have been demonstrated), so actually implementing the RFC is not of high priority.</p>",
        "id": 454481714,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1722092749
    },
    {
        "content": "<p>That's much clearer but perhaps too detailed. Let me take a stab at something short and still clearer than the original:</p>\n<blockquote>\n<p>Once a RFC  is marked with the label <code>RFC accepted</code>, it will be assigned a new priority that reflects our commitment to implementing the proposal (similar to fixes for bug reports).</p>\n</blockquote>",
        "id": 454508858,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1722104557
    },
    {
        "content": "<p>Another small issue. Since label changes don't ping anyone (including the OP), perhaps <code>RFC accepted</code> should be accompanied by a comment? (A message is not necessary for priority assignments since those are now expected.) </p>\n<p>I recently had a RFC (<a href=\"https://github.com/leanprover/lean4/pull/4654\">lean4#4654</a>) marked <code>RFC accepted</code> but I had no clue until I checked on the RFC to record the number. It's only by chance that I noticed the new label. I can easily imagine a <code>RFC accepted</code> label going unnoticed for a very long time.</p>",
        "id": 454512390,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1722105892
    },
    {
        "content": "<p>That's a good point. Maybe that can be integrated into our automation for this process that <span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> is putting together</p>",
        "id": 454514535,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1722107185
    }
]