[
    {
        "content": "<p>Hey all,</p>\n<p>I have been learning lean and continually find myself struggling with reading lean proofs. The syntax comes with a lot of baggage because it was never designed specifically for math, and that makes the learning curve really steep. Rather than complain about it I hacked together a  prototype VSCode extension that defines a custom language and live-translates it to a lean file. Beyond syntax highlighting updates there are a few other things that might help with readability. Here is a quick list of features shown off in the video:</p>\n<ol>\n<li>Breaks a proof block up into 4 collapsible sub-blocks</li>\n<li>Allows the user to not define the name for a hypothesis and call it directly in the proof block</li>\n<li>Grants more freedom for the syntax used in declarations, such as allowing comma separated variable names</li>\n<li>Allows the user to write ‘via’ in stead of := by” and adds syntax highlighting</li>\n</ol>\n<p>I was writing this for myself, but <span class=\"user-mention\" data-user-id=\"252920\">@Alex Kontorovich</span>  thought others might be interested. Are there other features you’d like to see? What don’t you like? Any and all feedback is appreciated.</p>\n<p><a href=\"/user_uploads/3121/-A9hQ8w8TbFgr7R8up-wsRlr/Screen-Recording-2024-09-23-at-10.26.56PM.mov\">Screen-Recording-2024-09-23-at-10.26.56PM.mov</a></p>",
        "id": 472379304,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1727145593
    },
    {
        "content": "<p>You might like looking at <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span>'s <a href=\"https://github.com/PatrickMassot/verbose-lean4\">Verbose Lean</a>. (<a href=\"https://github.com/PatrickMassot/verbose-lean4/blob/master/Verbose/English/Examples.lean\">Examples</a>)</p>\n<p>This language is implemented from within Lean, so it works from within the standard VS Code extension, and it inherits hoverability and all that. It doesn't have any of the collapsibility you have though.</p>",
        "id": 472384575,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1727147106
    },
    {
        "content": "<p>Are you aware of the <code>rw [‹a + b = 1›]</code> syntax for 2?</p>",
        "id": 472474424,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1727178776
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"624658\">@Eric Vergo</span>  This is all nice but indeed you made it a lot more complicated than needed by not using the flexibility of Lean 4 syntax.</p>",
        "id": 472540920,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1727198600
    },
    {
        "content": "<p>See <a href=\"https://raw.githubusercontent.com/PatrickMassot/verbose-lean4/refs/heads/master/itp2024_paper.pdf\">https://raw.githubusercontent.com/PatrickMassot/verbose-lean4/refs/heads/master/itp2024_paper.pdf</a> for more about Verbose Lean.</p>",
        "id": 472541856,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1727198931
    },
    {
        "content": "<p>All of your points are well taken, but I think I did a poor job of communicating what I shared this:</p>\n<p>Is this partially redundant? Yes. Overcomplicated? Also yes. But I’m not interested in these things right now - this is a hacked together prototype and we can ‘do it right’/optimize it later. Plus I’ve never written anything in Lean before, and have experience with javascript and typescript. So why did I put this together?</p>\n<p>For a lot of different reasons, I want all mathematicians to use Lean. And with all due respect to the people who have built it, I don’t think that’s going to happen with the language in its current form. When showing Lean to my professors and other students I have been met with responses such as “gross” and “this looks awful”. Right now asking someone to read a Lean proof is like asking them to read a TeX document rather than the pdf it generates. This is going to significantly reduce the adoption rate, both in terms of speed and overall proliferation. I think we can do better.</p>\n<p>In my opinion Verbose lean is clearly better than the default language, but I think this space is worth exploring more. In the interest of that:</p>\n<p>Do people see anything with value here? If so I can expand those features.<br>\nDo people have any features they know they would love to have? If so I can try to prototype them.<br>\nDo people have any ‘pain points’ in the syntax, but don’t know how it could be done better? If so we can brainstorm solutions.</p>",
        "id": 472587798,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1727220362
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"624658\">@Eric Vergo</span>, I think we're all in furious agreement that Lean needs to made easier to read!</p>\n<p>My concern with what you're trying to do is that it seems like an all-or-nothing thing: I don't think you're going to get any meaningful adoption unless it can cope with the full variety of Lean syntax as it appears in libraries, and that seems very unlikely for an interface written outside of Lean. (And I'd be skeptical of an argument like \"this could be used for custom small libraries for teaching\", as that would be doing students a disservice when they had to switch to \"standard\" Lean.)</p>\n<p>Of course I'd be delighted to be proved wrong. :-)</p>\n<p>The need to cope with Lean-as-it-is is why I would recommend that to make progress on this front, the right approach is to learn how to make usability improvements that could be deployed for all Lean users (i.e. that use the InfoView, or improve pretty printing, etc. etc.)</p>",
        "id": 472590443,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1727222448
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"624658\">@Eric Vergo</span> One other take on this (and <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> has also worked on this together with <span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> in their informalization project) is the following:</p>\n<p>People look at Lean and say \"ouch I don't want to read this\", and \"it is like reading TeX instead of the generated PDF\".<br>\nBut mathematicians don't have any problem with writing TeX. And many of them even define their own macros and packages etc...<br>\nBut then we still read the beautiful PDFs instead of the raw TeX.</p>\n<p>So one way I look at this is: we want a very powerful input language. And it might have a quirky syntax in order to support many powerful features (like macros, metaprogramming, syntax extensions, etc).<br>\nBut then nothing should stop us from rendering this in a way that is meant for <em>reading</em> instead of <em>writing</em>.</p>\n<p>The informalization project by Patrick and Kyle is one prototype for this. And Verso by <span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span> is another project (still WIP) that does this.</p>\n<p>Tl;dr: The language we write and the language we read don't need to be identical.</p>",
        "id": 472623839,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1727246488
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"624658\">@Eric Vergo</span> Also: I think it is really good that you are exploring this space! So please don't read my message as \"stop doing what you're doing\"</p>",
        "id": 472623980,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1727246546
    },
    {
        "content": "<p>Is there work on delaboration to LaTeX?</p>",
        "id": 472631674,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1727249757
    },
    {
        "content": "<p>Yes, that part is even public: <a href=\"https://github.com/kmill/LeanTeX\">https://github.com/kmill/LeanTeX</a></p>",
        "id": 472643023,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1727253689
    },
    {
        "content": "<p>I didn’t take your message, or anyone else’s for that matter, to mean ‘stop working on this’. This is something I’m interested in, partially aligns with my skillset, and is a place I think I can provide value; so I’m going to continue to tinker. Beyond that I think it’ll help if I share where I’m coming from: </p>\n<p>I think Lean is in its relative infancy. To put a fine-point on it, I’m expecting that Lean/mathLib are going to grow by many orders of magnitude in size over the next decade. In my experience the right time to go wide by experimenting is before you go tall and do something millions of times.</p>\n<p>We come from very different backgrounds, but I suspect we are here for the same reason: I’m here to build something great, and get the sense that all of you are too.<br>\n￼<br>\n<a href=\"/user_uploads/3121/ikVzlEEBCxKkePXJLjC0U4xP/Screenshot-2024-09-25-at-11.49.20AM.png\">Screenshot 2024-09-25 at 11.49.20AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/ikVzlEEBCxKkePXJLjC0U4xP/Screenshot-2024-09-25-at-11.49.20AM.png\" title=\"Screenshot 2024-09-25 at 11.49.20AM.png\"><img data-original-dimensions=\"1992x470\" src=\"/user_uploads/thumbnail/3121/ikVzlEEBCxKkePXJLjC0U4xP/Screenshot-2024-09-25-at-11.49.20AM.png/840x560.webp\"></a></div>",
        "id": 472958769,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1727377712
    },
    {
        "content": "<p>One of my goals in <a href=\"https://djvelleman.github.io/HTPIwL/\">How To Prove It with Lean</a> was to write proofs that are more readable.  To some extent this suffers from the problem Kim identified: I wrote some simple tactics to create a \"dialect\" of Lean that is somewhat different from standard Lean.  But the differences are not huge, and I find the proofs easier to read than most Lean proofs.</p>",
        "id": 472960977,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1727378799
    },
    {
        "content": "<p>another idea where this kind of skill-set could be useful: You know how in VSCode one can open a preview (rendered version) of any <code>.md</code> file by pressing Ctrl+Shift+V? I would love the same feature for a random Lean file, opening a \"prettier version\" in a new VScode tab as preview, even if \"prettier\" is something very rudimentary for now which can later be replaced with a better renderer.</p>",
        "id": 472986849,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1727392371
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"624658\">Eric Vergo</span> <a href=\"#narrow/stream/270676-lean4/topic/Lean.20syntax.20simplifier/near/472587798\">said</a>:</p>\n<blockquote>\n<p>When showing Lean to my professors and other students I have been met with responses such as “gross” and “this looks awful”.</p>\n</blockquote>\n<p>For what it's worth, I'm still quite amazed about how beautiful Lean as a Language is, while being as expressive as it is! In my opinion it's way better than latex source code! But you are certainly right about certain ideas how to display things.</p>",
        "id": 472986856,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1727392379
    },
    {
        "content": "<p>In the <a href=\"https://adam.math.hhu.de/#/g/hhu-adam/robo/world/Trace/level/6\">display for the natural number game</a> we also did this distinction between \"declarations\" and \"assumptions\", but I don't think this works as input modus: There are statements which cannot be expressed by having all \"declarations\" first and then all \"assumptions\" afterwards.</p>",
        "id": 472986865,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1727392383
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"453098\">Dan Velleman</span> <a href=\"#narrow/stream/270676-lean4/topic/Lean.20syntax.20simplifier/near/472960977\">said</a>:</p>\n<blockquote>\n<p>One of my goals in <a href=\"https://djvelleman.github.io/HTPIwL/\">How To Prove It with Lean</a> was to write proofs that are more readable.  To some extent this suffers from the problem Kim identified: I wrote some simple tactics to create a \"dialect\" of Lean that is somewhat different from standard Lean.  But the differences are not huge, and I find the proofs easier to read than most Lean proofs.</p>\n</blockquote>\n<p>this looks great, going to check it out.</p>",
        "id": 473141223,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1727451821
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"385895\">Jon Eugster</span> <a href=\"#narrow/stream/270676-lean4/topic/Lean.20syntax.20simplifier/near/472986849\">said</a>:</p>\n<blockquote>\n<p>another idea where this kind of skill-set could be useful: You know how in VSCode one can open a preview (rendered version) of any <code>.md</code> file by pressing Ctrl+Shift+V? I would love the same feature for a random Lean file, opening a \"prettier version\" in a new VScode tab as preview, even if \"prettier\" is something very rudimentary for now which can later be replaced with a better renderer.</p>\n</blockquote>\n<p>I love this and will find time to put a prototype together. As an exercise I’m going to try and come up with as many other ideas in this space as I can and prototype them. Additionally, I’m planning on doing an independent study under Alex Ryba next semester. We wanted to do something Lean related, but didn’t have a good idea of what to do. Maybe something will come out of this exercise thats worth spending more time on. After hearing your suggestion, if that happens I bet it’ll be something close to what you described, but who knows.</p>",
        "id": 473141356,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1727451844
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"385895\">Jon Eugster</span> <a href=\"#narrow/stream/270676-lean4/topic/Lean.20syntax.20simplifier/near/472986856\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"624658\">Eric Vergo</span> <a href=\"#narrow/stream/270676-lean4/topic/Lean.20syntax.20simplifier/near/472587798\">said</a>:</p>\n<blockquote>\n<p>When showing Lean to my professors and other students I have been met with responses such as “gross” and “this looks awful”.</p>\n</blockquote>\n<p>For what it's worth, I'm still quite amazed about how beautiful Lean as a Language is, while being as expressive as it is! In my opinion it's way better than latex source code! But you are certainly right about certain ideas how to display things.</p>\n</blockquote>\n<p>I’m still amazed at the fact anything like this could exist at all. That's why I keep trying to share it with people!</p>",
        "id": 473141441,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1727451870
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"385895\">Jon Eugster</span> <a href=\"#narrow/stream/270676-lean4/topic/Lean.20syntax.20simplifier/near/472986865\">said</a>:</p>\n<blockquote>\n<p>In the <a href=\"https://adam.math.hhu.de/#/g/hhu-adam/robo/world/Trace/level/6\">display for the natural number game</a> we also did this distinction between \"declarations\" and \"assumptions\", but I don't think this works as input modus: There are statements which cannot be expressed by having all \"declarations\" first and then all \"assumptions\" afterwards.</p>\n</blockquote>\n<p>I don’t think it can work in all situations, but I also think that it doesn’t have to. Maybe the right way to classify what I shared is a ‘notation convention’. This wasn’t shown, but the translator passes anything it doesn’t see in its ‘phrase book’ unchanged. As an example, you don’t have to write ‘via’ in place of ‘:= by’ but you can if you want to.<br>\nThe example I shared is pretty simple, and that was done so I could focus on getting the code working. I think it makes sense to move on to more complicated files. I was thinking of taking a few <a href=\"https://github.com/mo271/FormalBook/blob/main/FormalBook/Chapter_01.lean\">proofs from the book</a> as test cases.</p>",
        "id": 473141532,
        "sender_full_name": "Eric Vergo",
        "timestamp": 1727451895
    }
]