[
    {
        "content": "<p>Hi all,<br>\nLately lean's web server seems to crash at the slightest syntactic error that could be fixed in a minute. This results in the server frequently crashing. Further, at least on firefox, Ctrl + shift + X doesn't restart the server. Not sure why. At least this is the case on Ubuntu + firefox</p>\n<p>CC : <span class=\"user-mention\" data-user-id=\"385895\">@Jon Eugster</span></p>",
        "id": 472960746,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727378694
    },
    {
        "content": "<p>I have not noticed the frequent crashes, but I usually refresh the tab as a substitute for restarting.</p>",
        "id": 472973253,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727384677
    },
    {
        "content": "<p>Also, I think that this is new (I had certainly never noticed it earlier), but now \"Go to definition\" in the online server takes you to the documentation pages: this is awesome!</p>",
        "id": 472973363,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727384751
    },
    {
        "content": "<p>It crashes for me as soon as I do that</p>",
        "id": 472973431,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727384766
    },
    {
        "content": "<p>I don't really know what could be causing it: I'm also using Firefox, on Linux.</p>",
        "id": 472973898,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727385012
    },
    {
        "content": "<p>The last maybe two weeks I observe often heavy load on the machine that wasn’t there before. This may be partly due to a known bug lean4web where a session may spawn duplicate lean processes, but that doesn't fully explain it.</p>",
        "id": 472973919,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1727385028
    },
    {
        "content": "<p>Ctrl+Shift+X is not supposed to work, or at least thats never been implemented. You should be able to click the \"Restart File\" button in the infoview or the \"Restart Server\"  button from the menu.</p>\n<p>For the crashes, could you give me some concrete operations you do to get the server to crash? I'll try to take some time tomorrow to look at it and the process duplication, too</p>",
        "id": 472979453,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1727387884
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> indeed, I implemented a hacky go-to-def. it's quite rough around the edges, but it works in a good amount of cases<span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 472979599,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1727388000
    },
    {
        "content": "<p>Well, the doc page thing is just one example. It is hard to pin down exactly when the editor crashes. Usually when I am midway through a long def or editing an old def which temporarily introduces a downstream error. To be fair it could just be the LSP that is at fault, since I had crashes at calls for <code>inferInstance</code> both locally and on lean web</p>",
        "id": 472979928,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727388150
    },
    {
        "content": "<p>ok, so there are certainly errors thrown to the browser console when shift-howering over things just before go-to-def.</p>\n<p>Could you open the browser debug tools and see if you a)  see these errors pop up when shift-hovering and b) if they cause problems for you?</p>",
        "id": 472980402,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1727388389
    },
    {
        "content": "<p>I will try this today. Hopefully the crashes prove deterministic enough to reproduce them</p>",
        "id": 473039293,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727423909
    }
]