[
    {
        "content": "<p>Back in the old days of Lean 3, we often had people who didn't want to use the recommended setup, complained about having to install some python-based supporting tools, or simply were confused by how all those pieces fitted together. I wrote <a href=\"https://leanprover-community.github.io/toolchain.html\">https://leanprover-community.github.io/toolchain.html</a> for those people. We could simply get rid of this webpage, but I think it would be nice to have a Lean 4 version. However this would require very heavy editing. <span class=\"user-mention\" data-user-id=\"315577\">@Mac Malone</span> and <span class=\"user-mention\" data-user-id=\"128280\">@Wojciech Nawrocki</span>, you know a lot more about the project infrastructure and Lean editor protocol. Would you be interested in working on this update?</p>",
        "id": 389508869,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1694030816
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> I am happy to answer any questions and review any new drafts. <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span>   From a design standpoint, though, I am conscious of the overlap with the <a href=\"https://leanprover.github.io/lean4/doc/quickstart.html\">Lean 4 manual</a>. If a detailed overview of the Lean 4 toolchain is developed, it might be worth discussing where it would be best located (and if the other locations should duplicate some of the material or link to it).</p>",
        "id": 389518530,
        "sender_full_name": "Mac Malone",
        "timestamp": 1694035587
    },
    {
        "content": "<p>That's a fair point. What happened in the Lean 3 is that the full toolchain (not in the elan sense) included mathlib-only stuff. As far as I understand, this is still true as long as <code>lake exe cache get</code> is a mathlib thing and not a purely lake thing.</p>",
        "id": 389518755,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1694035711
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315577\">@Mac Malone</span> I think it is worth the duplication, because there will always be mathlib-only stuff and the lean 4 manual tends not to mention mathlib that much, which makes it not a good place to survey the whole zoo of tools</p>",
        "id": 389928583,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1694197120
    }
]