[
    {
        "content": "<p>In case anyone is interested, I recently managed to compile Lean programs to a RISC-V microcontroller. (Searching the Zulip, I couldn't find any references to microcontrollers or embedded systems, so AFAICT I am the first one to do this.)</p>\n<p>Right now my demo program can read GPIO input, and flash an LED in various patterns. Obviously this is still just an early proof-of-concept, a lot more work would be needed to turn this into something generally usable.</p>\n<p><a href=\"https://github.com/kuruczgy/lean-esp32\">Here is the project repo</a>, and I also have <a href=\"https://kuruczgy.com/blog/2024/07/31/lean-esp32/\">a longer blog article about this project</a> if you are interested in the details.</p>\n<p>Notes about my experience doing this:</p>\n<ul>\n<li>\n<p>My biggest issue was that in the precompiled Init library the initialization code (<code>initialize_Init</code>) is quite big (by embedded standards at least), is anyone aware of a (nice) method to only end up with initialization code for constants that are actually used by the program?</p>\n</li>\n<li>\n<p>Runtime: it would be cool to have a lot more <code>#ifdef</code>s to compile away e.g. the checks for all the negative refcounts when threading is disabled, or disable all the library functions that don't have a reasonable implementation in an embedded context (e.g. everything in <code>process.cpp</code>).</p>\n</li>\n<li>\n<p>Lake could have better support for cross compilation, e.g. right now it seems that there isn't really support for managing multiple <code>libInit.a</code>s or runtimes for different architectures. (Having all the libs as LLVM bitcode could solve the arch issue, but as I mentioned previously you probably want to have a different runtime version for the embedded target.)</p>\n</li>\n<li>\n<p>31 bit integers would be cool, a la OCaml. (But maybe a more general special casing of <code>Fin n</code> could be done? E.g. as long as <code>n &lt;= 2^31</code> we know that it is always represented as a scalar, no need to check for the general Nat representation.)</p>\n</li>\n</ul>",
        "id": 455342171,
        "sender_full_name": "György Kurucz",
        "timestamp": 1722421172
    }
]