[
    {
        "content": "<p>I'd like to suggest a change to the lean4 README, and the docs for creating an issue led me here.</p>\n<p>I'm having trouble finding resources for places I can ask lean4 questions. There is a lot of good stuff in terms of documentation on the README, but that can only go so far. For example, I only learned about elan after a long time of searching. A lot of the resources online are for lean3 and that gets confusing. This seems to be a fairly active discussion page where you can ask questions, so maybe it makes sense to link to this page on the README? (If it's there then I missed it).</p>\n<p>Also if there are other places on could seek help with using lean4, a list of places like that would be a helpful addition to the top-level docs.</p>",
        "id": 394036821,
        "sender_full_name": "Jonathan Crall",
        "timestamp": 1696042400
    },
    {
        "content": "<p>This is definitely the place to ask questions about lean 4</p>",
        "id": 394037109,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696042650
    },
    {
        "content": "<p>you can also ask questions on the proof assistant SE <a href=\"https://proofassistants.stackexchange.com/\">https://proofassistants.stackexchange.com/</a> , especially if your question applies to multiple proof assistants</p>",
        "id": 394037203,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696042721
    },
    {
        "content": "<p>I am surprised that <code>elan</code> was hard to spot, it should be in the getting started page</p>",
        "id": 394037235,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696042761
    },
    {
        "content": "<p>there is some indirect discussion of elan on step 3 of the <a href=\"https://github.com/leanprover/lean4/blob/master/doc/quickstart.md\">quickstart</a></p>",
        "id": 394037355,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696042836
    },
    {
        "content": "<p>following those instructions will install elan, and you don't normally interact with it directly otherwise</p>",
        "id": 394037412,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696042885
    },
    {
        "content": "<p>the fact that a lot of lean 3 documentation is out there is a problem we are aware of; it is unfortunately quite a lot of effort to make comparable lean 4 documentation (and get it to show up in searches) but it's getting done slowly</p>",
        "id": 394037652,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696043008
    },
    {
        "content": "<p>I agree that the zulip instance should be more prominently shown on the readme; it is at least as important as books like FPIL for getting users situated</p>",
        "id": 394037907,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696043214
    },
    {
        "content": "<p>I'm really a vim+terminal kind of guy, so the vscode instructions are hard for me to follow. The only reason I'm using vscode is because the interactive integration with lean seems very nice, but the magic \"install plugin\" button is less than helpful when it comes to building understanding. When I try to run new software I've never used, I'm looking for executables and PATH modifications. The example here: <a href=\"https://gist.github.com/jcommelin/1d45a0ea7a84a87db8a28a12e93cac32\">https://gist.github.com/jcommelin/1d45a0ea7a84a87db8a28a12e93cac32</a> is what cued me into elan. The main reason I went looking for it was because I was having a very hard time getting any new lean files to recognize mathlib as something that was importable. This is the other page that helped me out: <a href=\"https://leanprover-community.github.io/install/project.html\">https://leanprover-community.github.io/install/project.html</a> but there doesn't seem to be singular resource that brings you from zero to: you can write code in this file, reference external libraries, and execute your code like this. Something of that ilk might be very helpful to newcomers like me.</p>\n<p>EDIT: I should mention that the quickstart did get me to the point where I could use barebones lean very easilly. It might be good to add a section for \"if you want to use mathlib\" in addition to if you want to contribute.</p>",
        "id": 394042759,
        "sender_full_name": "Jonathan Crall",
        "timestamp": 1696046956
    },
    {
        "content": "<p>note that working from an old gist is pretty fraught</p>",
        "id": 394043246,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696047210
    },
    {
        "content": "<p>I see references to 2018 in there, things have changed significantly since then</p>",
        "id": 394043283,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696047231
    },
    {
        "content": "<p>the leanprover-community get started docs <a href=\"https://leanprover-community.github.io/install/debian.html\">here</a> go into a reasonable level of detail for folks who like to use the terminal</p>",
        "id": 394043449,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696047358
    },
    {
        "content": "<p>if you want to use mathlib that's a good place to start</p>",
        "id": 394043518,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696047399
    },
    {
        "content": "<p>other official lean sources mention mathlib as a bit of an afterthought because they are trying to be more broadly applicable</p>",
        "id": 394043544,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696047436
    },
    {
        "content": "<p>I think the page <a href=\"https://lean-lang.org/download/\">https://lean-lang.org/download/</a> could be improved though. I've certainly seen competent people I've spoken about lean to at workshops speed through the \"google name of software &gt; click on first link &gt; click download &gt; click binaries\" cycle without reading the \"You will usually want to follow the official instructions instead of downloading these releases directly.\" part at all, and then wondering why nothing works because every step seemed reasonable.</p>",
        "id": 394247052,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1696184778
    },
    {
        "content": "<p>I think rust does a good job of steering people looking for downloads to <a href=\"http://rustup.rs\">rustup.rs</a> or <a href=\"https://www.rust-lang.org/tools/install\">https://www.rust-lang.org/tools/install</a></p>",
        "id": 394250113,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696186822
    },
    {
        "content": "<p>I'm pretty sure we want to do the same kind of thing</p>",
        "id": 394250153,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696186855
    },
    {
        "content": "<p>the install page there in particular is well laid out, it's focused on \"what do people coming here want\" rather than \"what do we have\"</p>",
        "id": 394250236,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696186930
    },
    {
        "content": "<p>labelling something as \"(recommended)\" is good for the speedrunners</p>",
        "id": 394250263,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1696186987
    },
    {
        "content": "<p>maybe it's a good idea to have a topic pinned somewhere for keeping track of old/misleading documentation, so that we can find someone who can take it down or link to the right place :)</p>",
        "id": 394487342,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1696270085
    }
]