[
    {
        "content": "<p>Hey all, on latest stable, in a clean project, if you declare the exe root to be a certain module and that module doesn't have a top level <code>main</code> function, you get an inscrutable error from the <em>linker</em> rather than any error from Lake. Could we get a better error message?</p>\n<p>I am working on a complicated program downstream of Mathlib and got the linker error, assumed it was something way more difficult to debug, and then happened by chance to notice my main function wasn't in the root namespace and that was the issue.</p>",
        "id": 451624356,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1721075206
    },
    {
        "content": "<p>I <em>think</em> this is a question for <span class=\"user-mention\" data-user-id=\"315577\">@Mac Malone</span>? Let me know if I should make a GH issue!</p>",
        "id": 451624488,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1721075259
    },
    {
        "content": "<p>A GH issue for this would be great! Solving this will probably require some new coordination between Lean and Lake.</p>",
        "id": 451624727,
        "sender_full_name": "Mac Malone",
        "timestamp": 1721075346
    },
    {
        "content": "<p>(Since either Lake needs to figure out that the module has a <code>main</code> in it or it needs a way to tell Lean that is expecting it to have one.)</p>",
        "id": 451624970,
        "sender_full_name": "Mac Malone",
        "timestamp": 1721075421
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover/lean4/issues/4752\">https://github.com/leanprover/lean4/issues/4752</a> <span aria-label=\"saluting face\" class=\"emoji emoji-1fae1\" role=\"img\" title=\"saluting face\">:saluting_face:</span></p>",
        "id": 451629876,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1721077333
    },
    {
        "content": "<p>I'm hoping this is an easy fix -- even with some familiarity with how C programs are compiled, it's a scary (and huge) error message to get from such a small/careless mistake</p>",
        "id": 451630158,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1721077446
    },
    {
        "content": "<p>If you wanted to move \"linter errors should come with an explanation that something has gone horribly wrong and it's not your fault\" to a separate issue, that would be helpful. I agree we should be nicer to the user here.</p>",
        "id": 451827944,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1721153818
    },
    {
        "content": "<p>Sure. I wasn’t entirely sure what scope I wanted the error message improved for, though — I get linker errors often when doing FFI work, and on one hand the errors definitely could be improved (eg reporting an error on an implemented_by) but on the other it is a much more difficult problem to solve</p>",
        "id": 451830667,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1721154394
    },
    {
        "content": "<p>Like, I think you could get a linker error if a project you depend on is missing some C library dependency, and it’s not the compiler or library author’s fault. Which is a hairy edge case to explain in an error message :/</p>",
        "id": 451831183,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1721154493
    }
]