[
    {
        "content": "<p>For a particular identifier, is it possible to list all the attributes assigned to it?</p>\n<p>For example, can it be verified that the <code>[reducible]</code> attribute is assigned to <code>hoge</code> when <code>abbrev hoge := String</code>?</p>",
        "id": 482843037,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1731832347
    },
    {
        "content": "<p>Aah, I remember the old days...</p>\n<p>This was a thing in lean 3 but apparently in lean 4 it's much harder.</p>",
        "id": 482845735,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1731834849
    },
    {
        "content": "<p>Each attribute is responsible for storing its own data, and currently there is no central \"registry\" that attributes could, voluntarily or otherwise, contribute data to.</p>",
        "id": 482848778,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1731838075
    },
    {
        "content": "<p>oh no..</p>",
        "id": 482848826,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1731838093
    },
    {
        "content": "<p>So you're saying that no matter how hard we work on meta programming, we can't do it?</p>",
        "id": 482879547,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1731863762
    },
    {
        "content": "<p>The current limitation is that if you want to find out whether a definition has the reducible attribute, you have to query the reducible attribute extension. If you want to find out whether a definition has the csimp attribute you have to query the csimp extension (which has a different interface). And so on. This makes it exceedingly difficult to implement a version of <code>#print</code> that shows all attributes, because you have to write a hundred mini functions, and you won't be complete anyway because people can add more attributes later</p>",
        "id": 482881381,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1731865168
    },
    {
        "content": "<p>What we actually need here is to extend the interface of <code>AttributeExtension</code> such that it can print as well as parse attribute syntax</p>",
        "id": 482881494,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1731865252
    },
    {
        "content": "<p>and then you could just call all attribute extensions to print syntax for a given definition</p>",
        "id": 482881515,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1731865272
    },
    {
        "content": "<p>There is an RFC open for attributes in <code>#print</code> now: <a href=\"https://github.com/leanprover/lean4/pull/6107\">lean#6107</a> (and a fix in <a href=\"https://github.com/leanprover/lean4/pull/6115\">lean#6115</a>)</p>",
        "id": 483015007,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1731934648
    }
]