[
    {
        "content": "<p>I propose that we have a lockdown mode for Lean 4 and it should be the default. The lockdown mode prevents all side effects from being executed, like filesystem I/O, spawning child processes, accessing the internet, etc. With lockdown mode, Lean 4 becomes a proof assistant only, which is the primary use anyway. While currently mathlib is the only major library in the ecosystem, in the future there can be more mathematical libraries. Lockdown mode ensures that we can safely install additional mathematical libraries to suit our needs without having to risk running untrusted code, getting a virus or having our data exfiltrated.</p>\n<p>This is just a proposal. Once there is enough support I can start working on it.</p>",
        "id": 524370391,
        "sender_full_name": "(deleted)",
        "timestamp": 1750135131
    },
    {
        "content": "<p>You can just run a lean process in <a href=\"https://github.com/Zouuup/landrun\">https://github.com/Zouuup/landrun</a> or any other sandbox that's out there and it's going to be in what you call \"lockdown mode\".</p>",
        "id": 524380484,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1750142021
    },
    {
        "content": "<p>I think the problem is that most Lean users will not use such a sandbox, but they will possibly be running untrusted code. So I think it is a reasonable idea to have this safety net built in for \"average\" Lean users</p>",
        "id": 524437955,
        "sender_full_name": "Jovan Gerbscheid",
        "timestamp": 1750162187
    },
    {
        "content": "<p>I agree. This is my primary motivation for making this proposal. I myself run Lean in a sandbox already.</p>",
        "id": 524438623,
        "sender_full_name": "(deleted)",
        "timestamp": 1750162441
    },
    {
        "content": "<p>Additionally, having the infrastructure in place means that in the future we can make lockdown mode more fine grained. Initially we can start with a blanket lockdown. But in the future lockdown mode could be per package, and each package can explicitly declare the permissions it needs.</p>",
        "id": 524439049,
        "sender_full_name": "(deleted)",
        "timestamp": 1750162589
    },
    {
        "content": "<p>Not that I oppose to the idea. I think it's reasonable.<br>\nBut to compare with another language many here may like, Rust's custom build scripts can also cause arbitrary damage to one's system at compile time. At least the risk is more contained there and not spread across the code base.</p>",
        "id": 524439638,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1750162788
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"479299\">Jovan Gerbscheid</span> <a href=\"#narrow/channel/270676-lean4/topic/lockdown.20mode/near/524437955\">said</a>:</p>\n<blockquote>\n<p>I think the problem is that most Lean users will not use such a sandbox, but they will possibly be running untrusted code. So I think it is a reasonable idea to have this safety net built in for \"average\" Lean users</p>\n</blockquote>\n<p>If it is the average Lean user that you are looking for, you quickly run into the issue that this average (likely mathematician) user will probably run Windows and Windows does not have the capabilities to perform privilege drop in the same fashion that Linux (and I guess MacOS? though I don't know) has. You can't just say that some subprocess may not execute a system call to open a network socket on Windows. You might of course reason that the runtime should attempt to enforce this type of stuff but there is nothing stopping an adversarial user from linking in their own C code into say a natively compiled tactic and once that tactic gets called making that piece of C code perform a network request or whatever other system call they want. So you definitely require an OS level mechanism (which again, to the best of my knowledge is not available on Windows) unless you want to somehow add very deep restraints into what lake can do etc. which is likely out of scope for the forseeable future.</p>",
        "id": 524440849,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1750163162
    },
    {
        "content": "<p>I mean if Windows didn't have a mechanism for sandboxing Chromium and thus Chrome wouldn't exist... But this is something I'll research more.</p>",
        "id": 524441563,
        "sender_full_name": "(deleted)",
        "timestamp": 1750163365
    },
    {
        "content": "<p>Looks like there's this mechanism <a href=\"https://learn.microsoft.com/en-us/windows/win32/secauthz/restricted-tokens\">https://learn.microsoft.com/en-us/windows/win32/secauthz/restricted-tokens</a></p>",
        "id": 524443470,
        "sender_full_name": "(deleted)",
        "timestamp": 1750163950
    },
    {
        "content": "<p>I initially thought that we could limit the capabilities at the Lean level but now that it's clear an OS level mechanism is required heading in that direction is reasonable too. Let me see what I can do.</p>",
        "id": 524443775,
        "sender_full_name": "(deleted)",
        "timestamp": 1750164043
    },
    {
        "content": "<p><a href=\"https://chromium.googlesource.com/chromium/src/+/main/docs/design/sandbox.md#Sandbox-Windows-architecture\">https://chromium.googlesource.com/chromium/src/+/main/docs/design/sandbox.md#Sandbox-Windows-architecture</a></p>",
        "id": 524448502,
        "sender_full_name": "(deleted)",
        "timestamp": 1750165450
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"395550\">Henrik Böving</span> <a href=\"#narrow/channel/270676-lean4/topic/lockdown.20mode/near/524440849\">said</a>:</p>\n<blockquote>\n<p>If it is the average Lean user that you are looking for, you quickly run into the issue that this average (likely mathematician) user will probably run Windows</p>\n</blockquote>\n<p>I think this estimate is extremely unfair to the average mathematician. I don’t know more than a handful of mathematicians using Windows. In my department I was never able to find one when I needed to test Lean installation instructions on Windows before giving them to students.</p>",
        "id": 524586564,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1750190252
    },
    {
        "content": "<p>I've identified the lockdown route for both Linux and Windows. For Windows we can use restricted tokens. For Linux we can use namespaces. I don't have a Mac so I have no idea. If maintainers are fine with me using OS level sandboxing mechanisms then I can start working. This is to me the easiest path, compared to modifying how side effects are handled at the Lean level.</p>\n<p>From the two links I sent, Windows has adequate sandboxing mechanisms, and we just need to use them.</p>",
        "id": 524588388,
        "sender_full_name": "(deleted)",
        "timestamp": 1750190939
    },
    {
        "content": "<p>Before you start working on this (or any other Lean feature), you should make an RFC to the lean4 repo and wait for feedback (the FRO usually reviews these once per week, but this month there are some availability constraints, so it looks like it will be July until the next time the FRO reviews RFCs).</p>\n<p>I can tell you already though, completely independently of the merits of the feature itself, maintaining Lean for our four Tier 1 platforms has already been a struggle for the FRO at times even though there isn't <em>that</em> much platform-specific code in the runtime, so unless you have a very good story for the long-term maintenance of your feature, the RFC is going to have a hard time.</p>",
        "id": 524629330,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1750221658
    },
    {
        "content": "<p>Thank you. I plan to pursue another option which requires more upfront work, imposes less maintenance burden and still provides strong isolation.</p>",
        "id": 524632050,
        "sender_full_name": "(deleted)",
        "timestamp": 1750224309
    }
]