[
    {
        "content": "<p>I am new to Loogle and Moogle. Are these very different from each other? Are they for different purposes?</p>",
        "id": 405233904,
        "sender_full_name": "Dean Young",
        "timestamp": 1701390403
    },
    {
        "content": "<p>They both help you find Mathlib/Std/core definitions and theorems, but they’re for different kinds of search queries!</p>\n<p>If you know specific things about what you’re looking for, like the actual structure of the type or hypotheses as a Lean expression (e.g. <code>_ + _</code>) or a substring of the name, loogle can help you find it. Loogle takes advantage lean’s metaprogramming capabilities to actually match on the type and lemma name.</p>\n<p>Moogle, on the other hand, is for fully natural-language queries, and uses machine learning to help you find relevant definitions and theorems by description. This is useful when you don’t actually know the Lean/Mathlib form of what you’re looking for yet.</p>",
        "id": 405235828,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1701391132
    },
    {
        "content": "<p>I think the water is muddied by the fact that moogle has added support for using loogle-style searches</p>",
        "id": 405237875,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1701391825
    },
    {
        "content": "<p>Querying on moogle in the loogle-style doesn't give you suggestions yet if there are no loogle search hits</p>",
        "id": 405241953,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1701393032
    },
    {
        "content": "<p>Oh, I wasn’t aware of that. Do they actually use loogle behind the scenes for that style of search? Or are there differences?</p>",
        "id": 405245469,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1701394456
    },
    {
        "content": "<p>My understanding is that they just filter the results of loogle (or rather, <code>#find</code>)</p>",
        "id": 405245588,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1701394517
    }
]