[
    {
        "content": "<p>I am reading about all these things people are constructing in the FLT thread about \"quaternion modular forms\" and \"adeles\" (whatever they are). And think that while people are constructing the Mathlib wouldn't it be nice to also have more detailed explanations for the topics? So that it could be of use not only for professional mathematicians but also for people learning math. (And perhaps for professional mathematicians to learn new areas of math).</p>\n<p>I think it would be nice if on top of Mathlib which is a kind of dictionary of theorems, there could be a more encyclopaedia type approach also. Where the different topics were explained in a more in-depth way. Which could have interactive examples. And automatic formatting into Latex equations. This might also help in organising and finding lemmas.</p>\n<p>(Kind of like the MathWorld website but backed by Lean) Maybe even a Wiki approach.</p>\n<p>Is this something that is currently been done? Or that may be done in the future? Just my 2 cents.</p>",
        "id": 529704141,
        "sender_full_name": "Mr Proof",
        "timestamp": 1753034897
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a></p>",
        "id": 529704772,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1753035675
    },
    {
        "content": "<p>Have you seen <a href=\"https://imperialcollegelondon.github.io/FLT/blueprint/Quat_alg_project.html\">https://imperialcollegelondon.github.io/FLT/blueprint/Quat_alg_project.html</a> and <a href=\"https://imperialcollegelondon.github.io/FLT/blueprint/Adele_miniproject.html\">https://imperialcollegelondon.github.io/FLT/blueprint/Adele_miniproject.html</a> ? Those are my attempts to explain quaternionic modular forms and adeles to people with a general mathematical background. I do not see any reason to explain anything in any greater depth because it would make the FLT write-up of infinite length; if you want more details then just refer to standard number theory and algebra undergraduate and MSc level textbooks.</p>",
        "id": 529711190,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1753043399
    },
    {
        "content": "<p>That is great and all, I think perhaps my idea of \"general mathematical background\" is probably a bit different to yours. I was thinking more of something accessible to someone at undergraduate to graduate level. </p>\n<p>And maybe that is not possible as some concepts are necessarily built upon things which require several years of graduate study to understand. </p>\n<p>To be more precise I think someone who understood what a quaternion is, and what modular forms are, may still struggle on statements like \"Recall that a <em>quaternion algebra</em> over K  is a central simple K-algebra of K-dimension 4.\"And symbols like $D^\\times$. (Someone can correct me if these things are taught at undergraduate level these days). OK, well these aren't difficult concepts, it's more the unfamiliar language.</p>\n<p>So, in conclusion although it goes against the point of the project which is to produce a highly formalised and precise language. My opinion is that it may also benefit from a few \"dumbed down\" explanations in the sense of \"mathematical outreach\".</p>",
        "id": 529872935,
        "sender_full_name": "Mr Proof",
        "timestamp": 1753098213
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197836\">Jireh Loreaux</span> <a href=\"#narrow/channel/270676-lean4/topic/Making.20Mathlib.20into.20an.20interactive.20encyclopedia.20of.20math.3F/near/529704772\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a></p>\n</blockquote>\n<p>Yes exactly this! <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span> (It took me a while to realise this was a link)</p>\n<p>Would benefit I think if the project to automatically convert Lean syntax to Latex ever gets completed.</p>\n<p>Also, would be cool if it was interactable like a notebook. But I am asking too much <span aria-label=\"pensive\" class=\"emoji emoji-1f614\" role=\"img\" title=\"pensive\">:pensive:</span></p>",
        "id": 529874472,
        "sender_full_name": "Mr Proof",
        "timestamp": 1753098843
    },
    {
        "content": "<p>You’re not asking too much, unless you also have a deadline… All this will exist at some point in the future.</p>",
        "id": 529903366,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1753108057
    },
    {
        "content": "<p>That's great. No, I don't have a deadline, just happy to see it all coming together nicely. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 529925888,
        "sender_full_name": "Mr Proof",
        "timestamp": 1753115359
    }
]