[
    {
        "content": "<p>The mathlib porting meeting is no more, but it would be nice to use a meeting as a place to talk about what's new in lean more generally and how we are adapting to changes, and looping in more of the FRO team, maybe turning it into something with short presentations/announcements and a lot of time for questions. I'm thinking a once-a-month meeting (right after a new stable?) with short presentations or announcements followed by a lot of time for questions, kind of restarting the public lean 4 dev meetings.</p>",
        "id": 387752127,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693254846
    },
    {
        "content": "<p>cc: <span class=\"user-mention\" data-user-id=\"112857\">@Leonardo de Moura</span> <span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> <span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span> <span class=\"user-mention\" data-user-id=\"315577\">@Mac Malone</span></p>",
        "id": 387752217,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693254886
    },
    {
        "content": "<p>Indeed I wondered whether the FRO team wanted to setup something like this. Getting the frequency right is slightly tricky since we don't want to consume too many resources preparing such events.</p>",
        "id": 387754277,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1693255736
    },
    {
        "content": "<p>Even if the FRO isn't involved I'm willing to keep doing AMA's like in the porting meeting, but indeed the hope is that we can have an actual agenda and some preparation for these meetings, which is why once-a-month sounds about right, longer than that and we'll start to lose track of new things.</p>",
        "id": 387756915,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693256845
    },
    {
        "content": "<p>But I would definitely prefer if they lead it, it makes more sense from an outreach perspective</p>",
        "id": 387757165,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693256959
    },
    {
        "content": "<p>I think we should also include \"what's new in major libraries in the lean ecosystem (read: std / mathlib)\" things, depending on how much material we end up with</p>",
        "id": 387757403,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693257062
    },
    {
        "content": "<p>as well as new libraries that people want to advertise</p>",
        "id": 387757670,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693257185
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> This is a great idea. We will restart the monthly meetings + Q&amp;A soon. We will keep you posted.</p>",
        "id": 387767090,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1693261774
    },
    {
        "content": "<p>We have some more people joining the FRO in October, and so would like to start up the regular monthly meetings \"officially\" then. If Mathlib wants to get the ball rolling with a meeting in September more specifically about Mathlib/Std, that might be a good idea.</p>",
        "id": 388214602,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1693439932
    },
    {
        "content": "<p>It does seem challenging to find a time that is somewhat reasonable for USA, EU, and AUS...</p>",
        "id": 388260973,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1693464639
    },
    {
        "content": "<p>The porting meetings were pretty late for my schedule. But moving them 1hr earlier, or even 30 mins, would mean that Scott has to get out of bed at a really early hour.</p>",
        "id": 388261040,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1693464683
    },
    {
        "content": "<p>I was thinking of moving them around to mitigate this effect</p>",
        "id": 388261186,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693464763
    },
    {
        "content": "<p>but this is also hard to put on a calendar</p>",
        "id": 388261224,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693464786
    }
]