[
    {
        "content": "<p>Hey, I'm not that familiar with the Lean 4 codebase yet, so I thought I’d ask here before spending days digging around.</p>\n<p>I’m looking to build a <em>minimal standalone tool</em> that takes a <code>.lean</code> file and compiles it into a <code>.olean</code> file - no project setup, no imports, just a single file in, compiled output out.<br>\nBasically, I want the smallest possible program that replicates what Lean does when it compiles <code>.lean</code> files, but stripped down to just that core functionality. For research reasons, I’d like to keep it as minimal and self-contained as possible.</p>\n<p>Is there something like this already, or could it be easily extracted from Lean itself? I couldn't find much documentation about this part of the toolchain, so any pointers would be really appreciated.</p>\n<p>Thanks!</p>",
        "id": 524824972,
        "sender_full_name": "alpharee",
        "timestamp": 1750316261
    },
    {
        "content": "<p>I think this is a really hard problem. Lean is extremely extensible. There is a folklore theorem that says \"to parse Lean you have to be Lean\". (Note that this only talks about parsing!)</p>",
        "id": 524826314,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1750316846
    },
    {
        "content": "<p>Maybe interesting for me as well but what would your use cases for .olean files be? Do you have stuff that you'd like to do with them?</p>",
        "id": 524850230,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1750326238
    },
    {
        "content": "<p>I think that you need most of Lean for this.</p>\n<p>There are some parts that can be stripped out for batch compilation though: the LSP server, possibly the pretty printer, the incremental compilation system, and maybe a small handful of others. Everything else is somehow part of the language.</p>",
        "id": 524891044,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1750341069
    }
]