[
    {
        "content": "<p>To simplify using lake in an FFI setting with lots of dependencies I've wrapped build commands for things like rust or gcc inside <code>nix develop --command</code> to ensure that they always build with the correct env. It is also possible to just run <code>nix develop</code> first, but for a simpler workflow just running lake commands right away would be easier. The problem is the linker. Is it possible (easy) to configure package to use a different link command? <br>\nI want to add more nix support to lake in the future so that the UX is more smooth. Converting lake jobs into nix derivations would be very nice.</p>",
        "id": 329035750,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1676914696
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"433842\">Anders Christiansen Sørby</span> <a href=\"#narrow/stream/270676-lean4/topic/Modifying.20link.20command.20in.20lake.20to.20use.20nix.20develop/near/329035750\">said</a>:</p>\n<blockquote>\n<p>Is it possible (easy) to configure package to use a different link command?</p>\n</blockquote>\n<p>Last time I was messing with this, it is easy to <em>add arguments</em> to the linker command, but I don't recall there being a way to change the linker command itself... it would probably be in the <code>PackageConfig</code> structure if it exists?</p>",
        "id": 329103860,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1676954790
    },
    {
        "content": "<p>Yes, anything is possible, but it seems like the package interface does not have this option currently</p>",
        "id": 329152680,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1676975296
    },
    {
        "content": "<p>On a related note: <span class=\"user-mention\" data-user-id=\"315577\">@Mac</span> How do I let lake know it needs to relink when I use manual link arguments? Now I have to run lake clean to relink</p>",
        "id": 329153304,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1676975423
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"433842\">Anders Christiansen Sørby</span> <a href=\"#narrow/stream/270676-lean4/topic/Modifying.20link.20command.20in.20lake.20to.20use.20nix.20develop/near/329153304\">said</a>:</p>\n<blockquote>\n<p>How do I let lake know it needs to relink when I use manual link arguments?</p>\n</blockquote>\n<p>Are you asking about how to relink when the arguments themselves change or when the manually linked libraries change? For the later, you need to use <code>extraDepTargets</code>. For the former, that should happen automatically.</p>",
        "id": 329165190,
        "sender_full_name": "Mac Malone",
        "timestamp": 1676978973
    },
    {
        "content": "<p>I am using <code>extraDepTargets</code> but the relink does not happen. How does lake know when a target needs to rebuild? Does it hash the file tree?</p>",
        "id": 329303692,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1677018038
    }
]