[
    {
        "content": "<p>I have a ton of strings of lean code (each string is the contents of a full lean file) and I need to 1) compile these strings as if they were actual files to get out their error messages, and 2) (more important) extract out all the intermediate proof states and other theorem information. </p>\n<p>As of right now, in <a href=\"https://github.com/riyazahuja/ImProver\">my project</a> I'm creating temp files for this code via python, and running <code>lake exe function_that_extracts_states_and_msgs tmp_name</code> via the shell from python as well. This works, but when I have a lot of these that I want to run sequentially (i.e. run the script on a string and get error messages, use that to fix error message, repeat), it gets really really slow. Additionally, the script is outputting json of the data that is extracted, which I made a bunch of python objects to hold it nicely, but there's a lot of back-and-forth between these python objects and lean objects. </p>\n<p>Although this all technically works, I think its really slow and inefficient. I've looked into a couple ways to reduce the overhead of doing <code>lake exe ...</code> every time, but I'm a bit lost on what's the best way to do this as well as how best to implement it. </p>\n<p>For example, I've looked into doing a python reverse-FFI, but it seems quite difficult to getting it to work as the function that extracts the proof state info has dependencies to mathlib, as well as a lot of monad stuff. Additionally, perhaps the overhead comes from running <code>lake exe</code>, so the solution is to have lean drive the process by creating the tempfiles and compiling them by itself without needing to call <code>lake exe</code> again, so whatever object that outputs is still in lean, and I can just have my extraction function take that as an input.</p>\n<p>Any advice or ideas would be really helpful! Also, for reference, the \"extraction function\" I'm taking about is <code>scripts/training_data.lean</code>, so I essentially run <code>lake exe training_data FILE</code> for each tempfile. It currently works by using <code>compileModule</code> and <code>getInvocationTrees</code> and <code>moduleMessages</code>.</p>",
        "id": 482053200,
        "sender_full_name": "Riyaz Ahuja",
        "timestamp": 1731451713
    },
    {
        "content": "<p>you could use the Lean4 <a href=\"https://github.com/leanprover-community/repl\">repl</a> in \"file mode\" to accomplish this.</p>",
        "id": 482054075,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1731452208
    }
]