[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"557459\">@Xavier Généreux</span> and I recently merged a new, optimised implementation of forward reasoning into Aesop. Unfortunately, this makes Aesop around 8% slower in Mathlib. <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>\n<p>The reason for this is that the new implementation uses a custom normal form, RPINF (reducible proof-irrelevant normal form). This normal form is computed by traversing each expression in the goal, which incurs a large interpretation overhead.</p>\n<p>To reduce the overhead, the RPINF function should be precompiled. We could enable precompilation for Aesop, but this increases Aesop build time and all import times by a lot. So as a stop-gap, I suggest moving the RPINF function into core. This makes Aesop 9% faster, rather than 8% slower, relative to the previous Aesop version. The RPINF function is not particularly complex and is implemented in a single file, so should hopefully not add a high maintenance burden.</p>\n<p>Does this make sense?</p>",
        "id": 502576481,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1740748806
    },
    {
        "content": "<p><code>precompileModules</code> is per <code>lean_lib</code>. Could you not have an <code>AesopNative</code> library that contains the implementation of RPINF, enable <code>precompileModules</code> for that and import that from <code>Aesop</code>?</p>",
        "id": 502577687,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1740749144
    },
    {
        "content": "<p>I think so. This would address the Aesop build time concern. I believe the import time increase happens if precompilation is enabled anywhere in the import tree, but I'll check this.</p>",
        "id": 502578196,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1740749277
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> it seems like the speed center is failing again for <a href=\"https://speed.lean-lang.org/mathlib4/run-detail/45750ea4-7268-46a9-8ff4-59ac302f09c2\">this run</a> for <a href=\"https://github.com/leanprover-community/mathlib4/pull/22408\">#22408</a>, which enables precompilation for the RPINF function in Aesop. Could you take a look at this? <span aria-label=\"thank you\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"thank you\">:thank_you:</span> (Btw, it seems like the <code>pheidippides</code> runner has been down for a few days now.)</p>",
        "id": 502634685,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1740765324
    },
    {
        "content": "<p>Is that the same failure as last time? I guess the fix never landed in mathlib master?</p>",
        "id": 502637404,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1740766102
    },
    {
        "content": "<p>Oh, I didn't realise you fixed the script in the PR; I thought this was server-side. I'll PR the fix.</p>",
        "id": 502641208,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1740767364
    },
    {
        "content": "<p>is <code>precompileModules</code> supported by <code>lake exe cache</code>?</p>",
        "id": 502647735,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1740769511
    },
    {
        "content": "<p>I guess we'll find out! (or rather, we already have)</p>",
        "id": 502650032,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1740770292
    }
]