[
    {
        "content": "<p>As of <a href=\"https://github.com/leanprover/lean4/commit/7f8ccd84259b975f2cbb6c293ca608696f2709fc\"><code>7f8ccd8</code></a>, the new compiler has been enabled on <code>master</code>. This is a major step forward for Lean. The new compiler has been in the works for several years, and I have spent almost all of my time at the FRO this year finishing it and readying it for production. While there are some nice results from this initial switch, the real benefits will be seen when the new compiler is used as the foundation for future improvements, as we aim to increase the kinds of programs that can reasonably be written (and verified) in Lean.</p>\n<p>In the coming weeks, I'll be going over the GitHub issues with the <code>fixed-by-new-code-generator</code> and <code>depends-on-new-code-generator</code> labels. While I haven't looked at all of them, many of the latter should be relatively easy fixes now. In general, you should expect more rapid responses to issues reported in the compiler going forward.</p>\n<p>If you see any regressions, please CC me on GitHub issues or any threads here on Zulip. I will be on the lookout for anything, but the Lean community is thankfully now so large that it is unreasonable to expect to come across everything myself.</p>",
        "id": 525067297,
        "sender_full_name": "Cameron Zwarich",
        "timestamp": 1750434970
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"656225\">@Cameron Zwarich</span>  Congratulations on the awesome accomplishment!</p>",
        "id": 525068267,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1750435353
    },
    {
        "content": "<p>Do you have a speedcenter comparison to see what the impact on mathlib is? I'd be curious to see the differences.</p>",
        "id": 525088246,
        "sender_full_name": "Jovan Gerbscheid",
        "timestamp": 1750444979
    },
    {
        "content": "<p>I hear the speedcenter is down</p>",
        "id": 525093633,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1750447536
    },
    {
        "content": "<p>It was down yesterday, but not anymore I think</p>",
        "id": 525093786,
        "sender_full_name": "Jovan Gerbscheid",
        "timestamp": 1750447602
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"479299\">Jovan Gerbscheid</span> <a href=\"#narrow/channel/270676-lean4/topic/New.20compiler.20has.20been.20enabled/near/525088246\">said</a>:</p>\n<blockquote>\n<p>Do you have a speedcenter comparison to see what the impact on mathlib is? I'd be curious to see the differences.</p>\n</blockquote>\n<p>No, I actually didn't even know that it was possible to test the build time of Mathlib for a PR that way. That might be helpful in the future. This week there's also the additional complication that I can't push changes to branches in the <code>mathlib4</code> repo for my PRs against <code>lean4</code>.</p>\n<p>I did do some perf testing clean builds of Mathlib locally a few weeks ago (just after I got it building) and it was basically identical. There were some considerable performance fixes in the following week, so perhaps that got better since then.</p>\n<p>We honestly weren't expecting huge speedups on the core of Lean just from this switch (although we did get some, especially on more code-heavy files), because Lean itself is implemented in a way that avoids most of the performance glass jaws of the old compiler. Newer sections of code (e.g. Lake, the new iterators library, etc.) see larger improvements. However, some of the future compiler improvements unlocked by all of this work should affect Lean itself significantly. There are also some non-compiler improvements, e.g. the new compiler is better able to integrate with async/parallel elaboration and the new module system.</p>",
        "id": 525096466,
        "sender_full_name": "Cameron Zwarich",
        "timestamp": 1750449174
    },
    {
        "content": "<p>It would interesting to see if this <a class=\"message-link\" href=\"/#narrow/channel/287929-mathlib4/topic/Why.20is.20tensor.20product.20noncomputable.3F/near/524860156\">#mathlib4 &gt; Why is tensor product noncomputable? @ 💬</a> is no longer necessary with the new compiler</p>",
        "id": 525096652,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1750449289
    },
    {
        "content": "<p>Yes, I was just about to find the various <code>noncomputable</code>-related threads and reply to them. Understanding exactly what was going on with <code>noncomputable</code> (both the old compiler's implementation and Mathlib's expectations) was a lot of the work in the final push to get this landed. There were even a few cases where I couldn't completely understand why one example from Mathlib was considered computable (non-<code>noncomputable</code>?) but my reduced test case was not.</p>\n<p>There is a bit of a tradeoff between wanting the <code>noncomputable</code> check to be smarter and wanting it to be predictable and easy to understand. In an ideal world, we could move it right after elaboration, so that its behavior could be explained without any understanding of compiler optimizations (and we could change thee order of these optimizations freely without affecting the check). Based on my recent experiences, I am somewhat confident that we can make improvements here, and will resurrect some of the discussions here on Zulip to get into the details.</p>\n<p>There's also the problem of <code>noncomputable section</code> being useful but making it more difficult to debug why things are happening. I would like to add more detailed error messages that will print a noncomputability trace, potentially through multiple <code>noncomputable section</code>s back to the underlying cause. I had to make a hacky version of this for myself when debugging and I found it useful.</p>",
        "id": 525097965,
        "sender_full_name": "Cameron Zwarich",
        "timestamp": 1750450000
    },
    {
        "content": "<p>For example, I would be curious to know if the definition <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=bestFirstSearch#doc\">docs#bestFirstSearch</a> still takes 100 seconds to compile :)</p>",
        "id": 525098621,
        "sender_full_name": "Jovan Gerbscheid",
        "timestamp": 1750450484
    }
]