[
    {
        "content": "<p>Hi. I am new here. I wanted to add some more combinators to Lean.Data.Parsec (Eg, sepBy and sepBy1) and the contributions readme suggested I should ask here first if that would be a good idea. I was going to borrow implementations and comments from lean/library/data/buffer/parser.lean in lean3. Would that be a good pull request to do?</p>",
        "id": 340688607,
        "sender_full_name": "Greg B",
        "timestamp": 1678388287
    },
    {
        "content": "<p>In general, things with a <code>Lean</code> prefix are intended for primary use by Lean itself (nothing prevents you from using it but only things in <code>Init</code> are intended for general use). To keep Lean small, contributions that do not directly contribute to Lean itself are not welcome there. Of course, there can be a need for a general use version. That could go in <code>Std</code> or as a separate library. If you look around on github you will find several Lean parser libraries (including <a href=\"https://github.com/fgdorais/lean4-parser\">mine</a>). Just shop around, find one that meets your needs, and contribute there if anything is missing.</p>",
        "id": 340695724,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1678390333
    },
    {
        "content": "<p>Perfect! I am delighted to use your library! Thank you.</p>",
        "id": 340704767,
        "sender_full_name": "Greg B",
        "timestamp": 1678393296
    },
    {
        "content": "<p>We've implemented Megaparsec, with a design constraint of it being a replica of Haskell codebase.</p>\n<p><a href=\"https://github.com/yatima-inc/Megaparsec.lean\">https://github.com/yatima-inc/Megaparsec.lean</a></p>\n<p>We have some documentation in README and the functions are documented reasonably well.</p>\n<p>Also, <span class=\"user-mention\" data-user-id=\"451983\">@Arthur Paulino</span>  made a great tutorial for it: <a href=\"https://github.com/yatima-inc/Megaparsec.lean/blob/main/Examples/Tutorial.lean\">https://github.com/yatima-inc/Megaparsec.lean/blob/main/Examples/Tutorial.lean</a></p>\n<p>We would appreciate some industrial use. We're using it ourselves for our Wasm runtime in Lean and so far it holds, but we never threw a lot of data on it yet.</p>",
        "id": 340708073,
        "sender_full_name": "cognivore",
        "timestamp": 1678394442
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"119741\">@François G. Dorais</span>, a very nice library! We'll have a look at it and perhaps learn a trick or two :)</p>\n<p>Our stream implementation is in a separate library: <a href=\"https://github.com/yatima-inc/Straume\">https://github.com/yatima-inc/Straume</a></p>\n<p>We've implemented a lot of stuff to hedge for the use with infinite streams, but we've currently halted the development because we've implemented enough stuff to support Megaparsec use cases.</p>",
        "id": 340708363,
        "sender_full_name": "cognivore",
        "timestamp": 1678394551
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"507516\">@cognivore</span>! My students and I needed parser combinators for another project,  I only noticed your library <br>\nafter we had mostly done all the work for our own.  I decided to release it to the world as a spinoff since we like our work and we haven't yet found need to replace it with a more sophisticated one.  I'm happy if you can use some tricks for your Lean Megaparsec. I'm also interested in broader Unicode support but <a href=\"https://github.com/xubaiw/Unicode.lean\">https://github.com/xubaiw/Unicode.lean</a> seems to be not actively maintained at this time. Do let me know if you have thoughts about that.</p>",
        "id": 340722021,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1678399565
    },
    {
        "content": "<p>I do have push access to it in principle to guarantee doc-gen4 stability, I just dont know if <span class=\"user-mention\" data-user-id=\"414345\">@Xubai Wang</span> wants me to merge things</p>",
        "id": 340723864,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1678400341
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"395550\">@Henrik Böving</span> Can you take a quick look at the failed check on my PR? It doesn't seem to have anything to do with the code I submitted.</p>",
        "id": 340724513,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1678400633
    },
    {
        "content": "<p>By the way, thank you! I know you're busy right now. This is not urgent, I just haven't been able to get any kind of response for a while so I got excited<br>\n.</p>",
        "id": 340725015,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1678400830
    },
    {
        "content": "<p>The CI is failing because the doc-gen4 integration it is working with hasn't been updated in ages and is thus not at all compatible with modern doc-gen4 again...unfortunately the way doc-gen is called here is pulled out into another action (which did make sense at the time but not nowadays) ...so it is not really detecting something that is wrong with your code its mostly the repo not being cared for enough yeah.</p>",
        "id": 340730929,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1678403349
    },
    {
        "content": "<p>Also thinking further about it I dont think we want to pull std4 in here. <code>std4</code> already (conditionally) depends on doc-gen4 to be able to build documentation so pulling it into the dependency chain of doc-gen4 will create a cyclic dependency.</p>",
        "id": 340731155,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1678403453
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"395550\">Henrik Böving</span> <a href=\"#narrow/stream/270676-lean4/topic/Parsec/near/340731155\">said</a>:</p>\n<blockquote>\n<p>Also thinking further about it I dont think we want to pull std4 in here. <code>std4</code> already (conditionally) depends on doc-gen4 to be able to build documentation so pulling it into the dependency chain of doc-gen4 will create a cyclic dependency.</p>\n</blockquote>\n<p>I would really like this not to have to be a choice. It should be possible to build docs for a project without making doc-gen a dependency of that project</p>",
        "id": 340737383,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1678406551
    },
    {
        "content": "<p>It would be easy to factor out the one data file that's currently needed for doc-gen4. Unless doc-gen4 is planning for more advanced Unicode stuff, I could make that happen next week.</p>",
        "id": 340743345,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1678409547
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"395550\">@Henrik Böving</span> you just need the character names, or are you planning something more sophisticated?</p>",
        "id": 340743487,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1678409634
    },
    {
        "content": "<p>No just the names indeed</p>",
        "id": 340775587,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1678430740
    },
    {
        "content": "<p>Thanks for more details, François!</p>\n<p>We're currently mostly in maintenance mode when it comes to Megaparsec, as we're focused on using it for other projects, but if I have the time, I'll give Unicode stuff a look.</p>\n<p>As a matter of fact, I'm currently reviving an unmaintained pretty printing library, so perhaps the skills shall transfer.</p>\n<p>P.S.</p>\n<p>I didn't read the rest of the thread, maybe you have figured it out already :)</p>",
        "id": 342668788,
        "sender_full_name": "cognivore",
        "timestamp": 1679088892
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"507516\">@cognivore</span> Yes, I did figure it out to some extent. I created my own library: <a href=\"https://github.com/fgdorais/lean4-unicode-basic\">lean4-unicode-basic</a>. It already has a sound API so a 0.1.0 release should happen soon.</p>",
        "id": 342958954,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1679241994
    }
]