[
    {
        "content": "<p>This question is maybe more for <span class=\"user-mention\" data-user-id=\"481858\">@Sofia Rodrigues</span> ,<br>\nI see a lot of great advancement in foundations for Async, TCP/UDP, Files stack for lean 4.25.<br>\nI also saw you have a custom Http layer in a repository.<br>\nSo my questions are: </p>\n<ul>\n<li>Is the plan to roll Http API starting from lean 4.26 or are there more foundational building blocks needed before that's possible ? </li>\n<li>For Https, is the plan to make OpenSSL bindings in lean Std Internal ?</li>\n</ul>\n<p>If so, do you need help ? I would love to help in this subject. I'm familliar with OpenSSL C library.</p>",
        "id": 555577041,
        "sender_full_name": "Alfredo Moreira-Rosa",
        "timestamp": 1763123808
    },
    {
        "content": "<p>We do not plan to add TLS support to the Lean HTTP server. Recommended way to deploy the Lean HTTP server will be behind a reverse proxy like Nginx or Apache that handles TLS.</p>",
        "id": 555577923,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1763124135
    },
    {
        "content": "<p>I can understand for server, but what about client Https ?</p>",
        "id": 555578123,
        "sender_full_name": "Alfredo Moreira-Rosa",
        "timestamp": 1763124201
    },
    {
        "content": "<p>It will come eventually, but it's not on the roadmap yet since this is a big and complicated project (especially since we're using LibUV for TCP). For the same reason this isn't the best project for a community contribution, since just reviewing and testing such a contribution will require a major time investment from the maintainers which needs some planning and coordination.</p>",
        "id": 555581001,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1763125126
    },
    {
        "content": "<p>I understand.<br>\nSo since i want to advance this topic, i guess this means it has to be made outside of lean.<br>\nI'll keep you all informed anyway. And i'll make sure my work is reusable with proper licence so that if in the future you want to take a look at it as an inspiration you'll be able to do so.</p>",
        "id": 555605200,
        "sender_full_name": "Alfredo Moreira-Rosa",
        "timestamp": 1763131385
    }
]