[
    {
        "content": "<p>I'm new to lean and read in the documentation that I can read the documentation inside vscode. Are there any instructions in how to do this? I've got vscode installed on my ubuntu box and lean 4 running fine - I just don't know how to open the documentation inside vscode. Any help?</p>",
        "id": 363530157,
        "sender_full_name": "Ken Sailor",
        "timestamp": 1685895802
    },
    {
        "content": "<p>where did you read this? It's possible it was copied from another iteration of the docs</p>",
        "id": 363530829,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1685896063
    },
    {
        "content": "<p>some of the tutorials / books / manuals also have a setup for doing this, usually specific to that particular book</p>",
        "id": 363531016,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1685896129
    },
    {
        "content": "<p>I see. Now I can't find the reference. It seems to me I saw a button in the code snippets I was reading that was supposed to eval the code in lean. If it is not normal thing I can copy and paste. It sounded cool, however, like literate coding taken to the max.</p>",
        "id": 363532861,
        "sender_full_name": "Ken Sailor",
        "timestamp": 1685896859
    },
    {
        "content": "<p>I'm not doubting that you saw it, but the setup to do so is context-dependent. It generally amounts to cloning a repo recommended by the doc and opening a markdown side-by-side view</p>",
        "id": 363536338,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1685897977
    },
    {
        "content": "<p>Thanks. Clearly more complicated than I had hoped, and no instructions in the document as I remember it (just \"if you're reading this inside of vscode you can press the button \" or some such.</p>",
        "id": 363540572,
        "sender_full_name": "Ken Sailor",
        "timestamp": 1685899455
    },
    {
        "content": "<p>Actually, I got it finally. <br>\nCtrl-Shift-P and type Lean 4 in the command prompt.<br>\nSelect from the suggested list \"Open Documentation View\"<br>\nThis gives you a choice of the usual texts (like Theorem Proving in Lean) <br>\nChoose the text you want, and you can read the book inside of VS Code and click on the Try Me buttons at will.</p>",
        "id": 363550905,
        "sender_full_name": "Ken Sailor",
        "timestamp": 1685903428
    }
]