[
    {
        "content": "<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"bp\">#</span><span class=\"n\">check</span><span class=\"w\"> </span><span class=\"n\">sizeOf_default</span><span class=\"w\"> </span><span class=\"o\">(</span><span class=\"n\">α</span><span class=\"o\">:=</span><span class=\"n\">Nat</span><span class=\"o\">)</span><span class=\"w\"> </span><span class=\"mi\">5</span>\n<span class=\"bp\">#</span><span class=\"n\">check</span><span class=\"w\"> </span><span class=\"n\">sizeOf_nat</span><span class=\"w\"> </span><span class=\"mi\">5</span>\n</code></pre></div>\n<p>In the infoview, the respective types shown are <code>sizeOf 5 = 0</code> and <code>sizeOf 5 = 5</code>.</p>\n<p>On hovering, the <code>sizeOf</code> functions are further clarified to be <code>@sizeOf Nat (instSizeOfDefault Nat)</code> and <code>@sizeOf Nat instSizeOfNat 5</code>.</p>\n<p>This happens because <code>Nat</code> has been raised to the <code>SizeOf</code> typeclass in two different ways (see lines 52 to 60 <a href=\"https://github.com/leanprover/lean4/blob/3b0f2862196c6a8af9eb0025ee650252694013dd/src/Init/SizeOf.lean#L52\">here</a>).</p>\n<p>Now, I have a few questions about this:</p>\n<p>(i) I thought previously that it should not be possible to raise a type to a typeclass via two different instantiations, and would have expected the <code>instSizeOfNat</code> to override the low-priority default instantiation. Is it because the default definition here has a theorem associated with it which makes it stick around even after being overriden?</p>\n<p>(ii) Are type classes essentially equal to type constructors? I feel there must be some semblance between them since raising a type to a typeclass via two different means have different objects associated to them (in this case <code>instSizeOfDefault Nat</code> and <code>instSizeOfNat</code>), which seems (to me) as if <code>SizeOf</code> is internally represented as a type constructor, and type classes are just syntactic sugar.</p>\n<p>(iii) Is there anything better than <code>#check</code> for general use which highlights this instance distinctions? To clarify the context, I generally use <code>#check</code> for checking types, but I was thoroughly confused when I saw this multiple instance thingy happen in something else I was trying to prove. It took me quite a long time to realize that they were two different <code>sizeOf</code>s that were being used.</p>\n<p>[Also, I am  not quite sure if this would be better suited on <code>general</code>, if so, please tell and I will shift this discussion there]</p>",
        "id": 574119953,
        "sender_full_name": "Soham Saha",
        "timestamp": 1771251547
    },
    {
        "content": "<p>(i) Notice that both <code>sizeOf_default</code>, and <code>sizeOf_nat</code> do not have any typeclass assumptions in their type. Hence, you are not triggering any typeclass search when calling these <code>#check</code>. The search was already done when the theorems were defined, you can do just <code>#check sizeOf_default</code>, and hovering over <code>sizeOf</code> will show you that this theorem uses the <code>instSizeOfDefault</code> instance no matter which type you plug in.</p>\n<p>(ii) You should think of <code>class</code> just as a <code>structure</code> with some default instances. These instances get automatically filled at the moment when a constant with a typeclass arguments is applied. The exact rules are generally loose, so it could happen that you get a typeclass conflict.</p>\n<p>(iii) You can run</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"bp\">#</span><span class=\"n\">synth</span><span class=\"w\"> </span><span class=\"n\">SizeOf</span><span class=\"w\"> </span><span class=\"n\">Nat</span><span class=\"w\"> </span><span class=\"c1\">-- full typeclass search</span>\n<span class=\"bp\">#</span><span class=\"n\">instances</span><span class=\"w\"> </span><span class=\"n\">SizeOf</span><span class=\"w\"> </span><span class=\"n\">Nat</span><span class=\"w\"> </span><span class=\"c1\">-- single search step, requires at least `import Batteries`</span>\n</code></pre></div>",
        "id": 574123018,
        "sender_full_name": "Mirek Olšák",
        "timestamp": 1771252427
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"133339\">@Mirek Olšák</span>  Thank you very much for your answer.</p>\n<p>However, I am still a bit confused about (ii). Isn't the key idea of using type classes (instead of using type constructors) that we are supposed to have only one instance declaration for raising a given type to some particular typeclass? (as discussed <a href=\"https://stackoverflow.com/a/58683028\">here</a>). But here, multiple instance declarations have their own objects, and <code>SizeOf</code> seems to be behaving like a type constructor (since we have <code>instSizeOfNat : SizeOf Nat</code> and <code>instSizeOfDefault Nat : SizeOf Nat</code>). What is the reason/ design decision behind having multiple instance declarations for a given type? And are typeclasses internally implemented as type constructors?</p>",
        "id": 574128285,
        "sender_full_name": "Soham Saha",
        "timestamp": 1771253903
    },
    {
        "content": "<p>I would not take haskell as a ground truth because it works a bit differently from Lean. The main idea of using typeclasses is that they get inferred automatically, not about uniqueness.</p>\n<p>Of course, we don't want typeclass conflicts to happen in practice, so we are trying to have (up to defeq) uniquelly assigned typeclass instances but there is no theoretical obligation to do so, and in some cases (like <code>SizeOf</code>) there can be the specific instances, and a low-priority backup instance.</p>",
        "id": 574129945,
        "sender_full_name": "Mirek Olšák",
        "timestamp": 1771254306
    },
    {
        "content": "<p>By the way, as I am planning to teach Lean, here is my <a href=\"https://git.olsak.net/mirek/lean-teaching/src/branch/master/LeanTeaching/Lecture6_Typeclasses.lean\">write-up</a> about typeclasses. I am discussing typeclass conflicts there on lines 267 -- 300. (haven't tested on students yet, so feedback welcome)</p>",
        "id": 574131083,
        "sender_full_name": "Mirek Olšák",
        "timestamp": 1771254627
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"133339\">@Mirek Olšák</span> Thanks for the clarification about typeclasses and they being inferred automatically, it did clear things up. Also, thanks for the example code in the write-up! <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 574153533,
        "sender_full_name": "Soham Saha",
        "timestamp": 1771261467
    }
]