[
    {
        "content": "<p>With the option of setting <code>weak</code> options, there are now two \"default\" values:</p>\n<ul>\n<li>the actual <code>defValue</code> set when registering the option, and</li>\n<li>the <code>weak</code> value that may be set in the <code>lakefile</code>.</li>\n</ul>\n<p>The <code>defValue</code> is <code>myOption.defValue</code>.</p>\n<p>The currently set value can be found using e.g. <code>myOption.get (← Lean.getOptions)</code>.</p>\n<p>How can I retrieve the \"default\" <code>weak</code> option, if it is set?</p>\n<p>It is hard to write a good <a href=\"https://leanprover-community.github.io/mwe.html\">#mwe</a>, since this requires coordination of different files.  For an example in Mathlib, <code>linter.hashCommand</code> has a <code>defValue</code> of <code>false</code> and a weak-value of <code>true</code>.  How can I find out that the weak-value is <code>true</code>, if I do not know whether there is a <code>set_option linter.hashCommand</code> messing stuff around?</p>",
        "id": 467701377,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725503217
    },
    {
        "content": "<p>The reason for asking is that the longFile linter will have a default value of <code>0</code> (= inactive for downstream projects), but a weak value of <code>1500</code>.</p>\n<p>When linting, I would like to access <code>1500</code> without hard coding <code>1500</code> but doing a hypothetical <code>←getWeakOption linter.style.longFile</code> to retrieve the value.</p>",
        "id": 467720603,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725513108
    },
    {
        "content": "<p>I believe the way it is supposed to work is that the weak options will already be applied to the current options struct, overriding the default value. You shouldn't need to get them directly from some additional place for weak options</p>",
        "id": 467849019,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1725540980
    },
    {
        "content": "<p>If I understand correctly, the weak version is available as the initial <del>form</del>value of the option.  However, if the value is modified by a <code>set_option</code> before where I <code>get</code> it, then I cannot know if what I read is what the weak option was or what it was reset to be.  Am I misunderstanding something?</p>",
        "id": 467850302,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725541201
    },
    {
        "content": "<p>In my use case (the long <del>line</del>file linter), I want to know what is the \"reference value\" for the length of a file (1500 for mathlib), not what the option might have been set to by the time I am reading it.</p>",
        "id": 467850655,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725541249
    },
    {
        "content": "<p>What's the logic you're wanting here? I'm not sure I understand why you would want to know anything but the current value for the option.</p>",
        "id": 468272710,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1725650547
    },
    {
        "content": "<p>As I understand it, the aim is the following:</p>\n<ul>\n<li>mathlib wants the longFile syntax linter enabled</li>\n<li>projects depending on mathlib prefer it disabled, but should be able to enable it if they like</li>\n<li>syntax linters apply to any file importing the linter definition: thus, the solution mathlib contributors came up with was the following<ul>\n<li>the linter is <em>disabled</em> by default</li>\n<li>mathlib's lakefile <em>enables</em> the linter (using a weak option)</li>\n</ul>\n</li>\n</ul>\n<p>So far, so good (and perhaps not surprising). The interesting bit is:</p>\n<ul>\n<li>the linter would like to know if its option is set to something larger or smaller than the default. (Basically, the linter complains on long files, and changing the linter option is the way to silence the linter. It would be good to keep such changes minimal, which is why the linter complains if a <code>set_option</code> is superfluous: but that change requires knowing the default configuration)</li>\n<li>the \"default configuration\" for the purposes of the previous point is <em>not</em> the default value (that's \"disabled\"), but the value set in mathlib's lakefile.</li>\n</ul>\n<p>Does that make more sense? Is there anything still unclear?</p>",
        "id": 468282181,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1725653822
    },
    {
        "content": "<p>I'm not sure why the linter needs to know this:</p>\n<blockquote>\n<p>the linter would like to know if its option is set to something larger or smaller than the default</p>\n</blockquote>",
        "id": 468282760,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1725654106
    },
    {
        "content": "<p>This is required for the \"auto-correction\" feature the linter offers:<br>\nif you do <code>set_option linter.style.longFile 3000</code>, but that is not needed (say, as the file is now split, and has only 500 lines), it's nice to know this can be removed. mathlib's technical debt tracking looks at these options, so knowing when these can be removed is helpful.<br>\nThe linter does so by comparing the current length with the option value: if the file is much shorter than its option, it suggests removing the option.</p>\n<p>However, we don't want the linter to suggest <em>adding</em> a <code>set_option ... &lt;small_number&gt;</code> for small files: differentiating these two requires knowing the default value of the linter.</p>",
        "id": 468290474,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1725657867
    },
    {
        "content": "<p>One solution here would be to have a <code>linter.style.longFileOverride</code> option that people could set within files, and make it a linter error to set <code>linter.style.longFile</code>.</p>",
        "id": 468294102,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1725659115
    },
    {
        "content": "<p>I had also thought of adding an extra option that is the \"official\" limit and the linter reads both, but only one of the two is editable.  I was just hoping to avoid the extra option, recycling what is already available as much as possible.</p>",
        "id": 468294576,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725659305
    },
    {
        "content": "<p>Anyway, hard-coding the limit in the linter is quick and easy!  I also do not expect the limit to change often, so this is not really a major problem, mostly a curiosity!</p>",
        "id": 468295987,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725659890
    },
    {
        "content": "<p>Hard coding it means downstream users can't decide what the limit should be. It seems like having two options would be better for that reason, right?</p>\n<p>I'd suggest the following (modulo name changes):</p>\n<ul>\n<li>Define option <code>linter.style.longFile</code> with default 0</li>\n<li>Define option <code>linter.style.longFileOverride</code> with default 0 (this default does not matter)</li>\n<li>\n<p>The logic for \"what is the current file length limit\" would be</p>\n<ul>\n<li>if <code>linter.style.longFileOverride</code> is set, use it.</li>\n<li>otherwise, if <code>linter.style.longFile</code> is set, use it.</li>\n<li>otherwise, use the default value for <code>linter.style.longFile</code>.</li>\n</ul>\n<p>(Recall that you can tell whether or not an option has been set, without needing to compare with the default value.)</p>\n<p>A result of <code>0</code> means \"no limit\".</p>\n</li>\n<li>\n<p>Make setting <code>linter.style.longFile</code> within files a linter error.</p>\n</li>\n</ul>\n<p>I think this would be better than trying to reason about <code>weak</code>. <span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> can correct me if I'm wrong, but I think we should treat <code>weak</code> as only being part of the external interface to Lean, existing just to be able to set options from the command line.</p>",
        "id": 468301685,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1725661575
    },
    {
        "content": "<p>Kyle, thanks, I did not think about the fact that downstream users might want the linter, but with a different default length than mathlib.</p>",
        "id": 468324792,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725676413
    },
    {
        "content": "<p>I know that there is a difference between a set or a non-set option, but I'm not sure that I know how to tell the difference...</p>",
        "id": 468324911,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725676458
    },
    {
        "content": "<p>If <code>o</code> is the current options, I think you could do <code>o.get linter.style.longFileOverride.name (o.get linter.style.longFile.name linter.style.longFile.defValue)</code>. There's also <code>o.get?</code> to get the value if it's set and return <code>none</code> otherwise.</p>",
        "id": 468326278,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1725677124
    },
    {
        "content": "<p>Thanks a lot!</p>",
        "id": 468326745,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725677361
    },
    {
        "content": "<p>(I'm not sure what would be good option names. Another option is <code>longFile</code> -&gt; <code>longFileDefault</code> and <code>longFileOverride</code> -&gt; <code>longFile</code> ?)</p>",
        "id": 468327233,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1725677483
    },
    {
        "content": "<p>I had thought also of <code>linter.style.maxLines</code> for the \"non-modifiable\" one.</p>",
        "id": 468327697,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725677612
    },
    {
        "content": "<p>By the way, I do not know if you saw <a href=\"#narrow/stream/287929-mathlib4/topic/Is.20cases'.20deprecated.3F/near/468315171\">this message</a>, but that seems also partially relevant for this thread: if there was a way to retrieve all <code>weak</code> options from a dependency, that would be a possible answer!</p>",
        "id": 468328192,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725677751
    },
    {
        "content": "<p>Has anyone downstream actually requested that they be able to use the linter with a different limit? I feel like there may be some overengineering going on</p>",
        "id": 468366641,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1725695369
    },
    {
        "content": "<p>It costs very little to have one more option <span class=\"user-mention\" data-user-id=\"307953\">@Ruben Van de Velde</span>, both in implementation and maintenance, and potentially it is less expensive in maintenance overall. What are you worried about in particular?</p>",
        "id": 468368793,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1725696031
    },
    {
        "content": "<p>Time spent discussing, probably :)</p>",
        "id": 468385963,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1725702537
    }
]