[
    {
        "content": "<p>There is a thread from a few years back (<a class=\"stream-topic\" data-stream-id=\"270676\" href=\"/#narrow/stream/270676-lean4/topic/.E2.9C.94.20qualified.20imports.3F\">#lean4 &gt; ✔ qualified imports?</a>) about how qualified imports were not possible in Lean4.<br>\nI'm curious if anything has changed here, or if core maintainers would be OK with it in the language. Specifically, since we have so much more code in Lean4 now with mathlib, it's a bit hard to manage <code>_root_</code> qualified names.</p>\n<p>For example, I'm currently working with the krull dimension <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=height#doc\">docs4#height</a>, which does not live under a namespace. This means that whenever I want to create another notion of height, it must be both qualifed, and refer to the Krull height as <code>_root_.height</code> to avoid conflicts.</p>",
        "id": 377405973,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1689967035
    },
    {
        "content": "<p>How is this other notion of height defined? Could you define it <code>protected</code> so that it must be referred to in a qualified way, freeing up <code>height</code> for the root one?</p>",
        "id": 377407496,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1689967426
    },
    {
        "content": "<p>Yes, I was planning on making these each qualified under a certain type (e.g. <code>Ideal.height</code>, <code>Ring.height</code>, etc)<br>\nprotected seems to work! I think this is what I was looking for</p>",
        "id": 377407894,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1689967517
    },
    {
        "content": "<p>I think we also shouldn't be afraid to namespace existing definitions.</p>",
        "id": 377552373,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690022192
    },
    {
        "content": "<p><code>CategoryTheory</code> is essentially all in its own namespace, largely by historical accident (I PR'd a bunch before realising that wasn't the standard thing to do?), and I don't think that has particularly hurt.</p>",
        "id": 377552377,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690022193
    }
]