[
    {
        "content": "<p>Here's a MWE:</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"kn\">def</span><span class=\"w\"> </span><span class=\"n\">test_single_arm</span><span class=\"w\"> </span><span class=\"o\">(</span><span class=\"n\">val</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">Nat</span><span class=\"o\">)</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">Nat</span><span class=\"w\"> </span><span class=\"o\">:=</span><span class=\"w\"> </span><span class=\"n\">Id</span><span class=\"bp\">.</span><span class=\"n\">run</span><span class=\"w\"> </span><span class=\"k\">do</span>\n<span class=\"w\">  </span><span class=\"k\">if</span><span class=\"w\"> </span><span class=\"n\">h</span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">val</span><span class=\"w\"> </span><span class=\"bp\">!=</span><span class=\"w\"> </span><span class=\"mi\">0</span><span class=\"w\"> </span><span class=\"k\">then</span>\n<span class=\"w\">    </span><span class=\"n\">return</span><span class=\"w\"> </span><span class=\"mi\">0</span>\n<span class=\"w\">  </span><span class=\"c1\">-- h not in scope here</span>\n<span class=\"w\">  </span><span class=\"n\">return</span><span class=\"w\"> </span><span class=\"mi\">1</span>\n</code></pre></div>\n<p>As far as I can tell, this is due to the fact that in the parser and elaborator, this just gets converted to an <code>if</code> with an empty <code>else</code> branch.  I can confirm this by adding the <code>else</code>  and voila, <code>not h</code> is in scope in the else.  </p>\n<p>However, this makes writing code with early returns a bit \"clunky\", esp if I wish to use <code>h</code> later on.  Some examples of the code I am trying to make \"easier\" are <a href=\"https://github.com/leanprover/lean4/pull/5585/files#diff-6a7ad964c2be827457cb21c49f29077959177871ef72f112e02c8803969f1ad1\">here</a></p>\n<p>It seems the crux of the problem is in <code>doIfToCode</code> in <code>Elab/Do.lean</code>.  Baring doing some more advanced flow analysis, I thought perhaps that I could change the logic in this function so that</p>\n<p>1) It would check for the empty <code>else</code> case<br>\n2) Check if the last statement of the of the <code>if</code> statement is a control flow statement<br>\n3) Move the rest of the <code>do</code> statement into the <code>else</code> branch</p>\n<p>I built a prototype PR <a href=\"https://github.com/leanprover/lean4/pull/5585\">here</a>.  Note that this is my first time looking at Elab/Syntax and I pretty much worked it out by reading the code so please, please, I would appreciate any feedback!</p>\n<p>Let me know if this is of interest and I can try and convert from \"draft\" to a full PR.  Thanks!</p>",
        "id": 474189980,
        "sender_full_name": "Tom",
        "timestamp": 1727843641
    },
    {
        "content": "<p>changes to <code>Elab/Do.lean</code> have been rejected in the past. The code is frozen</p>",
        "id": 474237036,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727859268
    },
    {
        "content": "<p>I think probably this could at least be converted into a full RFC on github</p>",
        "id": 474246159,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1727861849
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> </p>\n<p>Thanks for the heads up!  Why is the code \"frozen\"?<br>\nJust so I know/don't \"waste time\", are you aware of other areas of the compiler which have a similar status?</p>",
        "id": 474332066,
        "sender_full_name": "Tom",
        "timestamp": 1727883540
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"310045\">@Eric Wieser</span> </p>\n<p>Thanks, I will.  However, I've already written another RFC <a href=\"https://github.com/leanprover/lean4/issues/5545\">about ranges</a> and didn't want to generate too many... with this PR, I was showing I was also willing to do the work rather than just suggest features.</p>",
        "id": 474332709,
        "sender_full_name": "Tom",
        "timestamp": 1727883723
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515083\">Tom</span> <a href=\"#narrow/stream/270676-lean4/topic/RFC.3A.20If.20hypothesis.20scope/near/474332066\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> </p>\n<p>Thanks for the heads up!  Why is the code \"frozen\"?<br>\nJust so I know/don't \"waste time\", are you aware of other areas of the compiler which have a similar status?</p>\n</blockquote>\n<p>Because it doesn't have a designated maintainer. The person who wrote the code (Leo) has a million other things to do and this is a very low priority area. I'm just reporting my experiences trying (and failing) to get features through to set your expectations.</p>\n<p>I don't know any other area quite like that, but if you wanted to make changes to the kernel or the new compiler (and probably most nontrivial changes to the old compiler) I doubt you would be successful unless you are on the FRO payroll. Many core parts of the elaborator are also very difficult to get changed, even when there are good reasons to, see <a href=\"https://github.com/leanprover/lean4/pull/4379#issuecomment-2155464216\">example</a>.</p>",
        "id": 474333208,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727883888
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> , I appreciate the explanation and will keep it in mind!  </p>\n<p>I didn't fully expect for the PR to be accepted and hence why I made it just a draft/proof of concept.  Based on your feedback, I may just turn it into a full PR and see if gets rejected and if so, I will move on.</p>\n<p>What is the \"new compiler\"?  Is this the new \"code generator\" Henrik B has mentioned before?</p>",
        "id": 474334077,
        "sender_full_name": "Tom",
        "timestamp": 1727884139
    },
    {
        "content": "<p>yes</p>",
        "id": 474334901,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727884368
    },
    {
        "content": "<p>Off the top of my head, parts of the code base that are currently \"frozen\" from accepting external contributions are</p>\n<ul>\n<li><code>do</code> elaboration</li>\n<li>the compiler</li>\n<li>typeclass instance synthesis</li>\n<li>the defeq algorithm and core algorithms for metavariables</li>\n<li>the kernel</li>\n</ul>\n<p>Many of these are pretty much off-limits to the FRO as well at the moment.</p>\n<p>I'd say that for external contributors, generally issues &gt; RFCs &gt; PRs. Going from one step to the next takes significantly more work and discussion. We want issues that show concrete problems users are facing, which helps guide how development resources are applied.</p>\n<p>The MWE in your first post in this thread is <em>almost</em> good for an issue, but it's a bit artificial and doesn't illustrate the need for the feature on its own. It takes some imagination to come up with applications. It's also sort of low-priority since the workarounds are easy (use a multi-arm <code>if</code>). Please create an issue showing a use case that illustrates early return and needing h!</p>\n<p>Let's say we've boosted this to a real issue and we've determined that fixing it has suitable impact (as judged by say the FRO's triage team). To get to the next step of an RFC, we'd want to also analyze control flow in general. My first thought is that <code>unless</code> is also a single-arm <code>if</code>, and if we are touching <code>if</code> wouldn't we want to also make <code>unless</code> accept a hypothesis for completeness?</p>\n<p>Then lastly there's getting to creating an implementation. Proofs-of-concept can be helpful for helping evaluate potential changes of course, but when touching core components, the FRO tends not to accept unasked-for external contributions. Leo has some justification for this in the Github comment.</p>\n<p>In my opinion, the most important work is identifying and minimizing problems and writing them up as clear issues. I don't believe implementation is the limiting factor in most cases.</p>\n<p>It's a lot easier to make contributions to downstream projects like Batteries and Mathlib, and they have a lot more low-hanging fruit for new contributors, with plenty of tactics and plenty of missing theorems.</p>",
        "id": 474346059,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1727886894
    },
    {
        "content": "<p>First of, let me say thank you for such a thorough explanation, this is information which is not  easy to find and I saved this message for later reference.</p>\n<p>Let me answer some of your comments:</p>\n<blockquote>\n<p>any of these are pretty much off-limits to the FRO as well</p>\n</blockquote>\n<p>Wow, what does that mean?  Who maintains/works on these then?</p>\n<blockquote>\n<p>I'd say that for external contributors, generally issues &gt; RFCs &gt; PRs</p>\n</blockquote>\n<p>I will try and adjust my mindset then.  My previous experiences with OSS projects have been that \"feature requests are cool, but PRs are cooler\", and sometimes downright just \"if you want this, make a PR\".  </p>\n<blockquote>\n<p>The MWE in your first post in this thread is <em>almost</em> good for an issue,</p>\n</blockquote>\n<p>I updated the PR description some of the code from the tests.  I had linked to the examples above but I understand they should be more front and center.</p>",
        "id": 474354577,
        "sender_full_name": "Tom",
        "timestamp": 1727889652
    },
    {
        "content": "<p>As for additional examples, I can certainly make them and create an issue.  The PR itself is a stepping stone in my current work on trying to make array indexing \"nicer\".</p>\n<ul>\n<li>I have a PR already merged which tries to \"clean up\" some usages of <code>[]!</code> in the Lean source</li>\n<li>I have submitted an RFC (linked above) regarding iteration with Ranges</li>\n</ul>\n<p>Next, I wanted to work on support for indexing multiple arrays (eg. by looking at the into the <code>get_elem_tactic</code>).  In the Lean source, there is pattern of iterating multiple arrays and indexing as <code>arr1[i]!</code> because the <code>for</code> hypothesis only supports <code>Membership</code> of the array involved in the <code>Range</code>; however, the code frequently leads with e.g.</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"k\">if</span><span class=\"w\"> </span><span class=\"n\">arr1</span><span class=\"bp\">.</span><span class=\"n\">size</span><span class=\"w\"> </span><span class=\"bp\">!=</span><span class=\"w\"> </span><span class=\"n\">arr2</span><span class=\"bp\">.</span><span class=\"n\">size</span><span class=\"o\">:</span>\n<span class=\"w\">   </span><span class=\"n\">return</span><span class=\"w\"> </span><span class=\"bp\">...</span>\n\n<span class=\"c1\">-- Now iterate both arr1 and arr2 but still have to use `[]!`</span>\n</code></pre></div>\n<p>This is the \"real\" motivation behind the PR but it seemed wrapping it up in a separate improvement may make sense.</p>\n<p>Note while you are correct that one could add an <code>else</code>, the fact that people write code like this suggests is that it's in some sense \"easier\", which is why I'm trying to learn more by going after some of these \"paper cuts\".</p>",
        "id": 474355173,
        "sender_full_name": "Tom",
        "timestamp": 1727889870
    },
    {
        "content": "<blockquote>\n<p>and if we are touching <code>if</code> wouldn't we want to also make <code>unless</code> accept a hypothesis for completeness?</p>\n</blockquote>\n<p>I have noticed this and reported it <a href=\"#narrow/stream/270676-lean4/topic/Indexing.20hypothesis.20observations/near/473969520\">here</a></p>\n<p>(Update: I have filed an issue for the <code>unless</code> syntax, as requested: <a href=\"https://github.com/leanprover/lean4/issues/5598\">Issue 5598</a>)</p>",
        "id": 474355648,
        "sender_full_name": "Tom",
        "timestamp": 1727890025
    },
    {
        "content": "<blockquote>\n<p>the FRO tends not to accept unasked-for external contributions</p>\n</blockquote>\n<p>Understood.  The PR is supposed to serve two purposes:<br>\n1) Show an example of a working implementation and the problem is solved<br>\n2) (and as I mentioned above regarding the other OSS projects) \"putting my money where my mouth is\", so to speak</p>\n<p>It's also a good learning exercise for me working in the code base but that is of no value to people out <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> side of myself</p>",
        "id": 474356584,
        "sender_full_name": "Tom",
        "timestamp": 1727890193
    },
    {
        "content": "<p>&lt;deleted/moved above&gt;</p>",
        "id": 474363128,
        "sender_full_name": "Tom",
        "timestamp": 1727891985
    },
    {
        "content": "<p>Lean core is developed as a \"cathedral\" instead of a \"bazaar\". Think the Linux kernel, where there's an architect in charge, who's delegated authority over certain subsystems. You wouldn't expect Torvalds to want to see a patch to change the process scheduler without a lot of discussion first, right? Even changing the max/min macros has needed his personal approval.</p>\n<p>I appreciate your enthusiasm, but with multi-indexing you shouldn't be working on your own. You'll need to work with the FRO here to make an acceptable design and to make sure it is consistent with whatever work may currently be in progress internally. Also, unless you have some project that really depends on it, that can't be done with user libraries, I don't think you can expect this to be an FRO priority. The hard work here is making a clear case for it addressing a user need. There's also potentially evaluating the design space, though that requires being well-acquainted with the language and its design patterns.</p>",
        "id": 474372778,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1727895252
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515083\">Tom</span> <a href=\"#narrow/stream/270676-lean4/topic/RFC.3A.20If.20hypothesis.20scope/near/474354577\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Many of these are pretty much off-limits to the FRO as well</p>\n</blockquote>\n<p>Wow, what does that mean?  Who maintains/works on these then?</p>\n</blockquote>\n<p>No one. That's what \"frozen\" means. It isn't broken, nobody try to breathe too hard on it in case we cause bigger issues.</p>",
        "id": 474374206,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727895571
    },
    {
        "content": "<p>Understood and FWIW, I'm good with that!</p>\n<p>I am not sure if this is coming across in my messages but I don't have some \"grand plan\" that I'm trying to push and I am very open to feedback.</p>\n<p>I didn't set out to \"fix\" array indexing, nor to implement the other changes - it is a lot more organic than that.   Due to my relative inexperience, my focus is narrow and I \"dig\" around areas to grow my understanding.  The changes I made are a representation of the \"early journey feedback\", which sometime has value due to the fact that once one gets used to an ecosystem, they don't see/worry about the \"beginner paper cuts\" anymore.</p>\n<p>So, I am trying to learn Lean and adjust my mindset coming from other languages.  Arrays and iteration is something most beginners will run into very early on.  In my case it was a bit like:</p>\n<ol>\n<li>I try to use \"[]\" and wonder why I need \"[]!</li>\n<li>Then, assuming Lean source and its libraries would be a good place to view/learn best practices, I realized that it's a lot more common.  Wait, wasn't the language supposed to be safe/provably safe?</li>\n<li>Hm, what am I misunderstanding...?  &lt;dig more&gt;</li>\n<li>Hm, here's a feature which may be useful in isolation... etc.</li>\n</ol>\n<p>So, I am running into some issues and I'm trying to report/file them as RFCs, e.g.</p>\n<ul>\n<li>Range behavior</li>\n<li>Dependent iteration with <code>ForIn</code></li>\n<li>Some Float behaviors</li>\n<li>etc</li>\n</ul>\n<p>However, I am a little worried because I don't want to just point out issues and rather try to be helpful with resolving them.</p>",
        "id": 474378306,
        "sender_full_name": "Tom",
        "timestamp": 1727896637
    },
    {
        "content": "<p>Lean runs a lot more like a company than the average OSS project. I'm sure <a href=\"https://github.com/microsoft/vscode\">https://github.com/microsoft/vscode</a> would rather you open an issue rather than try to fix it yourself</p>",
        "id": 474379830,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727897122
    },
    {
        "content": "<p>I would rather say that the core of Lean core is a lot more complicated than the average OSS project. So beginners trying to improve things there are a lot less likely to be useful.</p>",
        "id": 474383634,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1727898304
    }
]