[
    {
        "content": "<p>For the colon equal symbol (<code>:=</code>), could we have a unicode version of it in the definition syntax? I.e. <code>≔</code>.</p>\n<p>Full example:</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"kd\">def</span><span class=\"w\"> </span><span class=\"n\">n</span><span class=\"w\"> </span><span class=\"bp\">≔</span><span class=\"w\"> </span><span class=\"mi\">42</span>\n</code></pre></div>",
        "id": 496989585,
        "sender_full_name": "Anqur",
        "timestamp": 1738324151
    },
    {
        "content": "<p>I love unicode in general, but here I struggle to see what would be gain. Could you expand a bit on your motivation?</p>",
        "id": 497000454,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1738327867
    },
    {
        "content": "<p>And let me check: do you know about fonts with ligatures?</p>",
        "id": 497000517,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1738327892
    },
    {
        "content": "<p>Yes I know the ligatures, I use them often with Fira Code.</p>\n<p>The parser itself already has many \"unicode alternatives\", e.g.</p>\n<ol>\n<li><a href=\"https://github.com/leanprover/lean4/blob/056d1db/src/Lean/Parser/Term.lean#L390\">Arrow (<code>depArrow</code>)</a>: <code>→</code> and <code>-&gt;</code></li>\n<li><a href=\"https://github.com/leanprover/lean4/blob/056d1db/src/Lean/Parser/Term.lean#L394\">Forall</a>: <code>∀</code> and <code>forall</code></li>\n<li><a href=\"https://github.com/leanprover/lean4/blob/056d1db/src/Lean/Parser/Term.lean#L538\">Another arrow (<code>basicFun</code>)</a>: <code>↦</code> and <code>=&gt;</code></li>\n<li><a href=\"https://github.com/leanprover/lean4/blob/056d1db/src/Lean/Parser/Term.lean#L540\">Lambda</a>: <code>λ</code> and <code>fun</code></li>\n</ol>\n<p>So I believe it's okay (and even better) to keep/expand this convention, or, consistency, since initially I felt a bit surprised that many unicode symbols are supported, but the colon equal gets its name in the unicode table, having no its presence in the syntax.</p>",
        "id": 497004120,
        "sender_full_name": "Anqur",
        "timestamp": 1738329121
    },
    {
        "content": "<p>But the unicode version is basically indistinguishable from the ascii version, especially with ligatures. This is very different from the other examples you give.</p>",
        "id": 497016811,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1738333102
    },
    {
        "content": "<p>(See also previously <a href=\"#narrow/channel/113488-general/topic/A.20plea.20from.20a.20newbie.20concerning.20future.20Unicode.20use\">https://leanprover.zulipchat.com/#narrow/channel/113488-general/topic/A.20plea.20from.20a.20newbie.20concerning.20future.20Unicode.20use</a> though IMHO that thread hugely conflates two separate issues of \"do we need ASCII equivalents for all unicode symbols\" with \"is it OK to use highly confusable versions of the same symbol for very different things, regardless of whether that symbol is ASCII or unicode\" -- but it does contain some opinions from Mario and others on adding more ASCII equivalents.)</p>",
        "id": 497019049,
        "sender_full_name": "Julian Berman",
        "timestamp": 1738333703
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> Cool and thanks for pointing out its indistinguishable look and further issues.</p>\n<p>Ligature is something in an editor/IDE, but not generally the web. Unicode symbols will stand out for having the following advantages:</p>\n<ul>\n<li><strong>Single</strong> and <strong>monospaced</strong> character that fits rest of the code (<a href=\"https://plfa.github.io/Fonts/\">although sometimes it doesn't</a>)</li>\n<li>More <strong>literate</strong> on web with web-safe fonts (for being shorter, monospaced, mostly available everywhere)</li>\n</ul>\n<p>But I'm not here standing for/against some ASCII-ism vs Unicode-ism, I just arrived looking for some consistent and coherent convention of Unicode in Lean 4.</p>\n<p>A further context is, I was writing a book that introduces the implementation of a theorem prover, and Lean 4 syntax is my go. My intuition told me that a <code>≔</code> in the definition syntax should be valid but oops it's not.</p>\n<p><span class=\"user-mention\" data-user-id=\"321696\">@Julian Berman</span> Thanks for mentioning this discussion. I'm afraid the \"two issues\" (<em>universal ASCII alternatives</em> and <em>confusable Unicode symbols</em>) go out of the scope here. However, it's good to see similar topics being discussed, and I love the \"ship has sailed\" phrase, and it kinda fits here.</p>",
        "id": 497028158,
        "sender_full_name": "Anqur",
        "timestamp": 1738336265
    },
    {
        "content": "<p>as for some history on how unicode is added/removed in core Lean syntax, I think (3.) above got added because many people doing mathematics wished for it and it does not only look nicer, it can also help distinguish the different meanings <code>=&gt;</code> can have in Lean (e.g. <code>match</code>). And I believe there are/were wishes to remove (4.) because it blocks the symbol from being used as local variable/name.</p>\n<p>I don't think there is an inherit reason Lean couldn't use the unicode <code>:=</code>, but unless reasonable evidence exists that anybody would benefit from it, I doubt any core developer would be motivated to implement it (and add it to things that need to be maintained). I have a hunch that since it's part of various syntax it's more evolved than just defining a new <code>notation</code>, but I didnt really think about these details<span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 497032561,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1738337547
    },
    {
        "content": "<p>Oh yeah I guess <code>:=</code> means several different things, and it's kind of a bit  confusing that currently we are in a situation where <code>=&gt;</code> can be replaced by <code>\\mapsto</code> sometimes but not always (for the same reason). This proposal would probably mean more of that.</p>",
        "id": 497056476,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738345256
    }
]