[
    {
        "content": "<p>When you hover a term in the infoview, it shows you nicely via a blue background (which is not a cursor selection, but looks alot like it!) what the boundaries of the term are. </p>\n<p>It would be really nice if we could just press <code>Ctrl/Cmd+c</code> to copy this current hightlighted part (instead of <em>really</em> selecting the part with the cursor and then pressing <code>Ctrl/Cmd+c</code>)</p>\n<p>Is there maybe an extension capable of doing this that i don't know?</p>",
        "id": 562767612,
        "sender_full_name": "Moritz R",
        "timestamp": 1765305362
    },
    {
        "content": "<p>When you right click a highlighted term, it is selected, so using \"Copy\" from the context menu on it will copy the highlighted term. </p>\n<p>We may also be able to override the copy event handler of the webview in cases where there is no text selected but there is a highlighted term to make Ctrl+C work.</p>",
        "id": 562806749,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1765317121
    },
    {
        "content": "<p>Hmm, this doesn't seem to work for me. Right-clicking while hovering over a non-selected but highlighted term, then clicking copy, copies the whole line; this is consistent with what I see during right click (no highlighting or selection, just my cursor in the spot I right-clicked). (I'm on macOS if relevant.)</p>",
        "id": 562808331,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1765317646
    },
    {
        "content": "<p>I just tested this on a <strong>windows</strong> machine:<br>\n<code>hovering -&gt; right click -&gt; select \"copy\"</code> always works as expected.</p>\n<p><code>hovering -&gt; right click -&gt; Ctrl+c</code> either doesn't work at all (doesnt change the clipboard) or copies the whole line or sometimes a different full line (even though the pop up menu has <code>Ctrl+c</code> as a shortcut next to the <code>copy</code> option!</p>\n<p><code>hovering -&gt; Ctrl+c</code> also either doesn't work at all (doesnt change the clipboard) or copies the whole line  or sometimes a different full line.</p>",
        "id": 562926536,
        "sender_full_name": "Moritz R",
        "timestamp": 1765364279
    },
    {
        "content": "<p>Interestingly the <code>copy</code> command from the vscode command palette doesn't work at all with any combination of things i tried.</p>",
        "id": 562927040,
        "sender_full_name": "Moritz R",
        "timestamp": 1765364438
    },
    {
        "content": "<p>On my <strong>mac</strong> machine, interestingly <br>\n<code>hovering -&gt; right click -&gt; select \"copy\"</code> also always works as expected.</p>\n<p><code>hovering -&gt; right click -&gt; Cmd+c</code> always works as expected?!</p>\n<p><code>hovering -&gt; Cmd+c</code> never works, maybe it's a infoview-focus problem?</p>",
        "id": 562928176,
        "sender_full_name": "Moritz R",
        "timestamp": 1765364828
    },
    {
        "content": "<p>Interestingly the <code>copy</code> command from the vscode command palette sometimes seems to work if i right click after hovering</p>",
        "id": 562928690,
        "sender_full_name": "Moritz R",
        "timestamp": 1765364994
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 562929129,
        "sender_full_name": "Moritz R",
        "timestamp": 1765365134
    },
    {
        "content": "<p>The context menu and the copy functionality are handled by VS Code, not Lean or the Lean VS Code extension.</p>",
        "id": 562929207,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1765365162
    },
    {
        "content": "<p>We could certainly provide a command-palette action to copy the hovered text and also a \"when\" condition like <code>infoviewTextHovered</code>, so that we can override ctrl+c in these situtations using a vscode keybinding?</p>",
        "id": 562931376,
        "sender_full_name": "Moritz R",
        "timestamp": 1765365835
    },
    {
        "content": "<p>You also need to ensure that the InfoView is focused, because otherwise Ctrl+C can copy text e.g. from your editor if text is already selected there. I'd prefer trying to just override the webview copy event instead of adding more VS Code command &lt;-&gt; webview communication.</p>",
        "id": 562933824,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1765366724
    },
    {
        "content": "<p>(The focus issue is why every solution here will be somewhat unintuitive to users because you can always hover over terms in the InfoView without focusing it)</p>",
        "id": 562935059,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1765367132
    },
    {
        "content": "<p>ideally the copying would work, even without infoview focus? That's why i didn't include it in <code>infoviewTextHovered</code></p>",
        "id": 562935319,
        "sender_full_name": "Moritz R",
        "timestamp": 1765367220
    },
    {
        "content": "<p>A custom command palette action could work without needing focus on the infoview</p>",
        "id": 562935519,
        "sender_full_name": "Moritz R",
        "timestamp": 1765367288
    },
    {
        "content": "<p>What text do you copy if there is text selected in the editor or some other panel that is currently focused? What happens when you've focused the terminal and are running a command that should be cancelled by Ctrl+C?</p>",
        "id": 562935985,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1765367448
    },
    {
        "content": "<p>In my opinion we should prefer copying the infoview hovered text in all these scenarios.</p>",
        "id": 562936381,
        "sender_full_name": "Moritz R",
        "timestamp": 1765367590
    },
    {
        "content": "<p>For the terminal we can add a <code>!terminalfocused</code> though</p>",
        "id": 562936564,
        "sender_full_name": "Moritz R",
        "timestamp": 1765367654
    },
    {
        "content": "<p>Let's not change how standard VS Code operations behave w.r.t. focusing - I expect that this will result in even more confusing behavior than the alternative (e.g. your mouse is in the InfoView, you start typing, your mouse is hovering over a subterm by accident, you hit Ctrl+C to copy text in your editor and it unexpectedly copies text from the InfoView instead).</p>",
        "id": 562954785,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1765373331
    }
]