[
    {
        "content": "<p>Sometimes I'd like to run CI on a branch on my own fork of lean4 without polluting the main repo with draft PRs (which has been my M.O. thus far! :) ).</p>\n<p>I know I can do this by making a tag and a release, but this seems like a lot of menus to click through; if this is the preferred (non-PR) way, that's fine! It just feels like I'm missing something—I'd imagine there'd be something more direct to click (or, at worst, some CLI command to run) that just means \"run the workflow on this branch\" without making a tag each time.</p>\n<p>(I tried commands like <code>gh workflow run 'PR release' --ref &lt;branch&gt;</code>, but this gives me errors about lacking a \"workflow dispatch event\".)</p>",
        "id": 469853729,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1726204471
    },
    {
        "content": "<p>Somehow your question is phrased in a way that is very hard to answer.</p>\n<p>No? Yes? (You must make a PR, or tag, or work out how to modify CI yourself. :-)</p>",
        "id": 469858616,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1726206834
    },
    {
        "content": "<p>I believe the reason it's hard to answer is that I did not, in fact, include a question after all. Oops. <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>\n<p>But I think that parenthetical answers the question I <em>meant</em> to ask, which is \"do you need to make a tag or PR to run CI (given the way it works currently)\". :)</p>\n<p>A follow up question is: if you run CI by making a tag, do you need to make a <em>new</em> tag each time you want to run CI on a branch? (I'm wholly unfamiliar with tags.)</p>",
        "id": 469859189,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1726207125
    },
    {
        "content": "<p>You can force-update tags. You don't need to create a release for them. You can also make PRs to your own fork.</p>",
        "id": 469862197,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1726208340
    },
    {
        "content": "<p>Ah, okay! Googling got me to <code>git tag -f &lt;tag&gt; &lt;branch&gt;</code>, which seems promising. (Knowing that tags are meaningful independently from associated releases is useful too, since this isn't obvious when poking around the GitHub website!)</p>",
        "id": 469863158,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1726208636
    },
    {
        "content": "<p>In my own workflows I usually have the following:</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">on</span><span class=\"o\">:</span>\n<span class=\"w\">  </span><span class=\"n\">workflow_dispatch</span><span class=\"o\">:</span>\n</code></pre></div>\n<p>which allows you to click a button to run the workflow manually and select the branch to run it on (or trigger it via the command you mentioned, I assume)</p>\n<p>I would guess you could just add this to the desired workflow on your fork (I think the modified workflow needs to be on main/master?)</p>",
        "id": 469875097,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1726211651
    },
    {
        "content": "<p>(but PRs against the fork's main is what I do even more often)</p>",
        "id": 469875648,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1726211772
    },
    {
        "content": "<p>Oh, clicking a button like that sounds like what I was looking for! (Though admittedly I too might wind up just using PRs against my main, now that I know that works.)</p>\n<p>Though, if the workflow modification is on your main, does that mean that syncing with leanprover/lean4 (and/or making branches which don't include that change) is awkward? I could imagine accidentally making a new branch based on my fork's main, making a real PR, then realizing I have to remove <code>on:\\n  workflow_dispatch</code>.</p>",
        "id": 469876834,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1726212006
    },
    {
        "content": "<p>updating is probably just a simple <code>git rebase upstream/main</code> once you added <code>leanprover/lean4</code> as <code>upstream</code>, havent tested if the website \"Sync\" button does that, too, but I would guess so.</p>\n<p>but keeping such a tmp commit out of your branches might need a bit manual care, indeed</p>",
        "id": 469880857,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1726213060
    }
]