[
    {
        "content": "<p>Has there been some work in nix support for lean4? I'm asking because I know some people who joined the lean FRO are nix enthusiasts and I would like to know what the current \"preferred way\" of setting up, building, and running a lean4 project with nix is. </p>\n<p>Thanks in advance.</p>",
        "id": 405365434,
        "sender_full_name": "MangoIV",
        "timestamp": 1701437887
    },
    {
        "content": "<p>There is a lean setup in the lean repo, and at some point it was even meant to be a viable even for interactive use on lean project.  But I think nobody is using it (not even the people who created it ), and it does not seem viable to keep it running. The best I can hope for at the moment is that we maintain the ability to build <code>lean</code> itself using nix for now, and then on top maybe have a <code>lake</code> wrapping setup (maybe with a <code>lake vendor</code> command and including the vendor hash in the nix derivation, like for rust) for building lean programs in nix.</p>\n<p>For actually developing with lean, using nix will not help you much. Just get <code>elan</code> (e.g. from nixpkgs, that’s fine), and then use that to get lake, and use that for developing.</p>",
        "id": 405368794,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1701438994
    },
    {
        "content": "<p>alright, I was fearing something like that; I guess having lake as the frontend to all package builds is kinda a choice contrary to nix (I think we talked about that)</p>\n<p>I guess providing some tools in a devShell is fine..</p>",
        "id": 405369218,
        "sender_full_name": "MangoIV",
        "timestamp": 1701439145
    },
    {
        "content": "<p>Yes, for hacking _on_ lean I use the <code>nix-shell</code> there, which pulls in the right LLVM etc.</p>",
        "id": 405374480,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1701440714
    },
    {
        "content": "<p>And for loogle, the devShell pulls in mostly elan:<br>\n<a href=\"https://github.com/nomeata/loogle/blob/master/flake.nix#L190-L197\">https://github.com/nomeata/loogle/blob/master/flake.nix#L190-L197</a></p>",
        "id": 405374564,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1701440748
    }
]