[
    {
        "content": "<p>What's the right thing to do when seeing a small bug in core? (Example at hand: I noticed a missing <code>s!</code> in front of a clearly-intended-to-be-interpolated string that's used for an error message.)</p>\n<p>The contribution guidelines say that \"simple fixes for typos and clear bugs are welcome\", but follows that with a request to hold off on submitting PRs for now. Which takes priority in a case like this? (And if the simple fix does, does a simple fix for a clear, minor bug like this entail an issue + a PR, or just a direct PR, since the bug is so small?)</p>\n<p>Likewise, I occasionally notice small, non-meaningful typos in core docstrings. Would fixing a single typo like that in a PR be welcome? (I could, alternatively, hang onto them and submit several docstring typo fixes in a larger PR—or simply ignore them.)</p>\n<p>My goal here is just to not make unneeded noise, since I know everyone working on core is very busy. At the same time, I thought maybe I could help when I notice something like this. :)</p>",
        "id": 391431406,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1694910262
    },
    {
        "content": "<p>small bugs I would just PR, I wouldn't expect much drama about that</p>",
        "id": 391431630,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1694910405
    },
    {
        "content": "<p>typos too</p>",
        "id": 391431644,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1694910417
    },
    {
        "content": "<p>Cool—is <code>chore:</code> appropriate in the PR title/commit msg to indicate these would be small PRs, or is <code>fix:</code>/<code>docs:</code> the way to go?</p>",
        "id": 391431884,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1694910571
    },
    {
        "content": "<p><code>fix:</code> for the bugfix, not sure about <code>fix:</code> vs <code>docs:</code> for typos</p>",
        "id": 391432037,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1694910651
    },
    {
        "content": "<p>historical evidence points to <code>doc:</code></p>",
        "id": 391432184,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1694910737
    },
    {
        "content": "<p>Also—I'm guessing something like this doesn't warrant adding a test, right?</p>",
        "id": 391432530,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1694910945
    },
    {
        "content": "<p>it's probably fine</p>",
        "id": 391433185,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1694911300
    },
    {
        "content": "<p>For a bug fix I would take the extra effort to write at least a test that exercises it. Tests are not just to show that your fixes work, but also to guarantee that the behaviors you're testing won't regress in the future.</p>",
        "id": 391484979,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1694948315
    },
    {
        "content": "<p>For the example above (adding a <code>s!</code> or <code>m!</code> to a string that is clearly intended to use interpolation), I think a test would be unnecessary overhead. But yes, please err on the side of testing. :-)</p>",
        "id": 391493298,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1694952091
    }
]