[
    {
        "content": "<p>Is there any release schedule for the first stable release of Lean 4?</p>",
        "id": 366710915,
        "sender_full_name": "Evan Greenup",
        "timestamp": 1686898592
    },
    {
        "content": "<p>not with dates on it</p>",
        "id": 366711183,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1686898670
    },
    {
        "content": "<p>But there are some general milestones in terms of things that need to happen before we think it is ready, the main one being mathlib4 getting ported (not because it is specifically important to lean4 the language but because it is a large and important test case as well as the source of a lot of lean4-related documentation)</p>",
        "id": 366711581,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1686898769
    },
    {
        "content": "<p>But I'm not the one in charge of the release schedule, this is just my read on things</p>",
        "id": 366711689,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1686898801
    },
    {
        "content": "<p>I'm not sure whether the new compiler is planned for before or after the stable release</p>",
        "id": 366712076,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1686898875
    },
    {
        "content": "<p>cc: <span class=\"user-mention\" data-user-id=\"112857\">@Leonardo de Moura</span></p>",
        "id": 366712342,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1686898930
    },
    {
        "content": "<p>To give a guess for a time on mathlib4 being ported, it looks like it will all be over bar the shouting in a couple of weeks. There will probably be some debate about what \"finished\" means (all of <code>/src</code>? all of <code>/src</code> and all of the IMO problems/counterexamples? etc etc) and there will be a lot of triaging of porting notes which will need thinking about, but in all reasonable measures of the problem we are \"nearly there\" in the sense that the vast majority of the work seems to be done now and the current speed of porting remains high.</p>",
        "id": 366717173,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1686900037
    },
    {
        "content": "<p>I compared being \"finished\" with the port as like climbing a mountain. We're very close to the summit, but even we get there, we still need to climb back down the other side. All those porting notes are going to take some time.</p>",
        "id": 366725494,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1686901985
    },
    {
        "content": "<p>And there's a bunch of files that have in-progress PRs with more or less painful issues, so we may end up slowing down as these become blockers</p>",
        "id": 366732126,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1686903357
    },
    {
        "content": "<p>And all the documentation on the website needs updating for Lean 4, including e.g. updating <code>100.yaml</code> and <code>undergrad.yaml</code> for the new names of all the results and definitions referenced, etc.</p>",
        "id": 367023683,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1686959298
    },
    {
        "content": "<p>In Lean 4, the <code>leanc</code> command will compile a lean source file to a machine code. Is that correct?</p>",
        "id": 367349340,
        "sender_full_name": "Evan Greenup",
        "timestamp": 1687084970
    },
    {
        "content": "<p>No its a modified C compiler</p>",
        "id": 367350580,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1687085317
    }
]