[
    {
        "content": "<p>Sometimes I open up a file in VS code that has a lot of deep imports, and suddenly I’m building a thousand files. (This is quite taxing to my laptop.)</p>\n<p>I know there’s been discussion about turning this kind of autobuild-on-file-open off, but I wanted to ask about a different thing: is there a way to stop the build without writing <code>killall lake</code> (which stops the server too)? (This might still apply in the non-autobuild case: I deliberately begin the build, realize it’s extensive, then want to interrupt it.)</p>",
        "id": 391248017,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1694806022
    },
    {
        "content": "<p>IIUC, no there isn't (but maybe this has changed in the past month or two).</p>",
        "id": 391248706,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1694806293
    },
    {
        "content": "<p>I thought <span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> had some fix that involved process groups to ensure that killing lake also kills the workers</p>",
        "id": 391249136,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1694806462
    },
    {
        "content": "<p>And I thought it actually worked since people have stopped complaining (and some did confirm it worked)</p>",
        "id": 391260068,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1694810546
    },
    {
        "content": "<p>Hmm, could I be using an old version of <code>lake</code> or lean somehow? What do I need to make sure is up to date to test the new behavior?</p>",
        "id": 391287799,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1694821880
    },
    {
        "content": "<p>If you work on recent mathlib, that should not be a concern. But you haven't described yet what you actually tried; does closing the file tab not stop the build for you?</p>",
        "id": 391364707,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1694862363
    },
    {
        "content": "<p>Oh, I didn’t think to try that! In this case, I wanted to keep looking at the file without building—but that now falls under preventing autobuild, not the issue I brought up here. Closing the file works. Thanks. :)</p>",
        "id": 391426578,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1694905769
    }
]