[
    {
        "content": "<p>Hi everyone! I am new here so sorry in advance if I am asking something naive.</p>\n<p>I have been really interested in the lean4 programming language since I did a project a month ago for my university, and I am amused by the potentialities this programming language has to help the life of mathematicians.</p>\n<p>Since I've started learning lean I have an <em>Hamletian doubt</em>:  Mathlib may become richer and richer, may also cover all the existing mathematics, but if there is not a handy way for the user to get access to theorems they need in specific moments this sounds to me kind of useless.</p>\n<p>As far as I now (but I'd like to be corrected if I am wrong) the only way this problem has been approached until now is by following specific naming conventions for theorems on mathlib; and thanks to this naming conventions tools like <a href=\"https://www.moogle.ai/\">moogle.ai</a> try to do what they are meant to do.</p>\n<p>I was wondering if there is some specific work in progress on the side of \"letting humans be able to find easily theorems they need\": an approach via key-words/semantic fields associated to theorems (N.B. a key word may be associated to a theorem even if this does not appear in its name!), some kind of AI process to link key words to theorems in such a way that the more the users find a theorem (that they end up to use) by a specific key word, the stronger will become the link theorem-keyword in the \"searching for theorems algorithm\".</p>\n<p>Sorry if these sounds to you as useless doubts and questions but I'd be very glad if anyone could enlight me more about this topic.</p>\n<p>Best regards,</p>\n<p>Bernardo</p>",
        "id": 483871879,
        "sender_full_name": "Bernardo Tarini",
        "timestamp": 1732268448
    },
    {
        "content": "<p>The strongest tool that we have for this job which does not work like moogle is <a href=\"http://loogle.lean-lang.org\">loogle.lean-lang.org</a>. It allows you to search for theorems containing combinations of certain types, patterns in their expressions etc. There isn't really a keyword based system integrated with this but it allows for more predictable targeted search if you know the rough shape of your target.</p>",
        "id": 483872288,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1732268584
    },
    {
        "content": "<p>There is also <a href=\"https://leansearch.net/\">https://leansearch.net/</a> that is similar to Moogle.</p>",
        "id": 483873833,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1732269100
    },
    {
        "content": "<p>It would be great if loogle could learn to search docstrings too</p>",
        "id": 483910105,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1732281734
    },
    {
        "content": "<p>Forgive my ignorance, but what would it mean for loogle to search doc strings?</p>",
        "id": 483916564,
        "sender_full_name": "Jason Rute",
        "timestamp": 1732283829
    },
    {
        "content": "<p>if you write <code>\"foobar\"</code> then loogle will search for declarations containing <code>foobar</code></p>",
        "id": 483916674,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1732283877
    },
    {
        "content": "<p>It already does that right now, looking for doc-strings would additionally make it search for occurences of <code>foobar</code> in doc-strings.</p>",
        "id": 483916908,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1732283915
    },
    {
        "content": "<p>Also Moogle and LeanSearch do way more than just go off naming conventions.  Also, Lean Copilot has a lemma lookup feature which tries to find lemmas useful for the current goal.  (The keywords here are “premise selection” or “lemma selection”.)</p>",
        "id": 483917173,
        "sender_full_name": "Jason Rute",
        "timestamp": 1732284005
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"395550\">Henrik Böving</span> <a href=\"#narrow/channel/270676-lean4/topic/Theorem.20search.20tools/near/483916908\">said</a>:</p>\n<blockquote>\n<p>It already does that right now, looking for doc-strings would additionally make it search for occurences of <code>foobar</code> in doc-strings.</p>\n</blockquote>\n<p>sorry I guess it was implied but I meant \"declarations containing <code>foobar</code> <em>in their docstring</em>\"</p>",
        "id": 483917709,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1732284180
    }
]