[
    {
        "content": "<p>Hey all, I am an undergraduate learning Lean in a class this semester. I have been working on a course project, which I will soon be turning in. We discussed in class that since the behaviour of <code>simp</code> can change over updates, it is best practice to only have <code>simp only</code> in order to make code robust and maintainable. However, my code was riddled with 450+ unguarded <code>simp</code> statements, and converting them to <code>simp only</code> by first changing them to <code>simp?</code> and then clicking the suggestion in the infoview seemed to be very tedious. </p>\n<p>I therefore made a small tool which does this in quite a hacky way: <a href=\"https://github.com/mrigankpawagi/simpleafier\">https://github.com/mrigankpawagi/simpleafier</a>. I was able to transform all of my <code>simp</code>s in less than 30 seconds (with the \"fast\" mode) and had to spend only a minute or two more fixing 2 small errors that came up after the transformation.</p>\n<p>I would like to know if there's a cleaner way to do this that other people are aware of, for example, from inside Lean? I would also be happy to hear any feedback or suggestions. (PS my course project is <a href=\"https://github.com/mrigankpawagi/LeanearTemporalLogic\">here</a>).</p>",
        "id": 513155333,
        "sender_full_name": "Mrigank Pawagi",
        "timestamp": 1745056904
    },
    {
        "content": "<p>Thanks for asking, that's an interesting question! <br>\nLet me start with more of a side point: not <em>all</em> <code>simp</code>s are bad: if a simp closes a goal (it's a \"terminal simp\"), leaving it as simp is usually fine. (In fact, mathlib policy <em>asks</em> for such simps to be <code>simp</code> and not <code>simp only</code>s.)<br>\nThis leads me to a related tool: mathlib's <code>flexible</code> linter. You can activate it with <code>set_option linter.flexible true</code> in a file (or change your <code>lakefile</code>; if you don't know what this is, going file by file may be good enough). The linter will complain about every \"non-terminal simp\" (but will leave terminal simps alone) --- so you could use the linter as a means of checking \"which simps do I actually need to change\".</p>",
        "id": 513159297,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745060351
    },
    {
        "content": "<p>(If you're not on a very recent mathlib, you may need to <code>import Mathlib.Tactic.Linter.Flexible</code> to make the set_option work. On recent mathlib, that is never necessary any more.)</p>",
        "id": 513159319,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745060388
    },
    {
        "content": "<p>Thanks for your answer. You're right! My tool does, in fact, leave many <code>simp only</code>s at the end of proofs (it was a little tricky to manage them automatically). </p>\n<p>Good to know that there is a linter to help with this. It is generally better to take care of this while writing the proofs in the first place (before one ends up in a situation like mine with hundreds of bad <code>simp</code>s <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span>)!</p>",
        "id": 513159557,
        "sender_full_name": "Mrigank Pawagi",
        "timestamp": 1745060587
    },
    {
        "content": "<p>I have added <code>set_option linter.flexible true</code> to my file. It does not complain about terminal <code>simp only</code>s though <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>. For that I might just have to ctrl+F and check</p>",
        "id": 513169404,
        "sender_full_name": "Mrigank Pawagi",
        "timestamp": 1745068904
    },
    {
        "content": "<p>Indeed, the linter (currently) only checks one implication.</p>",
        "id": 513181204,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745077884
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> How difficult would it be to lint for terminal simps which are squeezed? (That should probably be covered by a new option, and cannot be enabled in mathlib yet either --- but it could help here or in downstream projects.)</p>",
        "id": 513181288,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745077940
    }
]