[
    {
        "content": "<p>Hi, sorry if this isn't the right place to ask, but I'm having a lot of trouble installing lean4. I've following the instructions on <a href=\"https://leanprover-community.github.io/install/windows.html\">https://leanprover-community.github.io/install/windows.html</a>, and I've downloaded the lean4 extension on VSCode, but this is what I see when I try to test it<br>\n<a href=\"/user_uploads/3121/MWVynle4Zcn3KIqwQUEaaSVQ/Screenshot-714.png\">Screenshot-714.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/MWVynle4Zcn3KIqwQUEaaSVQ/Screenshot-714.png\" title=\"Screenshot-714.png\"><img src=\"/user_uploads/3121/MWVynle4Zcn3KIqwQUEaaSVQ/Screenshot-714.png\"></a></div><p>I also tried cloning <a href=\"https://github.com/PatrickMassot/GlimpseOfLean\">https://github.com/PatrickMassot/GlimpseOfLean</a> to go straight to solving the exercises, but I just get the errors below:</p>\n<p><a href=\"/user_uploads/3121/k3hLQ-3PDV4zT_aApP6AFK_3/Screenshot-712.png\">Screenshot-712.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/k3hLQ-3PDV4zT_aApP6AFK_3/Screenshot-712.png\" title=\"Screenshot-712.png\"><img src=\"/user_uploads/3121/k3hLQ-3PDV4zT_aApP6AFK_3/Screenshot-712.png\"></a></div><p>When I installed Lean 3 just over a year ago I didn't have any problems with it, and was able to jump right into solving exercises, so I'm not sure what I've done wrong this time!</p>",
        "id": 389495758,
        "sender_full_name": "Ali Ramsey",
        "timestamp": 1694025155
    },
    {
        "content": "<p>This is a strange looking error. Everything looks ok with the lean version and directory. but the error message is saying something odd about git</p>",
        "id": 389508413,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1694030618
    },
    {
        "content": "<p>What happens if you run <code>lake build</code> in the GlimpseOfLean directory on the command line? (or terminal window in vscode)</p>",
        "id": 389508457,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1694030638
    },
    {
        "content": "<p>It took about 3hrs to build everything, but that seems to have fixed it -- thank you! Out of interest, is there something I missed in the installation?</p>",
        "id": 389545077,
        "sender_full_name": "Ali Ramsey",
        "timestamp": 1694051000
    },
    {
        "content": "<p>Probably not. The language server was likely in some weird state and building everything kicked it out of that weird state :p <br>\nif there's ever an issue with the language server, restarting it is usually a good call (Control+Shift+P, then search for \"Lean4 restart\")</p>",
        "id": 389546344,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1694051645
    },
    {
        "content": "<p>also <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> maybe the GlimpseOfLean readme should mention <code>lake exe cache</code>?</p>",
        "id": 389546436,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1694051699
    },
    {
        "content": "<p>I don see why it would refer specifically to this step since it refers to the whole installation instructions set.</p>",
        "id": 389664523,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1694094541
    },
    {
        "content": "<p>Because people skip it and forget it? I think until we have it integrated into <code>lake build</code> the more reminders the better.</p>",
        "id": 389766991,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1694124978
    },
    {
        "content": "<p>Although I had known about <code>lake exe cache</code> from zulip, when I'm in a new environment (Github Codespaces in my case) and looking for just a full instruction set containing a few commands to execute for adding mathlib as a dependency without hours of build time, the experience was frustrating (I tried the following in order from the top of my head):</p>\n<ol>\n<li>Mathlib README: <a href=\"https://github.com/leanprover-community/mathlib4#installation\">https://github.com/leanprover-community/mathlib4#installation</a> redirects to <a href=\"https://leanprover-community.github.io/get_started.html\">https://leanprover-community.github.io/get_started.html</a> where is a manual installation that mentions nothing about <code>lake exe cache</code> for all OSes</li>\n<li>Lean 4 manual: <a href=\"https://leanprover.github.io/lean4/doc/quickstart.html\">https://leanprover.github.io/lean4/doc/quickstart.html</a> which lets VSCode Lean 4 extension to do the installing but if I wish to execute <code>lake</code> commands, by default I'll have to realize that it's not in the PATH yet, and starting a new terminal in VS Code would not add it to the PATH, I have to do manual <code>export</code>, <code>source</code> or using <code>bash -l</code> etc. Of course, it also mentions nothing about <code>lake exe cache</code> because the manual is for pure Lean 4 not Mathlib4-based Lean 4 projects.</li>\n<li>Then following some tutorial or game projects that use mathlib4 already might be good enough? unfortunately, I picked <a href=\"https://github.com/djvelleman/HTPILeanPackage\">https://github.com/djvelleman/HTPILeanPackage</a> which is a great book for reading, but its lakefile <a href=\"https://github.com/djvelleman/HTPILeanPackage/blob/master/lakefile.lean#L12\">here</a> is specifying the lib source different from, e.g. <a href=\"https://github.com/bridgekat/filter-game\">https://github.com/bridgekat/filter-game</a>, which would end up compile Mathlib every time even after I executed <code>lake exe cache</code>successfully (I haven't figure out why yet)</li>\n<li>Go back to Mathlib4 doc I found a separate <a href=\"https://github.com/leanprover-community/mathlib4#downloading-cached-build-files\">https://github.com/leanprover-community/mathlib4#downloading-cached-build-files</a> below that mentions <code>lake exe cache</code> but didn't help me resolve issues encountered in step 3</li>\n<li>Reread Mathlib4 doc: I found another separate link below at <a href=\"https://github.com/leanprover-community/mathlib4#using-mathlib4-as-a-dependency\">https://github.com/leanprover-community/mathlib4#using-mathlib4-as-a-dependency</a> pointing to Mathlib4 wiki, which eventually became a lifesaver to guide me to create a new project depending on Mathlib4, I managed to get the new project working with effective Mathlib4 cache, then I got to realize what went wrong in step 3 and got the original code base working</li>\n<li>I also encounter issues related to Lean toolchain versions to realize that I need to use the toolchain as the one Mathlib4 is using, again I was copy-pasting Lean toolchain versions from some tutorial or game projects, so it's either incompatible with lake or mathlib4</li>\n<li>There's also another annoying issue during the process, I need to  open a Lean file in VS Code to activate the Lean 4 extension to install Lean toolchain, but then it would start the Lean server which is something like <code>lake serve</code>, but of course at the moment I haven't execute <code>lake exe cache get</code> yet, so it's recompiling Mathlib4 from scratch, so I have to stop lean server, but again, I have to remove the lake build lock to do my own <code>lake build</code> to verify whether it picks up Mathlib4 cache and keep trying. This is also known as <a href=\"#narrow/stream/287929-mathlib4/topic/running.20.60cache.20get.60.20as.20part.20of.20every.20.60lake.20build.60/near/385404922\">the server for the editor and lake on the command line fight each other</a>.</li>\n</ol>\n<p>During the experience, <a href=\"https://github.com/leanprover-community/mathlib4/wiki/Using-mathlib4-as-a-dependency\">the wiki link in step 4</a> is most helpful, but it's not easy to notice it because I was redirect away from Mathlib4 readme in step 1 .</p>\n<p>I hope my experience could be useful as a case study to improve the doc about how to install Lean 4 to use Mathlib4. I might be a little silly and sloppy when I read the docs, but it's easy to make these mistakes as I was directed around by readmes, manuals, books and tutorial/game projects. The instructions are scattered, pointing to different places and it's up to the user to piece things together. </p>\n<p>(A little background: I was familiar with Lean 3/Mathlib3 setup and pure Lean 4 setup around a year ago, but until recently I haven't got the chance to familiarize myself with Mathlib4 steup )</p>",
        "id": 389818546,
        "sender_full_name": "Utensil Song",
        "timestamp": 1694154469
    },
    {
        "content": "<ol>\n<li>The instructions at <a href=\"https://leanprover-community.github.io/get_started.html\">https://leanprover-community.github.io/get_started.html</a> haven't actually opened any projects yet, so <code>lake exe cache get</code> is irrelevant. When you click the \"<a href=\"https://leanprover-community.github.io/install/project.html\">Lean projects</a>\" link it then tells you about <code>lake exe cache get</code>.</li>\n</ol>\n<p>I suspect the problem here is that people don't realize they need to click \"Lean projects\". Perhaps someone could add a big banner at the bottom of that page: \"Next step: set up a Lean project\"?</p>",
        "id": 389820443,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1694155526
    },
    {
        "content": "<p>After reading your message and check the getting started page again, this is the first time I realize this sentence is right below all the links for all the OSes:</p>\n<blockquote>\n<p>After this installation procedure, it is crucial to read how to start or get a Lean project.  <em>&lt;- link here</em></p>\n</blockquote>\n<p>But I was directed away from this page for the specific OS, like I was direct away from Mathlib4 README. The reading stream is broken, and for someone haven't got the big picture of all steps, it could be an obstacle.</p>\n<p>(EDIT: I just noticed that for each OS, it mentions Lean projects at the bottom, now I truly have no excuse <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span> )</p>",
        "id": 389831128,
        "sender_full_name": "Utensil Song",
        "timestamp": 1694160311
    },
    {
        "content": "<p>We are working on making <code>lake exe cache get</code> unnecessary (i.e. it will be an opt-out automatic action when you <code>lake build</code>), since we're realising instructions are hard. :-)</p>",
        "id": 389834012,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1694161471
    }
]