[
    {
        "content": "<p>Is Try This suggestion styling intended to be gone for good, or was it just not re-implemented in <a href=\"https://github.com/leanprover/lean4/pull/9966\">lean4#9966</a>?</p>\n<p>The reasoning given for deprecating it in the PR is that the hint infrastructure uses diff colors, but try this suggestions typically (still) do not use a diff. Styling was used in <code>hint</code> to communicate successful tactics.</p>\n<p><span class=\"user-mention\" data-user-id=\"221921\">@Marc Huisinga</span>, is there any chance suggestion styling will eventually come back? (Currently, we're wondering whether to leave an adaptation note for <code>hint</code> in <a class=\"stream-topic\" data-stream-id=\"428973\" href=\"/#narrow/channel/428973-nightly-testing/topic/Mathlib.20status.20updates/with/536337836\">#nightly-testing &gt; Mathlib status updates</a> .)</p>",
        "id": 536337808,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1756261421
    },
    {
        "content": "<p>I'd prefer hints to be styled consistently (color-wise), but I'm happy to re-consider if use-cases other than <code>hint</code> end up popping up in practice. </p>\n<blockquote>\n<p>but try this suggestions typically (still) do not use a diff</p>\n</blockquote>\n<p>They now use blue to signal an insertion.</p>",
        "id": 536366461,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1756281620
    },
    {
        "content": "<p>I can appreciate that! I’ll mention two cases (ish) which come to mind:</p>\n<p><a href=\"#narrow/channel/113486-announce/topic/Reap!.3A.20Yet.20another.20tactic.20for.20theorem-proving/with/536354349\">This recent project</a> is hint-like, and uses styling for a similar reason—but uses their own tweaked try this widget, and so is only really an example of how more <code>hint</code>-like tactics might come to exist.</p>\n<p>One use case I had been meaning to get around to implementing was styling <code>exact?</code> suggestions which use deprecated constants with the deprecation styling.</p>\n<blockquote>\n<p>They now use blue</p>\n</blockquote>\n<p>For me, they’ve always been blue…I think they’ve always been styled as links to signal clickability, no?</p>",
        "id": 536370975,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1756283402
    }
]