[
    {
        "content": "<p>At Xena yesterday we had someone on Windows who (looked to me like they) did everything right when installing, but could not get rid of <code>uncaught exception: no such file or directory (error code: 2)</code> happening when they used <code>lake exe cache get</code>. </p>\n<p>After a lot of time searching this site we ran into the comments around <a href=\"#narrow/stream/270676-lean4/topic/.60lake.20exe.20cache.20get.60.20fails.20in.20command.20prompt/near/377463194\">here</a> and to cut a long story (involving clearing every cache and then ultimately reinstalling absolutely everything and the problem remaining) short, switching from PowerShell (which was the default shell which VS Code was using on this user's system) to Git Bash made the problem magically go away. I think there are other reasons for this error (for example Patrick had a nightmare with it once and he doesn't use Windows) but I thought I would highlight this one.</p>\n<p>I know that in the lean 3 docs we did stress at some point that git bash was the preferred shell for Windows users and I wonder whether this remains true for Lean 4.</p>",
        "id": 395226285,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1696587389
    },
    {
        "content": "<p>It is not nearly as easy as running <code>strace</code> on LInux (not a sentence I thought I would ever write) but if someone really wanted to debug this, Process Monitor would be the way I believe</p>",
        "id": 395240960,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1696592361
    },
    {
        "content": "<p>Do you know what version of Windows it was?</p>",
        "id": 395241236,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1696592441
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"132603\">@Calle Sönne</span> ? And can you reproduce if you switch back to power shell?</p>",
        "id": 395241372,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1696592495
    },
    {
        "content": "<p>Actually now it works in power shell as well somehow <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 395390175,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1696666734
    },
    {
        "content": "<p>Not sure what fixed it, because even after reinstalling everything I still got the error. Only after running it in git bash it started working and I have not changed anything since then.</p>",
        "id": 395390303,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1696666844
    },
    {
        "content": "<p>Oh right, after first running it in git bash I got 'leantar is too old'. I guess after updating whatever that is, it also started working in powershell.</p>",
        "id": 395390478,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1696667024
    },
    {
        "content": "<p>Thanks Kevin, I've just expended \"a lot of time searching\" and appreciate you confirming this problem was probably not  caused by me not following the install instructions....</p>",
        "id": 396335054,
        "sender_full_name": "Chris Sangwin",
        "timestamp": 1697131983
    }
]