[
    {
        "content": "<p>I know that using infixl, infixr, prefix we can define custom operators. but I clicked on <code>¬</code> and found that not operator was defined via <code>notation:max \"¬\" p:40 =&gt; Not p</code>. Searching around, here's what I have learnt: Notation is a more featureful way to define operators. But I have two questions now</p>\n<ol>\n<li>Is the notation syntax completely equivalent to infixl, infixr, prefix (when done in their format)? by equivalent I mean are they semantically or syntactically equivalent?</li>\n<li>why was \"Not\" defined via notation and not prefix?</li>\n</ol>",
        "id": 501718805,
        "sender_full_name": "Sabbir Rahman",
        "timestamp": 1740463101
    },
    {
        "content": "<p>infix, infixr, prefix is macro of notation command</p>",
        "id": 501727398,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1740467351
    },
    {
        "content": "<p>You should be able to \"go to definition\" on the infix/prefix commands to see how they're defined in terms of <code>notation</code>.</p>\n<p>The resaon <code>Not</code> is not using a <code>prefix</code> is that <code>prefix:40 \"¬\" =&gt; Not</code> would be equivalent to <code>notation:40 \"¬\" p:40 =&gt; Not p</code>. The <code>max</code> in the <code>notation</code> version makes the notation not need parentheses around it even if it's placed in some high-precedence contexts. (Maybe someone can come up with some examples why it is the way it is.)</p>",
        "id": 501979631,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1740555446
    },
    {
        "content": "<p>unfortunately when I tried clicking on infix/prefix vscode was not going anywhere, also tried \"go to definition\" that also failed.</p>",
        "id": 501979966,
        "sender_full_name": "Sabbir Rahman",
        "timestamp": 1740555598
    },
    {
        "content": "<p>Make sure you have <code>import Lean</code> (or a stronger import)</p>",
        "id": 501980402,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1740555795
    },
    {
        "content": "<p>Ah thanks, I was actually browsing the <code>.elan/toolchains/leanprover--lean4---v4.16.0/src/lean/Init/Notation.lean</code> file and was clicking on <code>infix</code> there and that wasn't working. After writing <code>infix</code> in a scratch file with <code>import Lean</code> that worked</p>",
        "id": 501980737,
        "sender_full_name": "Sabbir Rahman",
        "timestamp": 1740555935
    }
]