[
    {
        "content": "<p>In the Lean 4 VS Code extension, there are several config settings where I am not quite sure what they are used for in practice or whether they are still being used at all.</p>\n<p>If you or someone you know uses any of the following settings, please let me know:</p>\n<ol>\n<li><code>lean4.toolchainPath</code>: Used to override the Lean toolchain path. Could probably be replaced by using <code>elan override</code> instead?</li>\n<li><code>lean4.enableLake</code>: Can be used to disable Lake. Does anyone do this?</li>\n<li><code>lean4.lakePath</code>: Can be used to use a custom version of Lake. Could be replaced by calling VS Code with an adjusted PATH. <span class=\"user-mention\" data-user-id=\"315577\">@Mac Malone</span>  added this originally for debugging Lake; do you still use it?</li>\n<li><code>lean4.serverEnv</code> and <code>lean4.serverEnvPaths</code>: Used to add environment variables and paths to the PATH env variable. Could probably be replaced by calling VS Code with the corresponding environment variables, since the server inherits VS Code's process environment?</li>\n</ol>",
        "id": 392459163,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1695368709
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"221921\">@Marc Huisinga</span> To (3) and (4), I added <code>lean4.lakePath</code>, <code>lake4.serverEnv</code>, <code>lean4.serverEnvPaths</code> a while back largely to help debug various Lake interactivity issues and to support <code>precompileModules</code>. While they could technically be solved by augmenting the environment, that is very inconvenient to do on Windows and also requires restarting the whole of VSCode each time.  Luckily, there have not been very many interactivity issues with Lake recently, so I have not had to use them much recently, but I would like to keep at least <code>lakePath</code> around for future debugging.  I am not sure if anyone else uses them.</p>",
        "id": 392606981,
        "sender_full_name": "Mac Malone",
        "timestamp": 1695420179
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"315577\">Mac Malone</span> <a href=\"#narrow/stream/270676-lean4/topic/VS.20Code.20Extension.20Settings/near/392606981\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"221921\">Marc Huisinga</span> To (3) and (4), I added <code>lean4.lakePath</code>, <code>lake4.serverEnv</code>, <code>lean4.serverEnvPaths</code> a while back largely to help debug various Lake interactivity issues and to support <code>precompileModules</code>. While they could technically be solved by augmented the environment, that is very inconvenient to do on Windows and also requires restarting the whole of VSCode each time.  Luckily, there have not been very many interactivity issues with Lake recently, so I have not had to use them much recently, but I would like to keep at least <code>lakePath</code> around for future debugging.  I am not sure if anyone else uses them.</p>\n</blockquote>\n<p>Okay, I'll leave these settings for now, but will not support them for new features. Eventually, I'll replace all of them with a general setting that can add general environment variables to <code>process.env</code> and prepend entries to <code>PATH</code> in <code>process.env</code> without having to restart VS Code, which should hopefully cover all of these debugging needs.</p>",
        "id": 392963291,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1695635667
    }
]