[
    {
        "content": "<p>Sometimes I don't want continuous typechecking, and my ideal interface would be to have some keybinding to trigger typechecking for the current file (maybe up to the current cursor position, or up to the next command after the current cursor position). Especially on a laptop, this can save battery life and help the editor UI be more responsive. Continuous typechecking can also seem to cause the server to use a whole lot of memory, especially when you're editing a large function with many match cases.</p>\n<p>I've looked through the settings and Lean 4 commands, but I haven't seen anything that would at least let you pause typechecking. Is there anything like this? I'd rather not have to stop and start the server if possible.</p>",
        "id": 350640316,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1681777626
    },
    {
        "content": "<p>I often use Gitpod as well for editing Lean 4, and I've noticed that continuous typechecking can make it almost impossible to do expansions due to how much stuff is happening on-screen after every keypress. I usually have to add an <code>#exit</code> nearby just to keep things calm enough to the expansion system actually detect that I've typed <code>\\to</code> or whatever.</p>",
        "id": 350641096,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1681777929
    },
    {
        "content": "<p>I would love this too!</p>",
        "id": 350661014,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1681787541
    },
    {
        "content": "<p>Even more importantly, I really want VS Code to <em>not</em> start creating oleans for other files unless I explicitly hit <code>cmd-R</code>.</p>",
        "id": 350661046,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1681787574
    },
    {
        "content": "<p>Something that would be nice is to have Lean syntax that would not type check certain sections. </p>\n<p><code>section no_check</code> or something along those lines.  That way, for larger files where you don't want to comment out sections of code just to have things run faster you could just use that.  I don't think this is currently available correct?</p>",
        "id": 350661237,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1681787705
    },
    {
        "content": "<p>This would be more for user development at least.</p>",
        "id": 350661432,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1681787836
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"443984\">Newell Jensen</span> <a href=\"#narrow/stream/270676-lean4/topic/VS.20Code.20extension.2C.20pause.20typechecking/near/350661237\">said</a>:</p>\n<blockquote>\n<p>Something that would be nice is to have Lean syntax that would not type check certain sections. </p>\n<p><code>section no_check</code> or something along those lines.  That way, for larger files where you don't want to comment out sections of code just to have things run faster you could just use that.  I don't think this is currently available correct?</p>\n</blockquote>\n<p>This might even be implementable as a user I guess?</p>",
        "id": 350673546,
        "sender_full_name": "Reid Barton",
        "timestamp": 1681795636
    }
]