[
    {
        "content": "<p>As a new Lean user, I have some minor QoL suggestions around the Lean Infoview.  I looked at the vscode-lean4 repo and it said to have a discussion here first, so here I am.  I didn't find any related feature requests either.  I am going to split each into a separate message to people can react to them/thumb up independently.</p>",
        "id": 473007987,
        "sender_full_name": "Tom",
        "timestamp": 1727408287
    },
    {
        "content": "<ol>\n<li>I work with the \"All Messages\" window open.  As I scroll through code and the \"expected type/goal view\" updates, the rest of the pane jumps all over the place, which makes me lose track of where I was in the \"messages\" pane.  </li>\n</ol>\n<p>Would it be possible to put the \"expected type/goals\" into a statically sized, resizable pane so that even though it updates, the rest of the view doesn't skip around madly?</p>",
        "id": 473008227,
        "sender_full_name": "Tom",
        "timestamp": 1727408458
    },
    {
        "content": "<ol start=\"2\">\n<li>Would it be possible to make the \"All Messages\" pane stay in \"lock step\" with the location of the editing cursor?</li>\n</ol>",
        "id": 473008437,
        "sender_full_name": "Tom",
        "timestamp": 1727408594
    },
    {
        "content": "<ol start=\"3\">\n<li>Related to 2., would it be possible to add a small visual highlight/ribbon to indicate the current message under the cursor?</li>\n</ol>",
        "id": 473008624,
        "sender_full_name": "Tom",
        "timestamp": 1727408704
    },
    {
        "content": "<ol start=\"4\">\n<li>It would be really great - instead of just the expected type - to have another pane which can display more info about the symbol under the cursor, rather than just its type, e.g. its <code>Repr</code> if valid, (at least) the function signature (e.g. as displayed by #print) etc.</li>\n</ol>\n<p>As I'm learning, I am mostly looking at and trying to understand other people's code but I have to keep adding/removing <code>#eval</code> statements in the current file to get a sense of the values involved.  (I know about hovers)</p>",
        "id": 473009238,
        "sender_full_name": "Tom",
        "timestamp": 1727409161
    },
    {
        "content": "<p>Thanks for reading!</p>",
        "id": 473009382,
        "sender_full_name": "Tom",
        "timestamp": 1727409301
    },
    {
        "content": "<p>I think the problem with 1. is that most people do <em>not</em> work with All Messages open, and having the goal view has static size would be problematic, but very often it occupies the entire infoview, and scrolling is painful.</p>",
        "id": 473016274,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1727414345
    },
    {
        "content": "<p>Could you explain in more detail what you mean in 2.?</p>",
        "id": 473016309,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1727414378
    },
    {
        "content": "<p>For 4. could you say in more detail what \"more info\" you want, that isn't already in a hover?</p>",
        "id": 473016384,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1727414406
    },
    {
        "content": "<p>I see what you mean about 1.  It could be optional, or the pane could be set to be dynamic or static, in which case it would retain the current behavior.</p>",
        "id": 473017573,
        "sender_full_name": "Tom",
        "timestamp": 1727415362
    },
    {
        "content": "<p>Regarding 2:  Maybe an demonstration: Open a file and put in a bunch of eval statements that are spaced by a few lines, just e.g. </p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"bp\">#</span><span class=\"n\">eval</span><span class=\"w\"> </span><span class=\"mi\">1</span>\n\n\n<span class=\"bp\">#</span><span class=\"n\">eval</span><span class=\"w\"> </span><span class=\"mi\">2</span>\n\n\n<span class=\"bp\">#</span><span class=\"n\">eval</span><span class=\"w\"> </span><span class=\"mi\">3</span>\n<span class=\"bp\">...</span>\n</code></pre></div>\n<p>etc so that the <code>All Messages</code> view becomes bigger than your editor window.  Keep it open and scroll throw the file visiting the <code>#eval</code> statements.  First, the movement is seizure-inducing <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span> .  But second, note the pane will only display the <code>#evals</code> near the top of the file, rather than providing the context around the place where I'm editing - i.e. it doesn't move in lock-step with the editing window.  </p>\n<p>Maybe a similar example would be when you do diffs in an editor:  You want a scroll action to move both the files your diffing so you can see the context simultaneously.</p>\n<p>I hope that that explains it better.</p>",
        "id": 473018325,
        "sender_full_name": "Tom",
        "timestamp": 1727415881
    },
    {
        "content": "<p>Have you tried using the VSCode extension Error lens?</p>",
        "id": 473018873,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727416249
    },
    {
        "content": "<p>A hover displays the types (and perhaps doc strings) of the functions but doesn't show the <code>Repr</code> of values.  Having said that, I think it would still be more ergonomic for the exploration of a new code base to be able to just navigate around the code and simply have a \"perma-hover\" window that shows me the symbols as I navigate over them.</p>\n<p>Second is more related to learning, and perhaps this is just me:</p>\n<p>As I learn a programming language, I write a lot of Micky Mouse programs to explore how things work.  In something like Python, which has a debugger, I can step through some code and inspect values.</p>\n<p>With lean, it's different.  Without a debugger, I write a lot of top-level definitions (e.g. as I'm working through \"Functional Programming in Lean\" and other materials) and then write a ton of #eval/#check/#print etc statements to get an idea what's going on.</p>\n<p>So I guess I'm asking for a feature to make this a little easier for myself (and hopefully others) - so e.g. rather than just seeing the type of an expression in the view, there could be another (optional?) section that tries to show the Repr etc of the value, if available.</p>\n<p>Does that make sense?</p>",
        "id": 473019642,
        "sender_full_name": "Tom",
        "timestamp": 1727416789
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"321459\">Damiano Testa</span> <a href=\"#narrow/stream/270676-lean4/topic/VSCode.20small.20feature.20requests.2Fobservations.3F/near/473018873\">said</a>:</p>\n<blockquote>\n<p>Have you tried using the VSCode extension Error lens?</p>\n</blockquote>\n<p>Sorry, I've not.  Which of these things would it help with?</p>",
        "id": 473020021,
        "sender_full_name": "Tom",
        "timestamp": 1727416928
    },
    {
        "content": "<p>I think 2: it shows the output of stuff like <code>#eval</code> in the window where you type the code, not in the infoview.</p>",
        "id": 473021756,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727417720
    },
    {
        "content": "<p>Yeah, Error Lens is a big QoL improvement (-;</p>",
        "id": 473025561,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1727419509
    },
    {
        "content": "<p>Can we set it as an automatically installed dependency of the Lean extension or something? Or suggest it prominently during setup?</p>",
        "id": 473027254,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1727420101
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"221921\">@Marc Huisinga</span> I guess?</p>",
        "id": 473027497,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1727420188
    },
    {
        "content": "<p>Extensions can be bundled together as a recommendation.</p>",
        "id": 473039722,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727424049
    },
    {
        "content": "<p>When installing such a bundle, all recommended extensions are installed. The trouble with bundling third party extensions is more social: how is a decision to include or exclude an extension made and which extensions are deemed \"useful\" or not. Everybody might want their favourite QoL extension as part of the bundle.</p>",
        "id": 473040101,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727424168
    },
    {
        "content": "<p>Sorry the term is not bundling. It is \"extension pack\" <a href=\"https://code.visualstudio.com/blogs/2017/03/07/extension-pack-roundup\">https://code.visualstudio.com/blogs/2017/03/07/extension-pack-roundup</a></p>",
        "id": 473040629,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727424325
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> </p>\n<p>Thanks for the suggestions, that plugin is helpful.</p>",
        "id": 473166838,
        "sender_full_name": "Tom",
        "timestamp": 1727457621
    }
]