[
    {
        "content": "<p>Recently VSCode (specifically the Cursor version) becomes unusable quite frequently because it generates many 10s of Lean processes until my system grinds to a halt. Anyone else seen this behavior with the Lean VSCode plugin? It's hard to fix when it occurs: sometimes <code>killall lean</code> solves the problem for a while, other times restarting Cursor on a Lean file means the problem reoccurs right away.</p>\n<p>I'm on VSCode Lean plugin version 0.0.209, leanprover/lean4:v4.23.0-rc2. (I'm also using the Neovim plugin, but I would hope this doesn't interact in any way.)</p>",
        "id": 537934432,
        "sender_full_name": "Geoffrey Irving",
        "timestamp": 1757100461
    },
    {
        "content": "<p>Oh, so it's not just me then? (Also running Cursor.) Though, I'm not sure the problem is with Lean itself, as running the same files in e.g. Gitpod doesn't seem to have the same issues (though of course I have much less precise an idea of how much compute I'm actually using in that case)</p>\n<p>I just tried nuking my <code>.lake</code> folder and rebuilding from scratch; it ... might have helped some things some, but it's still pretty bad</p>",
        "id": 537962465,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1757117877
    },
    {
        "content": "<p>Are you using the <a href=\"https://github.com/microsoft/vscode-pull-request-github/issues/7403\">GitHub Pull Requests extension</a> by any chance?</p>",
        "id": 537968164,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1757125160
    },
    {
        "content": "<p>(Previous discussion: <a class=\"message-link\" href=\"/#narrow/channel/270676-lean4/topic/Many.20Lean.20processes.20on.20Windows/near/530792453\">#lean4 &gt; Many Lean processes on Windows @ 💬</a>)</p>",
        "id": 537968201,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1757125227
    },
    {
        "content": "<p>I am not, but I <em>am</em> using a Git MCP for Cursor. I've tried disabling it; I'll see if the problem goes away</p>",
        "id": 537973200,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1757132469
    },
    {
        "content": "<p>It would also be good to know if the issue only occurs with Cursor, or with regular VS Code as well</p>",
        "id": 537974253,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1757133561
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"221921\">Marc Huisinga</span> <a href=\"#narrow/channel/270676-lean4/topic/VSCode.20usage.20generates.20huge.20numbers.20of.20Lean.20processes/near/537974253\">said</a>:</p>\n<blockquote>\n<p>It would also be good to know if the issue only occurs with Cursor, or with regular VS Code as well</p>\n</blockquote>\n<p>Disabling the Git MCP did not help, but indeed the problem seems to be restricted to Cursor.</p>",
        "id": 538034451,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1757195984
    },
    {
        "content": "<p>I started seeing this today as well.</p>",
        "id": 538121190,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1757298098
    },
    {
        "content": "<p>I briefly tried reproducing this with Cursor, but didn't see the issue occur. Please let me know if you find a reproduction.</p>",
        "id": 538382562,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1757407550
    },
    {
        "content": "<p>This still hits me reliably after I start doing things with <a href=\"https://github.com/girving/ray\">https://github.com/girving/ray</a>. The most recent thing I did was open up <code>Tanh.lean</code> and try to convert from using <code>AnalyticAt</code> to <code>ContDiffAt</code>. After a minute or two my machine grinds to a halt. I don't have a precise reproducing sequence, and it does take a minute or two.</p>",
        "id": 538519506,
        "sender_full_name": "Geoffrey Irving",
        "timestamp": 1757447127
    },
    {
        "content": "<p>I can't reproduce on that file with a fresh Cursor install, either. Does this issue reproduce for you on a fresh install (without being logged in), too?</p>\n<p>If I had to give a totally blind guess, Cursor might be opening lots of random Lean documents that aren't opened as an editor to query information from the language server and provide additional context to AI. Since this issue doesn't occur in VS Code, I'd recommend creating a bug report on the Cursor issue tracker.</p>",
        "id": 538591145,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1757491991
    },
    {
        "content": "<p>FWIW, I have been dealing with a similar problem on and off since last week. Once it happens the user experience is painful.</p>\n<p>I wish I had a reproducible case.</p>\n<p><code>Lean (version 4.22.0, arm64-apple-darwin23.6.0, commit ba2cbbf09d4978f416e0ebd1fceeebc2c4138c05, Release)</code></p>",
        "id": 538957856,
        "sender_full_name": "Yuri",
        "timestamp": 1757634749
    }
]