[
    {
        "content": "<p>Hi everyone! I'm collecting examples of how to use <code>have</code> in Lean 4 to compile into a tutorial for our Lean 4 tactics repository.  While I often see tactics like <code>haveI</code> and <code>letI</code> in others' proofs, I still don't understand the fundamental differences between them and <code>have</code> and <code>let</code>. Are there any examples that highlight the advantages of using <code>haveI</code>?</p>",
        "id": 490380935,
        "sender_full_name": "张守信(Shouxin Zhang)",
        "timestamp": 1734866310
    },
    {
        "content": "<p>The difference between <code>have</code> and <code>let</code>: this is what I tell beginners. Everything in lean is a universe, a type or a term. There are two universes, <code>Type</code> and <code>Prop</code> (this is a lie, but mathematician beginners don't need to know about higher type universes). The types in <code>Type</code> correspond to sets, and the terms of those types correspond to the elements of the sets. The types in Prop are the theorem statements, and the terms of those types are the proofs of the statements. You use <code>let</code> if you're working in the <code>Type</code> universe and <code>have</code> if you're working in the <code>Prop</code> universe</p>",
        "id": 490383867,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1734868933
    },
    {
        "content": "<p>I would not tell beginners about the difference between <code>have</code> and <code>haveI</code>, or between <code>let</code> and <code>letI</code>. I'm not sure I know a single example that a beginner would see where these things aren't completely interchangeable</p>",
        "id": 490383903,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1734868992
    },
    {
        "content": "<p>(I suspect many uses of haveI and letI are mistakes, unless they appear in a type signature. In Lean 3 they were completely different tactics and were for resetting the instance cache. Nowadays they zeta reduce themselves immediately.)</p>",
        "id": 490404396,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1734887762
    },
    {
        "content": "<p>Yes, I think a overwhelming majority of uses are confusing coming from their Lean 3 homonyms. It’s sad because many people doing this mistake have never used Lean 3 but they are misled by examples written by people who used Lean 3.</p>",
        "id": 490404875,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1734888161
    }
]