[
    {
        "content": "<p>~5 months ago I made an issue (this issue is deleted bc I was blocked by github) at lean4  github </p>\n<blockquote>\n<p><strong>please make a javascript backend for lean4</strong></p>\n</blockquote>\n<p>and dont-remember-who (probably it was Sebastian Ullrich  who responded)</p>\n<blockquote>\n<p><strong>no, we have many other more interesting plans for lean instead</strong></p>\n</blockquote>\n<p>so, I wanted to ask <strong>\"what are these plans?\"</strong></p>",
        "id": 530248763,
        "sender_full_name": "Serhii Khoma (srghma)",
        "timestamp": 1753235055
    },
    {
        "content": "<p>Have you read the Lean FRO roadmap? <a href=\"https://lean-lang.org/fro/roadmap/1900-1-1-the-lean-fro-year-2-roadmap/\">https://lean-lang.org/fro/roadmap/1900-1-1-the-lean-fro-year-2-roadmap/</a></p>",
        "id": 530248895,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1753235174
    },
    {
        "content": "<p>what do you mean by a JavaScript backend? that is Lean can produce JavaScript code?</p>",
        "id": 530264955,
        "sender_full_name": "(deleted)",
        "timestamp": 1753248668
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"511228\">Huỳnh Trần Khanh</span> , Yes, bc purescript is not so powerful</p>\n<p>P.S. or issue was not about js backend, but about \"please rewrite kernel in lean itself instead of c++\"</p>\n<p>also, I wish lean supported linear types to allow more optimizations</p>",
        "id": 530286786,
        "sender_full_name": "Serhii Khoma (srghma)",
        "timestamp": 1753259006
    },
    {
        "content": "<p>my general stance is the Lean developers already have a lot on their plate. there are things that can be done through contributing to the surrounding ecosystem instead of Lean proper</p>",
        "id": 530287963,
        "sender_full_name": "(deleted)",
        "timestamp": 1753259255
    },
    {
        "content": "<p>as for linear types, Lean already has reference counting, isn't that enough</p>",
        "id": 530288101,
        "sender_full_name": "(deleted)",
        "timestamp": 1753259304
    },
    {
        "content": "<p>A Javascript backend would be nice. It would get people to really think hard about optimisation. The lessons learned would then be applied back to the desktop version.</p>\n<p>Plus having it run in the browser allows you to use good formatting libraries such as MathJax to show Latex equations.</p>\n<p>(Yes, there is the web-version but being cloud based, what if you are in a jungle with no internet?)</p>\n<p>While it would be nice to have the kernel it in pure Javascript so the code be inspectable I think this may be unfeasible.  A compromise might be to run the kernel as WASM code. (The hard bit might be if it uses external libraries such as GMP for the large integers these also need to be compiled to WASM). And then interface that with pure Javascript for the interface.</p>\n<p>Here is the kernel code: <a href=\"https://github.com/leanprover/lean4/tree/master/src/kernel\">https://github.com/leanprover/lean4/tree/master/src/kernel</a> in C if anyone wants to have a go. (Or maybe someone's already done this before?)</p>\n<p>Downsides: You would have to store a copy of mathlib on your computer (but perhaps just the definitions).</p>\n<p><span class=\"user-mention\" data-user-id=\"123965\">@Bryan Gin-ge Chen</span> Yes, I've read the roadmap. But (1) it is higher vague. e.g. \"Scalability Enhancements\" is an admirable goal but could mean anything. and (2) Things not on the roadmap could be projects for  people to do for their own amusement. (Whether someone does something on the roadmap or not, they don't get paid either way!)</p>",
        "id": 530308577,
        "sender_full_name": "Mr Proof",
        "timestamp": 1753265370
    },
    {
        "content": "<blockquote>\n<p>A Javascript backend would be nice. It would get people to really think hard about optimisation. The lessons learned would then be applied back to the desktop version.</p>\n</blockquote>\n<p>people already really think hard about optimisation, there is no need for a javascript backend for that.</p>",
        "id": 530309273,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1753265645
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"395550\">@Henrik Böving</span> Thinking about things and doing things are two different things. One may think very hard about prepping for a flood but when the waters are seeping through the gaps in your brickwork you get a better idea of where the problems are.</p>",
        "id": 530310057,
        "sender_full_name": "Mr Proof",
        "timestamp": 1753265960
    },
    {
        "content": "<p>People are already doing performance optimizations as well, there have been dozens of commits to the code generator, there is the new module system for faster rebuilds together with incrementality and in-file parallelism, Leo has halfed the runtime of grind on some real world examples in the past two weeks, we have the best performing fully verified bitblaster that exists.</p>",
        "id": 530310396,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1753266081
    },
    {
        "content": "<p>OK. Did anyone say there hasn't been improvements? I don't understand why every comment about interesting projects to do or suggestions for improvements is taken as a personal attack on the dedication of people working on Lean?</p>\n<p>We are VERY VERY grateful and HIGHLY appreciative of all the work you've been doing.</p>\n<p>PLEASE PLEASE don't take comments or suggestions about things to be PERSONAL ATTACKS.</p>",
        "id": 530310874,
        "sender_full_name": "Mr Proof",
        "timestamp": 1753266265
    },
    {
        "content": "<p>I make computer games for a living. And when people give comments or suggestions. I think to myself. \"Here is someone who didn't like the game\" I may agree or not agree but it is all HELPFUL information.</p>",
        "id": 530311089,
        "sender_full_name": "Mr Proof",
        "timestamp": 1753266357
    },
    {
        "content": "<p>It is not an attack on my ego.</p>",
        "id": 530311132,
        "sender_full_name": "Mr Proof",
        "timestamp": 1753266372
    },
    {
        "content": "<p>You said \"Thinking about things and doing things are two different things\" and I merely pointed out that indeed people are not just thinking but doing things.</p>",
        "id": 530311326,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1753266438
    },
    {
        "content": "<p>Also, I think that</p>\n<blockquote>\n<p>It would get people to really think hard about optimisation.</p>\n</blockquote>\n<p>suggest that people are not yet doing that. To me \"would get people to X\" means that people are not yet doing X.<br>\nMaybe that's not what you intended... but I think it explains some of the push-back you are getting.</p>",
        "id": 530311542,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1753266523
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/channel/270676-lean4/topic/what.20is.20future.20of.20lean.3F/near/530311542\">said</a>:</p>\n<blockquote>\n<p>Also, I think that</p>\n<blockquote>\n<p>It would get people to really think hard about optimisation.</p>\n</blockquote>\n<p>suggest that people are not yet doing that. To me \"would get people to X\" means that people are not yet doing X.<br>\nMaybe that's not what you intended... but I think it explains some of the push-back you are getting.</p>\n</blockquote>\n<p>Yeah, well it's still highly unoptimized by usual software standards. So if people have a problem with me saying that, that's more of a \"them\" problem than my problem.</p>",
        "id": 530312016,
        "sender_full_name": "Mr Proof",
        "timestamp": 1753266671
    },
    {
        "content": "<p>We all have the freedom to be unsatisfied with software and hardware speed. It's your approach that's off.</p>\n<p>Performance in a complex system such as Lean 4 has many dimensions and layers. So instead of simply saying that it's slow, I'd suggest a more structured way to communicate that at least displays <em>some</em> effort.</p>\n<p>For example: \"I'm trying to do X and it seems to be particularly slow. I tried to do X on this other system Y and it goes smoother. I looked at the source code and I found this call to Z, which I think is the bottleneck. On a local copy of the Lean 4 source code, I tweaked it a little bit and got a speed boost of P%. Is this approach dangerous in any sense?\"</p>\n<p>That would be the best approach I can think of. But if you just go with the first sentence and be very specific and explicit on X, that's already better than the opaque statements you're making.</p>",
        "id": 530329701,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1753272862
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"725689\">Mr Proof</span> <a href=\"#narrow/channel/270676-lean4/topic/what.20is.20future.20of.20lean.3F/near/530312016\">said</a>:</p>\n<blockquote>\n<p>Yeah, well it's still highly unoptimized by usual software standards.</p>\n</blockquote>\n<p>Would you like to name a faster proof assistant?</p>",
        "id": 530331520,
        "sender_full_name": "suhr",
        "timestamp": 1753273449
    },
    {
        "content": "<p>I believe Lean is faster than both Rocq and Isabelle/HOL.</p>",
        "id": 530331759,
        "sender_full_name": "suhr",
        "timestamp": 1753273539
    }
]