[
    {
        "content": "<p>Hi using a lsp client (namely lsp4ij) connecting lean lsp server I occasionally saw two <code>initialize</code> requests sending to the server like:<br>\n<a href=\"/user_uploads/3121/rv0Y78beOBieeNYFczlBd7IC/image.png\">image.png</a><br>\nThe red part indicates that there is no response for the <code>$/lean/rpc/connect</code> request and the client recreate a <code>initialize</code> request.  And the concrete error seems to be <a href=\"https://stackoverflow.com/questions/5026315/java-class-error-java-io-ioexception-the-pipe-is-being-closed\">java.io.IOException: The pipe is being closed</a> (the Chinese character), which should mean that the input/output pipeline connecting to the server is being closed. Would the reason be the lsp server quiting anomaly? I am not sure it's raised from the lsp server end or lsp client end hence in fact I created also a discussion in  <a href=\"https://github.com/redhat-developer/lsp4ij/discussions/478\">here</a> too</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/rv0Y78beOBieeNYFczlBd7IC/image.png\" title=\"image.png\"><img data-original-dimensions=\"1280x805\" src=\"/user_uploads/thumbnail/3121/rv0Y78beOBieeNYFczlBd7IC/image.png/840x560.webp\"></a></div>",
        "id": 465240662,
        "sender_full_name": "Shanghe Chen",
        "timestamp": 1724693017
    },
    {
        "content": "<p>Somewhat as usual for your questions, I don't have something specific to help you, but I can say I've noticed some funny initialization behavior in <code>lean.nvim</code> as well, but haven't had time to look into it yet -- specifically I've noticed multiple initialization requests getting sent on startup. Again I have no further info, but I do have a local note reminding me \"if you insert <code>vim.print</code> early on you see Lean's LS respond empty a few times\" -- so yeah it's possible there's something cross-client happening.</p>",
        "id": 465241637,
        "sender_full_name": "Julian Berman",
        "timestamp": 1724693438
    },
    {
        "content": "<p>Thanks Julian! Yeah I don’t know if it’s because sending <code>$/lean/rpc/connect</code> too early. I saw that the pid of the server changed though. But mostly after some retries it will setup correctly. Hence maybe not a problem but trying to see if there is some log from the server side.</p>",
        "id": 465242756,
        "sender_full_name": "Shanghe Chen",
        "timestamp": 1724693830
    }
]