[
    {
        "content": "<p>What's our current state of the art on defining planar graphs?</p>\n<p>I see a lot of discussion in <a href=\"#narrow/stream/252551-graph-theory/topic/K4.20is.20planar.20help\">this thread</a> but I don't know if things have changed since then.</p>\n<p>It looks like <a href=\"https://www.ams.org/notices/200811/tx081101382p.pdf\">Gonthier's triple of permutations representation</a> is most promising?</p>\n<p>I'd like to prove the <a href=\"https://www.whitman.edu/mathematics/cgt_online/book/section05.10.html\">five color theorem</a> at some point. That appears to depend on planarity in two ways:</p>\n<ol>\n<li>There exists a vertex with at most 5 neighbors. (This follows from the Euler characteristic)</li>\n<li>If you delete this vertex, then some of the paths between neighbors must intersect. (I don't know how to justify this. Is this related to the Jordan curve theorem?)</li>\n</ol>",
        "id": 393010474,
        "sender_full_name": "Chris Wong",
        "timestamp": 1695647669
    },
    {
        "content": "<p>There have been some attempts but nothing made it to mathlib. Definitely talk to <span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span>.</p>",
        "id": 393012664,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1695648237
    },
    {
        "content": "<p>I should think that you can use the Jordan curve theorem to prove the intersection property. Consider for example four reals a&lt;b&lt;c&lt;d. Then I claim that any continuous paths in the upper half plane from a to c and from b to d must intersect, and this is because the path from a to c can be joined up by a path in the lower half plane, and now b is in the interior and d in the exterior of that closed path</p>",
        "id": 393064153,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1695660767
    },
    {
        "content": "<p>I've thought about this a fair amount, I think what's most important for a mathlib definition of planar graphs is that it allows conversion between any of the definitions. As Kevin says, one of the biggest blockers to this is the Jordan curve theorem...</p>",
        "id": 393111888,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1695676265
    },
    {
        "content": "<p>I once convinced myself that this <a href=\"https://www.tandfonline.com/doi/abs/10.1080/00029890.1988.11972008\">https://www.tandfonline.com/doi/abs/10.1080/00029890.1988.11972008</a> was formalizable within a reasonable timeframe. But I don't remember if I am still convinced ...</p>",
        "id": 393219910,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1695730110
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"294142\">@Chris Wong</span> I think combinatorial maps are the right structure to work with a combinatorial version of planarity via Euler characteristic.</p>\n<p>The definition Gonthier uses (which is from Cori and Tutte from the mid-70s) is appealing due to its symmetry. There's another version where you use only two darts per edge rather than four (that's the one I used <a href=\"https://github.com/kmill/lean-graphs/blob/master/src/maps.lean#L27\">here</a> in the linked thread), but perhaps four darts makes gluing arguments easier? I don't know. I do like that the three-permutation definition sort of immediately gives you a handle structure (0-handles are vertices, 1-handles are edges, and 2-handles are the faces).</p>\n<p>Something I noticed is that if you define the dual of a combinatorial map, you don't get that the double dual is exactly the original graph --  you only get something isomorphic by swapping the roles of all the pairs of darts -- but the quadruple dual is exactly the original graph. It seems the triple permutation definition is affected by the same thing. This isn't a problem, but it's curious.</p>\n<p>Combinatorial maps might encode the local structure of a planar graph, and you can reconstruct the planar embedding if the graph is connected, but for non-connected graphs you use unique(-up-to-homemorphism) reconstruction. However, the existence of an euler-characteristic-2 combinatorial map representing a graph is equivalent to the existence of a planar embedding of a graph, so this might still fulfill Bhavik's criterion that all notions of planarity are equivalent.</p>",
        "id": 393224114,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1695731798
    },
    {
        "content": "<p>I think there's a purely algebraic version of the 5-color theorem where you use the contraction-deletion relation and you verify that a certain reduction rule holds, without any need for the Jordan curve theorem. It's probably more convenient to represent planar graphs for this argument using monoidal categories (the relation you verify can be stated as showing that a certain linear combination of morphisms is in the trace radical of this category -- modulo deletion-contraction, the morphism sets are finite dimensional vector spaces, and so the check amounts to a bit of linear algebra) but at some point you want to be able to go back and forth between morphisms in monodial category and combinatorial maps.</p>\n<p>One point in using monoidal categories is that it's a natural way to formulate fragments of combinatorial maps, cutting them apart, and gluing them together.</p>",
        "id": 393229514,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1695733632
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> I don't really remember but isn't the equivalence between planarity and existence of a combinatorial map of genus 2 essentially equivalent to the (discrete) Jordan curve theorem?</p>",
        "id": 393247127,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1695738804
    },
    {
        "content": "<p>(I assume you mean genus-0 there. I made a mistake too in what I said, which is that it should be euler characteric <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mn>2</mn><mi>c</mi></mrow><annotation encoding=\"application/x-tex\">2c</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6444em;\"></span><span class=\"mord\">2</span><span class=\"mord mathnormal\">c</span></span></span></span>, where <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>c</mi></mrow><annotation encoding=\"application/x-tex\">c</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">c</span></span></span></span> is the number of connected components.) Yeah, I think so, you need that cycles in the image of the planar embedding bound disks, in particular the cycles that correspond to faces.</p>",
        "id": 393248264,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1695739151
    },
    {
        "content": "<p>(Yes sorry <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>χ</mi><mo>=</mo><mn>2</mn></mrow><annotation encoding=\"application/x-tex\">\\chi=2</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\">χ</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6444em;\"></span><span class=\"mord\">2</span></span></span></span>.)</p>",
        "id": 393248839,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1695739302
    },
    {
        "content": "<p>There's category theory too!? Just when I thought I understood this... <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 393255720,
        "sender_full_name": "Chris Wong",
        "timestamp": 1695740751
    },
    {
        "content": "<p>Coq's MathComp-based <a href=\"https://github.com/coq-community/graph-theory\">graph-theory</a> library was recently reorganized to package results about planar graph results separately, since they depend on Gonthier's <a href=\"https://github.com/coq-community/fourcolor/\">fourcolor code</a>. If anyone here can read both Coq and Lean (there is also a <a href=\"https://hal.inria.fr/hal-03142192\">paper</a> about Coq side), I'd be interested in a comparison of what the relative statuses of graph-theory and Lean's mathlib are w.r.t. planar graphs.</p>",
        "id": 394234033,
        "sender_full_name": "Karl Palmskog",
        "timestamp": 1696178161
    },
    {
        "content": "<p>I think that Thomassen's proof of JCT has a chance of being a reasonable way to go: see <a href=\"https://www.maths.ed.ac.uk/~v1ranick/jordan/thomass.pdf\">https://www.maths.ed.ac.uk/~v1ranick/jordan/thomass.pdf</a></p>",
        "id": 405263757,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1701401398
    },
    {
        "content": "<p>He gives a JCT-free proof that every planar graph is planar with all arcs polygonal, then proves in this framework that K_{3,3} is nonplanar, and gets to JCT from there.</p>",
        "id": 405263920,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1701401479
    }
]