[
    {
        "content": "<p>Hello everyone, I wanted to work on Dirac's theorem on hamiltonian cycles but I saw in another post that The Bondy-Chvátal Theorem which is a general version of what I wanted to prove is already done.</p>\n<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/15720/files\">https://github.com/leanprover-community/mathlib4/pull/15720/files</a></p>\n<p>The code is there on Github but I can't find the theorem on <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Combinatorics/SimpleGraph/Hamiltonian.html\">https://leanprover-community.github.io/mathlib4_docs/Mathlib/Combinatorics/SimpleGraph/Hamiltonian.html</a></p>\n<p>Can anyone please clarify the situation?</p>",
        "id": 565962046,
        "sender_full_name": "Kartik",
        "timestamp": 1767255736
    },
    {
        "content": "<p>The PR you look to is still open, depends on other open PRs at least one of which is apparently not done in the correct generality according to comments on the PR, and has merge conflicts. I'm particular it's not in mathlib master and is not even ready for review. Looks to me like before embarking on another proof there should be a discussion on the mathlib-acceptable route.</p>",
        "id": 565970642,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1767265850
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>  I'm all for methodology discussions. I think that creating documents to describe processes and locations to newcomers (like myself) would be a good idea. I think a \"tour guide\" would be a good thing to create</p>",
        "id": 565985979,
        "sender_full_name": "Matthew Coke",
        "timestamp": 1767282461
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span></p>",
        "id": 565988681,
        "sender_full_name": "Kartik",
        "timestamp": 1767286244
    },
    {
        "content": "<p>Yeah this question also made me think about maybe creating some document. I think the key fact is that if it compiles and is a fully correct proof of a theorem then this certainly does not mean that the work is ready for mathlib. This particularly applies to AI-generated proofs which in essentially all cases are not ready for mathlib. The three main issues which are problematic are: (1) proof not in the correct generality for mathlib (eg should be proving a far stronger theorem, which in some cases might be much harder to do); (2) result not suitable for mathlib at all (eg because it's not a topic mathlib is interested in covering) and (3) unidiomatic proofs (this is often the case with AI proofs which are typically 10x as long as an expert-written proof).</p>",
        "id": 565990345,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1767288297
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> workflows come to mind. I worked with Salesforce for awhile but there are lots of other ways to create too</p>",
        "id": 565991603,
        "sender_full_name": "Matthew Coke",
        "timestamp": 1767290094
    }
]