[
    {
        "content": "<p>I thought it was worth making a chat regarding bumping PhysLean.</p>\n<p>For those new to Lean: Bumping PhysLean means updating either the Lean version or the Mathlib version that PhysLean depends on, or both. </p>\n<p>Firstly I want to open the following discussion: Currently I only bump PhysLean for every stable release of Lean (about once a month). Kevin said that over on FLT they bump weekly. The advantage of bumping more often is that it is easier: less has changed in Mathlib, so there is less to change downstream - and it is easier to pinpoint what has changed. The disadvantage is that it requires a more sustained time commitment, which I personally can't commit to alone. I would also be happy if we can make things somewhat predictable. What are our options are here?</p>\n<p>Secondly: I think using  this thread to notify when a bump of PhysLean has taken place will be useful.</p>",
        "id": 510683162,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744035074
    },
    {
        "content": "<p>Hi! This post has some great timing actually, since one of my goals for the coming months is to improve the process of bumping Lean projects. I was calling <span class=\"user-mention\" data-user-id=\"556875\">@Pietro Monticone</span> on the topic right at the moment you posted this :)</p>\n<p>One option you might want to consider is to install the <a href=\"https://github.com/leanprover-community/lean-update\"><code>lean-update</code></a> action, which runs the <code>lake update</code> command at a scheduled interval and will make a PR / issue / commit (configurable) whenever the build succeeds. So the easy updates become automatic and you get notified for the difficult ones.</p>\n<p>I see that right now you're making good use of the versioning tag system, so e.g. the Lakefile for the PhysLean tag <code>v4.18.0-rc1</code> requires Mathlib <code>v4.18.0-rc1</code>, which is great! If all Lean projects had version tags like this, there would be no issues with version mismatches between dependencies. So I would like to ask to keep making those tags too. (Another goal is to have <code>lean-update</code> or similar making this tag automatically for you. Perhaps that will need some <code>lake</code> improvements though, so that will have to wait a bit longer.)</p>",
        "id": 510703170,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1744039695
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span> ! Thanks for this. </p>\n<p><code>lean-update</code> looks great - I had heard about it before but forgot it was an option so thanks!</p>\n<p>If I set the frequency to 1 week for updates, will I still need to do special manual bumps to make sure one is on the tagged version of Mathlib and Lean? I'm guessing the answer is yes, but this should be easy if weekly bumps are also done.</p>",
        "id": 510706841,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744040605
    },
    {
        "content": "<p>Yes, if you use <code>lean-update</code> right now you would still need to do the tagged bumps manually, unfortunately. That should become automated in some way in the next few months :)</p>",
        "id": 510707331,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1744040733
    },
    {
        "content": "<p>And if you have any other ideas for how to make <code>lean-update</code> more useful, please let me know!</p>",
        "id": 510707407,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1744040754
    },
    {
        "content": "<p>Great thanks Anne! For reference, I made an GitHub issue c.f. adding lean-update to physlean <a href=\"https://github.com/HEPLean/PhysLean/issues/458\">here</a>.</p>",
        "id": 510708768,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744041133
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span> I did have one thought of something which would be very nice: It would be nice if when a bump fails it tells you which specific commit(s) to Mathlib or Batteries etc caused it to fail. </p>\n<p>I think this would be practically unfeasible to do though without a very large computation time.</p>",
        "id": 510743186,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744051642
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span> What is the recommended setup if I have package A that depends on mathlib and package B that depends on A. Ideally, the automation  tries to update A and if that succeeds it tries to update B.</p>\n<p>Do I just set up automatic update for A on Monday and B on Tuesday?</p>",
        "id": 510754167,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1744055320
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/channel/479953-PhysLean/topic/Bumps.20of.20PhysLean.2E/near/510743186\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"238446\">Anne Baanen</span> I did have one thought of something which would be very nice: It would be nice if when a bump fails it tells you which specific commit(s) to Mathlib or Batteries etc caused it to fail. </p>\n</blockquote>\n<p>Hmm, maybe to get more fine grained feedback, you could try running the automatic bumping in the background every day, but set up so it only reports an error on failure and doesn't do anything on success. This would then be in addition to the bumping script that actually commits/PRs the results every week, so you get an early warning if things start to go wrong, but you don't force users to update their dependencies every day.</p>",
        "id": 510883185,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1744104648
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"346070\">Tomas Skrivan</span> <a href=\"#narrow/channel/479953-PhysLean/topic/Bumps.20of.20PhysLean.2E/near/510754167\">said</a>:</p>\n<blockquote>\n<p>Do I just set up automatic update for A on Monday and B on Tuesday?</p>\n</blockquote>\n<p>Staggering the build times is exactly how lean/batteries/mathlib do it: Lean builds a nightly at 7AM UTC, Batteries at 9:45AM and Mathlib at 10AM.</p>",
        "id": 510883819,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1744104805
    },
    {
        "content": "<p>Right, we have this auto-bumping on FLT I think (if I'm talking about the same thing as Anne). Indeed one hour ago a machine opened <a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/402\">FLT#402</a> which is telling me amongst other things that <code>FLT.GaloisRepresentation.Cyclotomic</code> is not compiling any more, and I can guess exactly why: Andrew's PR to mathlib adding more stuff about the cyclotomic character just got merged, so now we have stuff in FLT which is also in mathlib which needs to be deleted. I will try to get to this bump today.</p>",
        "id": 510884148,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1744104887
    },
    {
        "content": "<p>Yes, we are using the <code>lean-update</code> action in FLT</p>",
        "id": 510910457,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1744112966
    },
    {
        "content": "<p>I’ve not thought about it deeply enough but here is rough idea.</p>\n<p>Given two packages A and B such that:</p>\n<ul>\n<li>A depends on Mathlib</li>\n<li>B depends on Mathlib</li>\n<li>A depends on B</li>\n</ul>\n<p>a potentially convenient update workflow (that would require a relatively small extension of <code>lean-update</code>) could be roughly the following:</p>\n<h3>On B (every 1-3 days):</h3>\n<ol>\n<li>If the Mathlib <code>lean-toolchain</code> version is higher than the B <code>lean-toolchain</code> version, then pin the new version in the B <code>lakefile.toml</code> and<code>lake update</code>. If it succeeds, open a PR  and create release after merge; if it fails, open an issue with the relevant information in the description (i.e. changes in the <code>lakefile.toml</code>) which would be useful to the maintainer for the manual bump. </li>\n<li>If the Mathlib <code>lean-toolchain</code> version is the same as the B <code>lean-toolchain</code> version, then pin the latest Mathlib commit in the B <code>lakefile.toml</code> and <code>lake update</code>. If it succeeds, open a PR; if it fails, open an issue with the relevant information in the description (i.e. changes in the <code>lakefile.toml</code>) which would be useful to the maintainer for the manual bump.</li>\n</ol>\n<h3>On A (every 1-3 days, shifted by an hour or so):</h3>\n<ol>\n<li>If the B <code>lean-toolchain</code> version is higher than the A <code>lean-toolchain</code> version, then pin the new version in the B <code>lakefile.toml</code> and <code>lake update</code>. If it succeeds, open a PR and create a release after merge; if it fails, open an issue with the relevant information in the description (i.e. changes in the <code>lakefile.toml</code>) which would be useful to the maintainer for the manual bump.</li>\n<li>If the B <code>lean-toolchain</code> version is the same as the A <code>lean-toolchain</code> version, then pin in the A <code>lakefile.toml</code> the latest commit in the B <code>lakefile.toml</code> and the Mathlib commit pinned in B, then <code>lake update</code>. If it succeeds, open a PR; if it fails, open an issue with the relevant information in the description (i.e. changes in the <code>lakefile.toml</code>) which would be useful to the maintainer for the manual bump.</li>\n</ol>\n<p>It might work decently and it seems generalizable enough…</p>",
        "id": 510923159,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1744116620
    },
    {
        "content": "<p>NB: The maintainer can always decide not to merge the PR immediately, but at least they would have full control.</p>",
        "id": 510926082,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1744117252
    },
    {
        "content": "<p>I agree with your vision! A great bonus functionality would be to specifically pin <code>B</code> to the <em>first</em> Mathlib version with a newer <code>lean-toolchain</code>. That way we can be sure all the releases of various projects agree on their dependency versions. I think that would be possible to find out using <code>git log</code>, right?</p>",
        "id": 510934832,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1744119075
    },
    {
        "content": "<p>Do I understand it correctly that in my <code>lakefile.lean</code> I should depend on mathlib's <code>master</code> branch? Otherwise <code>lean-update</code> action would not do anything useful.</p>",
        "id": 511019144,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1744143719
    },
    {
        "content": "<p>That's what I do in FLT except when we do a bump to a tag.</p>",
        "id": 511022402,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1744145066
    },
    {
        "content": "<p>(I've just bumped PhysLean to v4.18.0 and set up <code>lean-update</code>.)</p>",
        "id": 511138284,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744195917
    },
    {
        "content": "<p>I wasn't as successful as you yesterday :( I tried bumping SciLean to v4.18.0 but the compiler seems broken. For some reason, you can't compile binary that imports <code>Batteries.Tactic.Lint.Misc</code> and most of Mathlib does. It seems to be fixed on v4.19.0-rc2 but ffi is getting an overhaul and I can't get ffi functions to evaluate in the editor.</p>",
        "id": 511192342,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1744209579
    },
    {
        "content": "<p>I just bumped PhysLean to v4.19.0 with the PR <a href=\"https://github.com/HEPLean/PhysLean/pull/539\">#539</a>, will also create a tag.</p>\n<p>This means that if you merge with master or create a new branch from master you will have to update your local version of Mathlib.</p>",
        "id": 516151141,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1746438164
    },
    {
        "content": "<p>May I ask when will the next bump be? I'm working with lots of <code>inner</code> which will be impacted by <a href=\"https://github.com/leanprover-community/mathlib4/pull/24499\">#24499</a>, and Tomas's <a href=\"https://github.com/leanprover-community/mathlib4/pull/24056\">#24056</a> will probably reduce a lot of differentiability assumptions as well, so I'm wondering whether I should work on my current code first then refactor later or wait for the update</p>",
        "id": 519892074,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1747936777
    },
    {
        "content": "<p>I don't think there is much harm to bumping now. I made a bump-issue for v4.20.0-rc5 here: <a href=\"https://github.com/HEPLean/PhysLean/issues/565\">https://github.com/HEPLean/PhysLean/issues/565</a>.</p>\n<p>I think this will cover <a href=\"https://github.com/leanprover-community/mathlib4/pull/24499\">#24499</a>, but may not cover <a href=\"https://github.com/leanprover-community/mathlib4/pull/24056\">#24056</a>. But after bumping to v4.20.0-rc5, and tagging the release we can bump to a nightly version of mathlib for the time being, so that <a href=\"https://github.com/leanprover-community/mathlib4/pull/24056\">#24056</a> is covered. </p>\n<p>If you or anyone else wants to have a go at this - please be my guest :). The hardest part of bumping is fixing all the things that may have changed in mathlib - usually not so difficult but a bit annoying. <br>\nIf not, I can have a go at it tomorrow morning.</p>",
        "id": 519894447,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1747937668
    },
    {
        "content": "<p>More generally I'm currently only really bumping for stable lean releases. </p>\n<p>There is this <code>lean-update</code> thing discussed above, but I haven't got this fully up and running yet - basically because I'm worried people having to rebuild the whole of physlean everytime it updates which is not ideal.</p>",
        "id": 519895242,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1747937976
    },
    {
        "content": "<p>I'll try to follow the list and hopefully I don't break anything :)</p>",
        "id": 519898016,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1747938922
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/channel/479953-PhysLean/topic/Bumps.20of.20PhysLean.2E/near/519894447\">said</a>:</p>\n<blockquote>\n<p>I think this will cover <a href=\"https://github.com/leanprover-community/mathlib4/pull/24499\">#24499</a>, but may not cover <a href=\"https://github.com/leanprover-community/mathlib4/pull/24056\">#24056</a>. </p>\n</blockquote>\n<p>Is there a simple way to check which ones are in the stable release?</p>",
        "id": 519899770,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1747939491
    },
    {
        "content": "<p>I'm not aware of any :(. I just looked at the dates when they were merged and the date of the tagged  releases.</p>",
        "id": 519900103,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1747939594
    },
    {
        "content": "<p>FWIW we tend to bump FLT to mathlib master about once a week</p>",
        "id": 519924470,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747949631
    },
    {
        "content": "<p>PhysLean has now had the following two bumps committed: </p>\n<ul>\n<li><a href=\"https://github.com/HEPLean/PhysLean/pull/566\">#566</a> to the version of mathlib and lean tagged as <code>v4.15.0-rc5</code>. (Thanks <span class=\"user-mention\" data-user-id=\"890057\">@ZhiKai Pong</span> !). There is now a corresponding PhysLean tag for this.</li>\n<li><a href=\"https://github.com/HEPLean/PhysLean/pull/568\">#568</a> to a rev of mathlib from  today. </li>\n</ul>\n<p>Thus, if you merge with master or create a new branch you will have to update your local versions of mathlib and lean. I do this by running: <code>rm -rf .lake; lake update; lake build</code>, which is pretty fail-safe I think.</p>",
        "id": 519997752,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1747989278
    },
    {
        "content": "<p>I created a bump tracker issue for v4.20.0 <a href=\"https://github.com/HEPLean/PhysLean/issues/590\">here</a>. </p>\n<p>If anyone wants to have a go at this, let me know - otherwise I should be able to find time later this week.</p>",
        "id": 522331226,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1749035916
    },
    {
        "content": "<p>I have bumped physlean in </p>\n<ul>\n<li><a href=\"https://github.com/HEPLean/PhysLean/pull/591\">#591</a> to <code>v4.20.0</code></li>\n<li><a href=\"https://github.com/HEPLean/PhysLean/pull/593\">#593</a> to <code>v4.20.1</code></li>\n</ul>\n<p>Tags have been created for each of these. </p>\n<p>Thus, as usual, if you merge with master or create a new branch you will have to update your local versions of mathlib and lean (<code>rm -rf .lake; lake update; lake build</code>).</p>",
        "id": 522578967,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1749126317
    },
    {
        "content": "<p>I have bumped PhysLean in </p>\n<ul>\n<li><a href=\"https://github.com/HEPLean/PhysLean/pull/629\">#629</a> to <code>v4.21.0</code></li>\n</ul>\n<p>A tag has been created for this. </p>\n<p>My standard message here applies:</p>\n<blockquote>\n<p>If you merge with master or create a new branch you will have to update your local versions of Mathlib and Lean. Use: </p>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code>rm<span class=\"w\"> </span>-rf<span class=\"w\"> </span>.lake<span class=\"p\">;</span><span class=\"w\"> </span>lake<span class=\"w\"> </span>update<span class=\"p\">;</span><span class=\"w\"> </span>lake<span class=\"w\"> </span>build\n</code></pre></div>\n<p>This may take up to 30 minutes to run.</p>\n</blockquote>\n<p>I had to update my elan also with <code>elan self update</code>.</p>",
        "id": 526557709,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1751359832
    },
    {
        "content": "<p>Why is your message not \"if you merge your branch with master or create a new branch off master then you will have to update your local versions of mathlib and Lean. Use <code>lake exe cache get; lake build</code>. This may take a few minutes to run\"?</p>",
        "id": 526668496,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1751397069
    },
    {
        "content": "<p>Oh I see -- you are pinning versions of everything? I would not encourage my users to run <code>lake update</code> in FLT because it might randomly bump mathlib and break their build (we're typically on bleeding-edge mathlib, I don't want the hassle of just bumping once a month). But you're using <code>lake update</code> as a proxy for <code>lake exe cache get</code> it seems. And the 30 minutes is how long it's just taking PhysLean to build with an up-to-date mathlib on a computer which is much slower than the one I just built it on in 5 minutes?</p>",
        "id": 526670235,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1751397780
    },
    {
        "content": "<p>I usually only recommend <code>rm -rf .lake</code> when things are broken. This is putting up your compilation time because everything (incl mathlib) has to be recloned from github, rather than just bumped.</p>",
        "id": 526670394,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1751397860
    },
    {
        "content": "<blockquote>\n<p>Oh I see -- you are pinning versions of everything?</p>\n</blockquote>\n<p>This is a good idea (at least, in the way Joseph has done it), but indeed there is no need to make anyone else suffer through a fresh build</p>",
        "id": 526671260,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1751398261
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/479953-PhysLean/topic/Bumps.20of.20PhysLean.2E/near/526670394\">said</a>:</p>\n<blockquote>\n<p>I usually only recommend <code>rm -rf .lake</code> when things are broken.</p>\n</blockquote>\n<p>Strictly speaking you should only <code>rm -rf .lake/build</code>, it's possible to commit configuration inside <code>.lake</code></p>",
        "id": 526671357,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1751398310
    },
    {
        "content": "<p>Of course really <code>lake clean</code> should do, but I guess we all have trust issues</p>",
        "id": 526671407,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1751398337
    },
    {
        "content": "<p>Yeah, I've pinned versions. </p>\n<p>But I think I just understood something I never understood before :), which is the following: as long as the <code>lake-manifest.json</code> file is updated (e.g. from merging with master)  then <code>lake exe cache get</code> does all of the work. Is this correct? </p>\n<p>Thus on FLT do people then have to run <code>lake exe cache get</code> everytime they merge with master? (But if I now understand correctly this should be fast).</p>\n<p>The 30 min does come from the time to build PhysLean - which is a bit of an overestimate, the github workflows build it in about 20-25min.  I just didn't want people to worry if it takes a long time. So really my message should be:</p>\n<blockquote>\n<p>If you merge with master or create a new branch off master you will have to update your local versions of Mathlib and Lean. Use: </p>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code>lake<span class=\"w\"> </span>exe<span class=\"w\"> </span>cache<span class=\"w\"> </span>get<span class=\"p\">;</span><span class=\"w\"> </span>lake<span class=\"w\"> </span>build\n</code></pre></div>\n<p>Depending on your computer this can take anywhere between 5 to 30 minutes to run.</p>\n</blockquote>",
        "id": 526671842,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1751398574
    },
    {
        "content": "<p>Perhaps the surprise here is that <code>lake update</code> is calling <code>lake exe cache get</code> behind the scenes</p>",
        "id": 526672001,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1751398651
    },
    {
        "content": "<p>(because mathlib tells it to do that)</p>",
        "id": 526672044,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1751398672
    },
    {
        "content": "<p>Am I correct that <code>lake update</code> does little else? I.e. it just updates the <code>lake-manifest.json</code> and the <code>lean-toolchain</code>, and then <code>lake exe cache get</code> does the rest?</p>",
        "id": 526672212,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1751398760
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/stream/479953-PhysLean/topic/Bumps.20of.20PhysLean.2E/near/526672001\">said</a>:</p>\n<blockquote>\n<p>Perhaps the surprise here is that <code>lake update</code> is calling <code>lake exe cache get</code> behind the scenes</p>\n</blockquote>\n<p>Yes <a href=\"https://github.com/leanprover-community/mathlib4/blob/ede775853cc9f271a9fcf1475dec887f82544e30/lakefile.lean#L166-L176\">https://github.com/leanprover-community/mathlib4/blob/ede775853cc9f271a9fcf1475dec887f82544e30/lakefile.lean#L166-L176</a></p>",
        "id": 526672423,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1751398852
    },
    {
        "content": "<p>Thanks for the link Pietro, I think I understand things now. Many thanks for explaining everyone <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span>.</p>",
        "id": 526673770,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1751399513
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/channel/479953-PhysLean/topic/Bumps.20of.20PhysLean.2E/near/526671842\">said</a>:</p>\n<blockquote>\n<p>Thus on FLT do people then have to run <code>lake exe cache get</code> everytime they merge with master? (But if I now understand correctly this should be fast).</p>\n</blockquote>\n<p>No. They only need to do this every time they merge master into their work, and master has bumped mathlib since they last merged. But I think in general people don't merge master into their branches? Apart from the last couple of weeks when I've been busy, I am usually merging stuff pretty quickly (and I am back on top of things now, I think essentially all PRs are waiting for people other than me right now)</p>",
        "id": 526694397,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1751411033
    },
    {
        "content": "<p>As per the announce channel: </p>\n<ul>\n<li><a class=\"stream-topic\" data-stream-id=\"113486\" href=\"/#narrow/channel/113486-announce/topic/v4.2E22.2E0/with/534418531\">#announce &gt; v4.22.0</a>  </li>\n</ul>\n<p>v4.22.0 of Lean has being released, which means we should update PhysLean to this version and the corresponding tagged version of Mathlib and doc-gen. I have made a tracking issue for this bump :</p>\n<ul>\n<li><a href=\"https://github.com/HEPLean/PhysLean/issues/691\">Bump: tracking issue</a></li>\n</ul>\n<p>If someone would want to volunteer to do this, it would be great! If not I will likely be able to do it at some point, but there will likely be a delay.</p>",
        "id": 534433628,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1755160297
    },
    {
        "content": "<p>PhysLean has now been bumped (<a href=\"https://github.com/HEPLean/PhysLean/pull/710\">here</a>) to v4.22.0 of Lean and the corresponding tagged version of Mathlib.  The upside we get a bunch of new features from Lean and new theorems and definitions from Mathlib, the downside is:</p>\n<blockquote>\n<p>If you merge with master or create a new branch off master you will have to update your local versions of Mathlib and Lean. You can use: </p>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code>lake<span class=\"w\"> </span>exe<span class=\"w\"> </span>cache<span class=\"w\"> </span>get<span class=\"p\">;</span><span class=\"w\"> </span>lake<span class=\"w\"> </span>build\n</code></pre></div>\n<p>Depending on your computer this can take anywhere between 5 to 30 minutes to run.</p>\n</blockquote>\n<p>If you have any issues feel free to comment here and we can help.</p>",
        "id": 536051798,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1756136091
    },
    {
        "content": "<p>PhysLean has now been bumped, at <a href=\"https://github.com/HEPLean/PhysLean/pull/741\">PhysLean#741</a>, to v4.23.0 of Lean and the corresponding tagged version of Mathlib. </p>\n<blockquote>\n<p>If you merge with master or create a new branch off master you will have to update your local versions of Mathlib and Lean. You can use: </p>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code>lake<span class=\"w\"> </span>exe<span class=\"w\"> </span>cache<span class=\"w\"> </span>get<span class=\"p\">;</span><span class=\"w\"> </span>lake<span class=\"w\"> </span>build\n</code></pre></div>\n<p>Depending on your computer this can take anywhere between 5 to 30 minutes to run.</p>\n</blockquote>\n<p>If you have any issues feel free to comment here and we can help.</p>",
        "id": 539750464,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1758024180
    },
    {
        "content": "<p>I have made a tracking issue for bumping PhysLean to v4.24.0 <a href=\"https://github.com/HEPLean/PhysLean/pull/773\">PhysLean#773</a>. I will not get chance to do this until early next week, so if anyone wants to have a go at this please do.</p>",
        "id": 545508007,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1760688586
    },
    {
        "content": "<p>On my side i already made a bump in lean-units. The main impact i got is that <code>induction'</code> disappeared, and other minor changes.  Was a 30 mn work.</p>",
        "id": 545529222,
        "sender_full_name": "Alfredo Moreira-Rosa",
        "timestamp": 1760694999
    },
    {
        "content": "<p>PhysLean is now bumped to v4.24.0 (in <a href=\"https://github.com/HEPLean/PhysLean/pull/776\">PhysLean#776</a>), and the corresponding tagged version of Mathlib. This means</p>\n<blockquote>\n<p>If you merge with master or create a new branch off master you will have to update your local versions of Mathlib and Lean. You can use: </p>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code>lake<span class=\"w\"> </span>exe<span class=\"w\"> </span>cache<span class=\"w\"> </span>get<span class=\"p\">;</span><span class=\"w\"> </span>lake<span class=\"w\"> </span>build\n</code></pre></div>\n<p>Depending on your computer this can take anywhere between 5 to 30 minutes to run.</p>\n</blockquote>",
        "id": 546012369,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1760974131
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"942100\">Alfredo Moreira-Rosa</span> <a href=\"#narrow/channel/479953-PhysLean/topic/Bumps.20of.20PhysLean.2E/near/545529222\">said</a>:</p>\n<blockquote>\n<p>On my side i already made a bump in lean-units. The main impact i got is that <code>induction'</code> disappeared, and other minor changes.  Was a 30 mn work.</p>\n</blockquote>\n<p><code>induction'</code> never actually appeared in PhysLean :), the main thing I had to modify was add <code>open Matrix</code>  or <code>open MatrixOrder</code> in places, otherwise this time it was very simple.</p>",
        "id": 546012693,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1760974198
    },
    {
        "content": "<p>Of a similar variety to a bump so posting this here: In <a href=\"https://github.com/HEPLean/PhysLean/pull/778\">PhysLean#778</a> I have improved the linters so <code>lake exe lint_all</code> should run a lot quicker locally. (I basically changed how the sorry axiom is being looked for)</p>",
        "id": 546366434,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1761109612
    },
    {
        "content": "<p>PhysLean has been bumped to v4.25.0 (in <a href=\"https://github.com/HEPLean/PhysLean/pull/814\">PhysLean#814</a>), and the corresponding version of Mathlib. </p>\n<blockquote>\n<p>If you merge with master or create a new branch off master you will have to update your local versions of Mathlib and Lean. You can use: </p>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code>lake<span class=\"w\"> </span>exe<span class=\"w\"> </span>cache<span class=\"w\"> </span>get<span class=\"p\">;</span><span class=\"w\"> </span>lake<span class=\"w\"> </span>build\n</code></pre></div>\n<p>Depending on your computer this can take anywhere between 5 to 30 minutes to run.</p>\n</blockquote>\n<p>The biggest change in this Bump is that:  The definition of <code>EuclideanSpace</code> has changed and consequently the definition of  <code>Space d</code>, which is currently just an abbreviation of <code>EuclideanSpace</code>. It is a TODO to move <code>Space d</code> from been an abbreviation of <code>EuclideanSpace</code> to its own structure.</p>",
        "id": 558157773,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1763546268
    },
    {
        "content": "<p>I've restructured <code>Space d</code> to its own structure at: <a href=\"https://github.com/HEPLean/PhysLean/pull/819\">PhysLean#819</a></p>",
        "id": 560329878,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1764145586
    },
    {
        "content": "<p>PhysLean has been bumped to v4.26.0 (in <a href=\"https://github.com/HEPLean/PhysLean/pull/836\">PhysLean#836</a>), and the corresponding version of Mathlib. </p>\n<blockquote>\n<p>If you merge with master or create a new branch off master you will have to update your local versions of Mathlib and Lean. You can use: </p>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code>lake<span class=\"w\"> </span>exe<span class=\"w\"> </span>cache<span class=\"w\"> </span>get<span class=\"p\">;</span><span class=\"w\"> </span>lake<span class=\"w\"> </span>build\n</code></pre></div>\n<p>Depending on your computer this can take anywhere between 5 to 30 minutes to run.</p>\n</blockquote>\n<p>There was one tricky aspect of this Bump which remains unresolved, and was circumvented by making two results @[sorryful].</p>\n<p>This is discussed here</p>\n<p><a class=\"stream-topic\" data-stream-id=\"270676\" href=\"/#narrow/channel/270676-lean4/topic/Fin.2Efind.3F.20and.20decide.20in.20v4.2E26.2E0/with/564068609\">#lean4 &gt; Fin.find? and decide in v4.26.0</a></p>",
        "id": 564272587,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1765983600
    },
    {
        "content": "<p>created issue <a href=\"https://github.com/HEPLean/PhysLean/pull/928\">PhysLean#928</a> for bumping to v4.27.0, won't have time til weekend so if anyone wants to go ahead please do</p>",
        "id": 572238910,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1770321823
    },
    {
        "content": "<p>PhysLean has been bumped to v4.27.0 (in <a href=\"https://github.com/HEPLean/PhysLean/pull/929\">PhysLean#929</a>), and the corresponding version of Mathlib.</p>\n<blockquote>\n<p>If you merge with master or create a new branch off master you will have to update your local versions of Mathlib and Lean. You can use: </p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">lake</span><span class=\"w\"> </span><span class=\"n\">exe</span><span class=\"w\"> </span><span class=\"n\">cache</span><span class=\"w\"> </span><span class=\"n\">get</span><span class=\"bp\">;</span><span class=\"w\"> </span><span class=\"n\">lake</span><span class=\"w\"> </span><span class=\"n\">build</span>\n</code></pre></div>\n<p>Depending on your computer this can take anywhere between 5 to 30 minutes to run.</p>\n</blockquote>",
        "id": 572702570,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1770624779
    },
    {
        "content": "<p>(btw is there a way to create a tag on github? I did it through command line, wondering is there a more intuitive way. Also is it actually used for anything in PhysLean or just to keep a record?)</p>",
        "id": 572702889,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1770624859
    },
    {
        "content": "<p>The only way I know how to create a tag is to create a release, tag it, and then immediately delete the release. Not the most efficient, but it seems to work.</p>",
        "id": 572703872,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1770625133
    },
    {
        "content": "<blockquote>\n<p>Also is it actually used for anything in PhysLean or just to keep a record</p>\n</blockquote>\n<p>In theory it is so people can use PhysLean in downsteam projects to make everything consistent. The idea is that PhysLean tagged with 'v4.27.0' uses Mathlib with tag 'v4.27.0', so you can use PhysLean 'v4.27.0' with any other library tagged with 'v4.27.0' .</p>",
        "id": 572704485,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1770625300
    },
    {
        "content": "<p>The only place I think this is used is in: <a href=\"https://www.leanexplore.com\">https://www.leanexplore.com</a>, where (at least) historically they were working of a tagged version of PhysLean, not sure about now. Also unsure about any private repos etc.</p>",
        "id": 572704709,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1770625362
    },
    {
        "content": "<p>Many thanks for doing this bump <span class=\"user-mention\" data-user-id=\"890057\">@ZhiKai Pong</span>  :). Was the issue template <a href=\"https://github.com/HEPLean/PhysLean/pull/928\">PhysLean#928</a> easy enough to follow, or is there anything you think we could add? (The corresponding template file is <a href=\"https://github.com/lean-phys-community/PhysLean/blob/master/.github/ISSUE_TEMPLATE/Bump.yml\">this</a>)</p>",
        "id": 572706093,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1770625766
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/channel/479953-PhysLean/topic/Bumps.20of.20PhysLean.2E/near/572706093\">said</a>:</p>\n<blockquote>\n<p>Many thanks for doing this bump <span class=\"user-mention silent\" data-user-id=\"890057\">ZhiKai Pong</span>  :). Was the issue template <a href=\"https://github.com/HEPLean/PhysLean/pull/928\">PhysLean#928</a> easy enough to follow, or is there anything you think we could add?</p>\n</blockquote>\n<p>I think the template is good enough, the process itself is straightforward, it's fixing the actual code that takes the most time (maybe just this line: <code>rm -rf .lake</code> can be changed to something more general like <code>delete the .lake directory</code> since rm -rf doesn't work on windows)</p>",
        "id": 572707099,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1770626062
    },
    {
        "content": "<blockquote>\n<p>it's fixing the actual code that takes the most time</p>\n</blockquote>\n<p>yep :(. Made the change to <code>rm -rf .lake</code> and some other small mods in <a href=\"https://github.com/HEPLean/PhysLean/pull/931\">PhysLean#931</a></p>",
        "id": 572709149,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1770626652
    },
    {
        "content": "<p>PhysLean has been bumped to v4.28.0 (in <a href=\"https://github.com/HEPLean/PhysLean/pull/955\">PhysLean#955</a>), and the corresponding version of Mathlib.</p>\n<blockquote>\n<p>If you merge with master or create a new branch off master you will have to update your local versions of Mathlib and Lean. You can use: </p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">lake</span><span class=\"w\"> </span><span class=\"n\">exe</span><span class=\"w\"> </span><span class=\"n\">cache</span><span class=\"w\"> </span><span class=\"n\">get</span><span class=\"bp\">;</span><span class=\"w\"> </span><span class=\"n\">lake</span><span class=\"w\"> </span><span class=\"n\">build</span>\n</code></pre></div>\n<p>Depending on your computer this can take anywhere between 5 to 30 minutes to run.</p>\n</blockquote>",
        "id": 575073422,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1771665314
    }
]