[
    {
        "content": "<p>I thought it was worth making a chat regarding bumping PhysLean.</p>\n<p>For those new to Lean: Bumping PhysLean means updating either the Lean version or the Mathlib version that PhysLean depends on, or both. </p>\n<p>Firstly I want to open the following discussion: Currently I only bump PhysLean for every stable release of Lean (about once a month). Kevin said that over on FLT they bump weekly. The advantage of bumping more often is that it is easier: less has changed in Mathlib, so there is less to change downstream - and it is easier to pinpoint what has changed. The disadvantage is that it requires a more sustained time commitment, which I personally can't commit to alone. I would also be happy if we can make things somewhat predictable. What are our options are here?</p>\n<p>Secondly: I think using  this thread to notify when a bump of PhysLean has taken place will be useful.</p>",
        "id": 510683162,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744035074
    },
    {
        "content": "<p>Hi! This post has some great timing actually, since one of my goals for the coming months is to improve the process of bumping Lean projects. I was calling <span class=\"user-mention\" data-user-id=\"556875\">@Pietro Monticone</span> on the topic right at the moment you posted this :)</p>\n<p>One option you might want to consider is to install the <a href=\"https://github.com/leanprover-community/lean-update\"><code>lean-update</code></a> action, which runs the <code>lake update</code> command at a scheduled interval and will make a PR / issue / commit (configurable) whenever the build succeeds. So the easy updates become automatic and you get notified for the difficult ones.</p>\n<p>I see that right now you're making good use of the versioning tag system, so e.g. the Lakefile for the PhysLean tag <code>v4.18.0-rc1</code> requires Mathlib <code>v4.18.0-rc1</code>, which is great! If all Lean projects had version tags like this, there would be no issues with version mismatches between dependencies. So I would like to ask to keep making those tags too. (Another goal is to have <code>lean-update</code> or similar making this tag automatically for you. Perhaps that will need some <code>lake</code> improvements though, so that will have to wait a bit longer.)</p>",
        "id": 510703170,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1744039695
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span> ! Thanks for this. </p>\n<p><code>lean-update</code> looks great - I had heard about it before but forgot it was an option so thanks!</p>\n<p>If I set the frequency to 1 week for updates, will I still need to do special manual bumps to make sure one is on the tagged version of Mathlib and Lean? I'm guessing the answer is yes, but this should be easy if weekly bumps are also done.</p>",
        "id": 510706841,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744040605
    },
    {
        "content": "<p>Yes, if you use <code>lean-update</code> right now you would still need to do the tagged bumps manually, unfortunately. That should become automated in some way in the next few months :)</p>",
        "id": 510707331,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1744040733
    },
    {
        "content": "<p>And if you have any other ideas for how to make <code>lean-update</code> more useful, please let me know!</p>",
        "id": 510707407,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1744040754
    },
    {
        "content": "<p>Great thanks Anne! For reference, I made an GitHub issue c.f. adding lean-update to physlean <a href=\"https://github.com/HEPLean/PhysLean/issues/458\">here</a>.</p>",
        "id": 510708768,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744041133
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span> I did have one thought of something which would be very nice: It would be nice if when a bump fails it tells you which specific commit(s) to Mathlib or Batteries etc caused it to fail. </p>\n<p>I think this would be practically unfeasible to do though without a very large computation time.</p>",
        "id": 510743186,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744051642
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span> What is the recommended setup if I have package A that depends on mathlib and package B that depends on A. Ideally, the automation  tries to update A and if that succeeds it tries to update B.</p>\n<p>Do I just set up automatic update for A on Monday and B on Tuesday?</p>",
        "id": 510754167,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1744055320
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/channel/479953-PhysLean/topic/Bumps.20of.20PhysLean.2E/near/510743186\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"238446\">Anne Baanen</span> I did have one thought of something which would be very nice: It would be nice if when a bump fails it tells you which specific commit(s) to Mathlib or Batteries etc caused it to fail. </p>\n</blockquote>\n<p>Hmm, maybe to get more fine grained feedback, you could try running the automatic bumping in the background every day, but set up so it only reports an error on failure and doesn't do anything on success. This would then be in addition to the bumping script that actually commits/PRs the results every week, so you get an early warning if things start to go wrong, but you don't force users to update their dependencies every day.</p>",
        "id": 510883185,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1744104648
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"346070\">Tomas Skrivan</span> <a href=\"#narrow/channel/479953-PhysLean/topic/Bumps.20of.20PhysLean.2E/near/510754167\">said</a>:</p>\n<blockquote>\n<p>Do I just set up automatic update for A on Monday and B on Tuesday?</p>\n</blockquote>\n<p>Staggering the build times is exactly how lean/batteries/mathlib do it: Lean builds a nightly at 7AM UTC, Batteries at 9:45AM and Mathlib at 10AM.</p>",
        "id": 510883819,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1744104805
    },
    {
        "content": "<p>Right, we have this auto-bumping on FLT I think (if I'm talking about the same thing as Anne). Indeed one hour ago a machine opened <a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/402\">FLT#402</a> which is telling me amongst other things that <code>FLT.GaloisRepresentation.Cyclotomic</code> is not compiling any more, and I can guess exactly why: Andrew's PR to mathlib adding more stuff about the cyclotomic character just got merged, so now we have stuff in FLT which is also in mathlib which needs to be deleted. I will try to get to this bump today.</p>",
        "id": 510884148,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1744104887
    },
    {
        "content": "<p>Yes, we are using the <code>lean-update</code> action in FLT</p>",
        "id": 510910457,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1744112966
    },
    {
        "content": "<p>I’ve not thought about it deeply enough but here is rough idea.</p>\n<p>Given two packages A and B such that:</p>\n<ul>\n<li>A depends on Mathlib</li>\n<li>B depends on Mathlib</li>\n<li>A depends on B</li>\n</ul>\n<p>a potentially convenient update workflow (that would require a relatively small extension of <code>lean-update</code>) could be roughly the following:</p>\n<h3>On B (every 1-3 days):</h3>\n<ol>\n<li>If the Mathlib <code>lean-toolchain</code> version is higher than the B <code>lean-toolchain</code> version, then pin the new version in the B <code>lakefile.toml</code> and<code>lake update</code>. If it succeeds, open a PR  and create release after merge; if it fails, open an issue with the relevant information in the description (i.e. changes in the <code>lakefile.toml</code>) which would be useful to the maintainer for the manual bump. </li>\n<li>If the Mathlib <code>lean-toolchain</code> version is the same as the B <code>lean-toolchain</code> version, then pin the latest Mathlib commit in the B <code>lakefile.toml</code> and <code>lake update</code>. If it succeeds, open a PR; if it fails, open an issue with the relevant information in the description (i.e. changes in the <code>lakefile.toml</code>) which would be useful to the maintainer for the manual bump.</li>\n</ol>\n<h3>On A (every 1-3 days, shifted by an hour or so):</h3>\n<ol>\n<li>If the B <code>lean-toolchain</code> version is higher than the A <code>lean-toolchain</code> version, then pin the new version in the B <code>lakefile.toml</code> and <code>lake update</code>. If it succeeds, open a PR and create a release after merge; if it fails, open an issue with the relevant information in the description (i.e. changes in the <code>lakefile.toml</code>) which would be useful to the maintainer for the manual bump.</li>\n<li>If the B <code>lean-toolchain</code> version is the same as the A <code>lean-toolchain</code> version, then pin in the A <code>lakefile.toml</code> the latest commit in the B <code>lakefile.toml</code> and the Mathlib commit pinned in B, then <code>lake update</code>. If it succeeds, open a PR; if it fails, open an issue with the relevant information in the description (i.e. changes in the <code>lakefile.toml</code>) which would be useful to the maintainer for the manual bump.</li>\n</ol>\n<p>It might work decently and it seems generalizable enough…</p>",
        "id": 510923159,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1744116620
    },
    {
        "content": "<p>NB: The maintainer can always decide not to merge the PR immediately, but at least they would have full control.</p>",
        "id": 510926082,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1744117252
    },
    {
        "content": "<p>I agree with your vision! A great bonus functionality would be to specifically pin <code>B</code> to the <em>first</em> Mathlib version with a newer <code>lean-toolchain</code>. That way we can be sure all the releases of various projects agree on their dependency versions. I think that would be possible to find out using <code>git log</code>, right?</p>",
        "id": 510934832,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1744119075
    },
    {
        "content": "<p>Do I understand it correctly that in my <code>lakefile.lean</code> I should depend on mathlib's <code>master</code> branch? Otherwise <code>lean-update</code> action would not do anything useful.</p>",
        "id": 511019144,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1744143719
    },
    {
        "content": "<p>That's what I do in FLT except when we do a bump to a tag.</p>",
        "id": 511022402,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1744145066
    },
    {
        "content": "<p>(I've just bumped PhysLean to v4.18.0 and set up <code>lean-update</code>.)</p>",
        "id": 511138284,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744195917
    },
    {
        "content": "<p>I wasn't as successful as you yesterday :( I tried bumping SciLean to v4.18.0 but the compiler seems broken. For some reason, you can't compile binary that imports <code>Batteries.Tactic.Lint.Misc</code> and most of Mathlib does. It seems to be fixed on v4.19.0-rc2 but ffi is getting an overhaul and I can't get ffi functions to evaluate in the editor.</p>",
        "id": 511192342,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1744209579
    }
]