[
    {
        "content": "<p>I already had Claude Code with Opus 4.5 to formalize it, and it's done. Currently checking if it compiles, and if it does, I will have to trace the reasoning manually before submitting a PR for it.</p>",
        "id": 565266572,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1766571213
    },
    {
        "content": "<p>With things generated by AI, it’s also important to make sure it fits with the style of the codebase and integrates well into it. We want general APIs where possible with results that can be reused in different areas.</p>",
        "id": 565274624,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1766576719
    },
    {
        "content": "<p>I indeed had seen a similar remark by you in this <a href=\"https://www.reddit.com/r/Physics/comments/1f2dt1s/comment/lk6ojgo/\">Reddit post</a>. I think fleshing out the style further will help both humans and AI in the effort.</p>",
        "id": 565312555,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1766604857
    },
    {
        "content": "<p>Update on my end: Claude Code + Opus 4.5 had managed to specify spin systems, up to 2-qubit systems specifically.  But it struggled with specifying Bell states, with errors after errors, and cutting some corners. I suppose we are not there yet with vibe proofing in the sense of <a href=\"https://terrytao.wordpress.com/2025/12/08/the-story-of-erdos-problem-126/\">Erdős problem 1026</a>. You could say because that there has been no RLVR for physics formulations yet.</p>\n<p>Disclaimer: I don't know how to Lean, still new to me. But I am from Zulip community, where <a href=\"https://zulip.com/case-studies/lean/\">the Lean prover (and Mathlib) community is celebrated</a>.</p>",
        "id": 565313160,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1766605447
    },
    {
        "content": "<p>I think for this we would eventually want to build it on from the API detailed here: <br>\n<a href=\"https://github.com/HEPLean/PhysLean/pull/848\">PhysLean#848</a></p>",
        "id": 565595307,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1766955740
    }
]