[
    {
        "content": "<p>Currently it is based on Mathlib's Python-based linter, which I find to be too ad-hoc. But I recently tested that linting using tree-sitter is also very fast, using <a href=\"https://github.com/Julian/tree-sitter-lean\">https://github.com/Julian/tree-sitter-lean</a>. While the grammar is more comprehensive than the Python-based one. Any thoughts about pilot-testing this linter via GH Actions? The creator of that repo seems to be present in this Zulip organization too.</p>",
        "id": 565900202,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1767189649
    },
    {
        "content": "<p>I think there was an effort to port the python linters in Mathlib to Lean ones, I'm currently unsure of the status of that effort, but I think keeping things close to Mathlib would be good. But I agree that the python-based linters do feel a bit ad-hoc.</p>",
        "id": 565966704,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1767261368
    },
    {
        "content": "<p>Let me comment on the mathlib rewriting: I worked on this a lot in 2024, and most linters have been rewritten as syntax linters in Lean now. There are four linters remaining: the isolated by, where and \"line starts with a colon\" linters and the \"space after &lt;-\" linter should be subsubmed by <a href=\"https://github.com/leanprover-community/mathlib4/pull/30658\">#30658</a>. (That PR checks whitespace formatting in mathlib, and if it does not include these checks yet, it should.) There is also an in-progress linter about indentation. Once both of these land, all text-based mathlib linters can be removed, and I would prefer to remove that infrastructure.</p>",
        "id": 565969935,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1767265194
    },
    {
        "content": "<p>(Medium-term, an auto-formatter for Lean will make all these linters obsolete. I expect mathlib to experiment with this in the third quarter of this year.)</p>",
        "id": 565970079,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1767265230
    },
    {
        "content": "<p>In short: the python linters are going away in mathlib; working on them is not a good use of time. You should rather rewrite these as Lean syntax linters. <span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> and I are happy to help you with this. (We may and do have other obligations also, but I for sure will try to help. I presume the same holds for Damiano.)</p>",
        "id": 565970134,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1767265300
    },
    {
        "content": "<p>Thanks for the update <span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> . What are the issues rewriting the additional linters into Lean? Is what you are suggesting the following: </p>\n<p>We make a version of these linters in Lean for PhysLean and then once in Mathlib we remove them from PhysLean? If so, I think this would neaten things up a bit for us.</p>",
        "id": 566050558,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1767355240
    },
    {
        "content": "<p>Sorry for the late answer: what you're saying is not what I'm suggesting, but that's certainly an option.</p>",
        "id": 570867692,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1769711141
    },
    {
        "content": "<p>I hope that <a href=\"https://github.com/leanprover-community/mathlib4/pull/30658\">#30658</a> lands really soon; I'll be able to remove one of the Python linters immediately. The other three might require a small improvement to the whitespace linter. I'd be very happy to review a patch to that effect.</p>",
        "id": 570867838,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1769711196
    }
]