[
    {
        "content": "<p>One of the areas of PhysLean which is not really developed at all is condensed matter physics. I think it would be nice to have one or two things done in this direction within PhysLean to serve as a bit of an impetus. </p>\n<p>I don't currently have the time to do this right now, but I wanted to know if anyone had suggestions of some simple things  (e.g. undergraduate level)  that could get us started in the direction of condensed matter physics. E.g. maybe something to do with lattices, the second quantization etc. </p>\n<p>(Somewhat related - a fair while a go I asked in the chat of  Physics stack exchange if a question like Kevin's math-overflow question: </p>\n<p><a href=\"https://mathoverflow.net/questions/311071/which-mathematical-definitions-should-be-formalised-in-lean\">Which mathematical definitions should be formalized in Lean?</a></p>\n<p>but physics based would be on-topic... they said no :( as they don't like big-list questions. )</p>",
        "id": 514739268,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1745825278
    },
    {
        "content": "<p>One idea might be the 1D tight binding chain.</p>",
        "id": 514774088,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1745835230
    },
    {
        "content": "<p>I’d love to see Onsager’s solution to the 2D Ising model. Maybe the transfer matrix techniques he developed would be appropriate for Mathlib?</p>",
        "id": 514821669,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1745848674
    },
    {
        "content": "<p>I've also dreamt about Onsager's solution for a while! Another \"easy\" objective is showing that BEC undergoes a phase transition where it condenses.</p>\n<p>(That is, formally: a bunch of identical bosons in a Hamiltonian with a gap, like (say) a harmonic oscillator spectrum. You get the fraction of the population of N particles, as a function of temperature, and then take the limit as N -&gt; infty, and this converges to some function f(T). Prove there's a critical temperature T0 so that for all T &gt;= T0, f(T) = 0, and for all T &lt; T0, f(T) is positive.)</p>",
        "id": 514940177,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1745894522
    },
    {
        "content": "<p>I've tried looking into proving this and it's actually quite hard to make totally rigorous, though. Computing and bounding the contributions of the excited states (and showing they're sufficiently small) is usually done with a saddle-point method, which is not rigorous.</p>",
        "id": 514940328,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1745894602
    },
    {
        "content": "<p>Thanks for the suggestions both! Ideally I would like a couple of things which one could knock off in a week or so. Maybe BEC phase transitions are a possibility here, or maybe there is some simpler version.</p>",
        "id": 514960914,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1745904459
    },
    {
        "content": "<p>Looking a bit more into the 1D tight binding chain, I think it might be a good candidate for small place to  start. </p>\n<p>These notes by David Tong do a pretty good job of explaining it: <a href=\"https://www.damtp.cam.ac.uk/user/tong/aqm/aqmtwo.pdf\">https://www.damtp.cam.ac.uk/user/tong/aqm/aqmtwo.pdf</a>. </p>\n<p>I created a small issue/feature-request on the repo concerning this: <a href=\"https://github.com/HEPLean/PhysLean/issues/523\">https://github.com/HEPLean/PhysLean/issues/523</a>.</p>",
        "id": 515015694,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1745920637
    }
]