[
    {
        "content": "<p>I'm interested in how much can be said about the solution to the Schrödinger equation for the hydrogen atom. I'm guessing it is not yet possible to write down solution and prove it is unique, given what is currently in Mathlib. </p>\n<p>But it may be possible to show, that for example, solutions can be split into a radial part and an angular part - and thereby split the Schrödinger equation into a radial and angular part. </p>\n<p>I'd be interested in having anything along these lines in HepLean (which has now been renamed <em>PhysLean</em>).</p>",
        "id": 500356999,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1739871793
    },
    {
        "content": "<p>Glad to see the rename! I think as a near term goal for mathlib to support this effort, one can develop libraries of special functions as solutions to differential equations.</p>",
        "id": 500358099,
        "sender_full_name": "Winston Yin (尹維晨)",
        "timestamp": 1739872154
    },
    {
        "content": "<p>You can imagine that a goal for PhysLean is to formalise famous results in undergraduate physics. Certainly that includes the spherical harmonics.</p>",
        "id": 500358470,
        "sender_full_name": "Winston Yin (尹維晨)",
        "timestamp": 1739872265
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"416472\">Winston Yin (尹維晨)</span> <a href=\"#narrow/channel/479953-HepLean/topic/Hydrogen.20atom/near/500358099\">said</a>:</p>\n<blockquote>\n<p>Glad to see the rename! I think as a near term goal for mathlib to support this effort, one can develop libraries of special functions as solutions to differential equations.</p>\n</blockquote>\n<p>Totally agreed!</p>",
        "id": 500360218,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1739872778
    },
    {
        "content": "<p>I think the basic steps for the hydrogen atom would be:</p>\n<ol>\n<li>Write the Schrodinger equation for the hydrogen atom in Cartesian coordinates.</li>\n<li>Rewrite it in terms of spherical coordinates, with a corresponding lemma showing that solutions to one leads to solutions to the other.</li>\n<li>Split the spherical equation into a radial part and an angular part. Show that any solution to the full Schrodinger equation is the product of a solution from the radial and angular parts. </li>\n<li>Further split the angular part into an azimuthal and polar part.  Show that any solution to the full angular part is the product of a solution from the azimuthal and polar parts.</li>\n<li>Use special functions as mentioned by <span class=\"user-mention\" data-user-id=\"416472\">@Winston Yin (尹維晨)</span> , to solve the radial, azimuthal and polar parts. </li>\n</ol>\n<p>I believe 1-4 would be possible now (with a bit of work). </p>\n<p>Eventually we would want a general framework for QM and Schrodinger equation's which sit ontop of all of this.</p>",
        "id": 500361624,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1739873183
    },
    {
        "content": "<p>Re 1, I think you should carefully and informally state the equation in a new thread in #**mathlib4 and ask what is needed in order to formalize the equation. That would have a lot more visibility than this channel and is clearly the place to start.</p>\n<p>I have seen many times people coming along saying \"oh mathlib should have PDEs, here is a toy example, how do we state this?\" and then the experts coming along and saying \"aah well you can't do d/dx but we can differentiate along an arbitary vector and you should set everything up in terms of normed spaces and not pick a basis and blah blah blah\" and intimidating these people away. I think that you should not be intimidated away and should keep pressing until we have a formal statement of Schroedinger. It will be easier to take you seriously than a random newcomer who asks some questions about PDEs and then goes away again. This (stating Schroedinger) is I think one of these projects which is probably feasible given what we have, but it needs someone to drive it forwards and keep pestering until whatever fundamental obstacles there are to stating this equation are removed. Furthermore, once we have it then other people will be able to use it as a blueprint for their favourite differential equation.</p>",
        "id": 500375683,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1739877424
    },
    {
        "content": "<p>One obstacle going forward will be how to compute derivatives/gradients. I have a tactic <code>fun_trans</code> to do it but in mathlib you can't even write the gradient of a function with type <code>(Fin n -&gt; R) -&gt; R</code> or <code>R x R -&gt; R</code>(don't know how to type unicode on mobile). Yeah yeah I should use <code>EuclideanSpace</code> but arrow type and product type are so fundamental to the core type theory that it is hard to work without them. Internally <code>fun_prop</code> and <code>fun_trans</code> use product and arrow types to decompose complicated functions into simple ones. Once someone comes up with a predicate on functions that work only on <code>InnerProductSpace</code> then <code>fun_prop</code> will not work for it. Yes I tried using <code>WithLp ...</code> internally in the tactic and it got really messy and annoying. You slip once with abusing defeq and you end up with terms that just won't unify. </p>\n<p>My solution to this would be to add additional typeclass that sits between <code>NormedSpace</code> and <code>InnerProductSpace</code> which is exactly as <code>InnerProductSpace</code> but requires only that the induced norm is topologically equivalent to the given norm(max norm for product and arrow types). With this weaker notion of inner product space we can define adjoint and gradient that work with product and arrow types. I tried advocating for this change/addition but didn't see any enthusiasm so I gave up. Not sure what to do about this.</p>\n<p>And for context, the Schrodinger equation contains laplacian which can be defined as something like <code>laplace f x = trace (fderiv (gradient f) x)</code> i.e. you need to compute <code>gradient</code> for some complicated <code>f</code>.</p>",
        "id": 500387231,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1739881218
    },
    {
        "content": "<p>I realized that the hydrogen atom also has an added difficulty that the potential is not defined at zero. And thus, as a starting point, there may be easier (but still physical) examples to work with. For example planar motion in a uniform magnetic field (giving Landau levels). </p>\n<p><span class=\"user-mention\" data-user-id=\"346070\">@Tomas Skrivan</span> You are implying that even if I give you a solution to the Schrodinger equation (or any other PDE) it may be difficult to check if that solution is indeed a solution?</p>",
        "id": 500389142,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1739881797
    },
    {
        "content": "<p>Also I think the Schrodinger equation should be defined for a wave function with the type <code>R -&gt; EuclideanSpace 3 -&gt; C</code>(time -&gt; space -&gt; ...) where you can easily write the equation coordinate free.</p>\n<p>However once you rewrite it into spherical coordinates you have to do it coordinate wise so I think it should be written in terms of a wave function with the type <code>R -&gt; R -&gt; R -&gt; R -&gt; C</code>(time -&gt; radius -&gt; latitude -&gt; longitude -&gt; ...) and any partial derivatives can be expressed with just <code>deriv</code>.</p>",
        "id": 500389225,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1739881810
    },
    {
        "content": "<p>Yeah! I think in general it should certainly be possible to write things in a coordinate free manner.</p>",
        "id": 500389644,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1739881932
    },
    {
        "content": "<p>Yeah but if you switch to spherical coordinates then the inner product depends on the position. Therefore either you are forced to work with manifolds and covariant derivatives or write it out in coordinates.</p>",
        "id": 500390126,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1739882075
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/stream/479953-HepLean/topic/Hydrogen.20atom/near/500389142\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"346070\">Tomas Skrivan</span> You are implying that even if I give you a solution to the Schrodinger equation (or any other PDE) it may be difficult to check if that solution is indeed a solution?</p>\n</blockquote>\n<p>Checking that an explicit formula is a solution is just one big exercise on computing derivatives and mathlib does not have a tactic for it. I'm working on one but the definition of <code>InnerProductSpace</code> is making it difficult to compute <code>gradient</code>.</p>",
        "id": 500390426,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1739882158
    },
    {
        "content": "<p>(and I have no idea how to make this tactic work for <code>mfderiv</code> in case you want to go down the manifold route)</p>",
        "id": 500390574,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1739882197
    },
    {
        "content": "<p>Thanks for your suggestion <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> . I have posted something on the mathlib channel which hopefully hits the right tone. (<a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Stating.20Schrodinger.27s.20equation/with/500397009\">#mathlib4 &gt; Stating Schrodinger's equation</a>)</p>",
        "id": 500397281,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1739884185
    },
    {
        "content": "<p>Hmm annoyingly I think in the long run going down the manifold route is probably the most general way of doing things. </p>\n<p>In particular, I believe the mathematically correct way to describe a wave function is a section of a hermitian line bundle, and there are 'physical' examples where this really matters - my first ever <a href=\"https://arxiv.org/pdf/1905.11999\">paper</a> actually happened to be related to this very topic :). A particular example is the case of a Dirac monopole (which is related to the concept of a Dirac string). </p>\n<p>But maybe sticking with <code>fderiv</code> and <code>gradient</code> for now is the best idea.</p>",
        "id": 500421628,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1739890755
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/stream/479953-HepLean/topic/Hydrogen.20atom/near/500421628\">said</a>:</p>\n<blockquote>\n<p>But maybe sticking with <code>fderiv</code> and <code>gradient</code> for now is the best idea.</p>\n</blockquote>\n<p>I think so too and not only because of technical reasons but social ones. As Kevin mentioned, we already struggle with keeping people involved so we should keep it a bit closer to the math people are used to. Many many parts of physics and applied math don't use the language of differential geometry so I think forcing people to learn what \"modelWithCornersEuclideanHalfSpace\" before they can do the most basic stuff is not a good idea.</p>",
        "id": 500423574,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1739891223
    },
    {
        "content": "<p>It is already crazy that people have to learn that vector space is addcommgroup+module ...</p>",
        "id": 500423800,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1739891280
    },
    {
        "content": "<p>Yeah, ok I agree. </p>\n<p>I think an ideal case would be something along the following lines:</p>\n<p>Since one day it would be nice to have things like dirac monopoles, the general framework (e.g. in terms of <code>mfderiv</code>)  is needed. <br>\nBut this should be related to, in the cases where it can be, to a specific framework  (e.g. in terms of <code>fderiv</code> and <code>gradient</code>) which is easier to understand and closer to what the average physicist is use too.  Those who don't care about the general framework won't need to use it or even know of its existence.</p>",
        "id": 500426680,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1739891979
    },
    {
        "content": "<p>I think it's a great stress test of Lean/mathlib to formalise the hydrogen atom as a PDE problem first. Have you thought about generality on the physics side, namely that the Schrödinger equation is a special case of the eigenvalue problem of a Hermitian operator on a Hilbert space? For example, there are some subtleties with the Laplacian when you're dealing with infinite potential walls in tunnelling or particle in a box problems. Hilbert spaces are actually too restrictive, since we want to be able to treat non-integrable functions/distributions as solutions (e.g. plane waves) from which integrable solutions are built.</p>",
        "id": 500516165,
        "sender_full_name": "Winston Yin (尹維晨)",
        "timestamp": 1739914981
    },
    {
        "content": "<p>Quantum chemists would appreciate branching off from this into theories like Hartree Fock, LDA, and DFT. But exact solutions for the hydrogen atom make the most sense to do first, I think.</p>",
        "id": 500545260,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1739929593
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"416472\">@Winston Yin (尹維晨)</span>  Yeah, at some point all of this will need to be handled properly. Which may lead to difficulties - but for now getting some examples done is, I think the way to go.</p>",
        "id": 500564810,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1739942290
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/channel/479953-HepLean/topic/Hydrogen.20atom/near/500361624\">said</a>:</p>\n<blockquote>\n<p>I think the basic steps for the hydrogen atom would be:</p>\n<ol>\n<li>Write the Schrodinger equation for the hydrogen atom in Cartesian coordinates.</li>\n<li>Rewrite it in terms of spherical coordinates, with a corresponding lemma showing that solutions to one leads to solutions to the other.</li>\n<li>Split the spherical equation into a radial part and an angular part. Show that any solution to the full Schrodinger equation is the product of a solution from the radial and angular parts. </li>\n<li>Further split the angular part into an azimuthal and polar part.  Show that any solution to the full angular part is the product of a solution from the azimuthal and polar parts.</li>\n<li>Use special functions as mentioned by <span class=\"user-mention silent\" data-user-id=\"416472\">Winston Yin (尹維晨)</span> , to solve the radial, azimuthal and polar parts. </li>\n</ol>\n<p>I believe 1-4 would be possible now (with a bit of work). </p>\n<p>Eventually we would want a general framework for QM and Schrodinger equation's which sit ontop of all of this.</p>\n</blockquote>\n<p>I was a bit stupid in part of this message, you don't need to do the <code>Show that any solution....</code> parts, you just need to show completeness of solutions at the end, once you have them.</p>",
        "id": 500617233,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1739961476
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"424214\">Tyler Josephson ⚛️</span> <a href=\"#narrow/stream/479953-HepLean/topic/Hydrogen.20atom/near/500545260\">said</a>:</p>\n<blockquote>\n<p>Quantum chemists would appreciate branching off from this into theories like Hartree Fock, LDA, and DFT. But exact solutions for the hydrogen atom make the most sense to do first, I think.</p>\n</blockquote>\n<p>If any of y’all wanted to pursue this more deeply, I’d be happy to help write proposals to get funding for this sort of thing. I think “Formally verified quantum chemistry” is a kind of project that would get a lot of traction at various funding agencies (though who knows about the future of science funding in the US right now).</p>",
        "id": 500714120,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1739989144
    },
    {
        "content": "<p>I'm likely completely overloaded until at least June, so I can only give my moral support at the moment.</p>",
        "id": 500785314,
        "sender_full_name": "Winston Yin (尹維晨)",
        "timestamp": 1740021201
    },
    {
        "content": "<p>My knowledge of things like Hartree Fock, LDA and DFT isn't great. But I'd be interested in learning what you have in mind there Tyler. Maybe we could chat at some point?</p>",
        "id": 500797943,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1740030163
    },
    {
        "content": "<p>Regarding the more basics of QM I created a 'tracking issue' here:</p>\n<p><a href=\"https://github.com/HEPLean/PhysLean/issues/346\">https://github.com/HEPLean/PhysLean/issues/346</a></p>\n<p>Anyone should feel free to add more details, examples, references etc,  or attempt to do any of the points.</p>",
        "id": 500798054,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1740030254
    },
    {
        "content": "<p>I've done stuff with HF (have a paper on it, at least) .. and, to a lesser degree, DFT. I would be interested in collaborating on some 'verified quantum chemistry'</p>",
        "id": 502603262,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1740756195
    }
]