[
    {
        "content": "<p>This is just to make this community aware that PhysLean may be moving organisation again, this time to  <code>leanprover-community</code> where it will join with the QuantumInfo library run by <span class=\"user-mention\" data-user-id=\"448405\">@Alex Meiburg</span>  to form \"Physlib\" - a definitive library for physics in Lean. </p>\n<p>This decision has been made to help prevent fragmentation, with a similar concept to CSLib and Mathlib. </p>\n<p>This hopefully should not affect the experience of the average contributor to the project, though there may be some tweaking issues as this process takes place - for which I apologise.</p>",
        "id": 576280792,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1772204195
    },
    {
        "content": "<p>But e.g. <code>scipy</code> and <code>scikit-learn</code> are 2 separate libraries and they don't overlap as much, even though the latter is a subset of the former? In fact, <code>scipy</code> is a dependency of <code>scikit-learn</code>: <a href=\"https://github.com/scikit-learn/scikit-learn/blob/0731b161ada9ef8a610c70f20ce0a969fb949e0b/pyproject.toml#L11\">https://github.com/scikit-learn/scikit-learn/blob/0731b161ada9ef8a610c70f20ce0a969fb949e0b/pyproject.toml#L11</a>. Wouldn't it be more modular to keep them separate?</p>",
        "id": 576313433,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1772212792
    },
    {
        "content": "<p>In principle, there's no common code at the moment - neither one has the other as a dependency, and I'm not aware of any particularly duplicated efforts. But I believe that <em>in principle</em> they should have common ground and common development. At a minimum, some of the more specific stuff to Hilbert spaces and CPTP maps (for instance) would make sense to share between them.</p>\n<p>There's always room for more modularity, certainly. Isabelle's AFP, for instance, is <em>very</em> modular. But I think the big success of Mathlib has been precisely that it isn't modular, it's really trying to get everything together and tightly integrated, and that has been key to its success. I hope that eventually something similar can happen for physics. There's been a string of small \"standalone\" physics efforts lately which explicitly had zero interest in upstreaming anything, and there there definitely <em>has</em> been duplication of work, and/or poor or incompatible deifnitions, and I worry about a future where physics results end up scattered all over. (There are also projects that <em>are</em> trying to upstream and that causes me no worried, only happiness!)</p>",
        "id": 576379283,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1772244187
    }
]