[
    {
        "content": "<p>What are the things people would like to see added to PhysLean or changed about it over the next year, whether that is something about the content, infrastructure,  community, or something else entirely?</p>\n<p>From my side, I personally want to start working on Feynman diagrams again. I will soon be starting to organize a related workshop (more details to follow later). I would also like to see funds put in the right place so we can get a version of loogle and the Lean online working again for PhysLean.</p>",
        "id": 565510377,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1766840834
    },
    {
        "content": "<p>Wishing phenomenal growth in 2026 to this project and to all the contributors involved.</p>\n<p>Two non-techincal suggestions I have are as follows:</p>\n<ol>\n<li>Reach out: I think the mode of popular reachout (To the audience, which can volunteer or further popularize) can be examined. I am not sure about the concrete changes exactly, a lot of methods may be copied from the startups trying to reach customers and to become visible. One direct strategies that I can think of : <br>\nHave users of physlean apart from the maintainers make posts like \"I was able to incorporate the PhysLean APIs for .... and it helped me catch loopholes in my reasoning/formalize part of my paper etc\" or anything that highlights the applications of APIs in their research (for researchers) or better learning (for undergrads)<br>\nUser testimonials do significantly help startups get visibility and trust. This can also help PhysLean learn what MVP features prospective users need to incorporate PhysLean in their works till the APIs are completed.</li>\n</ol>",
        "id": 565513125,
        "sender_full_name": "Shlok Vaibhav",
        "timestamp": 1766844502
    },
    {
        "content": "<ol start=\"2\">\n<li>Quantifiable metrics: I think a good way to communicate the priorities that are in the minds of the maintainers is to build and track, whenever possible, certain quantifiable objective metrics that can be tracked every week or every zoom meet (much in a fashion how MNCs and startups track their ends). And having metrics also has a positive psychological effect and help enforce a sense of clarity to everyone as to what are the pressing goals and it is also something far more effective to market and communicate (Graph&gt;&gt;words)<br>\nAgain, I don't have an idea how this would work in an open-source environment or if such an approach is necessary but I personally find such quantifiable metrics made on my own side-projects and job pretty helpful, they generate precious data about the behaviour and energy-time usage patterns which can atleast help identify wasteful avenues or iterate metrics till they become more realistic.</li>\n</ol>",
        "id": 565513222,
        "sender_full_name": "Shlok Vaibhav",
        "timestamp": 1766844644
    },
    {
        "content": "<p>I would be very interested in finding some quantifiable metrics. Maybe this deserves a thread in its own right.</p>",
        "id": 565516737,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1766849746
    },
    {
        "content": "<p>A message was moved from this topic to <a class=\"stream-topic\" data-stream-id=\"479953\" href=\"/#narrow/channel/479953-PhysLean/topic/Metrics.20for.20PhysLean/with/565524751\">#PhysLean &gt; Metrics for PhysLean</a> by <span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span>.</p>",
        "id": 565524752,
        "sender_full_name": "Notification Bot",
        "timestamp": 1766860332
    }
]