[
    {
        "content": "<p>I was thinking of making a github action that automatically comments on PR's with a check list of basic things that should be done/checked for in a pull-request, and maybe a question about the usage of AI. I don't want this to become an over-burden, and it is as much to ensure the quality of my own PRs as anything else. </p>\n<p>Some examples of things may be: </p>\n<ul>\n<li>Updated the module doc-strings of any modules modified. </li>\n<li>Wrote comprehensive  module doc-strings for new modules added. </li>\n<li>Ensured that <code>theorem</code> is used only for important theorems, otherwise used <code>lemma</code>. </li>\n</ul>\n<p>If anyone has thoughts about what other items it would be good to include or is strongly against or for this, it would be great to hear your thoughts :).</p>",
        "id": 517434734,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1747028672
    },
    {
        "content": "<p>I had <a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/418\">FLT#418</a> which is probably now almost closed after <a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/424\">FLT#424</a> and <a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/427\">FLT#427</a> (I just didn't find the time to see which if any issues were remaining). But my checklist seems almost disjoint from yours.</p>",
        "id": 517443422,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747032446
    },
    {
        "content": "<p>Yeah, looking at yours Kevin, this seems like things that there are linters to cover. I'm kind of after things which are slightly more subjective, which the linters can't cover but which would still make a good PR.</p>",
        "id": 517444291,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1747032766
    },
    {
        "content": "<p>This PR contains what I currently have so far in this direction: </p>\n<p><a href=\"https://github.com/HEPLean/PhysLean/pull/552\">https://github.com/HEPLean/PhysLean/pull/552</a></p>",
        "id": 517562650,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1747059424
    },
    {
        "content": "<p>If this is a vibes thing rather than a mechanised thing then you could just make a checklist PR template like they have in core lean, they want you to tick the boxes promising that you've done various nice things before you add to their workload</p>",
        "id": 517564550,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747059763
    },
    {
        "content": "<p>Is that in fact exactly what the PR does?</p>",
        "id": 517564855,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747059822
    },
    {
        "content": "<p>Yes exactly - I didn't know that the core lean has this - so will take a look at their implementation.</p>",
        "id": 517565635,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1747059967
    },
    {
        "content": "<p>another possibly useful check (especially for theorems) could be adding the respective mathematical formula in Latex (with ideally a reference ) in the doc-text<br>\nand maybe also a consistent style for doc/texts. Perhaps a very dry textbook slyle 'let x be...' for docs/texts plus explanation of design choice for key defs</p>",
        "id": 517565944,
        "sender_full_name": "Matteo Cipollina",
        "timestamp": 1747060030
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/channel/479953-PhysLean/topic/Pull.20request.20checklists/near/517565635\">said</a>:</p>\n<blockquote>\n<p>Yes exactly - I didn't know that the core lean has this - so will take a look at their implementation.</p>\n</blockquote>\n<p>Actually sorry - not quite a PR template, but rather a bot that comments on the PR with the checklist. Maybe a template would be better.</p>",
        "id": 517566052,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1747060054
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"779253\">@Matteo Cipollina</span> I would prefer if the formula was written in UTF-8 as it is readable in more/all places made for Lean (I know in some cases this is extremely hard but I think it is something we can strive for). </p>\n<p>Maybe something like: </p>\n<ul>\n<li>For definitions and key theorems I have added, I have added an english-readable statement of the result, which is as self-contained as possible. </li>\n<li>Where appropriate and helpful I have included references to the original source of results. </li>\n</ul>\n<p>And maybe for the first one link to some examples.</p>",
        "id": 517569500,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1747060709
    }
]