[
    {
        "content": "<p>I found these two articles that explain the philosophy behind need (or futility) of metrics:</p>\n<ol>\n<li>\n<p><a href=\"https://www.linuxfoundation.org/resources/open-source-guides/measuring-your-open-source-program-success\">https://www.linuxfoundation.org/resources/open-source-guides/measuring-your-open-source-program-success</a><br>\n(Written for managers of projects with more emphasis on tracking performance)</p>\n</li>\n<li>\n<p><a href=\"https://opensource.guide/metrics/\">https://opensource.guide/metrics/</a> (Basic guide from GitHub)<br>\nI think I guess metrics best emerge in top-down fashion in an open-source environment, the manager has the highest amount of information and agency about the goals, stakes and resources at hand so as to decide what insights needs to be gained for decision making and how to monitor health of the project. Once this is decided, everyone can debate what exact metric or formula furnishes the required information most faithfully.</p>\n</li>\n</ol>",
        "id": 565521983,
        "sender_full_name": "Shlok Vaibhav",
        "timestamp": 1766857285
    },
    {
        "content": "<p><a href=\"#narrow/channel/479953-PhysLean/topic/Metrics.20for.20PhysLean/near/565521983\">A message</a> was moved here from <a class=\"stream-topic\" data-stream-id=\"479953\" href=\"/#narrow/channel/479953-PhysLean/topic/PhysLean.20in.202026/with/565516737\">#PhysLean &gt; PhysLean in 2026</a> by <span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span>.</p>",
        "id": 565524751,
        "sender_full_name": "Notification Bot",
        "timestamp": 1766860332
    },
    {
        "content": "<p>From my point of view, I think the most important metric to track (in terms of goals rather than e.g. usage) is the building of APIs. I made this a while ago:</p>\n<p><a href=\"https://physlean.com/APIs\">https://physlean.com/APIs</a></p>\n<p>But I don't think this is nearly as much detail as what would be necessary. Another metric to use would be the formalization of e.g. a book - as has been discussed with e.g. Landau and Lifshitz. </p>\n<p>One slight annoyance is that even building such metrics would require a lot of work (e.g. working out exactly what APIs we want, with what requirements etc, or theorems from books), that those processes in themselves likely benefit from their own metrics to measure progress and incentives. </p>\n<p>The other thing I was thinking in this direction is to set ourselves a goal for 2026 e.g. \"The addition of five informal results per week\" to the project, and to make a weekly announcement of what informal lemmas have been added and by who.</p>",
        "id": 565525095,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1766860798
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"917541\">@Shlok Vaibhav</span> (Also just pining you here as I moved this chat to a new thread, and not sure how e.g. notifications work when this is done)</p>",
        "id": 565525611,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1766861626
    },
    {
        "content": "<p>Maybe this is somewhere we could generally utilize GitHub issues more effectively.</p>",
        "id": 565536852,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1766879812
    }
]