[
    {
        "content": "<p>I would like to ask what's the intended scope for the E&amp;M section of PhysLean. Is it intended to start from more advanced concepts such as energy-stress tensors or fiber-bundles/gauge theory foundations (which I honestly don't know much about) or is it more inclined towards more \"standard\" university-level physics?</p>\n<p>I came across  this set of <a href=\"https://cab.unime.it/journals/index.php/lecture/article/view/334\">lecture notes</a> which I think might be a useful starting point, but I wanted to understand whether this level of results belongs here.</p>",
        "id": 510196019,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1743771547
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"890057\">@ZhiKai Pong</span> ,</p>\n<blockquote>\n<p>Is it intended to start from more advanced concepts such as energy-stress tensors or fiber-bundles/gauge theory foundations (which I honestly don't know much about) or is it more inclined towards more \"standard\" university-level physics?</p>\n</blockquote>\n<p>IMO, the intended scope has both of these. Let me try and explain:</p>\n<p>The E&amp;M section should be connected to more advanced concepts like gauge field theory (in the background). But it should also have more standard undergraduate level physics. These two things are <em>not</em> mutually exclusive. (Nothing about the more advanced concepts breaks the more standard undergrad approach).</p>\n<p>Ideally someone interested in the undergraduate-level physics should be able to access and contribute to this in PhysLean without having to worry about or know about gauge field theories. Additionally someone interested in gauge field theories should be able to see where for example the electric field comes from etc . I don't see why these two things are both not possible - and in fact the ability of have both of these in one library, and interconnected, is one of the main points of having a monolithic library for physics.</p>\n<p>Hopefully this makes sense. </p>\n<p>So to answer your other question:</p>\n<blockquote>\n<p>I came across this set of <a href=\"https://cab.unime.it/journals/index.php/lecture/article/view/334\">lecture notes</a> which I think might be a useful starting point, but I wanted to understand whether this level of results belongs here.</p>\n</blockquote>\n<p>This level of material absolutely does belong here.</p>",
        "id": 510202199,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1743773157
    },
    {
        "content": "<p>Thanks for the reply. I guess what I'm concerned about is there are a lot of levels (hierarchies? not sure what's the right word) in physics and any starting point seems kind of arbitrary. The mathlib people seem to put a lot of emphasis on \"the right level of generality\". If the answer to this is \"start anywhere, eventually we will be able to link things together\" then that's reassuring.</p>",
        "id": 510207164,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1743774455
    },
    {
        "content": "<p>Yes, as you say the answer is: \"start anywhere, eventually we will be able to link things together\".  Having something IMO is better than having nothing - as long as that something was done with care.</p>\n<p>But naturally don't define again things which are already there, for example the electric and magnetic field, or the definition of 'Space' or 'SpaceTime'.  We don't want 20 copies (or even 2) of exactly the same concept.</p>",
        "id": 510210292,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1743775177
    }
]