[
    {
        "content": "<p>Hi everyone,</p>\n<p>I’m a mathematics student at Imperial College London, currently studying <strong>quantum information and quantum computing</strong>, with a solid background in <strong>quantum mechanics</strong>.</p>\n<p>On the Lean side, I’ve worked on <strong>algebraic topology proofs</strong> (e.g. fundamental group of S¹ and path-based reasoning), so I’m familiar with the mathlib ecosystem.</p>\n<p>Recently I’ve been exploring how <strong>formal verification could be applied to quantum information</strong>, and I’ve started reading through the existing code in the <em>Lean-QuantumInfo</em> project. From what I can tell, the most natural foundation—both mathematically and physically—seems to lie around <a href=\"https://github.com/Timeroot/Lean-QuantumInfo/blob/main/QuantumInfo/Finite/Qubit/Basic.lean\"><code>QuantumInfo/Finite/Qubit/Basic.lean</code></a>.</p>\n<p>I’d like to <strong>confirm whether this is indeed a good place to start building formal verification structures</strong>, and hear thoughts on what kinds of definitions or theorems in quantum information might be meaningful to formalize next (for example, tensor product structures, quantum channels, or simple measurement postulates).</p>\n<p>Any advice or perspective on <strong>connecting formal verification ideas to quantum information theory</strong> would be greatly appreciated.</p>",
        "id": 544232285,
        "sender_full_name": "Ruize Chen",
        "timestamp": 1760123493
    },
    {
        "content": "<p>Quantuminfo has a dedicated channel here:<br>\n<a class=\"stream\" data-stream-id=\"508986\" href=\"/#narrow/channel/508986-Quantum-information\">#Quantum information</a> <br>\nso you can ask over there if you have more specific ideas.</p>\n<p>this conversation a while ago might be of interest:<br>\n<a class=\"stream-topic\" data-stream-id=\"479953\" href=\"/#narrow/channel/479953-PhysLean/topic/Quantum.20computing/with/542059709\">#PhysLean &gt; Quantum computing</a> </p>\n<p>where it was mentioned that some concepts might be useful in PhysLean as well, but I believe PhysLean has virtually nothing on this right now so depends on what direction you'd like to take :)</p>",
        "id": 544258282,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1760135736
    }
]