[
    {
        "content": "<p>On GitHub PhysLean currently lives under an 'organization' called 'HEPLean'. This is for historical reasons. But I've been thinking about the possibility of changing it. I think there are essentially four main options: </p>\n<ol>\n<li>Leave it as it is as <code>HEPLean</code></li>\n<li>Change it to something which is specific for example: <code>PhysLeanOrg</code></li>\n<li>Creating a general organization like: <code>leanprover-phys-community</code> or <code>leanprover-sci-community</code> and advocate for similar projects to be moved under the same github organization. (May help with long-term maintenance) </li>\n<li>Advocate for it to be moved under: <code>leanprover-community</code> </li>\n</ol>\n<p>Naturally 1 is easiest, and I think 2-4 each have their own advantages and disadvantages. I would be very glad to hear peoples thoughts.</p>",
        "id": 556998830,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1763452026
    },
    {
        "content": "<p>If it's just about naming, option 2 should be easy.<br>\nOption 3 is challenging but may open new opportunities for funding.<br>\nI'm not sure about option 4.</p>",
        "id": 557911138,
        "sender_full_name": "Alfredo Moreira-Rosa",
        "timestamp": 1763466984
    },
    {
        "content": "<p>I think for now we should leave it as HEPLean. But, the issue at hand is to start collecting all different projects under the same umbrella, to avoid the doubling of efforts and the scattering of  intent. In my opinion we should</p>\n<ul>\n<li>Know what are all the active projects</li>\n<li>Talk to their developers/maintainers about synchronizing efforts</li>\n<li>Build an organization for the community, like mathlib did. Doesn't have to be an FRO. Could be as simple as a US 501(c3). <br>\nI've heard about this point from various folks I've talked to, and it looks like people mostly agree that something like this has to happen. And, it will surely help with funding</li>\n</ul>",
        "id": 561482617,
        "sender_full_name": "Fabio Anzà",
        "timestamp": 1764697739
    },
    {
        "content": "<p>I had been putting together a list of projects here:</p>\n<p><a href=\"https://github.com/HEPLean/ITPsInPhysicsArchive\">https://github.com/HEPLean/ITPsInPhysicsArchive</a></p>\n<p>(to which PRs  are more then welcome). I agree with all the points here. Although I personally would be somewhat against making it anything formal like US 501(c3), basically because I don't think it is necessary, and I strongly suspect the existing <code>leanprover-community</code> isn't registered in formal any way.</p>\n<p>(I think we should probably be careful with the distinction between a <code>GitHub</code> organization and an organization as a legal entity, I was not careful in my initial message).</p>",
        "id": 561493354,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1764700924
    },
    {
        "content": "<p>Ah, I guess you were talking explicitly about a github organization in the tecnical sense. I interpreted it broadly. I think for this kinds of things we should make a decision based on whatever is less painful. I agree with <span class=\"user-mention\" data-user-id=\"942100\">@Alfredo Moreira-Rosa</span> that if it's just about naming, I'd go with option 2</p>",
        "id": 561501420,
        "sender_full_name": "Fabio Anzà",
        "timestamp": 1764703489
    }
]