[
    {
        "content": "<p>I'm thinking of putting together (or persuading someone else to put together) a webpage corresponding to 'A beginners guide to PhysLean'.  </p>\n<p>There is already a <a href=\"https://physlean.com/GetInvolved.html\">get involved</a> page but I don't think  this is too helpful for people who have never seen lean before. </p>\n<p>I'm also not wanting to reinvent the wheel - there are some great resources out there for Lean more generally, and I think these should be linked to rather than reproduced. </p>\n<p>Naturally it will link to the Natural numbers game, and <span class=\"user-mention\" data-user-id=\"424214\">@Tyler Josephson ⚛️</span>'s lectures. </p>\n<p>If anyone has suggestions of what would be useful here that would be great!<br>\nMaybe some sections like: \"Adding your first definition\", \"Creating a new file\", \"Adding documentation\"?</p>\n<p>I'm particularly interested in hearing from actual beginners on what would help here, and what would lead them to get more involved.</p>",
        "id": 509244051,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1743436954
    },
    {
        "content": "<p>I’ve been imagining, for a couple years now, a “Newton’s game” or something like that. The scaffold would be the natural number game, but the content would be physics.</p>",
        "id": 509245994,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1743437375
    },
    {
        "content": "<p>I don’t have anyone working on this at the moment though.</p>",
        "id": 509246046,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1743437385
    },
    {
        "content": "<p>I can give my perspective as someone who found the project recently but has decent Lean knowledge, so my thoughts are less about learning Lean and more about the specifics of the PhysLean project. </p>\n<ul>\n<li>The link to the curated notes is broken.</li>\n<li>The informal results graph is empty, not sure if that is intentional or if something is broken.</li>\n<li>The mini-projects and the Github issues/project board are what I found most helpful.</li>\n<li>Adding more details to issues and the project board would be very helpful in understanding what you are looking for, right now it's a little vague and cover a potentially large amount of content. Small and specific issues are easiest to work with.</li>\n<li>What is really helpful is if you can structure sorry-ed theorem definitions and we know exactly what you are looking for.</li>\n<li>One question I had which I'm not clear on is what we want to assume in each situation, like I was looking at the classical harmonic oscillator and it's not clear to me how the system is being solved. Like is it <code>ma = F = -kx</code> or conservation of energy or what? What are we taking as the most fundamental thing we assume and prove everything else with? I guess in some sense this is partly what we are figuring out, but it's very hard to think about structing a lean file without that information. (I expect this is a lot harder than the other items I've listed here)</li>\n</ul>",
        "id": 509336892,
        "sender_full_name": "Daniel Morrison",
        "timestamp": 1743471417
    },
    {
        "content": "<p>Many thanks for this Daniel! This is extremely useful. </p>\n<p>Let me address your comments in turn: </p>\n<ul>\n<li>The link to the curated notes is now fixed. </li>\n<li>Yeah the informal results graph is broken I think. I've removed the link to it from the website until it's fixed. Informal definitions and lemmas still appear in the <a href=\"https://physlean.com/TODOList\">TODO list</a>. </li>\n<li>Good to know the mini-projects and the Github issues/project board are useful.</li>\n<li>I understand that the lack of details in the issues and todos and project board etc is a fairly big problem. Some of them I only a vague idea of what is wanted (but I think even making this clear would be helpful). I plan to make an effort to go through and improve these sometime soon. </li>\n<li>I want to keep PhysLean sorry-free but I think <code>proof_wanted</code> is something which can be used here. There is an open issue regarding this <a href=\"https://github.com/HEPLean/PhysLean/issues/430\">here</a>. </li>\n<li>I think your last point may be solvable with better documentation. But yeah, I think this is part of the challenge of this whole project. In the actual case of the classical harmonic oscillator, currently nothing is being solved and there are some TODO items related to this.</li>\n</ul>\n<p>Thanks again Daniel!</p>",
        "id": 509362453,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1743485681
    },
    {
        "content": "<p>I've created an GitHub issue regarding the classical harmonic oscillator. See <a href=\"https://github.com/HEPLean/PhysLean/issues/436\">here</a>. There are a number of other modules where this sort of issue can be made.</p>",
        "id": 509387140,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1743495292
    },
    {
        "content": "<p>To help with improving details in issues and projects I've made it so that each <code>TODO</code> item has a unique tag so it can be uniquely referred to and linked to. For example: </p>\n<ul>\n<li><a href=\"https://physlean.com/TODOList#6VZG4\">TODO (6VZG4): file PhysLean.ClassicalMechanics.HarmonicOscillator.Basic</a></li>\n</ul>\n<p>This allows the creation of issues like <a href=\"https://github.com/HEPLean/PhysLean/issues/438\">this</a> - and hopefully issues regrading improvements of the TODO items.</p>",
        "id": 509408299,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1743501345
    },
    {
        "content": "<p>Concerning <code>proof_wanted</code> I've updated things so that you can now use <code>semiformal_result</code>. This is essentially the same as <code>proof_wanted</code> but it made so it appears in the TODO list, can handle definitions and accepts a <code>tag</code> (see above point). An example is:</p>\n<ul>\n<li><a href=\"https://physlean.com/TODOList#6V2FZ\">semiformal_result (6V2FZ): gaugeGroupℤ₆SubGroup</a> (Click the <code>See on GitHub</code> button to see the implementation).</li>\n</ul>\n<p>And I'm in the process of adding some more related to electromagnetism.</p>",
        "id": 509462067,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1743516469
    },
    {
        "content": "<p>This is a nice improvement! For tags, will it generate the labels for us or do we need to specify a label? If we need to specify the tag, is there a system to avoid duplicating tags?</p>\n<p>Also, if I can wish for something on the TODO list, it would be great to sort by TODO/informal def/informal lemma.</p>",
        "id": 509567866,
        "sender_full_name": "Daniel Morrison",
        "timestamp": 1743551284
    },
    {
        "content": "<p>You can generate tags with <code>lake exe make_tag</code>- which produces a tag based on time since the Unix epoch. There is also (as a back up) a system which checks for duplicate tags. </p>\n<p>I'll see what I can do regarding sorting.</p>",
        "id": 509603542,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1743571272
    },
    {
        "content": "<p>I've added filters to the TODO list to separate based on TODO, informal def etc.</p>",
        "id": 509615484,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1743577155
    },
    {
        "content": "<p>A section on github basics, e.g. how to setup PhysLean (just fork the repository?), how to create a new branch, how to push etc. is probably helpful</p>\n<p>Maybe something like <a href=\"https://leanprover-community.github.io/contribute/index.html\">https://leanprover-community.github.io/contribute/index.html</a> that outlines the overall workflow</p>",
        "id": 510225119,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1743778905
    },
    {
        "content": "<p>Some general comments as a beginner: currently  <code>SpaceTime</code> seems to be central to defining everything happening in \"our usual 3D space\", but the set up is quite obfuscated. If this is necessary then I feel like there should be documentation (and tutorial) to explain how things are defined and how to use definitions within it etc.</p>",
        "id": 510412706,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1743887421
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"890057\">@ZhiKai Pong</span> Agreed. The reason <code>SpaceTime</code> is set up in this way is so it works nicely with index notation. I agree this needs better documentation and a better API around it. Maybe this should be a short-term priority.</p>",
        "id": 510447755,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1743917187
    },
    {
        "content": "<p>Regarding the 'Beginners guide' this is what I have so far: </p>\n<p><a href=\"https://physlean.com/GettingStarted\">https://physlean.com/GettingStarted</a></p>\n<p>I might have gone a bit over-the-top with the colors.<br>\nIt's source files etc are located here:<br>\n<a href=\"https://github.com/HEPLean/PhysLean_Website\">https://github.com/HEPLean/PhysLean_Website</a></p>",
        "id": 510667566,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744031836
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/channel/479953-PhysLean/topic/What.20would.20be.20useful.20for.20a.20beginners.20guide.20to.20PhysLean/near/510447755\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"890057\">ZhiKai Pong</span> Agreed. The reason <code>SpaceTime</code> is set up in this way is so it works nicely with index notation. I agree this needs better documentation and a better API around it. Maybe this should be a short-term priority.</p>\n</blockquote>\n<p>Maybe <a href=\"https://notes.physlean.com\">https://notes.physlean.com</a> is a good place for us to put detailed documentation etc. related to space-time. I created an issue regarding this <a href=\"https://github.com/HEPLean/PhysLean_notes/issues/2\">here</a>.</p>",
        "id": 510671574,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744032692
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/channel/479953-PhysLean/topic/What.20would.20be.20useful.20for.20a.20beginners.20guide.20to.20PhysLean/near/510667566\">said</a>:</p>\n<blockquote>\n<p>Regarding the 'Beginners guide' this is what I have so far: </p>\n<p><a href=\"https://physlean.com/GettingStarted\">https://physlean.com/GettingStarted</a></p>\n<p>I might have gone a bit over-the-top with the colors.<br>\nIt's source files etc are located here:<br>\n<a href=\"https://github.com/HEPLean/PhysLean_Website\">https://github.com/HEPLean/PhysLean_Website</a></p>\n</blockquote>\n<p>Currently I don't think there's a link to the \"getting started\" page, might want a link from the get involved page (and maybe the PhysLean readme as well?)</p>",
        "id": 511273134,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1744238090
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"890057\">@ZhiKai Pong</span> . I added it to the readme as well as the get involved page.</p>",
        "id": 511319496,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744264328
    },
    {
        "content": "<p><a href=\"https://physlean.com/GetInvolved.html\">https://physlean.com/GetInvolved.html</a></p>\n<p>It's not displaying for me yet, is there a delay in the site updating?</p>",
        "id": 511346914,
        "sender_full_name": "ZhiKai Pong",
        "timestamp": 1744274149
    },
    {
        "content": "<p>Ugh, thanks for pointing this out. The website build failed, because there was a duplicate TODO tag in PhysLean. I've fixed this but it will take a couple of hours to update from here.</p>",
        "id": 511348402,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744274574
    },
    {
        "content": "<p>(Just made a related <a href=\"https://github.com/HEPLean/PhysLean/issues/465\">issue</a> which will prevent this).</p>",
        "id": 511349678,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1744274932
    }
]