[
    {
        "content": "<p>OK so I made some progress on the adele refactor in FLT but now I'm facing the issue that stuff is being PRed from FLT to mathlib and changes to mathlib are breaking FLT, so I would like to have FLT <code>main</code> and the mathlib branch <code>kbuzzard-finite-adele-ring-refactor</code> both depending on the same commit of mathlib <code>master</code>, which may as well be tag <code>v4.19.0-rc2</code> because this is what FLT <code>main</code> is on, and the mathlib branch <code>kbuzzard-finite-adele-ring-refactor</code> is behind this. In mathlib I tried</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>git checkout kbuzzard-finite-adele-ring-refactor\ngit rebase v4.19.0-rc2\n</code></pre></div>\n<p>and things looked good:</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>Successfully rebased and updated refs/heads/kbuzzard-finite-adele-ring-refactor.\n</code></pre></div>\n<p>But then if I try</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>git push\n</code></pre></div>\n<p>I get </p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>error: failed to push some refs to 'github.com:leanprover-community/mathlib4.git'\nhint: Updates were rejected because the tip of your current branch is behind\nhint: its remote counterpart. If you want to integrate the remote changes,\nhint: use 'git pull' before pushing again.\nhint: See the 'Note about fast-forwards' in 'git push --help' for details.\n</code></pre></div>\n<p>I'm confused about how after a merge the tip of my current branch can be behind its remote counterpart. If I try <code>git pull</code> I get another error:</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>hint: You have divergent branches and need to specify how to reconcile them.\nhint: You can do so by running one of the following commands sometime before\nhint: your next pull:\nhint:\nhint:   git config pull.rebase false  # merge\nhint:   git config pull.rebase true   # rebase\nhint:   git config pull.ff only       # fast-forward only\nhint:\nhint: You can replace \"git config\" with \"git config --global\" to set a default\nhint: preference for all repositories. You can also pass --rebase, --no-rebase,\nhint: or --ff-only on the command line to override the configured default per\nhint: invocation.\nfatal: Need to specify how to reconcile divergent branches.\n</code></pre></div>\n<p>I am confused now because I thought I already rebased. Is the idea that I need to rebase both <code>kbuzzard-finite-adele-ring-refactor</code> and <code>origin/kbuzzard-finite-adele-ring-refactor</code> separately??</p>",
        "id": 510376718,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1743862265
    },
    {
        "content": "<p>Okay, so what you did wasn't a merge but a rebase</p>",
        "id": 510380448,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1743864912
    },
    {
        "content": "<p>That means you took the commits on your branch and replayed them on top of ´v4.19.0-rc2`, but now there's no longer a connection between the new commits and the old ones, as far as git is concerned</p>",
        "id": 510380539,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1743864966
    },
    {
        "content": "<p>Short answer if it's fine to use <code>git push -f origin kbuzzard-finite-adele-ring-refactor</code></p>",
        "id": 510380575,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1743865005
    },
    {
        "content": "<p>It's slightly better to internalize using <code>git push --force-with-lease</code> instead at this point (the help has details on what the difference is, but basically it is designed for exactly this case of \"I rebased or added some stuff on top, but the thing in GitHub should exactly match what I'm pushing\" -- but if that <em>weren't</em> the case and someone had been collaborating with you and put other commits on top of your branch unknowingly, it will not wipe out their wok.)</p>",
        "id": 510381872,
        "sender_full_name": "Julian Berman",
        "timestamp": 1743865917
    }
]