[
    {
        "content": "<p>Right now we have ongoing miniprojects on adeles, Haar characters, Fujisaki's lemma, Quaternion algebras and Hecke operators. Each one of them is proceding nicely. But is anyone using at the blueprint graphs for these miniprojects? They are here: <a href=\"https://imperialcollegelondon.github.io/FLT/blueprint/dep_graph_chapter_8.html\">Adeles</a>,  <a href=\"https://imperialcollegelondon.github.io/FLT/blueprint/dep_graph_chapter_9.html\">Haar characters</a>, <a href=\"https://imperialcollegelondon.github.io/FLT/blueprint/dep_graph_chapter_10.html\">Fujisaki's lemma</a>, <a href=\"https://imperialcollegelondon.github.io/FLT/blueprint/dep_graph_chapter_11.html\">Quaternion algebras</a> and <a href=\"https://imperialcollegelondon.github.io/FLT/blueprint/dep_graph_chapter_12.html\">Hecke Operators</a>. </p>\n<p>I am wondering whether we should ditch these graphs, and go back to \"one graph for the entire project\". I don't use the graphs, I look through the code for sorries to find out what needs doing because each project is relatively self-contained. But will other people be upset if I remove these graphs from the website?</p>\n<p>The motivation is that I'm unhappy that currently it's really difficult to figure out how progress is going in the proof of FLT by looking at graphs.</p>",
        "id": 535816465,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1755967067
    },
    {
        "content": "<p>Can't we have both ways? Like some automatic graph stitching code that puts them all together?</p>",
        "id": 535818411,
        "sender_full_name": "Django Peeters",
        "timestamp": 1755969548
    },
    {
        "content": "<p>I guess the answer to that is: in theory yes, in practice someone would have to write that code and get Patrick to merge it, and so for me by far the simplest option is what I suggested above. Code which glues graphs from different sections together would be a much better solution but is a much bigger problem.</p>",
        "id": 535818710,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1755969911
    },
    {
        "content": "<p>I haven't looked at them for</p>",
        "id": 535819565,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1755970985
    },
    {
        "content": "<p>a long time - would certainly be nice have more insight in where we're going :)</p>",
        "id": 535819587,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1755971007
    },
    {
        "content": "<p>Asked Copilot to vibe code something quick - <a href=\"https://red-berget-83.tiiny.site/\">https://red-berget-83.tiiny.site/</a> Does that look like what you are envisioning? It is all sorts of hacky (parsing with regexp, etc) but also these days it is amazingly quick to get prototypes like this done - see <a href=\"https://github.com/rkirov/FLT/tree/vibe-viz\">https://github.com/rkirov/FLT/tree/vibe-viz</a> (I just wrote a few comments and TS interfaces).</p>\n<p>No idea why most edges seem to be missing? Is it a parsing issue with the script or they are not in the .tex files? I still feel there needs to be a system the seamlessly switches to the more reliable symbol dep graph from .lean files once they are exist and compile. But with namespaces symbol resolution is more complex there and probably will need actual compiler help.</p>\n<p>Is the spring-repusle viz any good for deps visualization, or graphviz Dot layout is better?</p>",
        "id": 535877900,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1756006379
    },
    {
        "content": "<p>So this is displaying (some form of) the entire blueprint graph, which is exactly what I don't want displayed. </p>\n<p>What I think the FLT graph should look like right now is <em>only</em> this <a href=\"https://imperialcollegelondon.github.io/FLT/blueprint/dep_graph_chapter_2.html\">https://imperialcollegelondon.github.io/FLT/blueprint/dep_graph_chapter_2.html</a> , however what I think it should look like in a week or two's time is the union of this and another similar-sized graph which I will have made in a different section. The four or 5 graphs I linked to above are also one other (paper-sized) project but they are a \"bottom-up\" contribution, so different to the \"top-down\" map which I linked to above, which has the FLT node.</p>",
        "id": 535888671,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1756023165
    },
    {
        "content": "<p>Oh, that sounds harder</p>",
        "id": 535900400,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1756039727
    },
    {
        "content": "<p>When the next file is written I'll be able to better explain the visualisation I would like for FLT. Working on it!</p>",
        "id": 535919361,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1756061354
    },
    {
        "content": "<p>Would it be possible to add a percentage to the graphs. e.g. How much of the graph is complete? (Estimated)</p>\n<p>Or maybe more useful, estimation of how many lines of code each node will take (roughly) and how much has been done. </p>\n<p>It's hard to see from the graphs, how far the project is along and how much there is more to do. </p>\n<p>(Or even a difficulty level for each section). </p>\n<p>Good luck.</p>",
        "id": 536530533,
        "sender_full_name": "Mr Proof",
        "timestamp": 1756356873
    }
]