[
    {
        "content": "<p>I don't know so much about elliptic curves or modularity. But maybe someone can help me understand whether characteristic classes get used along the way to proving FLT.</p>",
        "id": 467709707,
        "sender_full_name": "Dean Young",
        "timestamp": 1725507168
    },
    {
        "content": "<p>Let me add that I would be excited to see progress on characteristic classes - regardless of whether they would be used for FLT. (I'm not sure if all prerequisites are present: for instance, mathlib doesn't have singular or de Rham cohomology yet.)</p>",
        "id": 467753673,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1725523554
    },
    {
        "content": "<p>FWIW, I don't think characteristic classes of vector bundles play any role in FLT, at least not in the version of the proof that Kevin wants to formalise. But there are certainly lots of other reasons why one might care about them, as Michael points out.</p>",
        "id": 467774106,
        "sender_full_name": "David Loeffler",
        "timestamp": 1725527343
    },
    {
        "content": "<p>Ok. I am going to make a post on the Chern-Weil theory thread in October detailing my goals with them. I am interested in the Chern homomorphism most of all.</p>\n<p>It would be nice to \"glue in\" at various points, maybe the (algebraic) ones in the Chern-Weil thread. If it's modular that way that could be a win-win.</p>\n<p><span class=\"user-mention\" data-user-id=\"481963\">@David Loeffler</span> -<br>\nso, that includes algebraic vector bundles, right?</p>",
        "id": 467883121,
        "sender_full_name": "Dean Young",
        "timestamp": 1725547233
    },
    {
        "content": "<p>Characteristic classes in etale cohomology, for algebraic varieties, do play a role in some \"FLT-adjacent\" work. E.g. Flach's 1992 paper, which apparently was the starting point for Wiles' first, unsuccessful approach to Fermat, uses the etale Chern class for K_1 of a product of curves. There is a huge industry of subsequent work (some of it by me!) pursuing this approach in other contexts. But I think this theory does not play a role in the second, Taylor-Wiles patching approach to FLT.</p>",
        "id": 467910988,
        "sender_full_name": "David Loeffler",
        "timestamp": 1725552840
    },
    {
        "content": "<p>Thanks for your help Professor Loeffler. </p>\n<p>Maybe someone will set some goalposts for characteristic classes (Chern/Stieffel Whitney, Todd/Euler). </p>\n<p>For example the singular cohomology axioms would be a great idea.</p>",
        "id": 467916130,
        "sender_full_name": "Dean Young",
        "timestamp": 1725554153
    },
    {
        "content": "<p>There's a loooong distance between characteristic classes in algebraic topology, and the proof of FLT, imo.</p>",
        "id": 468004430,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1725578998
    },
    {
        "content": "<p>Once things have passed into the world of Galois representations, it feels to me that Chern–Weil theory doesn't get a look-in.</p>",
        "id": 468005640,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1725579363
    }
]