[
    {
        "content": "<p>I noticed that the FLT docs contain mathlib declarations (e.g., <a href=\"https://imperialcollegelondon.github.io/FLT/docs/Mathlib/Data/Nat/Prime/Infinite.html#Nat.exists_infinite_primes\">https://imperialcollegelondon.github.io/FLT/docs/Mathlib/Data/Nat/Prime/Infinite.html#Nat.exists_infinite_primes</a>), but don't let you search for mathlib declarations (e.g., type \"Nat.exists_infinite_primes\" in the search box). Whereas this works fine on the sphere eversion project (e.g., type \"Nat.exists_infinite_primes\" in the search box here: <a href=\"https://leanprover-community.github.io/sphere-eversion/docs/\">https://leanprover-community.github.io/sphere-eversion/docs/</a>). I think this is problematic if we want upstreamed theorems in the FLT blueprint to point to mathlib.</p>",
        "id": 564764272,
        "sender_full_name": "Thomas Browning",
        "timestamp": 1766172772
    },
    {
        "content": "<p>Same issue in the Brownian motion project, although it's not consistent. Sometimes it suddenly works again after a commit, and then breaks again after a few more (but I haven't seen it work in a while).</p>",
        "id": 564764986,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1766173057
    },
    {
        "content": "<p>We believe that this could be due to an issue with the way that doc-gen output is cached in CI. The search functionality is powered by declarations-data.bmp which is one of the outputs of doc-gen. I've unfortunately not yet been able to figure out what exactly is causing caching to fail here. The reason you are observing the issue only transiently is that at some point something will actually trigger the declaration-data to be rebuild properly and then everything works again.</p>",
        "id": 565087564,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1766452224
    },
    {
        "content": "<p>(FWIW this is very low-priority for me personally: I never use the FLT docs at all, but obviously other people and other projects might well care about this)</p>",
        "id": 565088557,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1766453445
    },
    {
        "content": "<p>I investigated this. The issue is in docgen-action's caching logic.</p>\n<p>The cache saves <code>doc/Mathlib/*.html</code> etc, but not <code>doc-data/*.bmp</code> (per-module declaration data). When cache hits, Lake sees HTML exists and skips <code>doc-gen4 single</code>, so the <code>.bmp</code> files aren't regenerated. The index then only contains project-specific declarations.</p>\n<p>The issue only appears transiently because dependency bumps change <code>lake-manifest.json</code>, which invalidates the cache key, triggering fresh builds that work correctly.</p>\n<p>Fixed in <a href=\"https://github.com/leanprover-community/docgen-action/pull/17\">https://github.com/leanprover-community/docgen-action/pull/17</a></p>",
        "id": 566257389,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1767569517
    },
    {
        "content": "<p>What were the two hardest problems in software engineering again? <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 566257897,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767570147
    }
]