[
    {
        "content": "<p>I am unclear about how much stuff from the FLT project should be in mathlib. For example, the Frey curve is an elliptic curve which doesn't exist. You build it from a counterexample to FLT (easy) and then you prove that it has too many nice properties to actually exist (2000 pages of hard work). Do we want the Frey curve in mathlib? I'm very very happy to start PRing. No doubt there will be some \"work in progress\" stuff in the FLT repo which is nowhere near mathlib-ready, but the Frey curve stuff will certainly be ready and stable quite soon; the point is that it's not really a thing which is useful for anything but FLT, and it's certainly not studied independently. The main but straightforward theorem is that the p-torsion in the Frey curve coming from a counterexample a^p+b^p=c^p from FLT has lots of very nice properties, and the hard theorem is that nothing has these properties.</p>",
        "id": 436489477,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714565385
    },
    {
        "content": "<p>I would suggest the Frey curve stays in FLT!</p>",
        "id": 436489654,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1714565491
    },
    {
        "content": "<p>Frey curves are used to solve other diophantine equations, too (e.g., of generalised Fermat type), so it would be reasonable to have some results about them in Mathlib eventually.</p>",
        "id": 436489681,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1714565507
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"479359\">@Michael Stoll</span> you might then have some opinions about my formalisation of it, because I demanded some congruences on A,B,C mod powers of 2 and then specifically used the global minimal model rather than Y^2=X(X-A)(X+B).</p>",
        "id": 436489831,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714565600
    },
    {
        "content": "<p>I think it is fine to first do it with the specific form needed for FLT and later think about how to generalise it so that it will be useful in other situations. My point is that we should keep this in mind (and so maybe try to keep the statements as general as possible if this can be done without sacrificing simplicity).</p>",
        "id": 436490026,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1714565755
    },
    {
        "content": "<p>Silly question: isn't the whole point that Frey curves are impossible objects? In that case, what applications would they have except in their nonexistence?</p>",
        "id": 436524504,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1714578209
    },
    {
        "content": "<p>To me this suggests that Frey curves are a concept limited in usefulness to the proof of FLT, and we should try to make as many theorems not specific to them as possible (except for the ones along the \"spine\" of the contradiction proof), so that they can be used even outside the contradictory context used for most of FLT</p>",
        "id": 436524873,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1714578352
    },
    {
        "content": "<p>Maybe the <code>Counterexamples</code> folder of mathlib is a good place for Frey curves to live?</p>",
        "id": 436524947,
        "sender_full_name": "Rida Hamadani",
        "timestamp": 1714578367
    },
    {
        "content": "<p>only if we're willing to upstream all of FLT to <code>Counterexamples</code>...</p>",
        "id": 436524997,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1714578390
    },
    {
        "content": "<p>First division by zero, now counterexamples to FLT: sometimes formalisation seems like it wants people to laugh at it...</p>",
        "id": 436531430,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1714580603
    },
    {
        "content": "<p>I take a maximalist view of the scope of mathlib: FLT is known mathematics that might occasionally get applied in other proofs, so it belongs in mathlib proper (not <code>Archive</code> or <code>Counterexamples</code>), and thus all its dependencies belong in mathlib proper as well; the main question is how to tell when such dependencies are ready to go in mathlib.</p>",
        "id": 436571532,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1714596999
    },
    {
        "content": "<p>In my opinion it is rather important to not let the <code>for_mathlib</code> folder becoming gigantic, by PRing stuff to mathlib. This of course slow down the project a little, but in the long run it pays off. Otherwise bumping mathlib can be a very tedious and time consuming job.</p>",
        "id": 436572680,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1714597516
    },
    {
        "content": "<p>My plan was not to let it ever have size more than epsilon. Right now we have some work on Hopf algebras which Amelia is PRing to mathlib. Please feel free to review <a href=\"https://github.com/leanprover-community/mathlib4/pull/11962\">#11962</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/11970\">#11970</a> !</p>",
        "id": 436574201,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714598148
    },
    {
        "content": "<p>I think that with things like LTE it was tempting to grow <code>for_mathlib</code> when the end became in sight; however the end will not be in sight for many years here.</p>",
        "id": 436574286,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714598178
    },
    {
        "content": "<p>It might be good to work out how to maintain a visible / rewarding-to-look-at PR queue for FLT relevant stuff.</p>",
        "id": 436586009,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1714604367
    },
    {
        "content": "<p>Maybe just an FLT label for Mathlib PRs?</p>",
        "id": 436586020,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1714604374
    },
    {
        "content": "<p>That way reviewers who are excited about FLT can review those first.</p>",
        "id": 436586112,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1714604409
    },
    {
        "content": "<ul>\n<li>a topic in this stream where FLT-relevant mathlib PRs can be mentioned</li>\n</ul>",
        "id": 436586189,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1714604442
    }
]