[
    {
        "content": "<p>I ran <code>leanblueprint web</code> on the command line on FLT and looked carefully at the output. To my surprise there were some ERRORs about unresolved labels (which I am now in the process of fixing; these are declarations whose name has changed but I'm still talking about them in \\uses), and then there are some WARNINGs which I can't understand: </p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>...\nINFO: Using the vector imager \"dvisvgm\".\n [ index.html [ sect0001.html ] [ ch_reductions.html\nWARNING: Using default renderer for underline\nWARNING: Bibliography item \"mazur-torsion\" has no entry\n ] [ ch_frey.html\nWARNING: Bibliography item \"silverman1\" has no entry\nWARNING: Bibliography item \"silverman2\" has no entry\nWARNING: Bibliography item \"ddt\" has no entry\nWARNING: Bibliography item \"edix\" has no entry\nWARNING: Bibliography item \"edix\" has no entry\nWARNING: Bibliography item \"katz-mazur\" has no entry\nWARNING: Bibliography item \"mazur-torsion\" has no entry\nWARNING: Bibliography item \"serrepropgal\" has no entry\nWARNING: Bibliography item \"serrepropgal\" has no entry\n ] [ ch_overview.html\nWARNING: Bibliography item \"moret-bailly\" has no entry\nWARNING: Bibliography item \"taylor-mero-cont\" has no entry\nWARNING: Bibliography item \"toby-modularity\" has no entry\nWARNING: Bibliography item \"blggt\" has no entry\n ] [ sect0002.html ] [ sect0003.html ] [ sect0004.html ]\n [ Adele_miniproject.html ] [ Haar_char_project.html ]\n [ Fujisaki_project.html\nWARNING: Bibliography item \"voightbook\" has no entry\n ] [ Quat_alg_project.html ] [ ch_bestiary.html\nWARNING: Bibliography item \"cf\" has no entry\nWARNING: Bibliography item \"serre-galcoh\" has no entry\nWARNING: Bibliography item \"serre-galcoh\" has no entry\nWARNING: Bibliography item \"serre-galcoh\" has no entry\nWARNING: Bibliography item \"serre-galcoh\" has no entry\nWARNING: Bibliography item \"serre-galcoh\" has no entry\nWARNING: Bibliography item \"cf\" has no entry\nWARNING: Bibliography item \"corvallis1\" has no entry\nWARNING: Bibliography item \"corvallis1\" has no entry\nWARNING: Bibliography item \"corvallis2\" has no entry\nWARNING: Bibliography item \"mazur-torsion\" has no entry\nWARNING: Bibliography item \"moret-bailly\" has no entry\n ] [ sect0005.html ] ]pre-processing DVI file (format version 2)\nprocessing page 1\n...\n</code></pre></div>\n<p>One might imagine from these warnings that I've messed up with the bibliography somehow, but everything seems to work fine; for example <code>serre-galcoh</code> is Serre's book on Galois cohomology and all 5 warnings above seem to correspond to links which work fine in both the pdf and the web version of the blueprint (see for example the <a href=\"https://imperialcollegelondon.github.io/FLT/blueprint/ch_bestiary.html#local_galois_coh_finite\">proof of Theorem 12.4</a> ). Right now I propose fixing the errors but ignoring the warnings. I've seen LaTeX warnings about references before when a document is being compiled during the latex; latex; bibtex; latex dance, however the warnings are just at the beginning of the dance and disappear later. The warnings I quote above seem to occur right at the end of the web compilation process so I was surprised.</p>",
        "id": 517616480,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747071157
    },
    {
        "content": "<p>I think I've been similarly confused in the past</p>",
        "id": 517632858,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1747075481
    },
    {
        "content": "<p>I do not see the warning <code>WARNING: Bibliography</code> either locally or in the log of the GitHub Actions workflow <a href=\"https://github.com/ImperialCollegeLondon/FLT/actions/runs/14979648977/job/42080469810#step:10:2122\">here</a>. I can't reproduce that.</p>",
        "id": 517652646,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1747080961
    },
    {
        "content": "<p>Oh that's weird! You're right that they are not visible in the logs.</p>",
        "id": 517797365,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747133844
    },
    {
        "content": "<p>plasTeX relies on LaTeX to generate bbl files, so you need to compile everything. <code>leanblueprint all</code> should do that.</p>",
        "id": 517806755,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1747136685
    },
    {
        "content": "<p>Simply running <code>leanblueprint pdf</code> before <code>leanblueprint web</code> should be enough actually.</p>",
        "id": 517807940,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1747137003
    },
    {
        "content": "<p>This does not make the warnings go away for me. Given that they are not there in the CI logs and that Pietro doesn't see them, this is clearly a \"me\" problem. But I am not remotely bothered about it; the only reason I even mentioned it was that I noticed them and thought \"I should fix them\" and then I realised that they didn't seem to be broken and I was confused.</p>",
        "id": 517815126,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747138854
    }
]