[
    {
        "content": "<p>Hello, this is just a quick advert about the Lean--<a href=\"https://www.lmfdb.org/\">LMFDB</a> project that we've started. The plan is to focus on formalising lots of the definitions relating to number fields, modular forms and elliptic curves. So since this is maybe also of interest to people in the FLT stream I thought I'd post a link to the <a class=\"stream\" data-stream-id=\"530229\" href=\"/#narrow/channel/530229-LMFDB\">#LMFDB</a>! stream in case anyone is interested.</p>",
        "id": 541263779,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1758728743
    },
    {
        "content": "<p>Nice project, I will be happy to collaborate!</p>",
        "id": 541270471,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1758730329
    },
    {
        "content": "<p>I'd be interested to contribute!</p>",
        "id": 541270931,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1758730457
    },
    {
        "content": "<p>Wonderful! There is plenty to do. I am working on a list of nice starter things, but for example there are several number field definitions that should be relatively easy to do given what we already have.</p>",
        "id": 541270950,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1758730461
    },
    {
        "content": "<p>There is a WIP blueprint <a href=\"https://cbirkbeck.github.io/LeanBridge/\">here</a></p>",
        "id": 541271145,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1758730505
    },
    {
        "content": "<p>Wooah a blueprint! I would love to chat about this and I'm happy for you to advertise the project here in the FLT channel (indeed, you asked me beforehand if this was OK) but I wonder if chat would be more easily findable in a different place.</p>",
        "id": 541275750,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1758731751
    },
    {
        "content": "<p>Yes so, we have a channel here: <a class=\"stream\" data-stream-id=\"530229\" href=\"/#narrow/channel/530229-LMFDB\">#LMFDB</a> which we are going to use for the project, so thats maybe the natural place. It also has the added benefit of tunneling out to the LMFDB zulip channel. One of the goals is to try and bring these two communities closer together.</p>",
        "id": 541281139,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1758733083
    }
]