[
    {
        "content": "<p>The FLT project dashboard containing the current list of tasks is <a href=\"https://github.com/orgs/ImperialCollegeLondon/projects/102\">here</a> . Instructions on how to claim and work on a task are <a href=\"https://github.com/ImperialCollegeLondon/FLT/blob/main/CONTRIBUTING.md\">here</a>. </p>\n<p>I've just created 13 new tasks (i.e. sorried theorems) around restricted products and group theory, needed to construct the key Hecke algebras used in the R=T theorem. I've also just merged an <a href=\"https://imperialcollegelondon.github.io/FLT/blueprint/HeckeOperator_project.html\">entire new miniproject</a> on Hecke algebras to the blueprint. My motivation is that I want to say \"We have a definition of the Hecke algebra which sorries no data\" in my Big Proof talk a week tomorrow. Here's a desciption of the new tasks.</p>\n<ul>\n<li><a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/563\">FLT#563</a> is a straightforward lemma in topological group theory.</li>\n<li><a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/568\">FLT#568</a> is the claim that restricted products wrt open subsets commute with binary products (what happens if the subsets are not open I don't know, and I haven't found anyone who knows, but we don't need it). Detailed proof in blueprint.</li>\n<li><a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/569\">FLT#569</a> is me not being very good at <code>filter_upwards</code>a.k.a. finite intersection of things in a filter are in a filter.</li>\n<li><a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/570\">FLT#570</a> is the claim that restricted products commute with finite products so on paper it's \"induction, given the binary case above\".</li>\n<li><a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/571\">FLT#571</a> is the claim that restricted products commute with \"take m x n matrices\" but because matrices are <code>m -&gt; n -&gt; X</code> not <code>m x n -&gt; X</code> it will no doubt be fiddly to deduce this from <a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/570\">FLT#570</a>.</li>\n<li><a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/581\">FLT#581</a> is a fun topology lemma: units of an arbitrary product of topological monoids is homeomorphic to a product of units. Detailed proof in the blueprint.</li>\n<li><a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/582\">FLT#582</a> is the same statement but for restricted products; paper proof in blueprint is \"a morphism of topological groups is continuous iff it's continuous at 1, which reduces us to <a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/581\">FLT#581</a>\". Again this might be fiddly in Lean, not sure.</li>\n<li><a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/583\">FLT#583</a> probably needs some more LaTeX and some more sublemmas. It's the proof that a certain adelic subgroup is compact and open. In the blueprint I actually work with a more general class of subgroups which is probably what we should be working with. Anyone who wants to work on this should probably contact me directly for more info rather than diving in; this could probably be split up into several smaller tasks.</li>\n<li><a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/584\">FLT#584</a> is the statement that two Hecke operators at a bad prime commute; it is some slightly delicate group theory using some machinery (of being an internal direct product) which I've only just written and isn't really battle-tested so again if someone is interested in this task then they should probably talk to me rather than diving in.</li>\n<li><a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/585\">FLT#585</a> is the proof that the Hecke algebra is commutative. This should be straightforward if my machine to prove that Hecke operators commute actually works. </li>\n<li>In contrast to the last three perhaps large projects, <a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/586\">FLT#586</a> is a straightforward bit of API: fixed points of a G-action on an R-module are an R-submodule.</li>\n<li><a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/587\">FLT#587</a> is a straightforward piece of topological algebra: units of an open submonoid of a topological monoid are an open subgroup of the units of the monoid. Proof in the blueprint.</li>\n<li>Finally <a href=\"https://github.com/leanprover-community/mathlib4/pull/588\">#588</a> is an equally straightforward piece of topological algebra: units of a compact submonoid of a Hausdorff topological monoid are a compact subgroup of the units. Is this true without Hausdorff? I don't have a counterexample but my proof doesn't work (and I only need it in the Hausdorff case).</li>\n</ul>",
        "id": 521485446,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1748735113
    }
]