[
    {
        "content": "<p>Hi, I was wondering if the FLT project could use help on the \"project management/overview\" side.</p>\n<p>I was looking at the FLT blueprint, and questions such as \"who is/will be working on this chunk\", \"what's currently actually in progress\", \"what are the approximate timelines\", \"what PR or Zulip thread to follow for any specific chunk\"... were difficult to infer. I imagined a scenario where all this information was available from the blueprint itself and could be easily answered and navigated to -- if these sorts of features are something that you feel might be useful, I'd be happy to explore how to enhance the blueprint and make it more information-rich and interactive.<br>\n(Tagging <span class=\"user-mention\" data-user-id=\"556875\">@Pietro Monticone</span> as I saw his name on Github in relation to the blueprint.) Thank you for your consideration; happy to chat more.</p>",
        "id": 436484253,
        "sender_full_name": "Dragan Okanovic",
        "timestamp": 1714562196
    },
    {
        "content": "<p>yeah I've been doing other things this morning. The idea is to run it the way that other projects have been run recently. The answer to all your questions is \"look at the thread on this stream which doesn't exist yet\". See for example <a href=\"#narrow/stream/423402-PrimeNumberTheorem.2B/topic/Outstanding.20Tasks.2C.20V5/near/426130159\">this post</a> on another project.</p>",
        "id": 436485267,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714562923
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>, you might address this specifics of this offer --- I think software tooling to allow people to claim and unclaim things from the \"what next\" list could be helpful.</p>\n<p>Although simply posting each bullet point as a separate post and using zulip emojis may be sufficient!</p>",
        "id": 436485703,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1714563212
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"459648\">@Dragan Okanovic</span> I am still really frustrated right now by the fact that loads of links are broken for me (but not for everyone) and I'm finding it very difficult to navigate around my own project; this is something to do with cookies apparently, but I've tried clearing lots of cookies and this hasn't solved the problem.</p>\n<p>How about I get this sorted out and then I show you what my (naive) plans are by actually posting the first \"outstanding tasks\" post, and then you can take a look at what's going on and tell me a better way to manage things.</p>",
        "id": 436487509,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714564235
    },
    {
        "content": "<p><a href=\"#narrow/stream/416277-FLT/topic/Outstanding.20Tasks.2C.20V1/near/436488903\">https://leanprover.zulipchat.com/#narrow/stream/416277-FLT/topic/Outstanding.20Tasks.2C.20V1/near/436488903</a></p>",
        "id": 436488918,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714565034
    },
    {
        "content": "<p>I had to close every github-related tab on my browser to get things working, so sorry to all the people I was in the middle of reviewing PRs for :-/</p>",
        "id": 436488996,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714565071
    },
    {
        "content": "<p>I didn't mean to put additional unnecessary pressure; I apologize for the somewhat unfortunate timing with my message.</p>\n<p>My proposal would be to assign a \"ticket\" to each node in the blueprint.</p>\n<p>Each ticket would have:</p>\n<ul>\n<li>an ID (so it can be easily referenced in conversation and with URLs)</li>\n<li>description and additional details (what's already in the blueprint basically)</li>\n<li>current assignee(s) (people that \"claimed\" work items)</li>\n<li>status (what colors in the blueprint signify), but maybe also with a short summary of the current state</li>\n<li>a link to a running Zulip thread specific to that ticket only</li>\n<li>optional: start and end date</li>\n</ul>\n<p>All this information could live within the FLT Github repo, i.e. that would still be a single source of truth. We could update details via PRs, or we could try to make an actual blueprint interactive and be able to make updates from its UI directly (automatically creating and merging PRs behind the scenes).</p>\n<p>We could even set up things so that each Github PR that references a particular ticket ID, gets linked to it as well and can be discovered from within the ticket.</p>",
        "id": 436491020,
        "sender_full_name": "Dragan Okanovic",
        "timestamp": 1714566307
    },
    {
        "content": "<p>Yeah, recording these details in the blueprint repo is <em>way</em> too much overhead.</p>",
        "id": 436491143,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1714566369
    },
    {
        "content": "<p>I think we should look at what worked well for PNT, and then incrementally improve from there.</p>",
        "id": 436491182,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1714566392
    },
    {
        "content": "<p>Adding and removing emojis on zulip is about the level of activation energy appropriate for claiming and releasing tasks.</p>",
        "id": 436491234,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1714566421
    },
    {
        "content": "<p>But it would be better if this could be integrated into something dependency-graph-like.</p>",
        "id": 436491271,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1714566436
    },
    {
        "content": "<p>I see. Here's what I can try to do as the next steps:</p>\n<ul>\n<li>talk with Alex about PNT and learn more about where the friction was</li>\n<li>make a proof of concept and come back to seek for some additional feedback</li>\n</ul>\n<p>Any other recommendations, or people that I should talk to about this kind of work in general?</p>",
        "id": 436492015,
        "sender_full_name": "Dragan Okanovic",
        "timestamp": 1714566787
    },
    {
        "content": "<p>One idea (currently only partly implemented) was a GitHub issue for each node which was, or was about to be, or obviously a million miles away from being, able to be worked on by the community</p>",
        "id": 436493285,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714567418
    },
    {
        "content": "<p>That's what the \"discussion\" links to in the blueprint graph if you're lucky enough to find a node for which I've implemented a discussion issue</p>",
        "id": 436493382,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714567457
    },
    {
        "content": "<p>PS Dragan -- no need to apologise! I've just had a completely frantic April and am moving into a busy May but I had promised the community we'd be going live so here we are. I've never run anything like this before and am very open to hearing opinions on how to do it.</p>",
        "id": 436493934,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714567765
    },
    {
        "content": "<p>I love the idea of using native Github issues (<a href=\"https://github.com/features/issues\">https://github.com/features/issues</a>) -- they do have pretty great features and be customized a lot (able to cover everything I've mentioned previously), and they could live together as part of the repo, but still not within its code, which is ideal. If we were to utilize Github issues, the only remaining piece would be linking them to the blueprint graph, which shouldn't be too difficult.</p>",
        "id": 436494688,
        "sender_full_name": "Dragan Okanovic",
        "timestamp": 1714568146
    },
    {
        "content": "<p>Providing a link from a node to a GitHub issue is already possible, as Kevin explained. The GitHub issue can then have a link to a Zulip discussion. Adding the possibility to also put a direct link to Zulip from the graph would be trivial, just copy-pasting the code that creates links to GitHub, but this would clutter the interface even more.</p>",
        "id": 436497611,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1714569427
    },
    {
        "content": "<p>Dragan, it’s nice to be enthusiastic, but maybe spending ten minutes reading the documentation of leanblueprint would help avoiding suggesting to add features that already exist. Clicking on the Legend link in the graph would probably also help you.</p>",
        "id": 436498017,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1714569606
    },
    {
        "content": "<p>Note also that, obviously, there have been a <em>lot</em> of previous discussion about all this during other projects. The current workflow is a delicate balance between information and overhead. It doesn’t mean it won’t change in the future. But assuming nobody ever thought about what you wrote is maybe a bit hasty.</p>",
        "id": 436498573,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1714569820
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> I was only basing my writing on what I could see so far - no links from within the blueprint, not really utilizing project management features and doing things manually… technical capabilities were never really questioned.<br>\nThe enthusiasm was directed exactly toward exploring an opportunity to learn if a fresh project such as FLT could benefit more over time from having some additional things put in place.<br>\nIf there are other success stories that tried similar things, I’d love to learn about them.</p>",
        "id": 436499788,
        "sender_full_name": "Dragan Okanovic",
        "timestamp": 1714570325
    },
    {
        "content": "<p>Some previous (long) discussions:</p>\n<ul>\n<li><a href=\"#narrow/stream/412902-Polynomial-Freiman-Ruzsa-conjecture/topic/Project.20completed!.20.20Thoughts.20and.20reflections.3F\">Project completed! Thoughts and reflections?</a></li>\n<li><a href=\"#narrow/stream/113488-general/topic/CFP.3A.20improved.20Blueprint.20UX\">CFP: improved Blueprint UX</a></li>\n</ul>\n<p>Some related issues: <a href=\"https://github.com/PatrickMassot/leanblueprint/pull/9\">PatrickMassot/leanblueprint#9</a> <a href=\"https://github.com/PatrickMassot/leanblueprint/pull/6\">PatrickMassot/leanblueprint#6</a></p>",
        "id": 436502984,
        "sender_full_name": "Utensil Song",
        "timestamp": 1714571595
    },
    {
        "content": "<p>Many solutions were suggested, some are over-engineered. It's indeed \"a delicate balance between information and overhead\" as Patrick suggested.</p>\n<p>Besides blueprint and issues providing existing information (\"map\", \"done\", \"claimed\", \"ongoing\", etc.), the \"Outstanding Task\" mechanism is very useful for directing things towards the future (\"next step\", \"need help\", \"to claim\"), they work together like (relatively) static/organized part and the dynamic/inspiring part, moving the project forward. They can be seen as the <a href=\"https://en.wikipedia.org/wiki/Yin_and_yang\">Yang and Yin</a> parts of the mechanism.</p>\n<p>One possible missing link is that claiming requires a PR to add the issue to the corresponding node,  unlike e.g. Giscuss would automatically create a discussion for a blog post. But this can be as lightweight as using a special label for these PRs, so they can be easily created and quickly merged.</p>",
        "id": 436504569,
        "sender_full_name": "Utensil Song",
        "timestamp": 1714572176
    },
    {
        "content": "<p>Utensil, thanks for reminding me of those open issues. Do you agree they  can safely be closed? There may be a couple of things left but at this stage it would probably be much clearer to open separate issues for those.</p>",
        "id": 436510623,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1714573611
    },
    {
        "content": "<p>Yes, many features are already implemented, the rest could be safely archived. If any of them seem useful again, I'll open separate issues. Thanks~</p>",
        "id": 436511042,
        "sender_full_name": "Utensil Song",
        "timestamp": 1714573714
    },
    {
        "content": "<p>Ok, done.</p>",
        "id": 436511300,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1714573782
    },
    {
        "content": "<p>Dragan’s message also makes me realize that the new documentation does not include links to existing blueprints and other places discussing this framework such as Terry’s very nice blog post. I’m pretty sure there used to be some links, I don’t know what happened. I’ll put them back.</p>",
        "id": 436511761,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1714573897
    },
    {
        "content": "<p>I added a semi-random list of examples at the beginning of the <a href=\"https://github.com/PatrickMassot/leanblueprint/blob/master/README.md\">README</a>. I’d be happy to add or remove entries if someone feels forgotten or doesn’t want to appear there.</p>",
        "id": 436516066,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1714575131
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/416277-FLT/topic/Project.20overview.20and.20coordination/near/436516066\">said</a>:</p>\n<blockquote>\n<p>I added a semi-random list of examples at the beginning of the <a href=\"https://github.com/PatrickMassot/leanblueprint/blob/master/README.md\">README</a>. I’d be happy to add or remove entries if someone feels forgotten or doesn’t want to appear there.</p>\n</blockquote>\n<p>Thanks. I've just opened a <a href=\"https://github.com/PatrickMassot/leanblueprint/pull/19\">PR</a> adding FLT3 to the list.</p>",
        "id": 436517279,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1714575602
    },
    {
        "content": "<p>I merged it. This list looks like our community is completely obsessed with FLT but I guess it’s partly true.</p>",
        "id": 436517986,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1714575820
    }
]