[
    {
        "content": "<p>I promised to Yael that if they changed CI so that it didn't use <code>-Kenv</code> then I'd change the set-up of the project so that it didn't use the <code>FLT_files.lean</code> set-up i.e. I'd move it to <code>FLT.lean</code>. This will also make the project more \"standard\" in the sense that every Project file seems to have a Project.lean file containing all the files in the project, for better or worse (I still think that this is super-weird because we never had anything like this in the lean 3 days and nobody seemed to be complaining that such a file should exist; all it seems to do as far as I can see is cause inconvenience when people forget to update it when adding a new file). </p>\n<p>But I don't really want to lose the current FLT.lean, because I think the name <code>PNat.pow_add_pow_ne_pow</code> is funny and I'd like it to be in the \"headline file\". So I'm thinking of renaming it to <code>FermatsLastTheorem.lean</code>, importing the weird <code>FLT.lean</code> file at the top of that file, having <code>FLT.lean</code> not import <code>FermatsLastTheorem.lean</code>, and ensuring that <code>lake build</code> builds <code>FermatsLastTheorem.lean</code>. I have two questions.</p>\n<p>1) Is such a set-up acceptable to e.g. <span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> , who doesn't like the current set-up because it doesn't conform to project standards<br>\n2) How do I ensure that <code>lake build</code> builds <code>FermatsLastTheorem.lean</code>?</p>",
        "id": 497900829,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738764283
    },
    {
        "content": "<p>Possibly related: the docs for lakefile.toml say</p>\n<blockquote>\n<p>TOML<br>\nThe TOML configuration format is fully declarative. Projects that don't include custom targets, facets, or scripts can use the TOML format. Because TOML parsers are available for a wide variety of languages, using this format facilitates integration with tools that are not written in Lean.</p>\n</blockquote>\n<p>How close am I to being able to use a TOML file for FLT?</p>",
        "id": 497903457,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738765004
    },
    {
        "content": "<p>In many cases, you can must use a toml file. The biggest exception is if your lakefile mentions doc-gen. I don't remember if FLT has that; it's not difficult to change. I've done the same for carleson and sphere-eversion.</p>",
        "id": 497904357,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1738765239
    },
    {
        "content": "<p>Actually, I just read the other thread: with Yael's proposed set, I presume you don't have doc-gen in your lakefile anymore. So I would guess (but haven't checked) that the answer is \"nothing\".</p>",
        "id": 497904528,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1738765291
    },
    {
        "content": "<p>Yeah, looks like you could adapt <a href=\"https://github.com/fpvandoorn/carleson/blob/master/lakefile.toml\">https://github.com/fpvandoorn/carleson/blob/master/lakefile.toml</a> pretty easily now</p>",
        "id": 497908714,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1738766366
    },
    {
        "content": "<p>Absolutely, we can use a lakefile.toml</p>",
        "id": 497915497,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1738768055
    },
    {
        "content": "<ol>\n<li>Yes, absolutely. I mostly want to get rid of custom scripts like <code>mk_all.sh</code> so that setting up and maintaining projects becomes easier. Eg I am trying to set up a new project and it's takinf me two days and counting because various bits of automation are mathlib-specific or LeanCamCombi-specific or...</li>\n</ol>",
        "id": 497916431,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1738768317
    },
    {
        "content": "<ol start=\"2\">\n<li>You can declare it as a build target in the lakefile</li>\n</ol>",
        "id": 497916631,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1738768362
    }
]