[
    {
        "content": "<p>For the first year of the project, we focussed a lot on a bottom-up theorem, that certain spaces of automorphic forms are finite-dimensional, and we are largely done with the proof. I have been quite bad at reviewing PRs recently (I'll get to why later on) but I had a go over the weekend and I've realised that we have done almost all of the adeles part of the argument and almost all of the finiteness part of the argument; what's left is some technical results about haar characters. </p>\n<p>More recently I have turned to thinking about a top-down argument, which involves a lot of technical Galois representation stuff and modularity lifting theorems, and I've mostly been keeping myself to myself. I'm going to give 8 2-hour lectures at Imperial next term (Jan-March 2026) where I'm really going to push forwards with this stuff and actually write a blueprint; it has somehow taken me a very long time to flesh out the proof into something coherent which I understood all the details of, but I think I am there now modulo a modularity lifting theorem which is well-documented in the literature.</p>\n<p>The thing that has been a big distraction for me recently is that I want to prove the main theorems of local class field theory and I've been working on this in private with a group of people who attended the Oxford Clay workshop on the topic. We have nearly finished the proof and this has become my main priority. I really hope to get back to bottom-up FLT soon and get the finiteness result sorry-free. I am naively hoping that I can get bottom-up FLT back on track and class field theory over the line by Christmas. Then in the new year I'm going to focus on top-down FLT.</p>\n<p>There might be some money for jobs at Imperial, perhaps for people who are experts in the number theory related to top-down FLT and/or number theorists interested in AI. If there's anyone out there who would be able to move to Imperial quickly (e.g. by Jan) then could they let me know by DM? It's a pretty niche job description so I am not optimistic I'll find anyone appropriate but I thought I'd ask.</p>",
        "id": 555228022,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1762983659
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/416277-FLT/topic/update/near/555228022\">said</a>:</p>\n<blockquote>\n<p>I'm going to give 8 2-hour lectures at Imperial next term (Jan-March 2026) where I'm really going to push forwards with this stuff and actually write a blueprint</p>\n</blockquote>\n<p>Will these lectures be recorded?</p>",
        "id": 555583423,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1763125870
    },
    {
        "content": "<p>Only if I secretly record them, which I could do...</p>",
        "id": 555589979,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1763127641
    },
    {
        "content": "<p>Next best thing, will you post your notes for the lectures?</p>",
        "id": 570446236,
        "sender_full_name": "Ryan Smith",
        "timestamp": 1769559205
    },
    {
        "content": "<p>Or: will your students?</p>",
        "id": 570447432,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1769560020
    },
    {
        "content": "<p>ok I'll upload the pdf slides for the lectures to the repo.</p>",
        "id": 570528705,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1769598702
    },
    {
        "content": "<p>Brief update from me:</p>\n<p>1) CI is failing and I don't know why.</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>✖ [8112/8112] Building FLT/FLT:docs (10s)\ninfo: Documentation indexing\ntrace: .&gt; /home/runner/work/FLT/FLT/.lake/packages/doc-gen4/.lake/build/bin/doc-gen4 index --build /home/runner/work/FLT/FLT/docbuild/.lake/build\nerror: no such file or directory (error code: 2)\n  file: /home/runner/work/FLT/FLT/docbuild/.lake/build/doc/references.bib\nSome required targets logged failures:\n- FLT/FLT:docs\nerror: build failed\nError: Process completed with exit code 1.\n</code></pre></div>\n<p>I hit \"rerun job\" a few times but this doesn't seem to fix it.</p>\n<p>2) Right now I am very much focussed on giving my course, which is a regular mathematics course on FLT in which I assume without proof everything known in the 1980s. There will be 8 2-hour lectures of which I have given 3 and will be giving another one today. The course will run until mid-March. I will then attempt to turn the course notes (which are appearing here <a href=\"https://github.com/ImperialCollegeLondon/FLT/tree/main/2026_EPSRC_TCC_course\">https://github.com/ImperialCollegeLondon/FLT/tree/main/2026_EPSRC_TCC_course</a> ) into a blueprint and then a Lean skeleton, and then there will be plenty of new things to work on. But right now I am basically working 100% on what I think is the most important issue for the project going forwards, which is actually writing down a complete and detailed roadmap for the route to FLT modulo 1980s which I am taking. For those aware of the Stanford course which Taylor gave last year; I am basically going through the same material but my emphasis is sometimes different. For example Taylor might spend several hours talking about a result which was known in the 1980s which I will skip; conversely Taylor will sometimes dismiss various arguments as standard but, even if they are, I will give careful details if I know of no 1980s reference.</p>\n<p>3) I am reluctant to bump the repo to the new Lean rc <code>v4.29.0-rc1</code> for reasons explained elsewhere (downstream repos are being encouraged not to bump); however I am happy to bump to <code>v4.28.0</code> so I will be merging <a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/859\">FLT#859</a> some time after today's FLT lecture. Many thanks <span class=\"user-mention\" data-user-id=\"307953\">@Ruben Van de Velde</span> for the bump.</p>",
        "id": 574728089,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1771507996
    },
    {
        "content": "<p>Re 1) I've seen a few comments going around related to references.bib. Let me see if I can find them</p>",
        "id": 574729247,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1771508279
    },
    {
        "content": "<p><a href=\"https://github.com/ImperialCollegeLondon/FLT/pull/860\">FLT#860</a> might/should help</p>",
        "id": 574730311,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1771508547
    },
    {
        "content": "<p>For 1) I had the same issue in the Brownian motion project, I updated docgen-action to the lastest commit, and then CI worked. I just did that, so perhaps CI is not really fixed and will fail during the next run, I don't know.</p>",
        "id": 574730510,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1771508600
    },
    {
        "content": "<p>Looks like it worked</p>",
        "id": 574821731,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1771535126
    }
]