[
    {
        "content": "<p>Hi all, new to lean here. I recently wrote a solution to <a href=\"https://github.com/dwrensha/compfiles/pull/53\">IMO 2023 P1</a> and wanted to know what the demand for handwritten proofs are. I see a lot of talk about AI written proofs here, but not much about finding proofs by hand. I have been having fun writing them and am working on 2018 P2 now, so I'm curious if this work will lead to anything meaningful.</p>",
        "id": 519270029,
        "sender_full_name": "Clayton Knittel",
        "timestamp": 1747706905
    },
    {
        "content": "<p>Proofs for all past IMO problems are up on the internet and will have been seen by all the modern language models. There might be an interest in proofs which are genuinely different to those documented in places such as AOPS but conversely it might be quite tough to find a new proof which isn't already up there in some form</p>",
        "id": 519290484,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747716753
    },
    {
        "content": "<p>Proofs of IMO problems are accepted in the <code>Archive/IMO/</code> directory of Mathlib, although we'd prefer that they are \"exemplary\" solutions (e.g. making proper use of mathlib rather than proving anything useful locally, and making good use of tactics, and good proof style).</p>",
        "id": 519309137,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1747725567
    },
    {
        "content": "<p>Also, <span class=\"user-mention\" data-user-id=\"243791\">@David Renshaw</span> has a repository of such proofs at <a href=\"https://github.com/dwrensha/compfiles/tree/main/Compfiles\">https://github.com/dwrensha/compfiles/tree/main/Compfiles</a></p>",
        "id": 519351188,
        "sender_full_name": "Jason Rute",
        "timestamp": 1747737562
    },
    {
        "content": "<p>So sorry.  Your link was to a compfiles PR.</p>",
        "id": 519351457,
        "sender_full_name": "Jason Rute",
        "timestamp": 1747737647
    },
    {
        "content": "<p>I did rely on some general reasoning about factorizations in my proof that took up a lot of space. The biggest offender was the fact that if n is not a prime power, then let p = n.minFac, q = (ordCompl[p] n).minFac, we have p &lt; q and p and q are both primes. Is it reasonable for proofs like this to require a lot of code? In my limited experience, I have needed to show \"obvious\" facts like this using a lot of code, failing to find anything that gives me exactly what I need in mathlib</p>",
        "id": 519428797,
        "sender_full_name": "Clayton Knittel",
        "timestamp": 1747758425
    },
    {
        "content": "<p>Reusable statements like this should be PR'd to Mathlib. This is part of the requirement for IMO problems to go in <code>Archive/</code>.</p>",
        "id": 519567989,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1747820574
    }
]