[
    {
        "content": "<p>I've added my unofficial Lean versions of the IMO 2025 problem statements to IMOLean: <a href=\"https://github.com/jsm28/IMOLean\">https://github.com/jsm28/IMOLean</a> (note that all five non-geometry problems are \"determine\" problems).</p>\n<p>If more than one AI reports formal-to-formal results in Lean for IMO 2025, and they fail to use a common version shared by all such AIs - either this version or some other version coordinated between all such AIs and following conventions agreed in public in the Lean community in advance to be appropriate - then they've earned criticism for evading comparability of their results.</p>\n<p>(That doesn't apply to any AIs that only use Lean internally as part of an informal-to-informal solver, though I'd say there that doing good science means <em>also</em> evaluating how the Lean component of such a solver does on an independent neutral Lean statement of the problems and so if a paper is submitted without such an evaluation, the referees ought to request such an evaluation be added.)</p>\n<p>My formal statements work both with the Lean and mathlib versions in IMOLean and the slightly older v4.21.0 tagged version. Any AI requiring something older than that is failing at practical usability, where staying up to date with mathlib is clearly going to be important.</p>",
        "id": 528974547,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1752637236
    },
    {
        "content": "<p>That's a great resource to have.  I'd be curious to see how much the formalization matters for Problem 1 in particular, and whether an inherently finite or natural number based solution is easier to solve than one in R^2.</p>",
        "id": 528975135,
        "sender_full_name": "Ralph Furman",
        "timestamp": 1752637746
    },
    {
        "content": "<p>Is there any news from any of the contesting AIs?</p>",
        "id": 529219867,
        "sender_full_name": "Jakob von Raumer",
        "timestamp": 1752738047
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110789\">@Jakob von Raumer</span> only Numina (<span class=\"user-mention\" data-user-id=\"509372\">@Jia Li</span>) has publically indicated that they will “compete” in any sense of the word compete.  So I look forward to what they have to announce.  I doubt they will use <span class=\"user-mention\" data-user-id=\"266253\">@Joseph Myers</span> statements for many obvious reasons.  There are other good formal models out there like Goedel-Prover v2, but at least <span class=\"user-mention\" data-user-id=\"584504\">@Kaiyu Yang</span> told me that he isn’t aware of any plans for them to “compete”.</p>",
        "id": 529254766,
        "sender_full_name": "Jason Rute",
        "timestamp": 1752750598
    },
    {
        "content": "<p>Nonetheless, one could run these open source models themselves and report the results.  It can get expensive and complicated so I don’t think anyone will for the formal math models.  (And if they do, I hope they run the models correctly with the right system prompt, the right looping strategy, the right Lean version, proper testing, etc.)</p>",
        "id": 529254814,
        "sender_full_name": "Jason Rute",
        "timestamp": 1752750612
    },
    {
        "content": "<p>As for the informal models there is some commentary and some experiments with the off-the-shelf LLM models on <span class=\"user-mention\" data-user-id=\"659423\">@Ralph Furman</span>’s  <a href=\"https://sugaku.net/content/imo-2025-problems/\">https://sugaku.net/content/imo-2025-problems/</a> .  I find the commentary really interesting even if not very systematic.  For example I don’t see the better AI models (the ones which did better on USAMO represented) like the newest Gemini model, Grok 4, or o4 (and in their heavy compute modes).  Also I am suspicious of prompts which don’t mention that these are IMO problems (or otherwise indicate that they are hard).  (Some IMO problems look easy, but because they are on the IMO you know they are very challenging.  For example I knew I made a mistake on P6 when I tried it, since my solution was too easy for an IMO problem.)</p>",
        "id": 529254847,
        "sender_full_name": "Jason Rute",
        "timestamp": 1752750625
    },
    {
        "content": "<p>I like the analysis on <span class=\"user-mention\" data-user-id=\"350365\">@Mislav Balunović</span>‘s  <a href=\"http://MathArena.ai\">MathArena.ai</a>.  It seems very systematic and thought through.  I hope they keep up the tradition by benchmarking the IMO.</p>",
        "id": 529254906,
        "sender_full_name": "Jason Rute",
        "timestamp": 1752750647
    },
    {
        "content": "<p>Thanks for the summary!</p>",
        "id": 529256206,
        "sender_full_name": "Jakob von Raumer",
        "timestamp": 1752751126
    },
    {
        "content": "<p>Correction to something I said above.  I was mistaken, and it does seem Sugaku’s analysis does include o4-mini, Gemini-2.5 Pro, Grok 4 (not sure what settings or how they were run).  Sometimes the answers are blank.  Is that because they returned no response?</p>",
        "id": 529265583,
        "sender_full_name": "Jason Rute",
        "timestamp": 1752754379
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"115715\">Jason Rute</span> <a href=\"#narrow/channel/208328-IMO-grand-challenge/topic/IMO.202025.20problem.20statements/near/529254814\">said</a>:</p>\n<blockquote>\n<p>Nonetheless, one could run these open source models themselves and report the results.  It can get expensive and complicated so I don’t think anyone will for the formal math models.  (And if they do, I hope they run the models correctly with the right system prompt, the right looping strategy, the right Lean version, proper testing, etc.)</p>\n</blockquote>\n<p>how expensive are we talking about? Goedel prover v2 seems pretty small (nowadays) of a model, so I guess the expense comes from running it N times for some large N? Do you think it costs like N$ to do pass@N roughly? More? Just asking bc my intuition was that it shouldn't be <em>super</em> expensive (like &lt;&lt;N$ for pass@N), especially if you have access to some gpus (32B seems like really friendly size actually)</p>\n<p>although the first thought that came to me was it's unclear that you can get goedel prover to \"guess\" the answer and having it prove given the \"guess\" makes the problem easier--but still would be interesting to see that whether it can do it!</p>",
        "id": 529302167,
        "sender_full_name": "Andy Jiang",
        "timestamp": 1752765257
    },
    {
        "content": "<p>like a funny thing someone could try would be to get the top frontier models to crowdsource guesses to feed into goedel and see what happens? I don't think it will break the bank to try this even for an individual tbh</p>",
        "id": 529302455,
        "sender_full_name": "Andy Jiang",
        "timestamp": 1752765345
    },
    {
        "content": "<p>Ok I just saw that MathArena evaluated the top informal models-- <a href=\"https://x.com/j_dekoninck/status/1945848711466160349\">https://x.com/j_dekoninck/status/1945848711466160349</a> [in line with USAMO evaluations (and lower than I expected)]</p>",
        "id": 529310545,
        "sender_full_name": "Andy Jiang",
        "timestamp": 1752767773
    },
    {
        "content": "<p>Gemini's P3 performance seems quite good--maybe it <em>suggests</em>/hints there was indeed some synthetic data coming from old alphaproof into Gemini 2.5 pro. Funny because I thought also that would be kind of a nice test of goedel prover bc the formalization seems quite short--caveat I haven't looked at any of the problems in detail myself</p>",
        "id": 529311127,
        "sender_full_name": "Andy Jiang",
        "timestamp": 1752767960
    },
    {
        "content": "<p>On the flip side--if one were to be overly generous--it does seem that at least in 5/6 (except for P6) the informal LLMs are getting it correct with some probability--which means that if the formal provers are strong enough (a big if ofc) it could have solved 5/6 in a combined effort. So I think it's really important we also test how strong the formal prover is (say given the correct guess).</p>",
        "id": 529314738,
        "sender_full_name": "Andy Jiang",
        "timestamp": 1752769114
    },
    {
        "content": "<p>The MathArena analysis looks great!</p>\n<p>One reason I rushed to get the models tested the moment the problems leaked is that LLMs are really good right now at web search and I don't know a good way to make sure they are solving the problem without cheating.</p>\n<p>The MathArena article mentions about Grok-4:</p>\n<blockquote>\n<p>Many of its initial responses were extremely short, often consisting <strong>only of a final answer without explanation</strong></p>\n</blockquote>\n<p>If you ask on their app and you look at its reasoning traces it explicitly searches for the problem statement and solution online<br>\n<a href=\"/user_uploads/3121/WZYFj8lymsf6ExTVHMLvKyOI/Gv7tS6bWcAAHfmN.jpeg\">Gv7tS6bWcAAHfmN.jpeg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/WZYFj8lymsf6ExTVHMLvKyOI/Gv7tS6bWcAAHfmN.jpeg\" title=\"Gv7tS6bWcAAHfmN.jpeg\"><img data-original-content-type=\"image/jpeg\" data-original-dimensions=\"1767x1023\" src=\"/user_uploads/thumbnail/3121/WZYFj8lymsf6ExTVHMLvKyOI/Gv7tS6bWcAAHfmN.jpeg/840x560.webp\"></a></div>",
        "id": 529315131,
        "sender_full_name": "Ralph Furman",
        "timestamp": 1752769263
    },
    {
        "content": "<p>Hello!</p>\n<p>I’m new to Lean, but I’m very interested in the IMO Grand Challenge and everything surrounding it. I have a question about the exact format in which you expect solutions for the competition—and what kind of solution would count as passing the challenge.</p>\n<p>Below I spell out where my uncertainty lies, framed as a few specific questions.</p>\n<p><strong>What I understand about Lean</strong><br>\nIn Lean code a <code>sorry</code> marks a spot that an prover is expected to replace with a correct term, while leaving the original code untouched. The Lean compiler must then confirm that every expression is correct; if it succeeds, the prover has solved the problem.</p>\n<p>In the formal‑to‑formal IMO problems published in the <strong>IMOLean</strong> <a href=\"https://github.com/jsm28/IMOLean\">repository</a>, each file contains two <code>sorry</code>s: one in the theorem statement and one in the answer term. Thus a “canonical” Lean solution looks like this:</p>\n<ol>\n<li><strong>Specify the answer</strong> (for problems that require an explicit answer);</li>\n<li><strong>Prove</strong>—or perhaps better, <strong>verify</strong>—within Lean that this answer satisfies the problem’s conditions.</li>\n</ol>\n<p>If the problem is of the form “prove that …,” step 1 is absent.</p>\n<p><strong>Question 1:</strong><br>\nIs it true that a winning AI system must discover <strong>both</strong> terms—the answer <em>and</em> the proof—on its own?</p>\n<p>From the structure of the IMOLean problems and what is stated in the README, I assume the answer is <strong>yes</strong>.</p>\n<p><strong>Current state of AI provers</strong><br>\nRecent AI provers (DeepSeek‑Prover‑V2, Kimina‑Prover‑72B, Gödel‑Prover‑V2, etc.) are usually benchmarked on miniF2F, PutnamBench, and the new <a href=\"https://huggingface.co/datasets/Goedel-LM/MathOlympiadBench\">MathOlympiadBench</a> (largely past IMO and IMO‑shortlist problems). In these benchmarks the theorem already includes the answer term, so the prover has to replace only <strong>one</strong> <code>sorry</code>. In effect, it performs only step 2, with the answer supplied as part of the input—crucial for problems that are not “prove that …” statements.</p>\n<p>PutnamBench even separates results into two tabs: <strong>“with answer”</strong> and <strong>“no answer.”</strong> The first tab lists many models; the second is empty: <a href=\"https://trishullab.github.io/PutnamBench/leaderboard.html\">https://trishullab.github.io/PutnamBench/leaderboard.html</a></p>\n<p><strong>Question 2:</strong><br>\nIf the answer to Question 1 is indeed “yes,” does that mean there are <em>no</em> known open‑source AI systems currently capable of even attempting the IMO Grand Challenge, because all public benchmarks assume the answer is pre‑substituted?</p>\n<p><strong>Question 3:</strong><br>\nAm I correct that at least the following provers—DeepSeek‑Prover‑V2, Kimina‑Prover‑72B, and Gödel‑Prover‑V2—cannot (or have not been trained to) generate the answer term and instead assume the theorem already contains it?</p>\n<p>I am aware of the closed 2024 system <strong>AlphaProof</strong>, whose authors state that their agent generates <strong>both</strong> the answer and the proof entirely on its own (i.e. without any human substitution):</p>\n<blockquote>\n<p>“while the problem statements were formalized into Lean by hand, the answers within the problem statements were generated and formalized by the agent.” (<a href=\"https://storage.googleapis.com/deepmind-media/DeepMind.com/Blog/imo-2024-solutions/index.html\">https://storage.googleapis.com/deepmind-media/DeepMind.com/Blog/imo-2024-solutions/index.html</a>)</p>\n</blockquote>\n<p>To my knowledge, no other system can currently meet the IMO Grand Challenge requirements.</p>\n<p>Thank you for creating this challenge. I look forward to any feedback that will help me better understand the state of the art.</p>",
        "id": 529432460,
        "sender_full_name": "Oktai Tatanov",
        "timestamp": 1752833683
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"939033\">@Oktai Tatanov</span> That is a good question!  First, there are actually benchmarks like this with two sorries, <a href=\"http://github.com/MoonshotAI/CombiBench/blob/master/lean/CombiBench/imo_2000_p4.lean\">one for the solution and one for the proof</a>.  (Sometimes we call this \"hard mode\", although others like to point out it is the \"standard mode\" for a competition problem.)  <a href=\"https://github.com/MoonshotAI/CombiBench\">CombiBench</a> comes to mind, and unlike PutnamBench, there is a <a href=\"https://moonshotai.github.io/CombiBench/leaderboard.html\">CombiBench leaderboard</a> with attempts at this, including off-the-shelf LLMs like Gemini, but also Lean-specific models like Kimina-Prover-Preview.</p>",
        "id": 529443754,
        "sender_full_name": "Jason Rute",
        "timestamp": 1752838170
    },
    {
        "content": "<p>I have to remind myself how Kimina-Prover Preview filled in the solutions, but for AlphaProof, I think they said they asked Gemini for solutions.  Then they autoformalized those solutions to Lean.  Then they had the model try to prove or disprove all the candidate solutions.  The disproof came in pretty fast, so it was easy to reject bad candidates and focus only on the good ones.  This approach is pretty flexible.  Any of the standard Lean AIs (which are good at both proving and disproving, which many do during RL since the automatically generated data can be false) could follow this method using an external reasoning model.  (Again, I need to check if Kimina-Prover-Preview and Kimina-Prover use an external model for this or their own model.)</p>",
        "id": 529443767,
        "sender_full_name": "Jason Rute",
        "timestamp": 1752838176
    },
    {
        "content": "<p>Also, \"winning AI system\" is a strange phrase.  There aren't exactly rules here (although there is the <a href=\"https://aimoprize.com/\">AIMO prize</a>).  But AlphaProof did set a standard of the AI coming up with the answer, and I think people would be quick to criticize any system that didn't do this automatically.</p>",
        "id": 529444258,
        "sender_full_name": "Jason Rute",
        "timestamp": 1752838417
    },
    {
        "content": "<p>I think for Kimina-Prover-Preview it seems they did use the model directly (which is an LLM, so it can be capable of fill-in-the blank stuff like this), but also point out in the <a href=\"https://arxiv.org/pdf/2505.03171\">combibench paper</a> that:</p>\n<blockquote>\n<p>It is important to note that Kimina-Prover Preview has not been specifically trained on datasets pertaining to combinatorics or fill-in-the-blank question types.</p>\n</blockquote>",
        "id": 529446364,
        "sender_full_name": "Jason Rute",
        "timestamp": 1752839431
    },
    {
        "content": "<p>For Kimina-Prover, they specifically train the model to do this.  From their <a href=\"https://huggingface.co/blog/AI-MO/kimina-prover\">report</a>:</p>\n<blockquote>\n<p><strong>Non-proof Problem Solving.</strong> Many problems are presented in the form of requiring a final answer, which cannot be naturally framed as a traditional proof task. Inspired by the CombiBench<a href=\"https://huggingface.co/blog/AI-MO/kimina-prover#10\">[10]</a> evaluation methodology, we introduced a capability for non-proof problem solving to unify answer generation with proof construction. In this setting, the model is given a problem with the final answer field left blank. It performs a two-stage process within a single inference: it first deduces the correct answer and then generates a complete formal proof to justify that answer. This approach ensures the model’s reasoning is explicitly conditioned on reaching the correct solution.</p>\n</blockquote>",
        "id": 529446378,
        "sender_full_name": "Jason Rute",
        "timestamp": 1752839434
    },
    {
        "content": "<p>6 messages were moved from this topic to <a class=\"stream-topic\" data-stream-id=\"208328\" href=\"/#narrow/channel/208328-IMO-grand-challenge/topic/IMO.202025.20P1/with/530547236\">#IMO-grand-challenge &gt; IMO 2025 P1</a> by <span class=\"user-mention silent\" data-user-id=\"115715\">Jason Rute</span>.</p>",
        "id": 530547237,
        "sender_full_name": "Notification Bot",
        "timestamp": 1753359267
    }
]