[
    {
        "content": "<p>After wrestling with the type checker for weeks now, I got a nice \"proof assistant\" wow moment, I wanted to share. Part a) of the exercise asked me to prove something given some hypotheses, and when I got to part b) which asked which of the hypotheses are needed - I could immediately see the Lean linter showing me two hypotheses were not used in the proof. Kinda magical, won't be nearly as easy to look through a pen and paper the proof and see what was used and what not, especially with A B C D looking a bit similar.</p>\n<p><a href=\"/user_uploads/3121/sIxK-_o7-ZS2B3hBwjeeMXiy/Screenshot-2025-07-16-at-11.35.54PM.png\">Screenshot 2025-07-16 at 11.35.54 PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/sIxK-_o7-ZS2B3hBwjeeMXiy/Screenshot-2025-07-16-at-11.35.54PM.png\" title=\"Screenshot 2025-07-16 at 11.35.54 PM.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"776x236\" src=\"/user_uploads/thumbnail/3121/sIxK-_o7-ZS2B3hBwjeeMXiy/Screenshot-2025-07-16-at-11.35.54PM.png/840x560.webp\"></a></div>",
        "id": 529211945,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1752734510
    },
    {
        "content": "<p>Ah, but is the questions which hypotheses were <em>not needed</em> or <em>not used</em>? :)</p>",
        "id": 529215540,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1752736186
    },
    {
        "content": "<p>My thinking is - not used for my specific proof means they are not needed in general, but for the two used, it is not clear that there isn't a better proof that doesn't use them. But I showed a counter example where the goal is not true, when A is empty. The only thing I don't know how to do yet in Lean is reason use symmetry and commutativity of the product that same applies to B.</p>",
        "id": 529293042,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1752762608
    },
    {
        "content": "<p>there is the <code>wlog</code> tactic, but it's been alledged to be a bit buggy, and is in general a bit rough around the edges.</p>",
        "id": 529306574,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1752766587
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"488971\">Rado Kirov</span> <a href=\"#narrow/channel/514017-Analysis-I/topic/a.20true.20proof.20assistant.20wow.20moment/near/529211945\">said</a>:</p>\n<blockquote>\n<p>I got a nice \"proof assistant\" wow moment</p>\n</blockquote>\n<p>I think my first big one was when I ported a proof I'd written from Lean 3 to Lean 4, the unused variable linter pointed out that in my lengthy proof by cases, I'd never actually used the fact I was in any particular case, and I could delete half the proof! (This was with a <code>by_cases</code> tactic.)</p>",
        "id": 529312231,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1752768267
    },
    {
        "content": "<p>My \"wow\" moment was when we had just completed a three-week project to formalize a newly proven conjecture (the polynomial Freiman-Ruzsa conjecture, PFR) with a certain constant C=12.  But then someone managed to modify the (informal) proof to improve the constant C=11.  We could implement this new proof in roughly a day, basically by replacing C with 12 at one line of the proof, seeing where the elaborator now complained, and filling in the steps with fixes that were either coming from the new informal proof, or were obvious modifications.  We could refactor thousands of lines of code with remarkable speed because we could safely zero in on the few lines of code that actually needed modification.</p>",
        "id": 529339027,
        "sender_full_name": "Terence Tao",
        "timestamp": 1752778658
    }
]