[
    {
        "content": "<p>I recently learned about <code>simp?</code> and <code>aesop?</code>, so now I wonder is it best practice in the final proof to expand these tactics to the output of their ? equivalents or leave them unexpanded. Especially for <code>aesop</code> the outcome can be quite long, but sometimes I can massage it down to manageable size.</p>",
        "id": 527606437,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1751952440
    },
    {
        "content": "<p>The mathlib rules (as I understand them) are that if these tactics are being used as finishing tactics (ie to close a goal rather than just change it) then it's usually fine to leave them as they are. The exceptions are: if <code>simp</code> takes a long time and <code>simp only ...</code> is much quicker then feel free to squeeze, and I personally sometimes take a look at what proof Aesop found in case it was just rfl or intros;.ext; simp or whatever, and might well replace the Aesop call with the simpler call in this case.</p>",
        "id": 527617971,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1751958931
    },
    {
        "content": "<p>In terms of general principles, there are issues of maintainability and performance that sometimes push in opposite directions.</p>\n<p>There have been some pretty extensive related discussions talking about the difference between <code>flexible</code> and <code>rigid</code>.  Mathlib even has a linter that will help identify potential maintainability issues caused by non-terminal <code>simp</code>s and related tactics.</p>",
        "id": 527619431,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1751959550
    },
    {
        "content": "<p>See for instance <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/flexible.20vs.20rigid.20tactics/with/427782429\">#mathlib4 &gt; flexible vs rigid tactics</a>.</p>",
        "id": 527619688,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1751959640
    },
    {
        "content": "<p>Not sure it's helpful but the rule of thumb I've settled on using for myself (specifically in the context of Analysis book exercises) is to:</p>\n<ul>\n<li>Only use <code>aesop</code> or <code>simp</code> if I can retrace the argument mentally on the spot and I'm confident in it (but it's annoying to type).</li>\n<li>Only use <code>simp only</code> rather than <code>simp</code>, and always verify that each suggested lemma was actually necessary.</li>\n<li>If I've settled on <code>aesop</code> or similar, then I'll clean up the lines before to remove other stuff it's able to do. Unless the shape of the proof disappears completely, in which case I'd still leave enough of the skeleton to retrace the argument. So basically, only skip out \"trivial\" parts.</li>\n</ul>",
        "id": 527725897,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1751990360
    },
    {
        "content": "<p>Those are good rule of thumb, I will try to follow them going forward, and maybe one day go back and clean up.</p>",
        "id": 527733487,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1751992385
    }
]