[
    {
        "content": "<p>Finally done with chapter 3.5. I feel I am starting to grok subtypes and how to work with Classical.choice. Exercise 3.5.12 and 3.5.13 were quite challenging but fun.</p>\n<p>Example 3.5.9 for whatever reason turned out really slow down Lean to the point that I had to type and wait ~10-20 sec for any feedback and extend heartbeats to get output. Luckily the solutions were short at the end. </p>\n<p>I would be curious to know if someone else manages to avoid that slowdown by working with better theorems (my solutions are here <a href=\"https://github.com/rkirov/analysis/blob/main/analysis/Analysis/Section_3_5.lean#L567-L721\">https://github.com/rkirov/analysis/blob/main/analysis/Analysis/Section_3_5.lean#L567-L721</a>). Also if there is any tracing/debugging I can do to pin point the slowdown that would be helpful.</p>\n<p>There are few _eval lemmas that I found lacking and can contribute back to the repo if folks agree they are generally useful - <a href=\"https://github.com/rkirov/analysis/blob/main/analysis/Analysis/Section_3_5.lean#L567-L721\">https://github.com/rkirov/analysis/blob/main/analysis/Analysis/Section_3_5.lean#L567-L721</a></p>",
        "id": 530053384,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1753164387
    },
    {
        "content": "<p>putting <code>set_option trace.profiler true in</code> at the start of a theorem gives you a trace in the infoview.  If one continually clicks on the little triangles that report the most seconds used, you will eventually find the heartbeat culprit.  Replacing <code>simp</code> with <code>simp only</code> via <code>simp?</code> may remove at least some of the slowdown, though <code>simp</code> isn't <em>that</em> heartbeat-intensive.</p>\n<p>The <code>fst</code> and <code>snd</code> operations on <code>X ×ˢ Y</code> should come with some <code>spec</code> lemma which should make <code>eval</code> lemmas about them easier to use.  The pairing map <code>X → Y → X ×ˢ Y</code> that is implicitly in <code>curry</code> should probably be made more explicit, with the <code>eval</code> lemmas being that this pairing map is basically inverted by <code>fst</code> and <code>snd</code>.</p>",
        "id": 530071194,
        "sender_full_name": "Terence Tao",
        "timestamp": 1753165237
    },
    {
        "content": "<p>For the second part, I opened <a href=\"https://github.com/teorth/analysis/pull/229\">https://github.com/teorth/analysis/pull/229</a></p>",
        "id": 530205792,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1753210843
    }
]