[
    {
        "content": "<p>I'm working through the exercises in <a href=\"https://github.com/gaearon/analysis-solutions\">https://github.com/gaearon/analysis-solutions</a>.</p>\n<p>I move at a relatively slow pace, but I just finished 3.5 and hope to get to chapter 4 soon. I try to solve them manually, with some help from Claude here and there when I'm stuck. I also try to reduce them to a minimal form (not necessarily golfed, but conceptually). So if some proof is unnecessarily complicated, I'd appreciate a tip in issues. I'm maintaining my fork as a stack of commits (one commit per section) in the <code>solutions</code> branch that I regularly rebase on top of upstream <code>main</code>. Not sure how long this will stay viable but I'll try to keep stacking them to avoid accidentally diverging.</p>\n<p>I know <span class=\"user-mention\" data-user-id=\"488971\">@Rado Kirov</span> also has a fork in <a href=\"http://github.com/rkirov/analysis\">http://github.com/rkirov/analysis</a> that I often consult. He's been using a bit more \"bruteforce\" approach (so not all proofs are shortest) but I found it super helpful to get unstuck and he's further ahead than me.</p>\n<p>If you have your own fork with solutions that you'd like to share, add to this thread! I think it's useful to be able to compare them and to see if anyone got a simpler or a shorter solution to different exercises.</p>",
        "id": 535225100,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1755654259
    },
    {
        "content": "<p>+1 encouraging more folks to share solutions online (I hope that doesn’t have bad effects for people teaching university classes using the book, then again AI  can already probably solve a lot of them). I have also learned some neat tricks by looking over <span class=\"user-mention\" data-user-id=\"418569\">@Dan Abramov</span> solutions, so it has been mutually beneficial to share solutions.</p>",
        "id": 535253026,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1755674499
    },
    {
        "content": "<p>Is it still the case that no one has successfully completed <code>Section_5_epilogue.lean</code> (\"Isomorphism with the Mathlib real numbers\") <code>sorry</code>-free? In other words, that level is not \"play tested\" yet. I'd love to see a solution, so please share if there is one.</p>",
        "id": 535257599,
        "sender_full_name": "Louis Cabarion",
        "timestamp": 1755676378
    },
    {
        "content": "<p>Yes, I am on ch4.2 and going linearly. Will post here once done, but probably will be at least 3 months more :)</p>",
        "id": 535257816,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1755676465
    },
    {
        "content": "<p>I've been playtesting it on my <a href=\"https://github.com/ldct/analysis/pull/1/files#diff-2ef8d21d8fe1dd5b6467e2b83043919b40382037329abeb12bac6245b59a9b79\">own branch</a>. Not sure there's anything particularly interesting, but some thoughts:</p>\n<ul>\n<li>Proof automation - I try to use <code>simp</code> as much as possible and I found working through this book really useful to develop intuition about good simp lemma design. I saw that the recent <code>v4.22</code> upgrade enables <code>grind</code> (albeit experimental), and I'm looking forward to trying that out.</li>\n<li>For proofs that cannot be dispatched by automation, each proof normally only has a small amount of \"clever mathematical ideas\" (things like case split on this proposition, or rewrite a simpler expression into a more complicated one so that some other theorem can make more progress) and then the rest is much more automation-friendly, so automation is much more fruitful than it might first seem. I find good theorem naming really important to making the code reflect the \"clever mathematical idea\" and also to see if a given goal state / context is true by inspection without writing a proof. Currently the Lean content of the book is IMO much harder than the math content, but I could see a future where the automation / scaffolding is good enough that this inverts, and working through books like these develop the reader's math skills without placing an unduly high prerequisite on their Lean skills.</li>\n<li>I think there are some interesting questions about the generality in which to state theorems / missing lemmas, e.g. many proofs about <code>CloseSeq</code> have the same basic idea as their <code>Close</code> counterpart... similarly I found the formalization of the finite segment part of exercise 5.1.1 much harder than the math proof and explored a bit how to make it easier</li>\n<li>Anything that I don't personally find interesting (basically anything not already listed) I tend to skip, so I have lots of sorrys, in particular I didn't work on section 3 at all - I'm just personally not that interested in learning how to reimplement / express set theory in Lean, but maybe I'm missing out...</li>\n</ul>",
        "id": 535431370,
        "sender_full_name": "Li Xuanji",
        "timestamp": 1755753498
    },
    {
        "content": "<blockquote>\n<p>Currently the Lean content of the book is IMO much harder than the math content, but I could see a future where the automation / scaffolding is good enough that this inverts, and working through books like these develop the reader's math skills without placing an unduly high prerequisite on their Lean skills.</p>\n</blockquote>\n<p>Yep, that's my observation too, but learning Lean more deeply by doing tons of undergraduate math exercises is what I am here for. Lean is programming language and one needs to write tons of code - reminds me of this essay <a href=\"https://www.norvig.com/21-days.html\">https://www.norvig.com/21-days.html</a>. Also, the Lean scaffolding is improving (<span class=\"user-mention\" data-user-id=\"418569\">@Dan Abramov</span> has sent some great PRs) by filling out example sorries and adding comments.</p>\n<p>After chatting <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> I learned about these two other resources for learning to do math in Lean by doing undergraduate math exercises:</p>\n<ul>\n<li><a href=\"https://github.com/b-mehta/formalising-mathematics-notes/tree/main/FormalisingMathematics2025\">https://github.com/b-mehta/formalising-mathematics-notes/tree/main/FormalisingMathematics2025</a></li>\n<li>\n<p><a href=\"https://hrmacbeth.github.io/math2001/\">https://hrmacbeth.github.io/math2001/</a><br>\nwhich I plan to go over too at some point. They also seem to have a large number of exercises, but Analysis1 Companion is close to 5x more sorries (if the shell script claude produced is right):</p>\n</li>\n<li>\n<p>analysis 1 companion - 2100 sorries</p>\n</li>\n<li>formalizing math 2025 - 330 sorries</li>\n<li>Mathematics is Lean - 340 sorries</li>\n<li>mechanics of proof - 570 sorries<br>\nThe downside of course is that analysis 1 has no actual text teaching you lean, so I have to learn from reading the scaffold, asking claude and zulip, but I like the challenge so far.</li>\n</ul>",
        "id": 535812839,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1755962894
    },
    {
        "content": "<p>I'll be happy to accept PR's to update the various Lean resources in README.md to incorporate these links (and whatever other links you come across that would be helpful for other users of the companion).</p>",
        "id": 535857726,
        "sender_full_name": "Terence Tao",
        "timestamp": 1755975100
    },
    {
        "content": "<p>The list here is already great - <a href=\"https://github.com/teorth/analysis?tab=readme-ov-file#general-lean-resources\">https://github.com/teorth/analysis?tab=readme-ov-file#general-lean-resources</a>, might just add <a href=\"https://github.com/b-mehta/formalising-mathematics-notes\">https://github.com/b-mehta/formalising-mathematics-notes</a>. But the problem is AFAIKT none of the \"doing math in lean\" texts go far enough to cover some more advanced lean tools needed to complete all the proofs in the Lean companion.</p>\n<p>For example, <code>generalize_proofs</code> is very much needed in Chapter 3, but a quick grep shows that none of MIL, mechanics of proof, or formalizing math text mentions it. Same with <code>field_simp</code> or <code>push_cast</code> that Claude just taught me yesterday, so I can complete Ch4.2</p>\n<p>Maybe <span class=\"user-mention\" data-user-id=\"418569\">@Dan Abramov</span> and I should write up \"A Lean guide to the Lean companion to Analysis I\" at some point, because text in the comments can only go so far.</p>",
        "id": 535862934,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1755982114
    },
    {
        "content": "<p>Though not quite the same thing, I was thinking of recording a YouTube series going through the exercises (while teaching a bit of Lean and the workflow).</p>",
        "id": 535865908,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1755986487
    },
    {
        "content": "<p>Rado, could you please open an issue in the mathematics in  Lean source repository about those missing tactics, in including links to a couple of relevant Analysis 1 exercises? That would be very useful.</p>",
        "id": 535877215,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1756005227
    },
    {
        "content": "<p>sounds good, will do it tomorrow</p>",
        "id": 535877444,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1756005614
    },
    {
        "content": "<p>One thing I like about formalising mathematics, which I think the Analysis 1 companion could benefit from, is that the header describes all new tactics the file introduces (i.e. the first time <code>linarith</code> is used, the header talks about what it does), and it had a separate <a href=\"https://b-mehta.github.io/formalising-mathematics-notes/Part_2/Part_2.html\">list</a> of all tactics (used in the course) at the end.</p>\n<p>Other than tactics, I imagine this could also be applied to language features and library typeclasses.</p>",
        "id": 535878306,
        "sender_full_name": "Li Xuanji",
        "timestamp": 1756007157
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"308587\">@Li Xuanji</span> That's a great idea. What's stopping me from just sending the PRs to do this is while I know the tactics used by my own solutions, I can't tell whether I am using overly powerful ones or not (and even having a canonical tactic power ordering is still WIP, I think there was a Lean thread). So maybe the best path is having a few independent solvers go through the chapters, then we can pull our lists of tactics used and contribute the minimum powerful set.</p>\n<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> filed <a href=\"https://github.com/avigad/mathematics_in_lean_source/issues/308\">#308</a> <a href=\"https://github.com/avigad/mathematics_in_lean_source/issues/309\">#309</a> <a href=\"https://github.com/avigad/mathematics_in_lean_source/issues/310\">#310</a> <a href=\"https://github.com/avigad/mathematics_in_lean_source/issues/311\">#311</a> for now and will keep doing so as I go along. Feel free to close some of those as won't do, if you don't think they can be well worked into the text.</p>",
        "id": 535906110,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1756046124
    },
    {
        "content": "<p>Thanks! I cannot promise when we’ll have time to work on this, but be sure this will be useful at some point.</p>",
        "id": 535906746,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1756046771
    },
    {
        "content": "<p>yeah, no worries, filing those is useful for my own book keeping too.</p>",
        "id": 535908463,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1756048714
    },
    {
        "content": "<p>I have experimentally added a \"tips from past users\" section to the header files for the Chapter 2-5 files (excluding those for which no sorries were to be filled), which intended to be a crowdsourced portion of the file in which users are invited to submit (as PRs) tips and other comments into the file itself (also external links to content discussing the material in the file is also welcome).  The intent is to allow for a variety of perspectives and proof strategies to be represented.   Users can feel free to sign their name to specific tips if desired (though in theory github already tracks authorship of contributions).  If this experiment is popular I will extend it to the rest of the companion.</p>",
        "id": 535909684,
        "sender_full_name": "Terence Tao",
        "timestamp": 1756049975
    },
    {
        "content": "<p>Nice, will contribute some tips after finishing ch 4.</p>",
        "id": 535931853,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1756076433
    }
]