[
    {
        "content": "<p>I am toying with the idea of teaching a class on the material of chapter 1 to 5 to interested folks in the bay area (likely mostly software people.) I wrote up proposal syllabus <a href=\"https://docs.google.com/document/d/1bCJ9Y_Y13A65kJUHgvzI8_3GMCVL5Ys55m4Qoz0G8CA/edit?tab=t.0#heading=h.2ds6n3ym2aob\">https://docs.google.com/document/d/1bCJ9Y_Y13A65kJUHgvzI8_3GMCVL5Ys55m4Qoz0G8CA/edit?tab=t.0#heading=h.2ds6n3ym2aob</a></p>\n<p>any thoughts, comments, suggestions (anyone can comment in the doc) before I start looking for participants?</p>\n<p>My hypothesis is that  there are at least 10-20 software engineers in the bay area that are math-curious (like <span class=\"user-mention\" data-user-id=\"418569\">@Dan Abramov</span> :) too bad you are in London) and Lean actually makes their foray into proofs more interesting and pleasant given they are used to using computers to write code.</p>",
        "id": 540933302,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1758606997
    },
    {
        "content": "<p>This sounds like a great idea!  I'd be happy to use this space as a forum for students in this class to discuss the Lean-related topics arising in the class (presumably any purely administrative questions of interest only to class participants should go elsewhere though).</p>",
        "id": 541022370,
        "sender_full_name": "Terence Tao",
        "timestamp": 1758636007
    },
    {
        "content": "<p>I sent the word out on the social media channels - <a href=\"https://bsky.app/profile/radokirov.bsky.social/post/3lzko27svuk2b\">https://bsky.app/profile/radokirov.bsky.social/post/3lzko27svuk2b</a> etc. So let's see how it goes.</p>\n<blockquote>\n<p>I'd be happy to use this space as a forum for students in this class to discuss the Lean-related topics arising in the class</p>\n</blockquote>\n<p>Yes, my plan was to do a first pass in a dedicated discord channel and  \"upstream\" here questions that I struggle to answer well.</p>",
        "id": 541143989,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1758690564
    },
    {
        "content": "<p>Got 11 interest responses so far, so this is a go interest-wise, next steps figure out the venue.</p>",
        "id": 541699096,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1758901548
    },
    {
        "content": "<p>Big thanks to everyone here boosting the message!</p>",
        "id": 541699148,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1758901566
    },
    {
        "content": "<p>We got a venue in San Francisco and will do the first meetup next Monday. Got 16 replies on the interest form and some participation in the discord forum.</p>",
        "id": 543668874,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1759905262
    },
    {
        "content": "<p>What's the venue?</p>",
        "id": 543768104,
        "sender_full_name": "Alok Singh",
        "timestamp": 1759934924
    },
    {
        "content": "<p>Moxsf</p>",
        "id": 543768438,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1759935004
    },
    {
        "content": "<p>lol of course. How did you find it</p>",
        "id": 544298715,
        "sender_full_name": "Alok Singh",
        "timestamp": 1760170018
    },
    {
        "content": "<p>Someone had an algebra and cat theory there earlier in the year. Didn’t have any other options realistically. I was more hopeful for tech companies having event space to share but couldn’t find any.</p>",
        "id": 544339758,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1760206623
    },
    {
        "content": "<p>Relax dude, I don’t think you could do better than mox</p>",
        "id": 544473903,
        "sender_full_name": "Alok Singh",
        "timestamp": 1760339514
    },
    {
        "content": "<p>I just saw this thread - I'm definitely interested in this real analysis thing, although I'm not sure if i can consistently commit to it with my work schedule. I'm curious if this ended up happening or if it's possible to join late <span class=\"user-mention\" data-user-id=\"488971\">@Rado Kirov</span></p>",
        "id": 553530162,
        "sender_full_name": "Greg Shuflin",
        "timestamp": 1762233944
    },
    {
        "content": "<p>Not to late at all, we met 3-4 times only so far and most people are still on NNG or chapter 2. Just join the discord  <a href=\"https://discord.com/invite/bXNPhQyjfe\">https://discord.com/invite/bXNPhQyjfe</a> to get the rest of the details.</p>",
        "id": 553538308,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1762239152
    }
]