[
    {
        "content": "<p>Discussion thread.</p>",
        "id": 494219765,
        "sender_full_name": "Jason Rute",
        "timestamp": 1737055951
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"417967\">@Abdalrhman M Mohamed</span> I missed a lot of the talk.  I'll watch the videos or see the slides later, but when you say there aren't any Lean benchmarks, what do you need in a Lean benchmark that the AI benchmarks don't have?  Do you need the premises to be explicitly given?</p>",
        "id": 494219988,
        "sender_full_name": "Jason Rute",
        "timestamp": 1737056028
    },
    {
        "content": "<p>By AI benchmarks, I mean things like MiniF2F, ProofNet, PutnamBench, and others.</p>",
        "id": 494220124,
        "sender_full_name": "Jason Rute",
        "timestamp": 1737056083
    },
    {
        "content": "<p>Yes, exactly. We need the necessary axioms for any theory not natively supported by SMT solvers. Additionally, we want to compare against ATP tactics, which are currently limited in Lean (I can only think of <code>duper</code>). Therefore, we want to compare with tactics from other theorem provers, such as Isabelle's Sledgehammer and SMTCoq. For this, the problems should either be in a standard format (e.g., SMT-LIB v2) or translated into the logic of other provers.</p>",
        "id": 494222170,
        "sender_full_name": "Abdalrhman M Mohamed",
        "timestamp": 1737056985
    },
    {
        "content": "<p>Also, there are already premise selectors like Lean Copilot.  I'm not saying they are the best, but you could try to hook them up so as to have a list of premises for each theorem and test that.  I once asked about this for <code>duper</code> (to implement MagnusHammer in Lean) but <a href=\"#narrow/channel/113488-general/topic/Duper/near/408651190\">I was told it wouldn't work</a> as <code>duper</code> is too sensitive to getting too many premises.  I think I should have actually asked about <code>auto</code>.  (I still get confused between <code>lean-smt</code>, <code>auto</code>, <code>duper</code>, <code>canonical</code> and the like.)  Anyway, I think one just needs to make a benchmark using Lean Copilot lemma suggestions and these symbolic tools to get a sense if the magnushammer approach has merit in Lean.</p>",
        "id": 494222199,
        "sender_full_name": "Jason Rute",
        "timestamp": 1737056999
    },
    {
        "content": "<p>Here are the slides: <a href=\"/user_uploads/3121/A1vt6X588kNkpEByt-wcyPTf/lean-SMT.pdf\">lean-SMT.pdf</a></p>",
        "id": 494222729,
        "sender_full_name": "Abdalrhman M Mohamed",
        "timestamp": 1737057191
    },
    {
        "content": "<p>What do you think lean-SMT is useful for?  It seems like it doesn't currently work as a black box proof automation tool, since the user has to supply a lot of theorems?  Do you just imagine some very specific cases, maybe industrial ones?  Or do you imagine something more general?  What is an application this would really shine at in Lean?</p>",
        "id": 494224156,
        "sender_full_name": "Jason Rute",
        "timestamp": 1737057798
    },
    {
        "content": "<p>Also, I know there was a question at the end about what you need to get it to be more like the Isabelle Sledge Hammer (from \"walking\" to \"running\"), but I didn't catch the details.  Could you say that again here?</p>",
        "id": 494224775,
        "sender_full_name": "Jason Rute",
        "timestamp": 1737058066
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 494225088,
        "sender_full_name": "Abdalrhman M Mohamed",
        "timestamp": 1737058198
    },
    {
        "content": "<p>I mean, duper and egg are kind of in the same box regarding requiring premise-selection. I know that egg has some idea of having 'egg baskets', but it seems like a band-aid on top of the general need to have a good automated premise selection algo</p>",
        "id": 494227128,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1737059103
    },
    {
        "content": "<p>It seems there might be some confusion about the role of each Lean tactic. Let me clarify and expand on this (according to my understanding):</p>\n<p><strong>First question:</strong> What do we need for a hammer tactic in Lean?<br>\nWe need three components:</p>\n<ul>\n<li>A component that scans the current Lean environment and selects the relevant set of available lemmas.</li>\n<li>A component that translates the current Lean goal into an ATP's logic (HOL/FOL).</li>\n<li>A component that uses the relevant lemmas to construct a proof for the Lean goal. This can be further divided into two sub-components:<ul>\n<li>An oracle that generates additional hints to help the next step (e.g., quantifier instantiations, arithmetic hints, etc.).</li>\n<li>A component that tries to reconstruct the oracle's reasoning steps as a Lean proof using the relevent lemmas and hints.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Second question:</strong> What do we currently have in Lean?<br>\nCurrently, we have the following:</p>\n<ul>\n<li>For the first component, we have AI-based premise selectors based on what you mentioned earlier.</li>\n<li>For the second component, we have lean-auto. Note: while lean-auto has an additional functionality to invoke an oracle (TPTP/SMT solver) on a goal, it only relays the results to the user and doesn't generate the proof needed to prove the goal.</li>\n<li>For the third component, we have an abundance of TPTP/SMT solvers that can serve as oracles to provide hints. We also have tactics like <code>aesop</code> and <code>duper</code> to do the proof search and construct proofs for the oracle hints and the goal.</li>\n</ul>\n<p>For the third component, we now also have the <code>smt</code> tactic. This tactic is tailored towards SMT solvers that generate detailed proofs of their results (like cvc5 and veriT), and has specialized tools to efficiently construct a Lean proof from a cvc5 proof (which is guaranteed to succeed). It is also more cautious about translating Lean goals into SMT-LIB to ensure that the reconstructed proof can immediately close the goal (without needing to do more search). Note, however, that this also means that the reconstruction step of this tactic is too specialized to be useful for a magnushammer-like tactic.</p>\n<p><strong>Third question:</strong> What is needed to have a Lean version of Sledgehammer?<br>\nMainly, we need a tool that combines all three components. We also need more tools for the first component (including non-ML-based ones) and the third component. <span class=\"user-mention\" data-user-id=\"436568\">@Josh Clune</span> and <span class=\"user-mention\" data-user-id=\"524339\">@Yicheng Qian</span> have more knowledge about efforts in this direction.</p>",
        "id": 494234275,
        "sender_full_name": "Abdalrhman M Mohamed",
        "timestamp": 1737062290
    },
    {
        "content": "<p>Ok, so this is only the reconstruction part?  But it reconstructs the proof instead of just sending the found premises to some powerful Lean tactic?  Is that right?</p>",
        "id": 494234988,
        "sender_full_name": "Jason Rute",
        "timestamp": 1737062625
    },
    {
        "content": "<p>Yes. It can either be used to directly solve problems already within the SMT solver's logic or as a backend for a sledgehammer tactic. Right now, it can be used as a backend for <code>auto</code>.</p>",
        "id": 494237324,
        "sender_full_name": "Abdalrhman M Mohamed",
        "timestamp": 1737063482
    },
    {
        "content": "<p>Speaking of premises selection for Lean 4, currently several students at CMU are working on it. I think Jeremy Avigad is leading the project, but I could be wrong.</p>",
        "id": 494241097,
        "sender_full_name": "Yicheng Qian",
        "timestamp": 1737065023
    },
    {
        "content": "<p><span aria-label=\"video camera\" class=\"emoji emoji-1f4f9\" role=\"img\" title=\"video camera\">:video_camera:</span> Video recording: <a href=\"https://youtu.be/T9fhMJmJRAw\">https://youtu.be/T9fhMJmJRAw</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"T9fhMJmJRAw\" href=\"https://youtu.be/T9fhMJmJRAw\"><img src=\"https://uploads.zulipusercontent.net/d05ccf3b31f625b14814383d0cef1793773730b5/68747470733a2f2f692e7974696d672e636f6d2f76692f543966684d4a6d4a5241772f64656661756c742e6a7067\"></a></div>",
        "id": 494257781,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1737073534
    }
]