[
    {
        "content": "<p>Discussion thread</p>",
        "id": 494200198,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1737048822
    },
    {
        "content": "<p>Slides: <a href=\"/user_uploads/3121/4SnOPorTjPmWXMjdZ-jYz31D/carleson.pdf\">carleson.pdf</a></p>",
        "id": 494200295,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1737048846
    },
    {
        "content": "<p>Unfortunately I don't have time to be around in the social time later tonight, but feel free to ask any questions here.</p>",
        "id": 494200370,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1737048875
    },
    {
        "content": "<p>Can you post the handout pdf as well?</p>",
        "id": 494213245,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1737053430
    },
    {
        "content": "<p>I've only looked at the slides, as the video isn't up, so apologies if this was discussed.</p>\n<p>Fast-forwarding to completion (<span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span>!) of the project, it sounds like you are not intending to upstream the bulk of the proof to Mathlib. Long-term, does this mean that projects/developments needing Carleson's theorem as a blackbox will just be downstream of this project? Have you thought about a model for long-term maintenance of the project? If the current non-Mathlib-standard proof rotted, would its existence be a barrier to someone considering making a Mathlib version? (Because the academic credit, to the extent it existed in the first place, has already been \"used up\".)</p>\n<p>(These are meant to be awkward questions --- this is one of the best examples so far of a significant project that others are very likely to want to use as a dependency!)</p>",
        "id": 494252239,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1737070248
    },
    {
        "content": "<p>(I think the video is already up as of.. 6 minutes ago: <a href=\"https://www.youtube.com/watch?v=w29spLdOFrY\">https://www.youtube.com/watch?v=w29spLdOFrY</a> )</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"w29spLdOFrY\" href=\"https://www.youtube.com/watch?v=w29spLdOFrY\"><img src=\"https://uploads.zulipusercontent.net/bca8d4820d7b300943ab09726d2829768b9c1205/68747470733a2f2f692e7974696d672e636f6d2f76692f77323973704c644f4672592f64656661756c742e6a7067\"></a></div>",
        "id": 494252441,
        "sender_full_name": "Julian Berman",
        "timestamp": 1737070380
    },
    {
        "content": "<p>Maybe in cases like this the right answer is to upstream to Mathlib with a dispensation for a particular directory. i.e. we have <code>Analysis/Carleson/Statement.lean</code> and then <code>Analysis/Carleson/Proof/{X,Y,Z}.lean</code>, with a README.md file in the <code>Proof</code> directory saying \"The development in this directory is intentionally not at the usual level of generality aimed for in Mathlib, because the proof of Carleson is so difficult. Contributors are welcome to refactor and generalize, and where appropriate move material out of this directory.\"</p>\n<p>Obviously we'd want to be careful with such dispensations, but for foundational black boxes it could be okay.</p>",
        "id": 494254204,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1737071438
    },
    {
        "content": "<p>Good question! In practice, I'm more worried about the practical aspect of upstreaming (finding somebody with the time to do it)... the \"dispensation\" sounds like an interesting idea, to be employed with care.</p>",
        "id": 494315645,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1737105550
    },
    {
        "content": "<p>In an alternative world I am employed full-time upstreaming other people's projects <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span></p>",
        "id": 494316340,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1737105778
    },
    {
        "content": "<p>How are you doing on upstreaming your own projects? <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span></p>",
        "id": 494320295,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1737107012
    },
    {
        "content": "<p><a href=\"https://github.com/YaelDillies/LeanAPAP/tree/master/LeanAPAP\">One of them doesn't have a <code>Mathlib</code> folder anymore!</a></p>",
        "id": 494320510,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1737107076
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/channel/474713-Lean-Together-2025/topic/Floris.20van.20Doorn.3A.20Progress.20report.20on.20the.20Carleson.20Project/near/494213245\">said</a>:</p>\n<blockquote>\n<p>Can you post the handout pdf as well?</p>\n</blockquote>\n<p>I'm not sure what you're asking for. Some printer-friendly version of the slides?</p>\n<p><span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span>: This was not discussed, and these are good questions. I think these are also much broader questions than just for the Carleson project. I am definitely intending to keep the Carleson project compiling with the latest version of Lean for the foreseeable future. That seems like it comes at a relatively cheap cost (~30 minutes of work per month?), at least when the number of such projects is relatively small.</p>\n<p>I can broadly see three options for the Carleson project and similar projects:<br>\n(1) It stays as a separate project, and to use it you have to add it as a dependency;<br>\n(2) It becomes part of Mathlib, violating Mathlib's usual standards on generality;<br>\n(3) We start a new centralized repository (along the lines of a Archive of Formal Proofs for Lean) that has only a few inclusion criteria[1] ensuring that the code is relatively maintainable, but no promises on the \"proper generality\" of these results, or partially duplicating something else.</p>\n<p>Each of these has upsides but also significant downsides.<br>\nI'm starting to look more favorable on option (3): it will take a large amount of work to keep it updated, but maybe that is worth it compared to the current situations where many (small) projects don't get updated at all. There are costs and advantages here...</p>\n<p>[1]  Possible inclusion criteria: all/most Mathlib linters pass + doesn't compile too slowly + nothing in the root namespace + has done an effort to put parts in Mathlib + has some amount of documentation/references.</p>",
        "id": 494368310,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1737122725
    },
    {
        "content": "<p>Yeah</p>",
        "id": 494378913,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1737125980
    },
    {
        "content": "<p>Re (3) - if we set this up, we probably want to avoid a situation where trouble bumping one of the projects blocks everything else</p>",
        "id": 494379371,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1737126114
    },
    {
        "content": "<p>I think to be honest I would be opposed to (3) (at least in the sense of not wanting to be part of the \"we\") unless it came with a medium term plan to <em>pay someone</em> to do the upgrading work. If it came with such a plan then worth exploring!</p>",
        "id": 494481399,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1737176390
    },
    {
        "content": "<p>I agree, (3) is conditional on having someone who has is paid (at least part-time) to do the updating. </p>\n<p>I will keep the option in mind to request funding for something like this in upcoming grant proposals (I'm not planning anything in the short term).</p>",
        "id": 494776637,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1737370013
    }
]