[
    {
        "content": "<p>Discussion thread for this talk.</p>",
        "id": 493946294,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1736952961
    },
    {
        "content": "<p>My takeaway from this talk: <span class=\"user-mention silent\" data-user-id=\"478376\">Joseph Rotella</span> and <span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> went into dependent type theory hell and came out the other side alive. Very interesting!</p>",
        "id": 493947801,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1736953315
    },
    {
        "content": "<p>The battle with the DTT demons was all Joseph's <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 493956154,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1736955586
    },
    {
        "content": "<p>Joseph's <a href=\"https://cs.brown.edu/media/filer_public/b8/d7/b8d70bb1-9c0e-467f-aec6-aaf42019f169/rotellajoseph.pdf\">thesis</a> describes the fight in more detail!</p>",
        "id": 493956897,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1736955807
    },
    {
        "content": "<p><span aria-label=\"video camera\" class=\"emoji emoji-1f4f9\" role=\"img\" title=\"video camera\">:video_camera:</span> Video recording: <a href=\"https://youtu.be/pao0UQKoKO0\">https://youtu.be/pao0UQKoKO0</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"pao0UQKoKO0\" href=\"https://youtu.be/pao0UQKoKO0\"><img src=\"https://uploads.zulipusercontent.net/b19a6c82e065fa782006e3cdc09e6b22cba11a36/68747470733a2f2f692e7974696d672e636f6d2f76692f70616f3055514b6f4b4f302f64656661756c742e6a7067\"></a></div>",
        "id": 494102360,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1737020500
    },
    {
        "content": "<p>Thank you for the talk! It’s great to see dependently typed languages—and Lean in particular—applied to computer science concepts!</p>\n<p>I’m curious about the possibility of decoupling the table body’s representation from the API, type-level definitions, and proofs. Specifically, I wonder if it would be feasible to store data using column-oriented tables as an alternative to the row-oriented approach presented here. Additionally, it would be interesting to explore support for various “backends” to enable more efficient storage of larger datasets.</p>",
        "id": 494206653,
        "sender_full_name": "Yuri",
        "timestamp": 1737051115
    },
    {
        "content": "<blockquote>\n<p>Specifically, I wonder if it would be feasible to store data using column-oriented tables as an alternative to the row-oriented approach presented here.</p>\n</blockquote>\n<p>This is an interesting idea and one that I did consider: while you can do it, it comes with a bit more overhead than the row-wise approach. In particular, you have to disallow \"ragged\" tables at the type level by recording the table height—this ensures that all columns have the same number of rows. Because of this, you're effectively locked into tracking both dimensions of the table at the type level. With the row-wise approach, on the other hand, you're free not to enforce table height as a type-level invariant, but you're also free to add it (just switch out the list of rows in the table body for a vector of rows). But the column-wise representation doesn't give you the symmetric freedom not to track table width, because you're forced into implicitly doing that anyway by having to record the type of each column.</p>\n<blockquote>\n<p>Additionally, it would be interesting to explore support for various “backends” to enable more efficient storage of larger datasets.</p>\n</blockquote>\n<p>We didn't focus much on performance for this project, so there's a fair bit of low-hanging fruit even in Lean itself for optimizing performance, but interfacing with native code (if I'm interpreting your suggestion correctly) would also be an interesting avenue to explore!</p>",
        "id": 494231169,
        "sender_full_name": "Joseph Rotella",
        "timestamp": 1737060996
    }
]