[
    {
        "content": "<p>What would be the right way to deduplicate goals that are exactly identical? Meaning that the goal types are the same up to hypotheses, and the goals have exactly the same hypotheses<br>\nIf it helps, I have access to the mvars of the goals that are identical, but I can't simply say <code>goal1.assign (.mvar goal2)</code>, since the hypotheses are mvars that only exist in their respective goal contexts<br>\nFor context, this is part of what I'm trying to do in <a class=\"stream-topic\" data-stream-id=\"239415\" href=\"/#narrow/channel/239415-metaprogramming-.2F-tactics/topic/mutual.20induction.20tactic/with/502284678\">#metaprogramming / tactics &gt; mutual induction tactic</a> where I'm applying all mutual recursors of a mutual inductive type, but every recursor has identical subcases (but perhaps a deduplicating tactic might be useful independently)</p>",
        "id": 503607837,
        "sender_full_name": "Jonathan Chan",
        "timestamp": 1741201369
    },
    {
        "content": "<p>I think this is fundamentally not possible. Remeber that goals are holes in a proof time,and imagine what it would mean for the resulting proof term <code>foo ?goal1 ?goal2</code>. To deduplicate them you’d probably  want something like <code>let common := ?goal in foo common common</code>, but we can’t easily insert something “somewhere above”.</p>\n<p>One work-around I can imagine is to use <a href=\"https://leanprover-community.github.io/mathlib4_docs/Lean/Meta/Tactic/AuxLemma.html#Lean.Meta.mkAuxLemma\">Lean.Meta.mkAuxLemma</a> to write the new, common proof into a separate definition, and use that to assign the goals.</p>",
        "id": 503609169,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1741201711
    },
    {
        "content": "<p>The named placeholder elaborator might be some inspiration. It does local context comparisons to see if the metavariable is compatible, then restricts the local context of the other metavariable as necessary.</p>",
        "id": 503609764,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1741201866
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 503610668,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1741202092
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"407610\">Jonathan Chan</span> has marked this topic as resolved.</p>",
        "id": 503633616,
        "sender_full_name": "Notification Bot",
        "timestamp": 1741208819
    },
    {
        "content": "<p>If I were in this situation in a mathematical proof I would just extract the common lemma and then invoke it to fill in the holes.</p>",
        "id": 503637909,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1741210367
    },
    {
        "content": "<p>This also came up a few times before: <a class=\"stream-topic\" data-stream-id=\"239415\" href=\"/#narrow/channel/239415-metaprogramming-.2F-tactics/topic/Consolidating.20duplicate.20goals/with/438445006\">#metaprogramming / tactics &gt; Consolidating duplicate goals</a>  and there is a further link in that topic.</p>",
        "id": 503642531,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1741211976
    }
]