[
    {
        "content": "<p>Is there a way to supply Aesop with a TacGen that accepts arguments?</p>\n<p><a href=\"https://en.wikipedia.org/wiki/XY_problem\">#xy</a></p>\n<p>I am working on a tactic that should do the following:</p>\n<ol>\n<li>Call premise selection once (expensive)</li>\n<li>Construct an Aesop call of the form <code>aesop? (add unsafe premise1) (add unsafe premise2) ... (add unsafe (by myTactic? premises)</code></li>\n<li>Suggest a tactic sequence equivalent to the proof that <code>aesop?</code> finds</li>\n</ol>\n<p>The kink is that I don't want <code>(by myTactic? premises)</code> to appear in the final suggested tactic script. Instead, <code>(by myTactic? premises)</code> is itself a minimizing tactic, and I want the tactic script it outputs to to be inserted into the suggested tactic script (rather than <code>(by myTactic? premises)</code> itself).</p>\n<p>My understanding is that the intended way to achieve this affect is to use a <code>TacGen</code> which outputs an array of string suggestions for Aesop to try. This <em>would</em> be fine for my purposes, except that I need my <code>TacGen</code> to be able to accept arguments (specifically, I need to supply it the premises from premise selection). As best as I can tell, the current interface doesn't provide a means of using a function of the form <code>myTacGen : myArgs → Aesop.TacGen</code>. In my use case, it would technically be possible to construct <code>mySlowTacGen : Aesop.TacGen</code> by moving premise selection inside of the <code>TacGen</code>, but because premise selection is prohibitively expensive, this isn't a practical solution for my use case.</p>\n<p>Is there a way to achieve my desired behavior with the current interface? If not, would a PR that modifies the current interface to allow this behavior be accepted/allowed?</p>",
        "id": 514819898,
        "sender_full_name": "Josh Clune",
        "timestamp": 1745848218
    },
    {
        "content": "<p>I think your tactic can proceed as follows:</p>\n<ol>\n<li>Get the <code>premises</code>.</li>\n<li>Define (i.e., add to the environment) a <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Aesop.SingleRuleTac#doc\">docs#Aesop.SingleRuleTac</a> <code>tac</code> that calls <code>myTactic</code> with <code>premises</code>. At this level, you have full control over the tactic sequence that <code>aesop?</code> inserts in place of <code>tac</code>.</li>\n<li>Construct syntax for the Aesop call <code>aesop? (add unsafe p1) ... (add unsafe tac)</code> and <code>evalTactic</code> it.</li>\n</ol>",
        "id": 514839054,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1745852903
    },
    {
        "content": "<p>For the wrapping that's required to turn a tactic into a <code>SingleRuleTac</code>, you can take inspiration from <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Aesop.RuleTac.tacticStx#doc\">docs#Aesop.RuleTac.tacticStx</a>.</p>",
        "id": 514840256,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1745853216
    },
    {
        "content": "<p>That works, thanks!</p>",
        "id": 514916236,
        "sender_full_name": "Josh Clune",
        "timestamp": 1745880298
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"436568\">Josh Clune</span> has marked this topic as resolved.</p>",
        "id": 514916242,
        "sender_full_name": "Notification Bot",
        "timestamp": 1745880300
    }
]