[
    {
        "content": "<p>for my own education, I'm trying to write something that will take a declaration of a class that represents models of an equational theory, such as (the obvious definition of) Monoid, and automatically declares a class like e.g. MonoidHomomorphism</p>\n<p>I'm <del>agnostic</del> indifferent to how the syntax will look because I haven't been able to get anything to work, but it could look like</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"kd\">@[</span><span class=\"n\">algebraic</span><span class=\"kd\">]</span><span class=\"w\"> </span><span class=\"kn\">class</span><span class=\"w\"> </span><span class=\"n\">Monoid</span><span class=\"w\"> </span><span class=\"o\">(</span><span class=\"n\">a</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"kt\">Type</span><span class=\"o\">)</span><span class=\"w\"> </span><span class=\"kn\">where</span>\n<span class=\"w\">    </span><span class=\"n\">mult</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">a</span><span class=\"w\"> </span><span class=\"bp\">\\</span><span class=\"n\">to</span><span class=\"w\"> </span><span class=\"n\">a</span><span class=\"w\"> </span><span class=\"bp\">\\</span><span class=\"n\">to</span><span class=\"w\"> </span><span class=\"n\">a</span>\n<span class=\"c1\">---...  etc.</span>\n\n<span class=\"bp\">#</span><span class=\"n\">print</span><span class=\"w\"> </span><span class=\"n\">MonoidHomomorphism</span><span class=\"w\"> </span><span class=\"c1\">-- struct MonoidHomomoprhism (M : Type) (N :Type) [Monoid M] [Monoid N]  : Type</span>\n<span class=\"c1\">--... etc.</span>\n</code></pre></div>\n<p>Do I want a macro, elab, or attribute? or some combination, or something else? Like I said, I haven't been able to get any of these to work so far. Is this even possible?</p>\n<p>Also, would this type of thing ever make its way into mathlib, or does this go against any conventions? Note that your answer to this question will not determine whether I make this thing for myself</p>",
        "id": 569826928,
        "sender_full_name": "Perry",
        "timestamp": 1769218956
    },
    {
        "content": "<p>I think an attribute is indeed likely what you want, since attributes are applied to declarations (actual constants and their types and values, as Lean expressions), and I’m guessing you’d want to operate on the actual types of the class’s fields as opposed to their syntax! :)</p>",
        "id": 569827140,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1769219197
    },
    {
        "content": "<p>You’d then be doing your work primarily in the <code>add</code> field of the attribute, and you’d have the chance to operate on the declaration’s name with the environment available. This would let you check if it’s a class, look up the projections/fields and their values/types, then construct appropriate expressions for the types/values of your new declaration, and add the new declaration(s).</p>\n<p>Which doesn’t give you the hooks you need yet—there is a small zoo of different attribute kinds to choose from—but it is doable. The real work would be figuring out how to transform the expressions systematically, and the rest is fairly standard (if esoteric and not well-known!).</p>\n<p>You could in fact start with that hard part, and try to figure out how you’ll transform the <code>Expr</code>s of the class’s type and projections into the generated structure’s type and projections.</p>\n<p>(Various attributes already generate and add declarations, which you could pattern off of; for example, <code>to_additive</code>, though that particular example is quite complex. Surely there’s a better example… <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span>)</p>",
        "id": 569827739,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1769219852
    },
    {
        "content": "<p>thank you Thomas :) and thanks for giving me the impression that this not a very well-trodden path, was worried i was messing up something easy</p>",
        "id": 569830645,
        "sender_full_name": "Perry",
        "timestamp": 1769223394
    }
]