[
    {
        "content": "<p>I was wondering if it is possible to do something like <a href=\"https://github.com/MetaCoq/metacoq/blob/coq-8.19/examples/add_constructor.v\">this</a>, from MetaCoq, where you generate a new inductive using metaprogramming. In this example, it creates a new inductive, e.g. <code>bool'</code> , and adds a new constructor, but one can imagine other use cases. <br>\nI know some is possible just using macros, but I haven't found other similar examples as the one I mentioned before.</p>",
        "id": 474317690,
        "sender_full_name": "Tomás Díaz",
        "timestamp": 1727880385
    },
    {
        "content": "<p>It's certainly <em>possible</em>, but I don't think macros are the way you want to go. What all do you know about metaprogramming in Lean? Have you read the metaprogramming book? It doesn't cover all the things you would need (e.g., here you're going to need to be adding things to the environment).</p>",
        "id": 474318714,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1727880679
    },
    {
        "content": "<p>No, definitely don't want to use macros. I've read the book  but I guess I'm a bit at a loss with how to extend the environment with the new definitions (type, constructor, etc.). I'm comparing it now to metacoq's <code>tmMkInductive</code> that adds an inductive, although the <code>term</code> there includes a constructor for inductives.</p>",
        "id": 474383693,
        "sender_full_name": "Tomás Díaz",
        "timestamp": 1727898321
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Lean.addDecl#doc\">docs#Lean.addDecl</a> is the function that adds declarations to the environment. You can call this with a <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Lean.Declaration#doc\">docs#Lean.Declaration</a> object representing an inductive type to be added.</p>",
        "id": 474386951,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1727899262
    },
    {
        "content": "<p>interesting! thanks</p>",
        "id": 474494492,
        "sender_full_name": "Tomás Díaz",
        "timestamp": 1727937977
    }
]