[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> I'm looking at how to adapt Aesop to the new config syntax (which is very nice btw). Would it be possible to get a <code>TermElabM</code> version of <code>declare_config_elab</code>or a public version of <code>mkConfigElaborator</code>?</p>\n<p>(Also, should the <code>recover</code> field maybe move to the context of <code>TermElabM</code> instead of <code>TacticM</code>? Recovering from errors seems to me like a general elaboration concept and not something specific to tactics.)</p>",
        "id": 480436949,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1730724665
    },
    {
        "content": "<p>Yeah, a term elab version would be possible. I just didn't see any uses of configurations that needed it, so I didn't add it. For now I'd rather not make <code>mkConfigElaborator</code> a public interface.</p>\n<p>Regarding the <code>recover</code> state, I haven't spent time yet to fully understand what it's supposed to represent and how it's meant to be different from the TermElabM <code>errToSorry</code> state. I think ideally we would have a system that keeps track of whether a tactic is \"interactive\" or not, which has to do whether exceptions should be reported as log messages, and whether we should run diagnostics that would help a user figure out why a tactic failed.</p>\n<p>I've had a suspicion that <code>errToSorry</code> could be renamed <code>recover</code>. That's likely incorrect, but it seems worth looking into.</p>",
        "id": 480492682,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1730741251
    },
    {
        "content": "<p>Question though <span class=\"user-mention\" data-user-id=\"256311\">@Jannis Limperg</span>: does Aesop need to be elaborating its configurations in TermElabM? Or would it be better to stick with TacticM, and if you do need to elaborate any terms, use <code>Tactic.elabTerm</code>, etc., to make sure elaboration is completed on each term individually?</p>",
        "id": 480494144,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1730741799
    },
    {
        "content": "<p>Is it that you're running into needing to have the Aesop ruleset parser work both for attributes and tactics?</p>",
        "id": 480494422,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1730741897
    },
    {
        "content": "<p>I think I could lift everything in the specific file that sparked this discussion into <code>TacticM</code> because it only concerns the elaboration of tactic arguments. And indeed I should maybe be using <code>Tactic.elabTerm</code> and friends there. I currently solve any elaboration-related problems by shotgun-disabling all the advanced elaboration features. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>\n<p>However, there are indeed other parts of Aesop's frontend that are meant to be usable from attributes, so there <code>TacticM</code> wouldn't make as much sense. As far as I can tell, I could use the <code>TacticM</code> functions anyway and then <code>run</code> with an empty goal list. But this, to me, indicates that these functions shouldn't be in <code>TacticM</code> in the first place: they only use the <code>recover</code> field, not the actual goals.</p>",
        "id": 480523935,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1730753360
    },
    {
        "content": "<p>For <code>@[simps]</code>, the way I upgraded it was to lift the command version of the elaborator to AttrM</p>",
        "id": 480524125,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1730753447
    },
    {
        "content": "<p>Ah yeah, that would work as well.</p>",
        "id": 480524221,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1730753501
    }
]