[
    {
        "content": "<p>Is there a version of <code>mkLambdaFVars</code> which takes an array of binderinfos (of the same length as the array of metavariables to abstract) such that the i:th index of the array of binderinfos gives the binderinfo for the i:th metavariable? Currently, I am using quite an awkward workaround by applying <code>mkLambdaFVars</code> to one metavariable at a time, so that I can control the binderinfo at each step.</p>",
        "id": 464819901,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1724494678
    },
    {
        "content": "<p>I was looking for this as well and didn't find it. Shouldn't be too hard to write it yourself by copy-pasting the <code>mkLambdaFVars</code> code.</p>",
        "id": 465216054,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1724685570
    },
    {
        "content": "<p>If it were for fvars, you would use <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Lean.Meta.withNewBinderInfos#doc\">docs#Lean.Meta.withNewBinderInfos</a> to change the binder infos and then use <code>mkLambdaFVars</code> from within that context.</p>",
        "id": 465218320,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1724686140
    },
    {
        "content": "<p>I think the API tends to work better with fvars — do you mind if I ask why you're abstracting mvars? Sometimes I've noticed people reaching for meta telescopes when they could be using the other telescope functions.</p>",
        "id": 465219565,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1724686382
    },
    {
        "content": "<p>This was in the context of <a class=\"stream-topic\" data-stream-id=\"239415\" href=\"/#narrow/stream/239415-metaprogramming-.2F-tactics/topic/Specializing.20function.20at.20unknown.20point.20.28and.20univese.20issues.29\">#metaprogramming / tactics &gt; Specializing function at unknown point (and univese issues)</a>. It should definitely be possible to solve this with an fvar telescope instead, but it would have been harder in other ways. Specifically, we wanted to replace an fvar with a particular value and with fvars, we would have had to make this replacement everywhere in later fvars whereas with mvars this is free.</p>",
        "id": 465236068,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1724691160
    },
    {
        "content": "<p>Yes exactly, I was not sure how to do that part with FVars. When starting to write that code I was actually constantly switching between using <code>forallTelescope</code> and <code>forallMetaTelescope</code>, and I ended up making the most progress with the latter.</p>",
        "id": 465237073,
        "sender_full_name": "Calle Sönne",
        "timestamp": 1724691591
    }
]