[
    {
        "content": "<p>The Church's thesis states that all total functions are computable, in some constructive deduction system. Through lean (assuming it contains the axiom of choice) is not constructive, functions defined without nonconstructive machineries are computable in meta sense.</p>\n<p>Thus, it is natural to add new axiom, say partial Church's thesis,  that states \"all functions <code>f : α → β</code>, <code>α </code> and <code>β</code> are <code>Primcodable</code>, such that <code>Lean.isNoncomputable</code> return <code>false</code> are <code>Computable</code>\". <br>\nIt is obviously conservative extention, through it may speedup the proofs.</p>\n<p>My questions are:</p>\n<ol>\n<li>How can we add this axiom? (Sorry, I am not familiar with metaprogramming)</li>\n<li>Is it thinkable to add this axiom to Mathlib? Because the proof of computability is obvious from its definition, but the proof looks horrible in some cases.</li>\n</ol>",
        "id": 518790999,
        "sender_full_name": "Palalansoukî",
        "timestamp": 1747464408
    },
    {
        "content": "<p>Mathlib has a no axiom policy. If you can prove things using the axiom then the way to get them into mathlib is to state the axiom as a Prop and then prove theorems of the form \"the proposition implies X\"</p>",
        "id": 518797111,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747469635
    },
    {
        "content": "<p>Note that <span class=\"user-mention\" data-user-id=\"414485\">@Palalansoukî</span> is proposing a whole family of axioms, on account of the clause \"such that <code>Lean.isNoncomputable</code> return <code>false</code>\". There is no way this is happening in Mathlib!</p>",
        "id": 518896341,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1747553412
    },
    {
        "content": "<p>Note that:</p>\n<ul>\n<li><code>noncomputable</code> doesn't actually mean the same thing as \"not computable\", it means that Lean can't figure out how to generate bytecode for it, which can be different in certain situations.</li>\n<li>Using <code>partial</code>, you can convert basically any <code>noncomputable</code> function to a computable function that just loops forever. So, your axiom would state that every function is <code>Computable</code>, which is false.</li>\n</ul>",
        "id": 519283393,
        "sender_full_name": "Niels Voss",
        "timestamp": 1747712627
    },
    {
        "content": "<p>I don't think there is any way to express this in lean as an actual axiom, unless you define <code>Lean.isNoncomputable f</code> as <code>not (Computable f)</code> in which case it's trivial. What this is instead is a metaprogram / tactic, and I <a href=\"#narrow/channel/113488-general/topic/.E2.9C.94.20Monadic.20DSL.20for.20Computability.20Proofs/near/519363482\">sketched</a> how one might go about doing that without axiomatic extensions.</p>",
        "id": 519375836,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1747745219
    }
]