[
    {
        "content": "<p>In his master thesis, <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> proves that Lean is equiconsistent with ZFC+{\"there are n inaccessible cardinals\" | n ∈ ℕ} (I didn't read the proof properly). I was wondering about nice classes of sentences such that they are provable in one of these theories iff they are provable in the other one (in particular, that can be translated reasonably between the languages of set theory and Lean). A reasonable such class could be higher-order arithmetic (however, there should be more expressive classes of formulas - for example allowing quantification over sets of ordinals in a certain universe respectively below one of the given inaccessibles - that still can be interpreted reasonably in either system).<br>\nAs a single, explicit question: Do both systems prove the same statements of higher order arithmetic? The obvious attempt would be to prove that both the construction of <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=ZFSet#doc\">docs#ZFSet</a> and the construction in Mario's thesis preserve truth of such statements. I'm relatively happy with the first of these constructions.</p>",
        "id": 490191789,
        "sender_full_name": "Sven Manthe",
        "timestamp": 1734711398
    },
    {
        "content": "<p>yes, the class of statements which are expressible in both settings is pretty large and encompasses basically all of ZFC</p>",
        "id": 490293484,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1734783073
    },
    {
        "content": "<p>so yes, higher order arithmetic, and also the continuum hypothesis, V=L and probably lots of other things</p>",
        "id": 490293568,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1734783148
    },
    {
        "content": "<p>the construction is intended specifically to be \"the obvious one\", i.e. types are sets, and consistent with the way we normally model mathematics in mathlib. So the translation of Fermat's last theorem in mathlib will be up to defeq almost exactly what you would write down to define Fermat's last theorem in ZFC</p>",
        "id": 490293752,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1734783338
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"651332\">Sven Manthe</span> has marked this topic as resolved.</p>",
        "id": 490320713,
        "sender_full_name": "Notification Bot",
        "timestamp": 1734807198
    }
]