[
    {
        "content": "<p>I’m working on formalising a fairly abstract Möbius inversion framework in Lean, aiming to unify Dirichlet inversion and inclusion–exclusion as instances of a single algebraic statement.</p>\n<p>Before duplicating work, I wanted to ask: is there already a general “abstract Möbius inversion” result in mathlib (e.g. phrased in terms of convolution algebras / incidence algebras), or is the existing coverage intentionally specialised to concrete settings like <code>ℕ</code> and <code>Finset</code>?</p>\n<p>For context, I’ve written up the mathematics in a short note here :<br>\n<a href=\"https://doi.org/10.5281/zenodo.18075722\">[link]</a></p>\n<p>I’m mainly interested in whether this abstraction aligns with current mathlib design, or whether it would be considered out of scope.</p>",
        "id": 565922491,
        "sender_full_name": "Bob Jefferson",
        "timestamp": 1767205810
    },
    {
        "content": "<p>I see <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=IncidenceAlgebra.moebius_inversion_bot#doc\">docs#IncidenceAlgebra.moebius_inversion_bot</a></p>",
        "id": 565922886,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1767206203
    },
    {
        "content": "<p>Thanks, that’s very helpful — I wasn’t aware of <code>IncidenceAlgebra.moebius_inversion_bot</code>, and this looks like exactly the right level of abstraction.</p>\n<p>My interest here is less in reproving Möbius inversion per se, and more in understanding and explaining why Dirichlet inversion on <code>ℕ</code> and inclusion–exclusion on finite sets are instances of the same underlying mechanism, and how that perspective should guide formalisation choices.</p>\n<p>I’ve attempted to lay out that conceptual unification for human readers, with those two cases as motivating examples, and it’s reassuring to see that the abstraction mathlib uses lines up with that viewpoint.</p>\n<p>As a follow-up question: are there existing examples in mathlib that explicitly specialise <code>IncidenceAlgebra</code> to recover Dirichlet convolution or inclusion–exclusion, or would those be reasonable illustrative additions?</p>",
        "id": 565923686,
        "sender_full_name": "Bob Jefferson",
        "timestamp": 1767206906
    },
    {
        "content": "<p>No, currently nothing uses <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=IncidenceAlgebra#doc\">docs#IncidenceAlgebra</a></p>",
        "id": 565926182,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1767209059
    },
    {
        "content": "<p>Ah, so in that case, would it be considered reasonable to add illustrative specialisations (e.g. Dirichlet convolution on <code>ℕ</code>, or inclusion–exclusion on finite sets) as documentation or examples for <code>IncidenceAlgebra</code>, or is the intention that it remain a purely abstract interface?</p>",
        "id": 565929361,
        "sender_full_name": "Bob Jefferson",
        "timestamp": 1767211842
    },
    {
        "content": "<p>Sure, we need applications!</p>",
        "id": 565930061,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1767212522
    },
    {
        "content": "<p>Makes sense. By “applications”, do you mean small illustrative specialisations (Dirichlet, IE), or something more substantial?</p>",
        "id": 565930325,
        "sender_full_name": "Bob Jefferson",
        "timestamp": 1767212799
    },
    {
        "content": "<p>The ones you mentioned are good first ones. I'm sure there are more, but I'm not aware of them</p>",
        "id": 565930416,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1767212872
    },
    {
        "content": "<p>That’s helpful to know. I might explore a small illustrative example at some point.</p>",
        "id": 565930533,
        "sender_full_name": "Bob Jefferson",
        "timestamp": 1767212988
    }
]