[
    {
        "content": "<p>Just wondering out loud, how could one formalize tricategories a la <a href=\"https://ncatlab.org/nlab/files/Gurski-AlgebraicTricategories.pdf\">Gurski</a> in Lean in a way that is manageable and potentially useful? The  <code>Bicategory</code> approach is extending <code>CategoryStruct</code> and then deciding on a simp normal form for 2-cells; are there other alternatives?</p>",
        "id": 565843827,
        "sender_full_name": "Fernando Chu",
        "timestamp": 1767139032
    },
    {
        "content": "<p>My gut feeling is that yes, for tricategories the \"same approach\" as bicategories (a <code>CategoryStruct</code> on top of which a <code>Bicategory</code> instance is added on the quiver homs) would work.  However, as 2-cells would be objects of a category (as 1-cells in a bicategory), trying to rely on simp will run into the usual problems (rewriting in 2-cells will lead to bad typing whenever there are 3-cells lying around).</p>\n<p>As for making it \"potentially useful\", as for categories and bicategories, we can’t define tricategorical concepts in bicategories as the corresponding concept in the tricategory of bicategories, this would not have enough universe polymorphism (think e.g how equivalences of categories are defined in mathlib: it is not defined as an equivalence in the bicategory of categories). IMO what would be more useful (at least, for mathlib as it is now) would be to define the tricategorical concepts that we are missing on bicategories (bi-equivalences, bi-adjunctions, monoidal/braided/sylleptic/symmetric monoidal bicategories...) first before trying to have a formal theory and definition of tricategories.</p>",
        "id": 565880324,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1767174307
    },
    {
        "content": "<p>(note that for bi-equivalences in bicategories, I think <span class=\"user-mention\" data-user-id=\"581787\">@Judah Towery</span> is already working on them)</p>",
        "id": 565882897,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1767176276
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"286014\">Robin Carlier</span> <a href=\"#narrow/channel/116395-maths/topic/Algebraic.20tricategories.20in.20Lean/near/565880324\">said</a>:</p>\n<blockquote>\n<p>...this would not have enough universe polymorphism</p>\n</blockquote>\n<p>I had not realized about this problem. That is quite unfortunate. Thanks for the insights!</p>",
        "id": 565913191,
        "sender_full_name": "Fernando Chu",
        "timestamp": 1767198706
    }
]