[
    {
        "content": "<p>Is there a proof of the Birkhoff ergodic theorem that works (directly) for functions <code>f : α → E</code>, not <code>f : α → ℝ</code>?</p>",
        "id": 389045505,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1693858245
    },
    {
        "content": "<p>I understand that we can prove it for <code>f : α → ℝ</code>, then go to <code>f : α → E</code> for a \"nice\" <code>E</code> (not sure about specific assumptions).</p>",
        "id": 389045555,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1693858296
    },
    {
        "content": "<p>BTW, is it true for an infinite dimensional <code>E</code>?</p>",
        "id": 389060951,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1693866584
    },
    {
        "content": "<p>I only know proofs that go through <code>ℝ</code>, using the order structure and maximal inequalities. Once you have it for <code>ℝ</code>, you deduce it for an arbitrary Banach space (for ae strongly measurable functions), by approximating the function by a finite linear combination of characteristic functions. For each of these, the one-dimensional result applies, and taking the norm you can also estimate the error in the approximation using the one-dimensional result.</p>",
        "id": 389113654,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1693894797
    },
    {
        "content": "<p>Thank you! I'll think about details tomorrow.</p>",
        "id": 389114336,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1693895100
    },
    {
        "content": "<p>Is this implication written somewhere? I tried to fill in the details and failed.</p>",
        "id": 389525340,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1694039075
    },
    {
        "content": "<p>Maybe I was overly optimistic. Let me try to write down the details, in the ergodic case first for simplicity.</p>\n<p>Let <code>u : E -&gt; F</code> be integrable. It is approximated in <code>L^1</code> by a simple function <code>∑ i, 1_{s_i} • a i</code>, where <code>a i</code> are elements of <code>F</code> and <code>s i</code> are measurable sets. Say <code>u = v + ∑ i, 1_{s_i} • a i</code> where <code>v</code> has <code>L^1</code> norm at most epsilon.</p>\n<p>Then <code>S_n u / n = S_n v / n + ∑ i, (S_n 1_{s_i})/n • a i</code>. Almost everywhere, the latter sum converges (by Birkhoff applied to the real function <code>1_{s_i}</code>), while the limsup of <code>S_n v / n</code> is bounded by epsilon (again by Birkhoff applied to the norm of <code>v</code>). It follows that <code>S_n u / n</code> oscillates asymptotically by at most epsilon.</p>\n<p>Letting epsilon tend to zero along a countable sequence, one deduces that, almost surely, <code>S_n u / n</code> is a Cauchy sequence, therefore convergent. Its limit is an invariant function, therefore constant. As its integral is the integral of <code>u</code>, this constant is the integral of <code>u</code>.</p>",
        "id": 389574329,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1694065054
    },
    {
        "content": "<p>Consider now the slightly harder non-ergodic case. Then <code>S_n ||v|| / n</code> still converges almost surely, but its limit (the conditional expectation of ||v|| with respect to the invariant sigma-algebra) doesn't have to be small everywhere. However, it is bounded by epsilon in L^1, so it is smaller than epsilon^{1/2} outside of a set of small measure (at most epsilon^{1/2}). Moreover, the conditional expectation of <code>u</code> is close to <code>∑ i, E(1_{s_i} | I) • a i</code> again outside a set of small measure. Taking <code>epsilon_n = 2^{-n}</code> and applying Borel-Cantelli, one obtains the almost sure convergence of <code>S_n u / n</code> to <code>E(u | I)</code>.</p>",
        "id": 389574453,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1694065101
    },
    {
        "content": "<p>I think that I missed the Borel-Cantelli step when I was trying to do that. Thank you!</p>",
        "id": 389585756,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1694070280
    },
    {
        "content": "<p>I realized that we didn't even have the strong law of large numbers for vector-valued observables, so I implemented it following the above proof sketch (but without the need for Borel-Cantelli as there are only constant limits), see <a href=\"https://github.com/leanprover-community/mathlib4/pull/7218\">#7218</a>. It went pretty smoothly (although it highlighted some gaps in the library and some superfluous second-countability assumptions here and there, as always).</p>",
        "id": 391470731,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1694938794
    },
    {
        "content": "<p>In the meantime, I'm busy with dull stuff like getting rid of <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Metric.Bounded#doc\">docs#Metric.Bounded</a> and migrating to <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Bornology.IsBounded#doc\">docs#Bornology.IsBounded</a>.</p>",
        "id": 391580230,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1694988695
    }
]