[
    {
        "content": "<p>I am interested in the possibility of formalizing the proof of the cobordism hypothesis for topological field theories in 1-dimension in lean. Potentially following arXiv:1210.0229. </p>\n<p>Do people think this would be possible?<br>\nGetting ahead of myself - if there is another interest, maybe it is worth setting up a GitHub repository with this aim in mind.</p>\n<p>(Sorry if this is the wrong stream to ask this.)</p>",
        "id": 407950508,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1702557312
    },
    {
        "content": "<p>Can you list some of the ingredients that would be needed for this?</p>",
        "id": 407951402,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1702557638
    },
    {
        "content": "<p>Symmetric monoidal infinity-categories and functors between them (basically the first few chapters of Lurie's higher topos theory, and higher algebra books). We would also need some properties of oriented 1-dimensional manifolds, maps between them, isotopies between those etc.</p>",
        "id": 407953537,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1702558390
    },
    {
        "content": "<p>I think symmetric monoidal infty cats might be a pretty tough challenge.</p>",
        "id": 407958074,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1702559880
    },
    {
        "content": "<p>AFAICT, mathlib doesn't have the classification of 1-manifolds yet - this would be useful in its own (and fairly doable, I'd think). Differential topology uses this all of the place. I'd be excited to see this; I cannot say yet if I'd have time to join this effort.</p>",
        "id": 407960935,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1702560892
    },
    {
        "content": "<p>Yeah I was going to say that it might be the case that oriented 1-dimensional manifolds was more of a challenge! We have very little about manifolds beyond basic definitions of manifolds and vector bundles incl tangent bundle.</p>",
        "id": 408018718,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1702578181
    }
]