[
    {
        "content": "<p>Dear all,</p>\n<p>I am pleased to announce the public release of a formalization project that has kept me quite busy for the last few months: formalizing \"unbiased\" versions of symmetric monoidal categories, and linking these unbiased definitions to the ones that we have in mathlib. The repository can be found <a href=\"https://github.com/robin-carlier/SymmMonCoherence\">here</a>.</p>\n<p>By \"unbiased\" symmetric monoidal categories, I mean versions of the notion where tensor product functors are available in all arities, and have natural actions of permutations.<br>\nFormally, the objects I think of as unbiased symmetric monoidal categories are pseudofunctors <code>BurnsideFintype ⥤ᵖ Cat</code> that preserve products, where <code>BurnsideFintype</code> is the (2,1)-category of spans of finite types, i.e the bicategory of spans in <code>FintypeCat</code> where non-invertible 2-morphisms are discarded. This point of view on symmetric monoidal categories was taken (in a suitably higher categorical setting) by Cranch in <a href=\"https://arxiv.org/abs/1011.3243\">his 2009 thesis</a> as a way to model symmetric monoidal infinity-categories. My repo formalizes the construction of such a pseudofunctor from Mathlib's version of a symmetric monoidal category.</p>\n<p>The main technical difficulty in this project is that the classical constructor for a symmetric monoidal category only requires low-arity data and involves finitely many diagrams, while the construction of a pseudofunctor as above requires coherence of this data in arbitrary arity. Quite unsurprisingly, the main ingredient in the construction is Mac Lane’s coherence theorem.<br>\nFollowing similar constructions found in <a href=\"https://nva.sikt.no/registration/0198f1714e08-ec2b3f03-26a6-4e26-a74b-10cf6c5e4903\">S. Piceghello’s thesis</a>, who formalized part of the coherence theorem in a Rocq + HoTT setting, I was able to formalize the coherence theorem as a symmetric monoidal equivalence of categories between the free symmetric monoidal category on a finite type <code>J</code> and the Pi-category <code>J → Core (FintypeCat)</code>, where the latter has the monoidal structure coming from the disjoint sum of types. The main idea (due to Piceghello), is to introduce and study an intermediate category of symmetric lists on a type, which is a categorified version of <code>Multiset</code>. The link between symmetric lists and finite sets, which was not fully formalized in the HoTT setting, comes from a correspondence between the relations that define hom-types in symmetric lists and the presentation of permutations as a Coxeter group (<a href=\"#narrow/channel/116395-maths/topic/Equiv.2EPerm.20.28Fin.20.28n.20.2B.201.29.29.20is.20a.20Coxeter.20group/with/559095481\">which is why I formalized this presentation</a>).</p>\n<p>You can find a small overview of the results in the repo in <a href=\"https://github.com/robin-carlier/SymmMonCoherence/blob/master/SymmMonCoherence.lean\">this file</a>, and some extra information on the repo content in the <a href=\"https://github.com/robin-carlier/SymmMonCoherence/blob/master/README.md\">README</a>.</p>\n<p>(Small clarification edit: the project is now at the \"yay I did it sorry-free\" stage, and some code in here definitely needs some clean-up!)</p>",
        "id": 570353454,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1769528290
    }
]