[
    {
        "content": "<p>Is anyone working of diagonalisable endomorphisms? I would like to give this as a summer projects to some students. I am thinking about algebraic/geometric multiplicity of eigenvalues and stuff like that.</p>",
        "id": 365150680,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1686412235
    },
    {
        "content": "<p>I would guess that <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> <span class=\"user-mention\" data-user-id=\"197836\">@Jireh Loreaux</span> and <span class=\"user-mention\" data-user-id=\"311453\">@Frédéric Dupuis</span> have opinions on that. the problem is to find the correct generality. finite dimensions are for sure overkill for most things. if you just want to do something with eigenvalues you probably don't need to assume that much, but then there is still the question whether to use linear maps (used in the fin-dim case), continuous linear maps (infinite-dim case for bounded operators) or partial linear maps (infinite case, unbounded operators).<br>\nI would say that if you just want some fun projects, then doing finite dimensional theory is probably a good idea, but the students should not expect to contribute to mathlib. for mathlib-ready code I would assume that we need some more discussions with the above mentioned people to figure out how these things should look like.</p>",
        "id": 365257548,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1686470593
    },
    {
        "content": "<p>I will surely do finite dimensional (for the very good reason that the students don't know what Hilbert spaces/something more general are).</p>",
        "id": 365259626,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1686471422
    },
    {
        "content": "<p>I actually think the finite dimensional version is definitely something we want in mathlib. It's more general than its infinite dimensional cousins because the scalar field isn't restricted to <code>IsROrC</code> and there is no need for an inner product space.</p>\n<p>I think doing it for endomorphisms (linear maps) as opposed to matrices is the way to go, at least for the initial result. My opinion: go for it.</p>",
        "id": 365303109,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1686485157
    },
    {
        "content": "<p>Exactly, there are really two theories here: a purely algebraic one (which allows quite general coefficients, at least for statements) and then an analytical theory. I claim that the existence of the latter doesn't really impinge on the former: the algebraic side is its own self-contained thing.</p>",
        "id": 365303454,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1686485255
    },
    {
        "content": "<p>Probably the first definition to make is the concept of an endomorphism of a module being semi-simple (any invariant submodule has invariant complement).</p>",
        "id": 365303854,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1686485377
    },
    {
        "content": "<p>One could define that for an endomorphism of an object in any category: we have the lattice of subobjects defined in great generality. :-)</p>",
        "id": 365304878,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1686485670
    },
    {
        "content": "<p>We already have the structure theorem for f.g. modules over a PID, don't we? That should help.</p>",
        "id": 365447859,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1686549568
    },
    {
        "content": "<p>I wonder whether the uniqueness part ever got finished.</p>",
        "id": 365448008,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1686549610
    }
]