[
    {
        "content": "<p>Hi everyone. I'm talking to high school students next week about the maths behind the card game dobble (spot it!), i.e. finite projective planes. I want to mention the result of Lam, Thiel and Swiercz (<a href=\"https://www.cambridge.org/core/journals/canadian-journal-of-mathematics/article/nonexistence-of-finite-projective-planes-of-order-10/EBD5E851090B1983978BBC6FE18D2A3F\">https://www.cambridge.org/core/journals/canadian-journal-of-mathematics/article/nonexistence-of-finite-projective-planes-of-order-10/EBD5E851090B1983978BBC6FE18D2A3F</a>) that no finite projective planes of order 10 exist. They show this via a computer search. They also talk about the possibilty of software-errors asking at the end of the paper that they \"hope that someone else will do an independent verification of the results\". Searching for this I found <a href=\"https://arxiv.org/abs/2012.04715\">https://arxiv.org/abs/2012.04715</a> which \"certifies\" the earlier work (I don't understand what this means), but they write: Our work does not provide a completely formal proof of the nonexistence of a projective plane of order ten because we rely on results that currently have no formal computerverifiable proofs. I was wondering whether this is the state of the art, or whether there have been developments in some of the proof-assistants towards (the possibilty of) a formal verification?  Does anyone know? (I hope this is not off topic, if there is a better stream for this question please let me know).</p>",
        "id": 395105241,
        "sender_full_name": "Judith Ludwig",
        "timestamp": 1696533495
    },
    {
        "content": "<p>Hi Judith! This stream is perfectly fine for your question.</p>\n<p>We have <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Combinatorics/Configuration.html#Configuration.ProjectivePlane\">this</a> file about projective planes, so there is something in Mathlib. Let me tag the author of the file <span class=\"user-mention\" data-user-id=\"253861\">@Thomas Browning</span></p>",
        "id": 395107344,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1696534524
    },
    {
        "content": "<p>Concerning the paper, I <em>think</em> they certify in the sense they give something a software (like maple or whatever) can verify, not a proof in a proof assistant. But I can be very wrong.</p>",
        "id": 395107489,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1696534587
    },
    {
        "content": "<p>We can try to ping <span class=\"user-mention\" data-user-id=\"436482\">@Marijn Heule</span> to comment on this, but he isn't very often here. It is more likely than someone else from CMU can help.</p>",
        "id": 395108104,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1696534875
    },
    {
        "content": "<p>I don't know if any further work in Lean beyond the file I wrote (we don't even have examples of finite projective planes yet)</p>",
        "id": 395108378,
        "sender_full_name": "Thomas Browning",
        "timestamp": 1696535041
    },
    {
        "content": "<p>In any case, anything that requires a SAT solver is currently beyond the reach of Lean. But there are people working to bridge the gap. This also applies to other interactive theorem provers.</p>",
        "id": 395109742,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1696535671
    },
    {
        "content": "<p>See for instance the work of <a href=\"https://www.lri.fr/~keller/index-en.html\">Chantal Keller</a>, in particular <a href=\"https://smtcoq.github.io/\">https://smtcoq.github.io/</a>.</p>",
        "id": 395109783,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1696535691
    },
    {
        "content": "<p>I'm quite surprised that the computer scientists' eyes didn't light up at that proof back in the 90s.</p>",
        "id": 395112703,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1696537017
    },
    {
        "content": "<p>And by the way, we <em>still</em> (30 years, and a lot of computational power later) don't know about projective planes of order 12, right?</p>",
        "id": 395145785,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1696555628
    },
    {
        "content": "<p>thanks for all the replies! <br>\nYes, my understanding is that order 12 ist still open.</p>",
        "id": 395195698,
        "sender_full_name": "Judith Ludwig",
        "timestamp": 1696577237
    }
]