[
    {
        "content": "<p>I'm curious to ask that how far can we formalize the proof of Catalan's conjecture, or cyclotomic Iwasawa Main Conjecture in Lean? These two seems far more easier than formalizing FLT. The first can be found on Schoof's Universitext book \"Catalan's conjecture\", and the second can be found on the appendix of Washington's GTM cyclotomic field.</p>",
        "id": 439454842,
        "sender_full_name": "Jz Pan",
        "timestamp": 1716141002
    },
    {
        "content": "<p>I agree that both of these things are doable and much easier than formalizing FLT (but they might not be easier than formalizing an R=T theorem and reducing FLT to theorems from the 1980s, which is what my job is right now). The original Catalan proof doesn't need anything like strong effective Baker bounds, and whilst the Mazur-Wiles IMC proof is probably a tall order, the proof using cyclotomic units is surely feasible. Both projects probably need a leader though, and a leader probably has to be someone who's doing some kind of approximation to \"working full time on the project\".</p>",
        "id": 439455368,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1716141465
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/116395-maths/topic/formalize.20proof.20of.20Catalan's.20conjecture.20or.20cyclotomic.20IMC.3F/near/439455368\">said</a>:</p>\n<blockquote>\n<p>Both projects probably need a leader though, and a leader probably has to be someone who's doing some kind of approximation to \"working full time on the project\".</p>\n</blockquote>\n<p>I agree. My feeling is that merely formalizing a single new concept and corresponding results in standard textbook is already time consuming.</p>\n<p>For the IMC, I prefer cyclotomic unit proof with Euler system argument. But for Mazur-Wiles' proof, I think we already have Eisenstein series in Lean, so maybe it's not necessary infeasible?</p>",
        "id": 439456597,
        "sender_full_name": "Jz Pan",
        "timestamp": 1716142513
    },
    {
        "content": "<p>It's much harder than the Euler system proof because it needs very delicate results about the geometry of modular curves. The Mazur-Wiles paper is around 150 pages isn't it? The Euler system argument is far shorter.</p>",
        "id": 439457502,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1716143414
    },
    {
        "content": "<p>At any rate, even for the cyclotomic unit proof of IMC we need the full strength of global class field theory.</p>",
        "id": 439876877,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1716316029
    },
    {
        "content": "<p>FYI, currently Mihăilescu is giving a short course at BIMSA <a href=\"https://bimsa.net/activity/CyclotomicFieldsIwasawaTheory/\">https://bimsa.net/activity/CyclotomicFieldsIwasawaTheory/</a> with Zoom link. Videos available. It's claimed that there will be a simpler proof of Catalan's conjecture.</p>",
        "id": 472606387,
        "sender_full_name": "Jz Pan",
        "timestamp": 1727234842
    }
]