[
    {
        "content": "<p>I'm aware of formalizations of universal Turing machines (UTMs), but I'm unaware of attempts to formalize that O(n lg n) universal simulation of TMs is possible. This is a fundamental result in TCS, but TMs are always tedious and to my knowledge its methods are not that relevant to contemporary research, hence the lack of visibility. <a href=\"https://en.wikipedia.org/wiki/Universal_Turing_machine#Efficiency\">https://en.wikipedia.org/wiki/Universal_Turing_machine#Efficiency</a> . If it is indeed yet to be formalized anywhere, I'd like to see what it would take to formalize this result, especially since the recent formalization of some Busy Beaver results in Coq may be instructive to me on how to formalize in a well-structured waylow-level behavior of TMs.</p>",
        "id": 455569832,
        "sender_full_name": "Johannes Choo",
        "timestamp": 1722495926
    },
    {
        "content": "<p>I'm wondering if someone is aware of the existence of a formalization of this result (efficient UTM simulation), or if someone has pointers for me to search if this is something that has been done.</p>",
        "id": 455570429,
        "sender_full_name": "Johannes Choo",
        "timestamp": 1722496096
    },
    {
        "content": "<p>As you point out, it is rather tedious to do which is why even on pen and paper, books tend to gloss over the construction of TMs as much as possible. There is a formalisation of Turing machines, but not of the encoding of TM + input into a UTM</p>",
        "id": 455592496,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1722502130
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Computability/TuringMachine.html\">https://leanprover-community.github.io/mathlib4_docs/Mathlib/Computability/TuringMachine.html</a></p>",
        "id": 455593150,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1722502359
    },
    {
        "content": "<p>The way mathlib proves the undecidability of halting is by moving from Turing machines to partial recursive functions</p>",
        "id": 455593219,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1722502382
    },
    {
        "content": "<p>That being said, TMs are certainly not ignored in modern research. They're just always in the ambient context. For example, when one speaks of DLOGTIME-uniform AC0, it is implied that the Generator runs in DLOGTIME on a Turing machine.</p>",
        "id": 455593980,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1722502648
    },
    {
        "content": "<p>Thanks for the link. Regarding my last comment, I misspoke, and didn't mean to say that TMs and their behavior itself isn't relevant to modern TCS; since indeed the details of TM variants are important in complexity theory. I meant to say that the typical construction of the O(n lg n) efficient TM and its data structure was probably not of research interest (correct me if I'm mistaken in that).</p>",
        "id": 455656732,
        "sender_full_name": "Johannes Choo",
        "timestamp": 1722520674
    },
    {
        "content": "<p>I think efficiency issues really depend on what you want to accomplish with Turing machines. Independent of the universal TM simulation, there are many cases where you can't miss the log factors. This is true in space complexity and circuit complexity lower bounds in the logspace realm. Simulating UTMs with log n overhead is a special case of efficient simulations in general.</p>",
        "id": 455661255,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1722521921
    },
    {
        "content": "<p>I'd say it is still a useful building block in complexity research. It's one of the details that will be brushed under the carpet in most papers that refer to things like logspace reductions for example</p>",
        "id": 455661616,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1722522013
    },
    {
        "content": "<p>Aah, I see, thanks</p>",
        "id": 455720158,
        "sender_full_name": "Johannes Choo",
        "timestamp": 1722535545
    },
    {
        "content": "<p>One useful line of work is to work on composable TMs. There is an open PR that is looking to be adopted <a href=\"https://github.com/leanprover-community/mathlib4/pull/7172\">mathlib4#7172</a></p>",
        "id": 455743658,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1722542456
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/stream/116395-maths/topic/Formalizing.20O.28n.20lg.20n.29.20efficient.20universal.20Turing.20macine/near/455743658\">said</a>:</p>\n<blockquote>\n<p>One useful line of work is to work on composable TMs. There is an open PR that is looking to be adopted <a href=\"https://github.com/leanprover-community/mathlib4/pull/7172\">mathlib4#7172</a></p>\n</blockquote>\n<p>Thanks for the reference. I have been thinking about it in the back of my head while focused elsewhere, and indeed to make things manageable I think I would like to have a notion of composition on (TM, tape, arbitrary properties), I'm thinking something like Hoare logic on imperative pseudocode.</p>",
        "id": 455951801,
        "sender_full_name": "Johannes Choo",
        "timestamp": 1722610022
    }
]