[
    {
        "content": "<p>I'm wondering how to define free monoids in a monoidal category in Mathlib, as in <br>\n<a href=\"https://ncatlab.org/nlab/show/category+of+monoids#FreeMonoids\">here</a>.</p>\n<p>In Mathlib there is currently a definition of the category of monoid objects in a monoidal category, and a <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/CategoryTheory/Monoidal/Mon_.html#Mon_.forget\">forgetful functor from this category to the underlying monoidal category</a>, so it seems we want to prove that under some conditions on the monoidal category, this functor has a left adjoint.</p>\n<p>My questions are:</p>\n<ol>\n<li>Is this defined already in Mathlib (I couldn't find it)?</li>\n<li>Any ideas on how to prove this? It doesn't need to be the most general version, for my usecase, the category is cartesian closed.</li>\n<li>Should I open an issue on this?</li>\n</ol>",
        "id": 492076832,
        "sender_full_name": "Albus Dompeldorius",
        "timestamp": 1736159289
    },
    {
        "content": "<p>We have some of the ingredients which could be helpful here. Let us say <code>C</code> is a monoidal category, and <code>X : C</code>.<br>\nI think the first step is to define a monoidal functor <code>Discrete ℕ ⥤ C</code> which sends <code>1</code> to <code>X</code>. (We have such a universal property for the free monoidal category on a single element, see <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.FreeMonoidalCategory.project#doc\">docs#CategoryTheory.FreeMonoidalCategory.project</a> but not yet with <code>Discrete ℕ</code>). Then, if <code>M</code> is a monoid and we have a monoidal functor <code>F : Discrete M ⥤ C</code>, you may investigate the conditions which allow to put a monoid structure on the colimit of <code>F</code>. Also, does it work for the colimit of any monoidal functor <code>F : D ⥤ C</code>, even if <code>D</code> is not necessarily <code>Discrete M</code>?! If so, the proofs of the compatibilities would probably be cleaner than in the particular case of coproducts.</p>",
        "id": 492082894,
        "sender_full_name": "Joël Riou",
        "timestamp": 1736161631
    },
    {
        "content": "<p>Thanks! To get the universal property for <br>\n<code>Discrete ℕ</code>, I guess we could show that <code>Discrete</code> is left adjoint to the forgetful functor from strict monoidal categories to monoids, which sends a strict monoidal category to its underlying monoid of objects?</p>",
        "id": 492475542,
        "sender_full_name": "Albus Dompeldorius",
        "timestamp": 1736332205
    },
    {
        "content": "<p>We do not have (and I am not sure mathlib would like to have) a notion of \"strict\" monoidal category. I would state what we want by saying that the category of monoidal functors from <code>Discrete ℕ</code> to <code>C</code> is equivalent to <code>C</code>.</p>",
        "id": 492488212,
        "sender_full_name": "Joël Riou",
        "timestamp": 1736337165
    },
    {
        "content": "<p>I see! I'm also considering a different approach, where we define a free monoid in <code>C</code>, where <code>C</code> is a closed monoidal category, to be the initial algebra of the endofunctor <code>X ↦ 1 + (A ⊗ X)</code>.</p>",
        "id": 492498896,
        "sender_full_name": "Albus Dompeldorius",
        "timestamp": 1736341039
    }
]