[
    {
        "content": "<p>Hi all, I've put together a formalization of Gaussian Integration by Parts (Stein's Lemma), and I'd be happy to start PR'ing it if people think it would be a useful addition in this form.</p>\n<p><a href=\"https://github.com/or4nge19/mathlib4/blob/GIBP/Mathlib/Probability/Distributions/GaussianIntegrationByParts.lean\">https://github.com/or4nge19/mathlib4/blob/GIBP/Mathlib/Probability/Distributions/GaussianIntegrationByParts.lean</a></p>\n<p><a href=\"https://github.com/or4nge19/mathlib4/blob/GIBP/Mathlib/Probability/Distributions/GIBP_HilbertFin.lean\">https://github.com/or4nge19/mathlib4/blob/GIBP/Mathlib/Probability/Distributions/GIBP_HilbertFin.lean</a></p>\n<p>The formalization covers so far:</p>\n<ol>\n<li>The 1D case: For a centered Gaussian <code>X ~ N(0, v)</code>, it proves <code>𝔼[X * F(X)] = v * 𝔼[F'(X)]</code>  via exponential tilt and differentiation under the integral sign, for which I've tried to setup some sharp, uniform bounds for the difference quotient, considering that the immediate need for this is the attempt to formalize prerequisites to formalise results in Talagrand \"Mean Field models for Spin Glasses\" for which these bounds I believe should be enough  .</li>\n<li>A finite-dimensional Hilbert space version: For a centered Gaussian <code>g</code> on <code>H</code> with covariance operator <code>Σ</code>, it proves the covariant form <code>𝔼[⟪g, h⟫ F(g)] = 𝔼[(fderiv ℝ F g) (Σ h)]</code> by decomposing along an orthonormal basis and applying the 1D result conditionally using Fubini's theorem.</li>\n</ol>\n<p>To make the main lemmas cleaner, and following/adapting from Talagrand, I've introduced a <code>HasModerateGrowth</code> predicate to bundle the polynomial growth conditions on the test function <code>F</code> and its derivative.</p>\n<p>Any feedback on the plan, the code, design choice or abstractions introduced would be very welcome :)</p>",
        "id": 535554452,
        "sender_full_name": "Matteo Cipollina",
        "timestamp": 1755799593
    }
]