[
    {
        "content": "<p>As the title asks, are there any interesting examples of non-fibered prefibered categories that arise in nature?<br>\nI'm using <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/CategoryTheory/FiberedCategory/Fibered.html#CategoryTheory.Functor.IsPreFibered\">these definitions</a>. I'm wondering because an alternative formulation of fibered cat would be just requiring that every morphism in the base category has an strongly cartesian lift, which (I'd guess) makes some things nicer?</p>",
        "id": 509744240,
        "sender_full_name": "Fernando Chu",
        "timestamp": 1743611652
    },
    {
        "content": "<p>We have <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.Functor.IsFibered.of_exists_isStronglyCartesian#doc\">docs#CategoryTheory.Functor.IsFibered.of_exists_isStronglyCartesian</a></p>",
        "id": 509799309,
        "sender_full_name": "Joël Riou",
        "timestamp": 1743630310
    },
    {
        "content": "<p>Yup, I know. Since (I'd guess) this is the actual thing you want to use (and prove), I was wondering if there is any benefit to having the pre-fibered concept</p>",
        "id": 509885268,
        "sender_full_name": "Fernando Chu",
        "timestamp": 1743671844
    },
    {
        "content": "<p>In algebraic K-theory, there are technical homotopical results which are stated under the assumption that a certain functor is prefibered or precofibered.<br>\nNote also that in the 2-categorical context, we not only have pseudofunctors, but also lax functors, for which <code>mapId</code> or <code>mapComp</code> may not be isomorphisms.<br>\nAlso, even in the process of verifying that a functor is fibered, it may occasionnaly be useful to prove first that it is prefibered (existence of adjoint functors), and then show they compose well.</p>",
        "id": 510010830,
        "sender_full_name": "Joël Riou",
        "timestamp": 1743705073
    },
    {
        "content": "<p>I see, thanks a lot for the in depth examples and explanations!</p>",
        "id": 510014314,
        "sender_full_name": "Fernando Chu",
        "timestamp": 1743706182
    }
]