[
    {
        "content": "<p>I want to formalize the fact that an invariant measure is an average of ergodic measures. Katok and Hasselblatt use Choquet-Bishop-de Leeuw theorem to prove this, see <a href=\"https://en.wikipedia.org/wiki/Choquet_theory\">https://en.wikipedia.org/wiki/Choquet_theory</a><br>\nI've tried to read Bishop&amp;De Leeuw 1959 but they never say how do they <strong>define</strong> the integral for a function taking values in a locally convex TVS. Where can I find the definition? Does it generalize Bochner integral? Is there a proof that doesn't require this generalization of integral?</p>",
        "id": 483566329,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1732134615
    },
    {
        "content": "<p>I looked up some of this work about 10 years ago -- if I remember correctly it may be the Pettis integral?</p>",
        "id": 483566968,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1732134856
    },
    {
        "content": "<p>If I want the main goal in terms of <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=MeasureTheory.Measure.join#doc\">docs#MeasureTheory.Measure.join</a>, do you suggest following Bishop-De Leeuw or there is a better direct argument?</p>",
        "id": 483577627,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1732139514
    },
    {
        "content": "<p>That, I can't say.  The one sentence I wrote above is all I remember :)</p>",
        "id": 483578054,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1732139731
    },
    {
        "content": "<p>Yes, I think here it's a version of the Pettis integral (but not exactly because your space is already a dual). My interpretation is that <code>g = ∫ ω, f ω ∂η</code> means <code>∀ x, g x = ∫ f ω x ∂η</code>. And in the case of probability measures, <code>μ = ∫ ω, ν ω ∂η</code> means <code>∀ s, MeasurableSet s → μ s = ∫ ω, ν ω s ∂η</code></p>",
        "id": 483633237,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1732174859
    },
    {
        "content": "<p>In the latter case, you also need that <code>ω -&gt; ν ω s</code> is measurable for all measurable set <code>s</code>. So, in mathlib terms, nu is a kernel (with values in ergodic measures), and mu can be written as the composition of this kernel and a probability measure eta.</p>",
        "id": 483635428,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1732175910
    }
]