[
    {
        "content": "<p>Asking this on behalf of a friend: do we have anything in Mathlib about the Levy hierarchy of formulas? Or, do we even have some model theoretic mechanism to talk about formulas currently?</p>",
        "id": 485941959,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1733256270
    },
    {
        "content": "<p>Each file in <code>ModelTheory/</code> has either <span class=\"user-mention\" data-user-id=\"302826\">@Aaron Anderson</span> or <span class=\"user-mention\" data-user-id=\"110044\">@Chris Hughes</span> as a (co-)author.</p>",
        "id": 486013444,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1733288297
    },
    {
        "content": "<p>This question is for myself though: what are some good resources for learning model theory that will help me understand Mathlib's model theory library?</p>",
        "id": 486053559,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1733306510
    },
    {
        "content": "<p>Usually, knowing a piece of mathematics translates decently well into knowing how to apply it in Lean. But I feel like due to the level of abstraction at play here, model theory is somewhat more subtle.</p>",
        "id": 486053813,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1733306583
    },
    {
        "content": "<p>Or, maybe I'm just entirely lost</p>",
        "id": 486053820,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1733306585
    },
    {
        "content": "<p>Here's an overview of where to find some relevant things in the model theory library:</p>\n<ul>\n<li><a href=\"https://tqft.net/mathlib4files/Mathlib/ModelTheory/Basic\">file#Mathlib/ModelTheory/Basic</a> defines languages and structures</li>\n<li><a href=\"https://tqft.net/mathlib4files/Mathlib/ModelTheory/Syntax\">file#Mathlib/ModelTheory/Syntax</a> defines formulas and related concepts. This is where nearly all of the subtlety is that makes things difficult to read, coming from the inductive definition of formulas.</li>\n<li><a href=\"https://tqft.net/mathlib4files/Mathlib/ModelTheory/Semantics\">file#Mathlib/ModelTheory/Semantics</a> interprets formulas in structures. This is where you get to say that a given structure is a model of a given theory.</li>\n<li><a href=\"https://tqft.net/mathlib4files/Mathlib/ModelTheory/Satisfiability\">file#Mathlib/ModelTheory/Satisfiability</a> defines what it means for a <em>theory</em>, rather than a structure, to model a formula, as well as other useful properties of theories. Universe issues mean that at the moment this requires a bunch of other files containing higher-level concepts, up to the proof of the Löwenheim-Skolem theorem.</li>\n<li><a href=\"https://tqft.net/mathlib4files/Mathlib/ModelTheory/Complexity\">file#Mathlib/ModelTheory/Complexity</a> contains definitions related to quantifier complexity, which is the closest stuff we have to the Lévy hierarchy. We have what it means for a formula to be quantifier-free, or existential, or universal.</li>\n</ul>",
        "id": 486079208,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1733314756
    },
    {
        "content": "<p>As far as sources, I have mainly used three:</p>\n<ul>\n<li>the bulk of the subtle stuff about defining formulas is adapted from the flypitch project</li>\n<li>Marker's GTM on Model Theory</li>\n<li>Tent and Ziegler's <em>A Course in Model Theory</em></li>\n</ul>",
        "id": 486092751,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1733318999
    },
    {
        "content": "<p>I have some thoughts on formula complexity hierarchies - there are 3 similar ones that I think it might be worth building a simultaneous API for. Specifically, we start with a particular class (sublattice? sub-boolean algebra?) of formulas that we call Δ0.</p>\n<ul>\n<li>For a general language, these should be quantifier-free formulas</li>\n<li>For the arithmetic hierarchy, in the language of ordered rings, these should be formulas with only bounded quantification</li>\n<li>For the Lévy hierarchy, in the language of set theory, these should be formulas with only bounded quantification (which means something a bit different in that context)</li>\n</ul>\n<p>Then we define Σn, Πn, and Δn inductively by closing under quantifiers in the same way.</p>",
        "id": 486149177,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1733334925
    }
]