[
    {
        "content": "<p>Just for fun!</p>\n<p>I was curious if anyone has an inventory of the various things that have been meant by \"tree\", in math/cs literature. (This was prompted in part by needing a \"tree\" notion in Mathlib and finding that neither <code>Tree</code> nor <code>IsTree</code> were what I wanted :) ) To start the list off, I have definitely seen \"tree\" to mean:</p>\n<ul>\n<li>Acyclic, connected simple graph. (This is Mathlib's <code>IsTree</code>)</li>\n<li>Acyclic, connected, locally finite, simple graph. <code>IsTree</code>+<code>LocallyFinite</code>.</li>\n<li>Acyclic, connected, finite, simple graph. <code>IsTree</code>+<code>Fintype</code>.</li>\n<li>Acyclic, directed, weakly-connected graph with max in-degree 1. Note that the infinite path graph has two non-isomorphic versions under this definition, and trees do not necessarily have a root. I'll call this <code>DirectedTree</code>.</li>\n<li>Acyclic, directed, weakly-connected graph with max in-degree 1, and one vertex with in-degree 0. This is a \"rooted tree\" (with no ordering of children). Note that \"acyclic, directed, weakly-connected with max in-degree 1\" is equivalent to \"a pointed undirected graph that <code>IsTree</code>\", that is, an <code>IsTree</code> graph with a single designated \"root\". I will call this <code>RootedTree</code>.</li>\n<li><code>DirectedTree</code>+<code>LocallyFinite</code>.</li>\n<li><code>DirectedTree</code>+<code>Fintype</code>. The same as <code>RootedGraph</code>+<code>Fintype</code>.</li>\n<li><code>RootedGraph</code>+<code>LocallyFinite</code>.</li>\n<li><code>IsTree</code>+<code>LocallyFinite</code> + the condition that each vertex has degree 1 or degree _k_, and then this is called either a _k_-tree, or a <code>(k-1)</code>-tree, depending on context. I'll call this <code>kEqTree</code>. Especially common with <code>k=2</code>.</li>\n<li>Like <code>kEqTree</code>, but instead the requirement is just that degree is _at most_  k. We could call this a <code>kLETree</code>.</li>\n<li><code>kTree</code> + <code>Fintype</code>.</li>\n<li>The permutations of <code>DirectedTree</code> and <code>RootedGraph</code> but with the <code>k</code>-regularity condition.</li>\n<li>All the versions of <code>kEqTree</code> and <code>kLETree</code>, but with an additional _ordering_ on the children. For instance with <code>kEqTree</code> with k=2, and then the children are the left- and right-children. For a <code>kLETree</code> with k=2, some nodes can have just one child, but it is not distinguished whether that's the \"left\" or \"right\" child -- it's just the only child.</li>\n<li>Versions of <code>kLETree</code> where, when the degree is more than 1 and less than k, there is a distinct notion of which neighbors are \"missing\". That is, the neighbors of every vertex can be described as <code>Maybe (Fin k -&gt; Maybe V)</code>.  Mathlib's <code>Tree</code> then describes an <code>kLETree 2</code>, <code>RootedGraph</code> on a <code>Fintype</code>, with this additional \"missing\" info -- with the ability to store data on the vertices.</li>\n<li>All of the above are sometimes implicitly meant \"up to isomorphism\", which in Lean would of course be a distinct type from the trees itself. For instance, when people talk about counting unlabelled trees on n vertices.</li>\n<li>Last and _certainly_ least, I contend that \"tree\" is very often used by computer scientists to actually mean any DAG -- even ones that are weakly cyclic. For instance, the \"git-tree\", an \"inheritance tree\" (in any language with multiple inheritance, such as C++), or a \"dependency tree\" are all DAGs, not trees. But they are still colloquially referred to as trees, and often described in code by a class named Tree or similar.</li>\n</ul>\n<p>I wonder if anyone can come up with some that I've missed! :) And while some might sound silly, I promise I've seen (nearly?) all of these used in practice... for instance, I've seen <code>IsTree</code>+<code>LocallyFinite</code> come up in condensed matter physics plenty of times, as well as <code>DirectedTree</code>+<code>LocallyFinite</code> (_without_ a root).</p>",
        "id": 462213194,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1723583468
    },
    {
        "content": "<p>Well would you know it, I sent this message and only afterwards noticed <span class=\"user-mention silent\" data-user-id=\"690858\">Daniel Weber</span> <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/rooted.20trees/near/462170098\">'s message</a>. Ha!</p>",
        "id": 462213928,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1723583848
    }
]