[
    {
        "content": "<p>Is there any work currently being done to formalise modular curves in mathlib? The background being that I was wondering if it is a reasonable project (i.e. time scale not on the order of years) to formalise the Eichler-Shimura relation for modular curves.</p>",
        "id": 532873638,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1754385440
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"934803\">@Bryan Wang</span> yes, i'm working on elliptic curves in my personal project <a href=\"https://github.com/kckennylau/EllipticCurve\">https://github.com/kckennylau/EllipticCurve</a></p>",
        "id": 532873922,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1754385520
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"934803\">@Bryan Wang</span> right now I feel the biggest tension is deciding whether to plough on with the \"plane cubic\" definition or try and make a working \"smooth proper group scheme\" definition. The advantage of the plane cubic definition is that it still gives you a path to a correct definition of elliptic curve over a scheme (\"there exists an affine cover of the base over which it's iso to a nonsingular plane cubic\") and then getting modular curves out of this will hopefully be pretty straightforward. This way also avoids stacky considerations. If you want to prepare for Eichler-Shimura and also help FLT then we have nothing about reduction of an elliptic curve over say the field of fractions of a complete DVR. For example no definition of good reduction, no group hom from the generic fibre to the special fibre etc.</p>",
        "id": 532952935,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1754412212
    },
    {
        "content": "<p>Thanks! Just to clarify, when you say \"plane cubic\" definition, you mean the one currently in mathlib as <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=WeierstrassCurve#doc\">docs#WeierstrassCurve</a> ?</p>",
        "id": 533016107,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1754449162
    },
    {
        "content": "<p>I am somehow vaguely reminded of that old joke about Serre's answer to the question \"what is a variety?\" (\"integral scheme of finite type over a field\") I guess this type of tension has always existed and will continue to exist in Lean..</p>",
        "id": 533018333,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1754451149
    },
    {
        "content": "<p>My feelings right now are that we need to develop both the smooth proper story and the \"five numbers\" (aka plane cubic) story, because having the model is super-useful (e.g. Tate's algorithm). Note that we don't have alg-geom Riemann-Roch yet so moving between the two stories will be hard; right now we're talking a \"Silverman-like\" approach by just developing the plane cubic story.</p>",
        "id": 533042481,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1754465987
    },
    {
        "content": "<p>ok! Re: the \"Silverman approach\", let me see if I get anywhere with first defining (and showing existence of) minimal Weierstrass equations, which are needed to define reduction.</p>",
        "id": 533056155,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1754470833
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/28115\">#28115</a> defines minimal Weierstrass equations and the reduction of elliptic curves over the fraction field of a DVR. Any comments are appreciated, as I am still pretty new to the <code>EllipticCurve</code> API in mathlib!</p>",
        "id": 533420880,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1754641967
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243562\">@Adam Topaz</span> in what generality should we have concepts such as \"this plane cubic equation with coefficients in a field actually has coefficients in an integer ring\"?</p>",
        "id": 533460044,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1754658115
    },
    {
        "content": "<p>Thanks! I'd love to review this properly but I'm stuck writing my thesis for the next month or so... Note that there was prior discussion about reduction in <a class=\"message-link\" href=\"/#narrow/channel/116395-maths/topic/thoughts.20on.20elliptic.20curves/near/382819103\">#maths &gt; thoughts on elliptic curves @ 💬</a> but that's for the points rather than the coefficients of the curve itself</p>",
        "id": 533461337,
        "sender_full_name": "David Ang",
        "timestamp": 1754658635
    },
    {
        "content": "<p>So I realised we didn't get back to modular curves in the end - it seems like the best way is to develop elliptic curves over schemes first and base the definition of modular curves on that?</p>",
        "id": 539789439,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1758033820
    },
    {
        "content": "<p>What level modular curves would this give? Would this be Gamma_1?</p>",
        "id": 539790417,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1758034074
    },
    {
        "content": "<p>It would be nice to be able to do full level N so that one can get all the other ones, like they do <a href=\"https://beta.lmfdb.org/knowledge/show/modcurve\">here</a></p>",
        "id": 539790645,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1758034129
    },
    {
        "content": "<p>But that might be beyond what we can currently do as it probably needs some representability of moduli spaces</p>",
        "id": 539790835,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1758034169
    },
    {
        "content": "<p>I think this is exactly the problem, nobody wants to do a particular case by hand if it ends up being outdated but on the other hand we are not ready for the \"correct\" generality.</p>",
        "id": 539792092,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1758034531
    },
    {
        "content": "<p>(with the obvious conflict of interest being <a href=\"https://github.com/kckennylau/EllipticCurve\">https://github.com/kckennylau/EllipticCurve</a>) I would say that it seems a bit pointless to talk about \"a moduli of elliptic curves\" if we can't talk about the (correct) elliptic curves</p>",
        "id": 539794225,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1758035070
    },
    {
        "content": "<p>Oh yes that is definitely a problem. I should definitely be clear, all I wanted to know is what level this approach would give. I think its worth doing even if not in the fullest level of generality.</p>",
        "id": 539794750,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1758035202
    },
    {
        "content": "<p>I think we it would be nice to at least have some modular curves. If we later get the 'correct' ones then anything else can just be updated.</p>",
        "id": 539794751,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1758035202
    },
    {
        "content": "<p>well Y1(4)(R) is <code>Spec R[x]/(1/Δ(x),16x-1)</code> or something like that, so we can have Y1(4) \"today\" <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 539797715,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1758035905
    },
    {
        "content": "<p>I think one feasible plan is define an elliptic curve over a scheme to be \"locally Y^2+...=cubic\" and worry about why 1-dimensional abelian varieties have this property later. If we have Y_1(4) and Y_1(5) (which can both be done by hand) then I think we can make Y_1(N) by looking at N-torsion in universal curves.</p>",
        "id": 539813214,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1758040191
    },
    {
        "content": "<p>that is the plan for my project linked above</p>",
        "id": 539813634,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1758040342
    }
]