[
    {
        "content": "<p>In the same project we'll need this counting sequence too: <a href=\"https://oeis.org/A103293\">https://oeis.org/A103293</a></p>\n<p>I guess this is too esoteric to have been formalized.</p>",
        "id": 478201463,
        "sender_full_name": "Amir Livne Bar-on",
        "timestamp": 1729570096
    },
    {
        "content": "<p>Maybe someone needs to create <a href=\"https://github.com/leanprover-community/oeis\">https://github.com/leanprover-community/oeis</a></p>",
        "id": 478244124,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1729589877
    },
    {
        "content": "<p>I could imagine that this would be a really fun project! The OEIS often contains code for sequences written in e.g. mathematica or pari. It would not surprise me at all if the OEIS folks were open to including Lean code, they have always seemed very liberal in what they would accept (in the past I've sent them pari code for sequences and it's just been uploaded with very little fuss). But making a lean repo where people just start defining functions corresponding to the sequences is something where a lot of people might consider joining in. It's certainly much easier than formalising IMO solutions!</p>",
        "id": 478251580,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1729592413
    },
    {
        "content": "<p>Maybe, even AI formalizing some of the OEIS entries is feasible.</p>",
        "id": 478261633,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1729596223
    },
    {
        "content": "<p>AI is already doing that -- <span class=\"user-mention\" data-user-id=\"223577\">@Josef Urban</span> et al have a system which looks at an OEIS entry and attempts to autonomously write python code which reproduces it. I had a look at this paper and what they do is really quite surprising -- for some sequences it's dead easy, but there were others I found where the sequence had a complicated explanation, the python program was definitely not implementing the explanation and looked like a completely random piece of code written by a machine, but the code was outputting the sequence. See <a href=\"https://arxiv.org/abs/2301.11479\">https://arxiv.org/abs/2301.11479</a> for more details. I found at least one example where the code was definitely wrong in the sense that if I generated more terms of the sequence then the python program would diverge from the answer, but it was also definitely right multiple times.</p>",
        "id": 478316740,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1729611941
    },
    {
        "content": "<p>Since Lean code depends strongly on particular Lean and mathlib versions and needs updating frequently as those change, a Lean project with definitions of OEIS sequences seems much more useful than putting the code directly in OEIS and letting it bitrot quickly.</p>",
        "id": 478352580,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1729625011
    },
    {
        "content": "<p>Note that Sean Irvine has Java code for over 150000 OEIS sequences - <a href=\"https://github.com/archmageirvine/joeis\">https://github.com/archmageirvine/joeis</a> - and does automated validation that the terms calculated by those implementations match those on OEIS. For any kind of Lean definition providing some way to calculate or prove individual terms of a sequence, such validation seems important to have as well.</p>",
        "id": 478353079,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1729625205
    },
    {
        "content": "<p>It's a lot less clear what it would mean to have a sequence defined in Lean than it is for those Java implementations. Any or all of the following are possible:</p>\n<ul>\n<li>A definition suitable for proving things about the sequence.</li>\n<li>A definition suitable for computing terms of the sequence (whether through direct execution of the Lean function, or through kernel reduction).</li>\n<li>Proofs that multiple such definitions do define the same sequence.</li>\n<li>A tactic / <code>norm_num</code> extension for proving the values of terms of the sequence.</li>\n<li>Ad hoc proofs of the values of specific terms (given a suitable definition).</li>\n<li>Proofs of lemmas giving properties of the sequence and relations to other sequences. <a href=\"https://oeis.org/A000110\">https://oeis.org/A000110</a> (Bell numbers) has a <em>lot</em> of such properties under \"Comments\", \"Formula\" and \"Crossrefs\". Most sentences there correspond to lemmas that could be given formal proofs.</li>\n</ul>",
        "id": 478353990,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1729625534
    },
    {
        "content": "<p>As usual, it would be important to put relevant material in mathlib not only in a separate repository. For example, the definition and basic properties of Bell numbers certainly belong in mathlib (and then <code>OEIS.A000110</code> might be defined in a separate project in terms of the mathlib definition, and lemmas relating it to other sequences proved in terms of corresponding mathlib lemmas). But no doubt there are also plenty of more obscure sequences and facts in OEIS, much less likely to be of general use, where a separate repository is a natural home.</p>",
        "id": 478354468,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1729625735
    },
    {
        "content": "<p>And mathlib material might be in greater generality than material in a separate repository. Looking at the \"keyword:core\" sequences in OEIS, for example, A000079 is the powers of 2; we certainly don't need a separate <code>def</code> for that in mathlib, the instance for <code>^</code> on natural numbers suffices (but various standard properties of powers of 2 probably belong in mathlib). A000796 is the decimal expansion of pi; we should have base-N expansions of real numbers in mathlib (including tactics to compute terms given bounds on those real numbers), and we already have pi, but there may not be anything worth saying about the combination of those two concepts in mathlib. Many thousands of OEIS sequences are given by linear recurrences (or more generally D-finite sequences); the theory of such sequences belongs in mathlib, but beyond a few important special cases such as Fibonacci, the individual such sequences probably don't (and in a separate project, they should be defined automatically in terms of data giving the recurrence coefficients rather than writing Lean definitions manually for each one).</p>",
        "id": 478355317,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1729626097
    },
    {
        "content": "<p>Given the various different things that might or might not be provided for an individual sequence in Lean (including proofs of lots of individual assertions present in the sequence description in OEIS), tracking what is / isn't included in any Lean OEIS project would be a lot more complicated than a simple yes/no for each sequence. (And even when doing a yes/no there would be the issue of what interface works for looking at state for over 350000 sequences.)</p>",
        "id": 478355601,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1729626189
    },
    {
        "content": "<p>11 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"217875\" href=\"/#narrow/channel/217875-Is-there-code-for-X.3F/topic/Bell.20numbers\">#Is there code for X? &gt; Bell numbers</a> by <span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span>.</p>",
        "id": 478357041,
        "sender_full_name": "Notification Bot",
        "timestamp": 1729626742
    },
    {
        "content": "<p>Could we move this to <a class=\"stream\" data-stream-id=\"116395\" href=\"/#narrow/channel/116395-maths\">#maths</a> ?</p>",
        "id": 478357474,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1729626930
    },
    {
        "content": "<p>Done. Note there is <a href=\"#narrow/channel/116395-maths/topic/OEIS.20Lean.20entries/near/211625634\">this old thread</a> too</p>",
        "id": 478357768,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1729627068
    },
    {
        "content": "<p>Might be worth merging them</p>",
        "id": 478357950,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1729627132
    },
    {
        "content": "<p>I'll let <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>  decide, since he started the other thread</p>",
        "id": 478360458,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1729628160
    },
    {
        "content": "<p>Happy to merge them! Great to see some youngster already had this idea in 2020!</p>",
        "id": 478365861,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1729630506
    }
]