[
    {
        "content": "<p>I notice that the file containing <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Topology.RelCWComplex#doc\">docs#Topology.RelCWComplex</a> doesn't have anything proving that <code>openCell</code>s are in fact open. I'm not really a topologist; what's the best way to build that proof?</p>",
        "id": 517199335,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1746832192
    },
    {
        "content": "<p>CC <span class=\"user-mention\" data-user-id=\"697518\">@Hannah Scholz</span></p>",
        "id": 517228579,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1746857255
    },
    {
        "content": "<p>The problem is that the open cells aren't actually open in general. Think of the CW construction on the 2-sphere that uses two 0-cells, two 1-cells and two 2-cells. In that construction the \"open\" 1-cells are not actually open in the sphere. Open cells are however open in the skeleton of the corresponding dimension. You could prove that statement if you wanted to. You would first need to write a characerization of when a subset of the skeleton is closed in the skeleton. (I think this should also just be its intersection with every cell being closed.) Then you just need to show that the complement of the open cell is closed in the skeleton which should be pretty direct.</p>",
        "id": 517235706,
        "sender_full_name": "Hannah Scholz",
        "timestamp": 1746863459
    },
    {
        "content": "<p>...Ah. That's a bit unfortunate, but alright. Thanks for the tip, I don't know how much longer I'd've kept trying to prove False otherwise ^.^;</p>",
        "id": 517328100,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1746942446
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"697518\">Hannah Scholz</span> <a href=\"#narrow/channel/116395-maths/topic/Open.20cells.20of.20a.20CW.20complex.20are.20open/near/517235706\">said</a>:</p>\n<blockquote>\n<p>You would first need to write a characerization of when a subset of the skeleton is closed in the skeleton. (I think this should also just be its intersection with every cell being closed.)</p>\n</blockquote>\n<p>Followup question: we already have this, but in fact it's stated as \"any subset of the skeleton is closed <em>in the ambient space</em> iff its intersection with every cell is closed.\" I can see how to get from there to \"any subset of the skeleton is open in the skeleton iff its intersection with every cell is open,\" but not how to extend to something symmetric with the existing statement, all the way out to being open in the ambient space. Am I just missing something, or is this a real asymmetry we'll just have to live with if using this definition?</p>",
        "id": 517406012,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1747006977
    },
    {
        "content": "<p>Maybe <a href=\"https://en.wikipedia.org/wiki/Thom%E2%80%93Mather_stratified_space\">https://en.wikipedia.org/wiki/Thom%E2%80%93Mather_stratified_space</a> is also relevant in this context?</p>",
        "id": 517437565,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1747030037
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"359992\">Robert Maxton</span> <a href=\"#narrow/channel/116395-maths/topic/Open.20cells.20of.20a.20CW.20complex.20are.20open/near/517406012\">said</a>:</p>\n<blockquote>\n<p>but not how to extend to something symmetric with the existing statement</p>\n</blockquote>\n<p>What kind of symmetric statement would you like there to be? I guess there are two issues here: First of all with closedness you can talk about the intersections with closed cells being closed (in the ambient space). With opennes you need to shift this to the intersection with closed cells being open in the closed cell. Which is already a bit uglier than the closed version. A similar problem is that one would like to make statements about sets being open in the CW complex which is again a closed set. So I think here again we unfortunatly need to be content with talking about openness inside of the CW complex instead of the ambient space.</p>",
        "id": 517886158,
        "sender_full_name": "Hannah Scholz",
        "timestamp": 1747157071
    },
    {
        "content": "<p>Unfortunatly, the ambient space approach means that we cannot use the API that already exists for <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Topology.IsCoherentWith#doc\">docs#Topology.IsCoherentWith</a>. But maybe you can find some inspiration there</p>",
        "id": 517886571,
        "sender_full_name": "Hannah Scholz",
        "timestamp": 1747157194
    }
]