[
    {
        "content": "<p>I find myself often wishing we had clear spellings for \"order-reversing map\" and \"Galois connection but it reverses the order\", without using <code>OrderDual</code>. I know that you can use the dual, of course. But I don't like this as an option myself. For one thing - is the natural type of order-reversing maps <code>Aᵒᵈ →o B</code> or <code>A →o Bᵒᵈ</code>?</p>\n<p>Personally I would like to see a world where we have <code>A →oᵒᵈ B</code> to mean \"order-reversing map from A to B\", and then an appropriate equivalence between <code>A →oᵒᵈ B</code> and <code>Aᵒᵈ →o B</code> and <code>A →o Bᵒᵈ</code>. I'm not sure if there's any appetite for this amongst contributors or maintainers. I assume this was considered before in the past and discounted?</p>\n<p>This would also mean that the type of <code>OrderDual.toDual</code>would be <code>α ≃ᵒᵈ αᵒᵈ</code>, which I think is nicer, personally.</p>\n<p>Given we want to, probably, move to a world in which <code>OrderDual</code> is defined as a one-element structure, it would be even nicer to have this stuff: <code>A →oᵒᵈ B</code> and <code>Aᵒᵈ →o B</code> and <code>A →o Bᵒᵈ</code> are in that case <em>different types</em>, albeit (order)-isomorphic ones.</p>",
        "id": 531841341,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753881575
    },
    {
        "content": "<p>I really dislike it when there's multiple options but no canonical or \"best\" choice</p>",
        "id": 531843258,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1753882019
    },
    {
        "content": "<p>I agree, which I <em>think</em> means you might be agreeing with me - certainly at the moment that is the case! (because we have <code>Aᵒᵈ →o B</code> and <code>A →o Bᵒᵈ</code> and these both mean the same thing but, IMO, neither is better than the other).</p>",
        "id": 531843521,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753882075
    },
    {
        "content": "<p>Given we have <code>Antitone</code> as a perfectly well-supported predicate, I see no issue with a mostly identical definition to <code>OrderHom</code> but with <code>antitone'</code> instead of <code>monotone'</code>.</p>",
        "id": 531844500,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753882330
    },
    {
        "content": "<p>Order isos are a bit more tricky since they're an <code>abbrev</code> for <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=RelIso#doc\">docs#RelIso</a></p>",
        "id": 531845674,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1753882646
    },
    {
        "content": "<p>I think that's fine, right? OrderAntiIso or whatever would also be such an abbrev, but with ge instead of le on the RHS (or, yes, on the LHS, but I think in this case that's just an implementation detail).</p>",
        "id": 531846348,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753882795
    },
    {
        "content": "<p>Really it's weird that <code>OrderHom</code> isn't an abbrev for <code>RelHom</code>. I don't see why there isn't a consistent approach there.</p>",
        "id": 531856119,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753885187
    },
    {
        "content": "<p>I once developed a theory of contravariant functors and it was great -- I proved that composite of covariant and contravariant was contravariant, and that composite of two contravariant was covariant. What I liked about this was that there is literally no way of spelling contravariant in the \"add an op somewhere\" manner which makes \"if F : A -&gt; B and G : B -&gt; C are contravariant functors, then GF is a covariant functor\" typecheck -- you need both conventions in one statement. On the other hand Lean has got this far without contravariant functors and we have an absolute ton of stuff, so presumably our conventions are working great so far.</p>",
        "id": 531875055,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1753890309
    },
    {
        "content": "<p>The reason I don't like them is if I'm stating a theorem or a def, which one should I use? There's nothing about them that makes one better than the other and there don't seem to be any conventions either.</p>",
        "id": 531875568,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1753890461
    },
    {
        "content": "<p>I wonder how much it's the case that people just fudge it. I agree with you precisely that that GF theorem would be good, Kevin - as you say you need both conventions to make it make sense!</p>",
        "id": 531875656,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753890487
    },
    {
        "content": "<p>I think you can Just Fudge it (but we shouldn't), I think is my opinion.</p>",
        "id": 531875727,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753890510
    },
    {
        "content": "<p>But I also think <code>Monotone</code> shouldn't require preorder, but the bottom of the order hierarchy is full of sharks and I am sure YD has good thoughts as to why this is wrong.</p>",
        "id": 531875815,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753890540
    },
    {
        "content": "<p>(It is so weird that OrderHom requires <code>Preorder</code> but <code>OrderEmbedding</code> and <code>OrderIso</code> don't.)</p>",
        "id": 531888886,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753894804
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> why, by the way, is that?</p>",
        "id": 531897244,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753897675
    },
    {
        "content": "<p>Like why is <code>OrderHom</code> not defined as <code>@RelHom α β (· ≤ ·) (· ≤ ·)</code>?</p>",
        "id": 531897284,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753897689
    }
]