[
    {
        "content": "<p>Hi, I just wanted to let you know that I have started a little <a href=\"https://codeberg.org/preichert/homotopy-lean\">side project</a> about infinity-groupoids. It is in an early stage, but I wanted to share my thoughts in case someone else is interested in it. (Happy to move to GitHub if someone wants to collaborate.)</p>\n<p><strong>What/Why?</strong></p>\n<p>In the long run, I'd like to formalize HoTT-style proofs in Lean -- dodging univalent foundations by working with infinity-groupoids instead of HoTT types, functors between them instead of HoTT functions and equivalences instead of HoTT equality. As far as I can tell, it's totally open how well it will work out -- my motivation is curiosity in the design space and the prospect to learn some infinity-category theory on the way. I'm neither an expert in infinity-category theory nor in HoTT.</p>\n<p>But the first step is to even have a notion of infinity-groupoid, and that's what I'm working on right now.</p>\n<p><strong>How?</strong></p>\n<p>As I am less excited about working formally with Kan complexes than with <a href=\"https://home.sandiego.edu/~shulman/cmshighercategories2013/Brunerie.pdf\">Guillaume Brunerie's more algebraic definition</a>, I am going with the latter.</p>\n<p>I find Brunerie infinity-groupoids very beautiful. Being based on globular sets, they are conceptually closer to a type theory than Kan complexes, and they provide a nicely motivated, unified account of identity paths, inverses, compositions and coherences.</p>\n<p>This is the rough and somewhat ambitious action plan:</p>\n<ol>\n<li>Formalize Brunerie type theory (the type theory that tells us what coherences we need).</li>\n<li>Define a weak infinity-groupoid roughly as a model of this type theory.</li>\n<li>Construct path spaces: The paths between two objects of an infinity-groupoid are infinity-groupoids themselves.</li>\n<li>Define weak functors and construct the infinity-groupoid of weak functors between two given infinity-groupoids.</li>\n<li>Define the infinity-groupoid <code>Space.{u + 1}</code> of (small) infinity-groupoids.</li>\n<li>Construct Pi types, the <code>J</code> eliminator and more of the standard stuff.</li>\n<li>(Stretch goal:) Implement tactics analogous to <code>rw</code>, <code>simp</code> and <code>cases</code> that work with equivalence instead of equality.</li>\n</ol>\n<p><strong>What's the current state?</strong></p>\n<p>Right now, I'm still streetfighting my way through (1.) without much prior knowledge of type theory formalization. It's fun and I learn a lot, but there are lots of tricky inductions to make and it's much more work than I expected for such a simple type theory.</p>\n<p>There is <a href=\"https://younesse.net/assets/report_L3.pdf\">prior work</a> w.r.t. finishing (2.) in Agda, but I don't know whether (3.) will ever be finished in this project.</p>",
        "id": 537172531,
        "sender_full_name": "Paul Reichert",
        "timestamp": 1756761292
    },
    {
        "content": "<p>Just to check, you do know about the <a class=\"stream\" data-stream-id=\"455414\" href=\"/#narrow/channel/455414-Infinity-Cosmos\">#Infinity-Cosmos</a>  project, right?</p>",
        "id": 537184349,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1756770447
    },
    {
        "content": "<p>at any rate, it does look quite interesting, and I'd personally love to see more HoTT stuff in Lean!</p>",
        "id": 537184374,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1756770465
    },
    {
        "content": "<p>I do, and I think it's a great project! I'm using a more elementary and limited approach. Brunerie's definition can't easily be generalized to infinity-<em>categories</em>, grouipoids are all I'm after. So I don't mean to compete with the infinity cosmos project (and would not be able to given the enormous amount of categorical expertise present there).</p>",
        "id": 537211783,
        "sender_full_name": "Paul Reichert",
        "timestamp": 1756791850
    }
]