[
    {
        "content": "<p>Quantales are a non-commutative generalization of frames (an order-theoretic view on topology). I.e. a quantale is an ordered semigroup distributing over a complete (sup)lattice. A frame is then an integral quantale with a commutative and idempotent monoid as semigroup. </p>\n<p>I've personally started to study quantales out of an interest in their application in theoretical computer science, but as they have a broad applicability in physics and math as well (the word quantale already shows up in some discussions on Zulip), I figured adding the definition to Mathlib also makes sense. I'm working now on the branch PieterCuijpers_Quantales of Mathlib to get my first PR.</p>\n<p>Here, I would like to start a discussion and invite anyone who is interested in quantales to contribute. Have a look at the initial definitions if you like and comment whether you think they are going in the right direction. Also, let's discuss which definitions and theorems would be interesting/necessary to have as part of the library.</p>",
        "id": 481262036,
        "sender_full_name": "Pieter Cuijpers",
        "timestamp": 1731053973
    },
    {
        "content": "<p>(<a href=\"https://github.com/leanprover-community/mathlib4/tree/PieterCuijpers_Quantales\">branch#PieterCuijpers_Quantales</a> / <a href=\"https://github.com/leanprover-community/mathlib4/pull/17289\">#17289</a>)</p>",
        "id": 481456177,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1731155159
    },
    {
        "content": "<p>The first PR, giving the definition of Quantale in the form of an IsQuantale mixin, has now been merged :-)<br>\nThanks to Yaël and Jireh for their patient reviewing.<br>\nComments and suggestions for further PRs are very welcome.<br>\nOn my current list are:</p>\n<ul>\n<li>a variable_alias <code>Quantale</code></li>\n<li>definitions of homomorphism and lax/oplax homomorphism</li>\n<li>theorem that frames are commutative quantales, and a quantale is a frame iff it is an idempotent and integral monoid.</li>\n</ul>",
        "id": 483455348,
        "sender_full_name": "Pieter Cuijpers",
        "timestamp": 1732099891
    },
    {
        "content": "<p>It's great to see more interest in quantales/locales in Lean. Are you also planning to make the connection to C*-algebras?</p>",
        "id": 484143108,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1732446408
    },
    {
        "content": "<p>To be honest, I'm doing the formalization partly also simply to learn more about Quantales and have a fun project that encourages me to do so. In that sense, yes it may make sense to make the connection, since quite a few papers seem to mention the connection to C<em>-algebras. Frankly, I don't know yet what C</em>-algebras are ;-)</p>\n<p>I'm mainly a theoretical computer-scientists, interested in quantales as a model of observation of dynamic behavior (I have a background in process algebra - so the work of Abramsky, Vickers, and Resende is high on my list). If it is relevant for that, then sure I'll probably try myself at somepoint, but also if not, I would like to see other directions. At the moment, I'm in the \"gathering ideas\" phase, so thanks a lot for suggesting this!</p>",
        "id": 484383722,
        "sender_full_name": "Pieter Cuijpers",
        "timestamp": 1732566300
    },
    {
        "content": "<p>(Sorry for the late reply, apparently this wasn't posted due to network problems...)</p>\n<p><span class=\"user-mention\" data-user-id=\"563058\">@Pieter Cuijpers</span> Quantales where introduced to generalize Gelfand duality between <em>commutative</em> C<em>-algebras and Compact Hausdorff spaces to the non-commutative C</em>-algebras.<br>\nA first observation, is that Gelfand duality factors via a duality with Compact regular locales. Quantales can then be seen as non-commutative locales.<br>\n<a href=\"https://www.maths.sussex.ac.uk/Staff/CJM/research/pdf/&amp;.pdf\">https://www.maths.sussex.ac.uk/Staff/CJM/research/pdf/&amp;.pdf</a><br>\n<a href=\"https://ncatlab.org/nlab/show/quantale\">https://ncatlab.org/nlab/show/quantale</a></p>",
        "id": 488111620,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1733927319
    },
    {
        "content": "<p>That makes sense, and I can relate some of it to what I know from theoretical computer science. Formalizing this as one of the first things within the Mathlib library seems like a good idea to me. Not sure when/if I'll get to it myself on short notice though, since teaching load will increase the coming months.</p>",
        "id": 489500962,
        "sender_full_name": "Pieter Cuijpers",
        "timestamp": 1734446334
    }
]