[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110050\">@Sebastien Gouezel</span> How far are we from being able to define a Riemannian manifold? It seems to me that almost all the ingredients are in place. If so, that sounds like a pretty nice milestone!</p>",
        "id": 186520380,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1579890955
    },
    {
        "content": "<p>Not so close. The main missing block is to define the bundle of metrics. Two possible choices: define it by hand, or define a general mechanism associating to a vector bundle and a functor a new vector bundle. The general version would be better, but I have never played with the category theory library...</p>",
        "id": 186527018,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1579895162
    },
    {
        "content": "<p>I see. I was thinking of the first approach, because I don't know this second construction. How does that work?</p>",
        "id": 186532184,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1579898687
    },
    {
        "content": "<p>If you have a functor, say, from (Vect, isos) to (Vect, isos), and it is continuous on Hom-sets in an appropriate sense, then given a vector bundle, you choose a trivialization, apply the functor to the fiber over each piece and to the transition maps, and use the resulting data to glue together a new vector bundle.</p>",
        "id": 186537648,
        "sender_full_name": "Reid Barton",
        "timestamp": 1579902508
    },
    {
        "content": "<p>Yes, this is the math version. The question is rather the Lean version :)</p>",
        "id": 186538323,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1579903001
    },
    {
        "content": "<p>For instance, if you have the tangent bundle with fibers <code>T_x M</code>, then the bundle with fiber <code>(T_x M ⊗ T_x M)^*</code> comes directly out of this construction, and this is the one in which a metric lives.</p>",
        "id": 186538511,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1579903174
    }
]