[
    {
        "content": "<p>There was a big announcement made in the <a href=\"https://hottest-seminar.github.io/\">HoTTEST seminar</a> today, namely the recently-completed <a href=\"https://www.youtube.com/watch?v=UNBfyeB9u1s\">formalization of the Serre finiteness theorem</a> by <span class=\"user-mention\" data-user-id=\"110032\">@Reid Barton</span>, Owen Miller, <span class=\"user-mention\" data-user-id=\"620276\">@Axel Ljungström</span> , <span class=\"user-mention\" data-user-id=\"508064\">@Anders Mörtberg</span>, and <span class=\"user-mention\" data-user-id=\"372365\">@Loïc P</span>.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"UNBfyeB9u1s\" href=\"https://www.youtube.com/watch?v=UNBfyeB9u1s\"><img src=\"https://uploads.zulipusercontent.net/dbd39de2e583eff4b59b9515b6c00fd530b9f7be/68747470733a2f2f692e7974696d672e636f6d2f76692f554e4266796542397531732f6d7164656661756c742e6a7067\"></a></div>",
        "id": 546774684,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1761256676
    },
    {
        "content": "<p>These folks can explain better than me but let me give a bit of background. The Serre Finiteness Theorem says roughly that all of the homotopy groups of spheres are finitely presented, i.e., isomorphic to <code>ℤʳ × ℤ/r₁ × ⋯ × ℤ/rₙ</code> for some finite sequence of integers. <span class=\"user-mention\" data-user-id=\"110032\">@Reid Barton</span> and Tim Campion recently discovered a proof of (a generalization of) this result in homotopy type theory that is fully constructive, i.e., which contains an algorithm that for a particular <code>πₙ Sᵐ</code> computes exactly this sequence of integers.</p>",
        "id": 546775066,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1761256887
    },
    {
        "content": "<p>The formalization is in the proof assistant Cubical Agda which implements a fully constructive form of homotopy type theory called somewhat imprecisely \"cubical type theory.\" In this system univalence is a theorem rather than an axiom. In particular, this formal system satisfies a metatheoretic property called normalization which says that a closed term (meaning in the empty context) of type <code>ℤ</code> is an explicit integer.</p>",
        "id": 546775241,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1761256989
    },
    {
        "content": "<p>Now the Barton-Campion algorithm formalized by the team mentioned above only computes all homotopy groups of spheres in theory. Past history with the <a href=\"https://homotopytypetheory.org/2022/06/09/the-brunerie-number-is-2/\">Brunerie number</a> suggests it will take a lot of optimization before it can compute any homotopy groups of sphere in practice. On the other hand, the entire algorithm, plus a lot of beautiful background mathematics about CW-complexes and a new notion of <em>stably almost finite homotopy types</em> has now been formally verified. This is very cool!</p>",
        "id": 546775429,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1761257112
    },
    {
        "content": "<p>This is really cool! Congrats to the authors!</p>",
        "id": 546876112,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1761306308
    }
]