[
    {
        "content": "<p>I have to rational numbers a, b and I need to show that that casting to Real respects division.<br>\ni.e. <code>(a : ℝ) / (b : ℝ) = ((a / b : ℚ) : ℝ)</code></p>\n<p>I would have thought that either <code>simp</code> or <code>norm_cast</code> would help but apparently not. How should I show this, and also how can I search for relevant theorems? <code>rw?</code> didn't seem to come up with anything useful.</p>",
        "id": 505859039,
        "sender_full_name": "Sebastian Zimmer",
        "timestamp": 1742053111
    },
    {
        "content": "<p>I also think either <code>simp</code> or <code>norm_cast</code> should work but if they don't you can always just use <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Rat.cast_div#doc\">docs#Rat.cast_div</a> directly.</p>",
        "id": 505859203,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1742053207
    },
    {
        "content": "<p>Ah I was missing an import <code>import Mathlib.Data.Rat.Cast.CharZero</code>.</p>\n<p>What would have been the easiest way for me to find this without asking here?</p>",
        "id": 505859603,
        "sender_full_name": "Sebastian Zimmer",
        "timestamp": 1742053499
    },
    {
        "content": "<p><code>import Mathlib</code> and only reduce your imports once you're done writing all the code (that's what I do).</p>",
        "id": 505859768,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1742053620
    },
    {
        "content": "<p>Of course, if you're working on mathlib, this doesn't quite work.</p>",
        "id": 505859786,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1742053637
    },
    {
        "content": "<p>If you're working within an already-existing file then almost always you either have enough stuff imported already, or you know what more you need to import already. If you're working on a new file then you start with  <code>import Mathlib</code> and minimise later. This is my experience, but then again it might not be representative of everyone because I tend to work very far from the root.</p>",
        "id": 505863998,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1742056569
    }
]