[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"559197\">@Dean Young</span> It's great that you outlined your project over here: <a href=\"#narrow/stream/113486-announce/topic/Whitehead.20Theorem\">https://leanprover.zulipchat.com/#narrow/stream/113486-announce/topic/Whitehead.20Theorem</a><br>\nSince <a class=\"stream\" data-stream-id=\"113486\" href=\"/#narrow/stream/113486-announce\">#announce</a> isn't suited for longer discussions, I'm starting a thread here. You talk about an extensive outline for the project. Is that publicly available?</p>",
        "id": 395836503,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1696928091
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> ,</p>\n<p>thanks so much for making this space for the idea, and good question. The information about the project is publicly available at <code>https://linearlibrary.net/ThreeWhiteheadTheorems/October11th.pdf</code>.  I'd also like to mention that any notation in the October11th file is pretty flexible going forward.</p>",
        "id": 396144721,
        "sender_full_name": "Dean Young",
        "timestamp": 1697048960
    },
    {
        "content": "<p>As I do not know much about infinity categories, it is very difficult for me to relate to anything that is in this document. If I were actively trying to prove any version of Whitehead theorems I know of, I would proceed basically like this:</p>\n<ul>\n<li>formalize Serre fibrations of topological spaces (various equivalent definitions, construction of the homotopy sequence of a Serre fibration)</li>\n<li>formalize the axioms of model categories (which a few of us already know how to do): then any weak equivalence between fibrant and cofibrant objects are homotopy equivalences (this is a Whitehead type theorem, which I believe I have already formalised in Lean3)</li>\n<li>formalize the Quillen model category structure on topological spaces</li>\n<li>formalize the model category structure on simplicial sets</li>\n</ul>\n<p>How does your strategy intersect with the constructions above?</p>",
        "id": 396478106,
        "sender_full_name": "Joël Riou",
        "timestamp": 1697193053
    },
    {
        "content": "<p>Hi Joël,</p>\n<p>Great question.</p>\n<p>The core of the Whitehead theorem typically uses an extension property (HEP) such as the one in Hatcher's text on page 346. You're no doubt familiar with how such extension theorems lead to model structures, and so to answer your question I would like to illustrate the extension property that we will show. </p>\n<p>Firstly, instead of CW-complexes we use a quite similar object formed by attaching objects Δⁿ along their boundaries ∂Δⁿ instead of discs Dₙ along their boundaries Sⁿ. We show the theorem by induction, reducing to the case of a \"jar filling lemma\" which extends a homotopy along a single attachment. Maybe you see why I want to call this HEP a \"jar filling lemma\": the jar shape is created by gluing (∂Δⁿ × I) with Δⁿ along ∂Δⁿ. The existence of the extension uses the quasi-category lifting condition by extending one simplex at a time (followed by a lid which completes the desired homotopy extension).</p>\n<p>I hope this brief explanation of the relevant lifting lemma answers your question.</p>\n<p>Unfortunately the October11th file does not feature this detail since I had only recently decided on a particular model. I also like the models you mention, and it would be great to hear your thoughts as to which model you think would be most useful or integrated.</p>",
        "id": 396654210,
        "sender_full_name": "Dean Young",
        "timestamp": 1697292725
    },
    {
        "content": "<p>I did not mention CW-complexes!</p>",
        "id": 396674927,
        "sender_full_name": "Joël Riou",
        "timestamp": 1697314196
    },
    {
        "content": "<p>My question was more: do you intend to prove that topological spaces and simplicial sets have a model category structure (and there is a Quillen equivalence between the two)?</p>",
        "id": 396675933,
        "sender_full_name": "Joël Riou",
        "timestamp": 1697315478
    },
    {
        "content": "<p>We don't prove any model structures for either. That part was the closest it came because of how it suggests a weak factorization system involving maps from a CW-complex to a point and their relative analogues.</p>\n<p>However if it's something that would be useful for you then we can go ahead and add a model structure for topological spaces in.</p>",
        "id": 396722348,
        "sender_full_name": "Dean Young",
        "timestamp": 1697350962
    },
    {
        "content": "<p>I only wish that while you develop your approach, we do not eventually get only an \"isolated\" theorem but also the relevant API. For example, it seems likely that what you suggest about \"jars\" is related to some classical results from Gabriel-Zisman <em>Calculus of fractions and homotopy theory</em> about different characterizations of the saturation of horns in the category of simplicial sets (IV.2 Anodyne extensions).</p>",
        "id": 396768598,
        "sender_full_name": "Joël Riou",
        "timestamp": 1697388102
    },
    {
        "content": "<p>Consider the demonstration that two maps of chain complexes f, g : C𛲔 ⭢ D𛲔 with C𛲔 a chain complex of projectives bounded below, and such that (∀ n : Int), Hₙ f = Hₙ g, are homotopy equivalent. This proof typically accompanies \"weak equivalent replacement with a projective complex\". Similarly, our proof of Wa (Whitehead theorem a) features two parts: replacement (REPa) and homotopy extension (HEPa). I just wanted to mention that to clarify how such two-fold proofs can get by without proving a model structure.</p>\n<p>Having mentioned that, I think it's a good idea to fill out the whole of various model structures involved, and including basics on anodyne maps seems like a good way to attract more users too.</p>\n<p>Based on your suggestions, here are six fundamental definitions, suggesting three different model structures, which might make a good addition to the project:</p>\n<p>• a left fibration if f has the right lifting property with respect to all<br>\nhorn inclusions Λni ⊆ ∆n, 0 ≤ i &lt; n.<br>\n• a right fibration if f has the right lifting property with respect to all<br>\nhorn inclusions Λni ⊆ ∆n, 0 &lt; i ≤ n.<br>\n• an inner fibration if f has the right lifting property with respect to all<br>\nhorn inclusions Λni ⊆ ∆n, 0 &lt; i &lt; n.<br>\nA morphism of simplicial sets i : A → B is<br>\n• left anodyne if i has the left lifting property with respect to all left fibrations.<br>\n• right anodyne if i has the left lifting property with respect to all right fibrations.<br>\n• inner anodyne if i has the left lifting property with respect to all inner fibrations.</p>\n<p>(See Lurie's HTT page 53.)</p>\n<p>What do you think about the inclusion of three model structures involved in the above?</p>",
        "id": 396826458,
        "sender_full_name": "Dean Young",
        "timestamp": 1697434624
    },
    {
        "content": "<p>For the standard model category structure on simplicial sets (the one which is the most useful for homotopy), the fibrations are Kan fibrations, which is a stronger condition than left/right/inner fibrations.</p>\n<p>(Note that in case of homological algebra, I have mostly verified the axioms of model categories in the dual situation: the case of bounded below complexes in a category with enough injectives <a href=\"#narrow/stream/335062-homology/topic/Derived.20functors\">https://leanprover.zulipchat.com/#narrow/stream/335062-homology/topic/Derived.20functors</a> . I am not completely sure that the exact phrasing of the lemma on projectives you mention is correct though.)</p>",
        "id": 396890706,
        "sender_full_name": "Joël Riou",
        "timestamp": 1697458921
    }
]