[
    {
        "content": "<p>Hello fellow Lean enthusiasts, and happy New Year!</p>\n<p>It had been a long time since I had time to play Lean, but during the holidays I found a bit of time. I thought I'd make the result <a href=\"https://github.com/kkytola/VirasoroProject/\">public</a>, in case others are interested in the same theme. (I might even write a small blueprint soon to help see what is in there.)</p>\n<p>What I set out to do was to formalize something related to the Virasoro algebra. I did not (yet) get to where I really wanted, but I did get the construction of the Virasoro algebra as the unique 1-dimensional central extension of the Witt algebra. </p>\n<p>This involved writing some basics of Lie algebra cohomology in degree two, central extensions constructed (concretely) from 2-cocycles, and the (abstract) \"characteristic predicate\" of central extensions as short exact sequences.</p>\n<p>The main part so far was, however, the explicit calculation of a specific 2-cohomology, namely that of the Witt algebra. I had never done Lean projects which involve calculations, so this was one of the main reasons why I chose this game instead of something else; I wanted to get a feeling of how is it to do calculations (in an explicitly chosen basis <span aria-label=\"scream\" class=\"emoji emoji-1f631\" role=\"img\" title=\"scream\">:scream:</span>) in Lean. I expected this to be slightly awkward, but at least it wasn't worse than I expected. In the end the (current) main result is the proof that the 2-cohomology (with coefficients in the scalar field) of the Witt algebra is 1-dimensional and generated by the class of the Virasoro cocycle.</p>\n<p>With the cocycle and the central extension API, I defined the Virasoro algebra. As another (more trivial) example application I constructed the Heisenberg (Lie) algebra as the 1-dimensional central extension of an infinite-dimensional abelian Lie algebra associated with an explicit nonzero 2-cocycle. The main motivation for this second (quite boring in its own right) application is that I actually wanted to work towards the Sugawara construction (in conformal field theory, which is my own area), which equips positive energy representations of the Heisenberg algebra with a representation of the Virasoro algebra. But I ran out of holiday days and I thought I should at least put what I have so far in public in case someone else finds it interesting.</p>",
        "id": 491524778,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1735761459
    },
    {
        "content": "<p>very nice! maybe there is some intersection with what <span class=\"user-mention\" data-user-id=\"630477\">@Scott Carnahan</span> is doing? <a href=\"https://github.com/leanprover-community/mathlib4/pull/20206\">#20206</a></p>",
        "id": 491602843,
        "sender_full_name": "Yoh Tanimoto",
        "timestamp": 1735820744
    },
    {
        "content": "<p>Oh, there absolutely seems to be! Thanks! I hadn't noticed this PR (I have not really had time to follow Mathlib development recently).</p>\n<p>The part of my project that was in the most urgent need of cleaning up was anyway the general theory; I set it up only so that I got to doing the concrete calculation. So I will be happy to try to refactor if Scott's PRs set up that general theory and they land in Mathlib.</p>\n<p>But a question to <span class=\"user-mention\" data-user-id=\"630477\">@Scott Carnahan</span>: have you done also the calculation of the Witt algebra 2-cohomology to define the Virasoro algebra and is your plan to PR that?</p>",
        "id": 491605312,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1735821889
    },
    {
        "content": "<p>(Btw, Yoh, Scott, and I may have somewhat similar reasons in our own research themes to be interested in central extensions etc... <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span>)</p>",
        "id": 491605500,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1735821963
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"373986\">@Kalle Kytölä</span> I have not done any cohomology calculations, but I have a construction of central extensions from 2-cocycles.</p>",
        "id": 493180824,
        "sender_full_name": "Scott Carnahan",
        "timestamp": 1736680622
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"678361\">@Yudai Yamazaki</span> does this overlap with your summer project?</p>",
        "id": 493193327,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1736691711
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"630477\">Scott Carnahan</span> <a href=\"#narrow/channel/116395-maths/topic/Virasoro.20algebra.20.28and.20cohomology.20of.20the.20Witt.20algebra.29/near/493180824\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"373986\">Kalle Kytölä</span> I have not done any cohomology calculations, but I have a construction of central extensions from 2-cocycles.</p>\n</blockquote>\n<p>Ok! I'd love to see you PR the construction; you can ping me for review (although I have varying amounts of lack of time). If you PR it, I would then try to refactor my concrete calculation to use your (i.e., Mathlib's) 2-cohomology and central extensions.</p>\n<p>Btw, do you also have the opposite: that any central extension corresponds to a 2-cocycle (well-def mod coboundary)? I spent maybe 15min on that diagram chase in Lean, but decided I don't explicitly need that direction, so I left it at that. It should not be too hard, but there was some annoyance (if I remember correctly it was about proving that the unique elements obtained by the diagram chasing depend linearly on their arguments as they of course obviously do; the annoyance could well just be my lack of familiarity with the appropriate parts of Mathlib).</p>\n<p>I was also planning to do Sugarawa construction (the basic bosonic case), and I think here there is an obvious overlap of our interests, since the same is used in VOAs. I \"need\"/want a version that is at the same time slightly more general than the VOA construction and less general in that it would be restricted to the free boson case (although modifications to affine Kac-Moody algebras should then be relatively straightforward). If you have or get plans for doing that, I'd appreciate knowing; I will also let you know when (...or if...) I find the time to write Sugawara myself.</p>",
        "id": 493372064,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1736780158
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"630477\">@Scott Carnahan</span>:</p>\n<p>I'd still be interested in the above, i.e., whether you also have that any central extension corresponds to a 2-cocycle (well-def mod coboundary)? If you already did the diagram chase, I'd be glad to save myself the trouble. But it would be nice to have (already for the purpose of constructing a basis of a central extension from bases of the original Lie algebras).</p>\n<p>Another thing that I would like to know is whether you had a nicer way around the dependent type issues that I found annoying leading up to <a href=\"https://kkytola.github.io/VirasoroProject/docs/VirasoroProject/CentralExtension.html#VirasoroProject.LieTwoCocycle.CentralExtension.equiv_of_lieTwoCoboundary\">LieTwoCocycle.CentralExtension.equiv_of_lieTwoCoboundary</a>, i.e., that two cocyles which differ by coboundaries determine isomorphic central extensions. The issues I faced are described in particular in the (apparently incomplete sentence of the) docstring for <a href=\"https://kkytola.github.io/VirasoroProject/docs/VirasoroProject/CentralExtension.html#VirasoroProject.LieTwoCocycle.CentralExtension.congr\">LieTwoCocycle.CentralExtension.congr</a>.</p>",
        "id": 498528021,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1739042305
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"373986\">@Kalle Kytölä</span> </p>\n<p>I haven't worked anything out, but I would suggest a function that, instead of the hypothesis <code>(h : γ' - γ ∈ LieTwoCoboundary 𝕜 𝓖 𝓐)</code>, used an explicit 1-cochain <code>x</code>, and the hypothesis that <code>γ' = γ + dx</code>.</p>",
        "id": 498546641,
        "sender_full_name": "Scott Carnahan",
        "timestamp": 1739057978
    },
    {
        "content": "<p>Thanks, that seems like a potential improvement, although it also seems like a natural alternative to go in the opposite direction and use <code>(h : γ.cohomologyClass = γ'.cohomologyClass)</code> as the hypothesis. <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span> <em>[UPDATE: Ah, I now realize you were probably referring to my crime of constructing data in tactic mode. Yes, for that your suggestion looks clearly better! This was a secondary issue to me compared with the dependent type issue, but should absolutely be fixed, too.]</em></p>\n<p>In any case, this does not seem to affect the dependent type issue, unless I am missing something... Perhaps the lemmas in between <a href=\"https://kkytola.github.io/VirasoroProject/docs/VirasoroProject/CentralExtension.html#VirasoroProject.LieTwoCocycle.CentralExtension.congr\">LieTwoCocycle.CentralExtension.congr</a> and <a href=\"https://kkytola.github.io/VirasoroProject/docs/VirasoroProject/CentralExtension.html#VirasoroProject.LieTwoCocycle.CentralExtension.equiv_of_lieTwoCoboundary\">LieTwoCocycle.CentralExtension.equiv_of_lieTwoCoboundary</a> are just necessary. (Mathematically it just feels strange to me to be saying that if I know that two 2-cocycles are literally the same then the central extensions they determine are isomorphic.)</p>\n<p>I guess the main thing about the diagram chase was something a bit similarly frustrating; obviously there was a unique thing (and I constructed it), so I just got lazy proving the obvious fact that the unique thing determined by a linear condition on the input depends linearly on its input (and satisfies the 2-cocycle equation)... My guess was that someone has encountered a similar thing before and there may be a Lean-idiom that handles it less brutally than what I would have done if I hadn't gotten lazy as I did not need it right away.</p>",
        "id": 498832857,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1739212120
    },
    {
        "content": "<p>I added one result in the <a href=\"https://github.com/kkytola/VirasoroProject\">VirasoroProject</a> that might be of interest to, well, those interested in the Virasoro algebra... Sorry about my shameless plug, but I will take the liberty of pinging <span class=\"user-mention\" data-user-id=\"630477\">@Scott Carnahan</span>, <span class=\"user-mention\" data-user-id=\"242586\">@Vincent Beffara</span>, and <span class=\"user-mention\" data-user-id=\"382902\">@Yoh Tanimoto</span>, and maybe also <span class=\"user-mention\" data-user-id=\"260071\">@Ingo Runkel</span>  --- if for nothing else then at least to reduce the risk of duplicating work.</p>\n<p>The added result is the <a href=\"https://kkytola.github.io/VirasoroProject/docs/VirasoroProject/Sugawara.html#VirasoroProject.VirasoroAlgebra.sugawaraRepresentation\">basic bosonic Sugawara construction</a>, equipping any representation of the Heisenberg algebra that satisfies a local truncation condition with a representation of the Virasoro algebra with central charge <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>c</mi><mo>=</mo><mn>1</mn></mrow><annotation encoding=\"application/x-tex\">c=1</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">c</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6444em;\"></span><span class=\"mord\">1</span></span></span></span>. The two lemmas below that one should convince one that the construction does what it says on the tin.</p>\n<p>There would be various generalizations of this, some which I plan to add (as) soon (as I have time for them):</p>\n<ul>\n<li>one can do a central change modification by introducing a background charge</li>\n<li>one could extend this to affine Kac-Moody algebras once one defines them (their definition looks very feasible but is not one of my priorities)</li>\n<li>or one can do fermionic Sugawara constructions (in particular applicable to the Ising-type Majorana fermions in the Ramond and Neveu-Schwarz sectors, or a symplectic fermion version, both of which I plan to do when I have time).</li>\n</ul>\n<p>A disclaimer: I haven't cleaned up the code yet --- I just quickly wanted to have a <code>sorry</code>-free formalization of one small lemma that necessarily appears in a talk I will give in Bonn in one week + <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ε</mi></mrow><annotation encoding=\"application/x-tex\">\\varepsilon</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">ε</span></span></span></span>. Also the blueprint doesn't yet contain the Sugawara construction, but I will probably try to write this up in natural language as well...</p>",
        "id": 524092478,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1749942543
    },
    {
        "content": "<p>That is a very impressive result!</p>",
        "id": 524092752,
        "sender_full_name": "Scott Carnahan",
        "timestamp": 1749943074
    },
    {
        "content": "<p>It is very calculation-heavy, which is not the thing one usually does in Lean. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> (Doing calculations in Lean was definitely a part of the VirasoroProject experiment, although I also care about this result for its own sake).</p>\n<p>I think it should be helpful at some steps in your VOA projects, where one wants to promote some concrete VAs to VOAs.</p>",
        "id": 524092994,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1749943494
    },
    {
        "content": "<p>wow, great work!</p>",
        "id": 524119582,
        "sender_full_name": "Yoh Tanimoto",
        "timestamp": 1749982301
    }
]