[
    {
        "content": "<p>This thread is for <a href=\"https://github.com/teorth/equational_theories/issues/378\">EQUATION_EXPLORER: Give an option in equation explorer to allow the \"expanded\" list of equations beyond the original 4694</a></p>",
        "id": 556710506,
        "sender_full_name": "Emmanuel Osalotioman Osazuwa",
        "timestamp": 1763322701
    },
    {
        "content": "<p>The issue name says to allow for an \"expanded\" list of equations beyond the original 4694, but since there are infinitely many equations, does the expanded list have some kind of cap?</p>",
        "id": 556723448,
        "sender_full_name": "Emmanuel Osalotioman Osazuwa",
        "timestamp": 1763336632
    },
    {
        "content": "<p>Also, if the expanded list isn’t capped, is the aim of the issue to update the UI to allow for infinite scrolling?</p>",
        "id": 556723631,
        "sender_full_name": "Emmanuel Osalotioman Osazuwa",
        "timestamp": 1763336834
    },
    {
        "content": "<p>I thought your PR <a href=\"https://github.com/teorth/equational_theories/pull/1383\">https://github.com/teorth/equational_theories/pull/1383</a> \"Allow displaying of higher order equations by explorer\" was basically doing what is requested in this issue?</p>",
        "id": 556759772,
        "sender_full_name": "Bruno Le Floch",
        "timestamp": 1763363648
    },
    {
        "content": "<p>It lets you search for higher order equations, but doesn't display them in a list format.</p>",
        "id": 556760308,
        "sender_full_name": "Emmanuel Osalotioman Osazuwa",
        "timestamp": 1763363914
    },
    {
        "content": "<p>We have to think about what would be useful.  Just having an infinitely-scrollable list of equations with no data does not seem useful.  From the Zulip thread cited in the issue, it seems the idea was to only list a few special equations that we care about.  For instance, E5093, or others that have commentary.  This keeps the list finite.</p>",
        "id": 556821611,
        "sender_full_name": "Bruno Le Floch",
        "timestamp": 1763383847
    },
    {
        "content": "<p>Oh.<br>\nThey couldn't be listed before cause when someone clicks on them in the UI it will lead to a broken link, but now that the ui supports higher order equations we should be able to display those special equations too.</p>",
        "id": 556822101,
        "sender_full_name": "Emmanuel Osalotioman Osazuwa",
        "timestamp": 1763384001
    },
    {
        "content": "<p>Right?</p>",
        "id": 556822249,
        "sender_full_name": "Emmanuel Osalotioman Osazuwa",
        "timestamp": 1763384041
    },
    {
        "content": "<p>I guess... but I really don't know any of the code there.  It may be risky to make changes.  Actually, allowing the Equation Explorer to display higher equations (as done by your PRs from a few days back) is a very useful change, but I don't yet see the point in including them in lists.</p>\n<p>By the way, the ui doesn't yet support anything more than before: your PRs have not been merged yet as far as I understand.</p>",
        "id": 556941839,
        "sender_full_name": "Bruno Le Floch",
        "timestamp": 1763418327
    },
    {
        "content": "<p>I've just merged <a href=\"https://github.com/teorth/equational_theories/pull/1379\">equational#1379</a>, but I am less certain as to the current status of <a href=\"https://github.com/teorth/equational_theories/pull/1383\">equational#1383</a> and <a href=\"https://github.com/teorth/equational_theories/pull/1384\">equational#1384</a>.</p>",
        "id": 556992518,
        "sender_full_name": "Terence Tao",
        "timestamp": 1763448978
    },
    {
        "content": "<p>They are still in review.</p>",
        "id": 556992602,
        "sender_full_name": "Emmanuel Osalotioman Osazuwa",
        "timestamp": 1763449016
    },
    {
        "content": "<p>I think what would be useful is to allow higher-order equations that have implications/non-implication proved to be displayed like normal equations. We have a number of these, but currently I believe the pipeline is not set-up to export them and the UI is currently hardcoded to only support contiguous blocks of implications.</p>",
        "id": 557880313,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1763458820
    },
    {
        "content": "<p>I think this may require rethinking how implications are exported overall. There may be an overall easy way to do it, I remember not loving the general design of the data format for export but it has been a while</p>",
        "id": 557880822,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1763458974
    }
]