[
    {
        "content": "<p>Would it be possible to have the FME's operation table check available as a Python module or API? (it'd take the operation table as an argument (in different formats), and return a json with \"equation_number\": 1 (for satisfied) or 0 for (refuted))?  <br>\nI made a small RL agent exploring the param space, but I hope I can build it on top of that tool (I've been using it a lot, and it seems to be very reliable).</p>",
        "id": 479451296,
        "sender_full_name": "Michael Bucko",
        "timestamp": 1730199601
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"466334\">@Shreyas Srinivas</span> Please take a look at this. I'll be running an rl agent. We could be experimenting with reward functions and all that. <br>\nWhat I've noticed is that compute is a very strong limitation for lots of people (I've been a running a lot of ATP experiments in the last couple of days), and that new methods might be needed.</p>",
        "id": 479503141,
        "sender_full_name": "Michael Bucko",
        "timestamp": 1730214338
    },
    {
        "content": "<p>Wrote the script myself. Not as a package - just as a function in a script. So this is solved for me.</p>",
        "id": 479652761,
        "sender_full_name": "Michael Bucko",
        "timestamp": 1730284936
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"672170\">Michael Bucko</span> has marked this topic as resolved.</p>",
        "id": 479652771,
        "sender_full_name": "Notification Bot",
        "timestamp": 1730284939
    },
    {
        "content": "<p>Nice. Is there a PR for this?</p>",
        "id": 479653584,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1730285165
    },
    {
        "content": "<p>Tagged you in that ticket. No PR atm. Just running the script. Shared it too in that script. Still needs to make sure that it's running correctly.</p>",
        "id": 479654461,
        "sender_full_name": "Michael Bucko",
        "timestamp": 1730285457
    },
    {
        "content": "<p>(The script is currently only for my special case - 854N413)</p>",
        "id": 479654661,
        "sender_full_name": "Michael Bucko",
        "timestamp": 1730285518
    }
]