[
    {
        "content": "<p>I have now created some tasks which should be visible at <a href=\"https://github.com/teorth/equational_theories/issues\">https://github.com/teorth/equational_theories/issues</a> , and which people are now free to claim by commenting on the relevant issue page.  As one can see, most of the tasks currently are part of the \"SUBGRAPH\" subproject at Subgraph.lean, which is aimed at completing the implication graph for a small subset of equations.</p>\n<p>I am now trying to incorporate the <code>proof_wanted</code> keyword into the workflow.  So there will be some tasks (38&lt;-&gt;42 and 39&lt;-&gt;42) where the statement to prove is already present in the Lean file as a <code>proof_wanted</code>, and someone is needed to convert this to a Lean proof.  Then there are additional tasks where implications that have been largely worked out in the Zulip discussion, but now the task is to convert them into proof_wanted statements.  (Here, one only needs to insert a minimal set of statements; any statement that can be deduced from the minimal set can be discarded as redundant.  Also, to help any future formalizer of these statements, a short explanation of the proof can be provided in a comment.)</p>\n<p>Going forward, the subgraph is already too complicated to analyze by hand, so I also added a request for a tool that can compute the status of every implication <code>EquationX → EquationY</code> in view of the existing theorems and <code>proof_wanted</code> statements.  It turns out that there are in fact nine possible statuses: explicitly proved/disproved, implicitly proved/disproved, explicitly conjectured/conjectured false, implicitly conjectured/conjectured false, and open.  Once such a tool is available, it should be easy to use it to add more tasks of the previous types, and after a few iterations we should be able to close off the Subgraph subproject (maybe after adding the dual vertices).</p>",
        "id": 473262907,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727487283
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"657719\">@Terence Tao</span> :  We should probably move the description of tasks to a different topic for that my request for PRs remains visible. If this is fine I can make the move.</p>",
        "id": 473263169,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727487357
    },
    {
        "content": "<p>2 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"458659\" href=\"/#narrow/stream/458659-Equational/topic/PRs.20Welcome.20.3A.20CI.20actions.20to.20manage.20the.20project\">#Equational &gt; PRs Welcome : CI actions to manage the project</a> by <span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span>.</p>",
        "id": 473263397,
        "sender_full_name": "Notification Bot",
        "timestamp": 1727487416
    },
    {
        "content": "<p>To add clarification: the tasks are on the dashboard here: <a href=\"https://github.com/users/teorth/projects/1\">https://github.com/users/teorth/projects/1</a></p>",
        "id": 473263665,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727487497
    },
    {
        "content": "<p>We are <strong>manually</strong> applying the protocol in <a href=\"#narrow/stream/458659-Equational/topic/PRs.20Welcome.20.3A.20CI.20actions.20to.20manage.20the.20project/near/473259994\">this thread</a> for now. The linked thread has a call for PRs to automate this protocol with github actions.</p>",
        "id": 473263719,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727487513
    },
    {
        "content": "<p>I have now added the duals of existing equations into the mix of equations to study for the Subgraph subproject, namely 23 (the dual of 8), 45 (the dual of 42), 4564 (the dual of 4513), and 4378 (the dual of 4522).  I have created new tasks for each of these to place them on the graph; I have also placed a task request for an automated tool to compute the dual of an equation, as well as a request to produce a nicer, more symmetric Hasse diagram.</p>",
        "id": 473372900,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727548398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"657719\">@Terence Tao</span> The automation to assign users to tasks and link their PRs is in place thanks to <span class=\"user-mention\" data-user-id=\"556875\">@Pietro Monticone</span>. All that remains to automate is moving tasks between the columns on the dashboard's task view by dragging and dropping the boxes. Pietro has agreed to address this limitation tomorrow. For now we can do this manually. In the task view, any task with a picture of a person can be moved to \"Claimed Tasks\" and any \"Claimed Tasks\" can be moved to \"In Progress\" if a PR icon is seen. When a PR is merged, the tasks  automatically move to the \"Completed Tasks\" column</p>",
        "id": 473373176,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727548610
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> has marked this topic as resolved.</p>",
        "id": 474373586,
        "sender_full_name": "Notification Bot",
        "timestamp": 1727895415
    }
]