[
    {
        "content": "<p>Currently all the formal implications are being recorded in a single Lean file, Basic.lean, while some of the implications that are either formalized or soon to be formalized are in the blueprint, and finally some claims about implications are being made in the outstanding tasks thread.  This is (barely) sustainable for now, but soon will not scale, especially once the automated tools come online and start generating thousands of implications at a time.  So we need to figure out what data structure is going to be the \"ground truth\" store of implications, which would then be used to create data visualizations, linters, and lists of unsolved implications (ideally with redundant implications removed, and possibly ordered by some sort of usefulness metric).</p>\n<p>I see this project having two levels of ground truth.  The first is the Lean-verified ground truth of implications that are actually formalized in Lean.  (If we are continuing to scrape the Lean source code for this, we may wish to change any <code>sorry</code>'d theorem to a <code>proof_wanted</code> so as to make it easier for a scraper to ignore those theorems.)  In this level, any implication is either proven, disproven, or open.</p>\n<p>But I would also like to see a second level of ground truth, containing all the implications that are obtained (possibly inaccurately) by non-Lean methods: either worked out by humans, or by other automated tools that do not output directly into Lean-compilable code.  In this level, any implication is either claimed to be true, claimed to be false, or not known.  Right now I am (barely) able to curate this level through the outstanding task list, but this is not going to scale much further.</p>\n<p>Perhaps, in addition to the Lean folder, the repository could contain a Claims folder, in which anyone could contribute a plain text file containing claims without any Lean proof.  This could for instance consist of machine-readable lines such as <code> Equation4_not_implies_Equation4582</code> to describe the content of the claim,  possibly accompanied by some human-readable commentary to describe the proof of the claim.  This folder would then be the ground truth for the non-Lean verified claims, and external tools (such as automated theorem provers) could generate large text files of this form to add to this folder without passing through any Lean CI.  (However we may need some sort of CI to flag if the claims contain an inconsistency, e.g., A implies B, B implies C, but A does not imply C, or if the claims are not compatible with the Lean-verified truth.)</p>\n<p>One could then have visualization tools to see both the Lean-verified state of implications and the unverified state of implications (after completing the posets as much as possible), and to identify claims in the latter that are not in the former.  This in particular could be used to create an automated \"outstanding tasks\" list, possibly managed through Github projects (which I have recently enabled, I believe).</p>\n<p>Anyway, this is the tentative picture of the workflow I think will be needed to scale up the project.  Any thoughts or comments on this proposal would be welcome.</p>",
        "id": 473022025,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727417849
    },
    {
        "content": "<p>I completely agree that it will be useful two have two such \"ground truths\". I also think it would be good to have different names for them. The first one certainly is a very grounded version of \"ground truth\". The second one quite a bit less. Maybe that one is \"ground claims\"? (But that doesn't roll off the tongue as easily...)</p>",
        "id": 473028614,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1727420606
    },
    {
        "content": "<p>Ooh, I just realized that maybe <code>proof_wanted</code> can be used for unverified claims.  So Lean files can contain both theorems such as</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"kn\">theorem</span><span class=\"w\"> </span><span class=\"n\">Equation2_implies_Equation3</span><span class=\"w\"> </span><span class=\"o\">(</span><span class=\"n\">G</span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"kt\">Type</span><span class=\"bp\">*</span><span class=\"o\">)</span><span class=\"w\"> </span><span class=\"o\">[</span><span class=\"n\">Magma</span><span class=\"w\"> </span><span class=\"n\">G</span><span class=\"o\">]</span><span class=\"w\"> </span><span class=\"o\">(</span><span class=\"n\">h</span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">Equation2</span><span class=\"w\"> </span><span class=\"n\">G</span><span class=\"o\">)</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">Equation3</span><span class=\"w\"> </span><span class=\"n\">G</span><span class=\"w\"> </span><span class=\"o\">:=</span><span class=\"w\">  </span><span class=\"k\">fun</span><span class=\"w\"> </span><span class=\"bp\">_</span><span class=\"w\"> </span><span class=\"bp\">↦</span><span class=\"w\"> </span><span class=\"n\">h</span><span class=\"w\"> </span><span class=\"bp\">_</span><span class=\"w\"> </span><span class=\"bp\">_</span>\n</code></pre></div>\n<p>and claims such as</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">proof_wanted</span><span class=\"w\"> </span><span class=\"n\">Equation256_implies_Equation304</span><span class=\"w\"> </span><span class=\"o\">(</span><span class=\"n\">G</span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"kt\">Type</span><span class=\"bp\">*</span><span class=\"o\">)</span><span class=\"w\"> </span><span class=\"o\">[</span><span class=\"n\">Magma</span><span class=\"w\"> </span><span class=\"n\">G</span><span class=\"o\">]</span><span class=\"w\"> </span><span class=\"o\">(</span><span class=\"n\">h</span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">Equation256</span><span class=\"w\"> </span><span class=\"n\">G</span><span class=\"o\">)</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">Equation304</span><span class=\"w\"> </span><span class=\"n\">G</span>\n</code></pre></div>\n<p>So any human or automated tool that wants to make a claimed implication, but without a Lean proof, can just add a <code>proof_wanted</code> to a relevant Lean file, and some later human or automated tool can try to fill in that proof later.   Other automated tools can then collect both the proven implications and the claimed implications for various visualization tools and to help assign tasks.</p>",
        "id": 473260352,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727485689
    },
    {
        "content": "<p>Indeed, I think I mentioned something to that effect in the thoughts and impressions topic</p>",
        "id": 473290345,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1727501690
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> has marked this topic as resolved.</p>",
        "id": 474373508,
        "sender_full_name": "Notification Bot",
        "timestamp": 1727895398
    }
]