[
    {
        "content": "<p>I would like to remind and request everybody that if you have an idea please request a task for it by creating an issue and discussing it in a zulip thread. Please follow the claims process. This keeps the maintainers' task simple and ensures that nobody's work overlaps too much with anybody else and everyone gets an opportunity to work on their contributions without worry of being overshadowed by competing PRs.</p>",
        "id": 475678888,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728423755
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"466334\">@Shreyas Srinivas</span> can you elaborate on the exact procedure for this part:</p>\n<blockquote>\n<p>please request a task for it by creating an issue and discussing it in a zulip thread</p>\n</blockquote>\n<p>For example, I spotted a typo in Definition 7.1 in the blueprint which I was going to fix just now. To follow the process listed above, I first opened a new issue <a href=\"https://github.com/teorth/equational_theories/issues/470\">Issue #470</a> then claimed the issue and proposed <a href=\"https://github.com/teorth/equational_theories/pull/471\">PR #471</a> on the issue.  After merge validation completed on the PR, I also added the <code>awaiting-review</code> tag. However, throughout this process, nothing new showed up on the project board <a href=\"https://github.com/users/teorth/projects/1\">here</a>, so I suspect I missed a step - but I do not know which.</p>",
        "id": 475907126,
        "sender_full_name": "Avi Levy",
        "timestamp": 1728489787
    },
    {
        "content": "<p>Ah so what's missing here is that maintainers have to add the task to the project board</p>",
        "id": 475907332,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728489847
    },
    {
        "content": "<p>Since github doesn't restrict PRs on public repositories, it is the only filter we have to make ensure the contributions process works in some sense.</p>",
        "id": 475907659,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728489940
    },
    {
        "content": "<p>Otherwise we could be flooded with overlapping PRs and lose track of which PR was doing exactly what</p>",
        "id": 475907856,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728489982
    },
    {
        "content": "<p>This is why we encourage zulip discussions on the issue</p>",
        "id": 475908296,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728490094
    },
    {
        "content": "<p>Ah, I think I missed another thing as well - I just noticed that when I added awaiting-review to the PR <a href=\"https://github.com/teorth/equational_theories/pull/471\">equational#471</a>, it failed to find the link to the issue <a href=\"https://github.com/teorth/equational_theories/pull/470\">equational#470</a> - the failed job <a href=\"https://github.com/teorth/equational_theories/actions/runs/11258721703/job/31305993978\">https://github.com/teorth/equational_theories/actions/runs/11258721703/job/31305993978</a> shows the error message</p>\n<blockquote>\n<p>No related issue found in PR body. Exiting...</p>\n</blockquote>\n<p>when running</p>\n<blockquote>\n<p>ISSUE_NUMBER=$(jq -r '.body | capture(\"Closes #(?&lt;num&gt;[0-9]+)\") | .num' pr.json)</p>\n</blockquote>\n<p>I retroactively edited the PR body to include the phrase \"Closes <a href=\"https://github.com/leanprover-community/mathlib4/pull/470\">#470</a>\" and now I know to do this for next time!</p>",
        "id": 475915479,
        "sender_full_name": "Avi Levy",
        "timestamp": 1728492395
    },
    {
        "content": "<p>So if you  had proposed the PR after the issue was added to the project, this would have happened automatically</p>",
        "id": 475915614,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728492459
    },
    {
        "content": "<p>So if you look at how tasks were managed in the PFR project, the idea was that there would be outstanding tasks threads (see examples in <a class=\"stream\" data-stream-id=\"412902\" href=\"/#narrow/stream/412902-Polynomial-Freiman-Ruzsa-conjecture\">#Polynomial Freiman-Ruzsa conjecture</a>). People would claim them and Terence Tao would manually edit the top message to validate the claim. We built on that basic scheme and automated it all the way.</p>\n<p>One difference is that the tasks don't have to be batched up anymore. That was primarily because of the constraints of managing the  project over zulip (not wanting to lose track of tasks and threads for example)</p>",
        "id": 475916217,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728492716
    },
    {
        "content": "<p>Essentially it is a ticket system, except here the maintainers post the tickets (issues/tasks) and contributors pick them up.</p>",
        "id": 475916561,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728492841
    },
    {
        "content": "<p>Regarding the four entities:</p>\n<ol>\n<li>Zulip thread</li>\n<li>Issue</li>\n<li>Project board</li>\n<li>Pull request<br>\n1,2, and 4 can be done by any contributor but 3 requires maintainer involvement. The link from 2 -&gt; 4 is done by posting a \"propose #XXX\" message on the issue, and the link from 4 -&gt; 2 is done (perhaps automatically in some scenarios) by including a \"Closes #XXX\" message in the PR. The Zulip thread should reference 2 and 4 using projectname#XXX which Zulip automatically linkifies</li>\n</ol>",
        "id": 475917103,
        "sender_full_name": "Avi Levy",
        "timestamp": 1728493019
    },
    {
        "content": "<p>3 is largely handled by CI actions</p>",
        "id": 475917154,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728493041
    },
    {
        "content": "<p>One quibble I have with github's projects (I am saying this fully realizing that you work at Microsoft), is that there are a set of default workflows which can be expressed in flowchart GUI, but for everything else CI scripts are necessary. There is no room for custom project workflows to be added in the flowchart language.</p>",
        "id": 475917368,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728493106
    },
    {
        "content": "<p>One of the default workflows takes any issue labelled \"project-task\" and adds it to the dashboard. We restrict this label to maintainers.</p>",
        "id": 475917710,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728493220
    }
]