[
    {
        "content": "<p>Since idemprimal algebras are rigid, and almost all magmas are idemprimal, the number of isomorphism types of magmas on n elements is asymptotic to n^{n^2}/n!<br>\n Perhaps this adds some precision to the comment in section 1 of the blueprint  about the number of isomorphism types growing more slowly than the number of magmas.</p>",
        "id": 515418268,
        "sender_full_name": "Stanley Burris",
        "timestamp": 1746056439
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 515775164,
        "sender_full_name": "Stanley Burris",
        "timestamp": 1746210918
    },
    {
        "content": "<p>Thanks, I've uploaded a revision that incorporates this observation.</p>",
        "id": 515796706,
        "sender_full_name": "Terence Tao",
        "timestamp": 1746219285
    },
    {
        "content": "<p>The asymptotics n^{n^2}/n! for the number of isomorphism types of magmas on n elements once again looks fine to me after recalling a 1990 result of Ralph Freese that the labelled and unlabelled probabilities of algebraic properties of magmas both exist and are the same if one of them exists. Murskii showed the unlabelled probability of being rigid was 1.</p>\n<p>Reference: Ralph Freese. <em>On the two kinds of probability in algebra</em>. Algebra<br>\nUniversalis, 27(1):70–79, 1990.</p>\n<p>A rather complicated formula for the precise number of  isomorphism types was published by Michael A. Harrison as Theorem 4 of his <a href=\"https://www.ams.org/journals/proc/1966-017-03/S0002-9939-1966-0200219-9/home.html\">paper</a> \"The number of isomorphism types of finite algebras\", Proc. Amer. Math. Soc. <strong>17</strong> (1966), 731-737.</p>",
        "id": 516016287,
        "sender_full_name": "Stanley Burris",
        "timestamp": 1746355109
    },
    {
        "content": "<p><a href=\"https://arxiv.org/abs/2305.00269v2\">https://arxiv.org/abs/2305.00269v2</a>.</p>",
        "id": 516348273,
        "sender_full_name": "KKKKK",
        "timestamp": 1746507673
    },
    {
        "content": "<p>This preprint will certainly be useful for those working on k-magmas with k&gt;2. For 2-magmas (i.e, magmas) evidently Harrison's formula is correct.</p>",
        "id": 517308704,
        "sender_full_name": "Stanley Burris",
        "timestamp": 1746924432
    },
    {
        "content": "<p>A brief write-up of proofs for</p>\n<p>(1) almost all finite magmas are rigid, and<br>\n(2) asymptotics for the number of isomorphism types of finite magmas</p>\n<p>is available at <a href=\"https://github.com/snburris/CountUpdate/blob/main/count_magma_eqns\">my PR</a>. </p>\n<p>Also in my PR there are corrected LaTeX and PDF files for the formula for counting the number of magma of size n. The Blueprint subsection 1.1. (Alternate Formula) on this was corrected recently, but the link at the end of the subsection is to the old flawed LaTeX and PDF files in the scripts folder. (The Maple program was always correct.)</p>",
        "id": 517718462,
        "sender_full_name": "Stanley Burris",
        "timestamp": 1747103692
    }
]