[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> <a href=\"#narrow/stream/458659-Equational/topic/CI.20Lean.20Environment.20Check/near/475007840\">said</a>:</p>\n<blockquote>\n<p>As long as the CI time is still on the order of minutes instead of hours, I'd say it's worth it to have the extra guarantee. (Note to future self reading this thread: when writing the final paper, make a note of the extra layers of checking we have beyond the core Lean compiler, for instance we also have a separate check that no extra axioms are being inserted (<a href=\"https://github.com/teorth/equational_theories/pull/242\">equational#242</a>).)</p>\n<p>It might be good to \"red team\" and brainstorm for any other potential ways in which this project could be compromised, either by a glitchy AI or by some mischevious human.</p>\n</blockquote>\n<p>I think this message still belongs in this thread.</p>",
        "id": 475012376,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728156479
    },
    {
        "content": "<p>It might help to set the baseline expectation : Assuming that Lean has a bg-free sound kernel, in theory the build + external checkers are all we need. </p>\n<p>In practice any Cybersecurity issue anywhere in the GitHub infrastructure can become a source of bugs. Further human errors in setting up of the CI, lack of proper PR reviews, lack of checks to look for suspicious modifications, especially to the CI, can upset the apple cart.</p>",
        "id": 475021016,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728160673
    },
    {
        "content": "<p>Further, one relatively underexplored aspect of large scale collaborations is publication authorship</p>",
        "id": 475021095,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728160738
    },
    {
        "content": "<p>If a 100 people collaborate on a project, at least in my CS brain, that's 100 authors on the paper. Now traditionally authorship means making  technical contributions, writing something, and taking responsibility for what is written in the paper, but this makes less sense for larger projects.</p>",
        "id": 475021119,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728160776
    },
    {
        "content": "<p>It just doesn't scale.</p>",
        "id": 475021236,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728160890
    },
    {
        "content": "<p>No one author can possibly be sure that every contribution is 100% kosher.</p>",
        "id": 475021300,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728160925
    },
    {
        "content": "<p>In this project, there are PRs that add upwards of 100,000 lines of code. I can only be sure that they have been properly included and build. But scale it up to 500 people and an army of maintainers and suddenly even that is impossible for any individual.</p>",
        "id": 475021481,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728161158
    },
    {
        "content": "<p>For example, what if one maintainer lets in lean code which has not been imported in the top level file and so never gets checked by CI</p>",
        "id": 475021590,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728161214
    },
    {
        "content": "<p>This is just a long winded way of saying that even simple problems become extremely challenging at scale</p>",
        "id": 475021727,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728161354
    },
    {
        "content": "<p>I guess it is about time to start discussing authorship.  In the Polymath projects, we ended up selecting a pseudonym \"D.H.J. Polymath\" to author the published papers, with a link to a page listing the participants (which was collected by voluntary self-selection from the contributors' part) and their affiliations and grant support, although in one or two cases the journals did not permit pseudonymous authorship and we had to revert back to selecting some list of primary authors.</p>\n<p>I was leaning towards a similar model for this project, having the report authored by the \"Equational Theories Project\" as a whole, and have some listing somewhere of participants.  I guess there could be various levels of participants though - perhaps not everyone who contributed would wish to vouch for the accuracy of the report (which I presume we would collaboratively write, either on the same github repository, or on some other platform such as Overleaf or Dropbox).  So perhaps only a volunteer subset of the participants would end up authoring the report.  There is some precedent for this, for instance Neil Sloane has a number of articles (e.g., <a href=\"https://www.ams.org/journals/notices/201809/rnoti-p1062.pdf\">https://www.ams.org/journals/notices/201809/rnoti-p1062.pdf</a> <a href=\"http://neilsloane.com/doc/HIS50.pdf\">http://neilsloane.com/doc/HIS50.pdf</a> ) about the OEIS, without listing every single OEIS contributor as co-author.</p>",
        "id": 475024531,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728163956
    },
    {
        "content": "<p>Certainly I would imagine that a discussion of scaling issues would be an important part of any report on this project, and some of it would be presenting the issue as an unsolved problem rather than asserting that our platform is the perfect solution for all scales and all use cases.</p>",
        "id": 475024776,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728164220
    },
    {
        "content": "<p>Much of the software infrastructure we are using is already known. What I think needs to be conveyed are \"how are we approaching the contribution process in a way that enhances trust, and respects the effort of contributors. How the automation works. How we designed the project to work as automatically as possible, how we adapted to automated provers, etc. although people on this Zulip already know this, the broader math community might be interested in an explanation of how \"trust\" works.</p>",
        "id": 475025425,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728164860
    },
    {
        "content": "<p>I recall a talk about how the \"D.H.J Polymath\" thing was a bad idea, as it ended up in practice centralizing the attention on the big names leading the project</p>",
        "id": 475025427,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728164863
    },
    {
        "content": "<p>I don't see a huge difference between putting an author like that and just not crediting people</p>",
        "id": 475025486,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728164899
    },
    {
        "content": "<p>the listing was apparently also not a very permanent record, not everything from the blog is still available</p>",
        "id": 475025505,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728164936
    },
    {
        "content": "<p>Also, in computer science, we give authorships a bit broadly. Any technical contribution that goes beyond reviewing the paper and making broad suggestions generally merits authorship. A lot of algorithms theory students get their first papers by proving a few lemmas. An implementation is also a contribution.</p>",
        "id": 475025515,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728164952
    },
    {
        "content": "<p>About trust: This is not just about trusting Lean's kernel or adding an environment checker. It is also about how the contribution process is managed. How  PRs ought to be reviewed, what sort of human errors can mess things up etc.</p>",
        "id": 475025611,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728165062
    },
    {
        "content": "<p>Yeah that is a problem, we don't have a permanent hosting for the polymath wiki.  One could go down the route of the sciences with lead authors, secondary authors, etc.; I am wholly unfamiliar with that culture though, and am vaguely uncomfortable about it, though perhaps I can get used to it.</p>",
        "id": 475025619,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728165075
    },
    {
        "content": "<p>The mathlib paper had a similar dilemma, but at least the real author list was given in an appendix rather than an external source that can bitrot</p>",
        "id": 475025621,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728165079
    },
    {
        "content": "<p>In electrical engineering papers, we have to describe each author's contributions briefly these days</p>",
        "id": 475025683,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728165126
    },
    {
        "content": "<p>I think if mathematics is actually doing big projects with many people, then it should have papers with many people too, that's just reflecting the reality of the situation</p>",
        "id": 475025704,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728165164
    },
    {
        "content": "<p>certainly it's a change from the status quo, but so is interactive theorem proving</p>",
        "id": 475025717,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728165187
    },
    {
        "content": "<p>Okay, so the proposed model would be a paper authored by a large number of people (listed under their real names), with an appendix describing each author's affiliation, grant support, and contribution to the project (including, for instance, whether they actively helped author the report)?  That sounds reasonable to me.</p>",
        "id": 475025808,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728165280
    },
    {
        "content": "<p>Another best practice for big, collaborative, open-source projects is including a code of conduct. </p>\n<p>We can easily generate one from <a href=\"https://github.com/teorth/equational_theories/community/code-of-conduct/new?template=contributor-covenant\">here</a>, but the project manager / repository owner should decide on the best contact method. </p>\n<p>The link to the <a class=\"stream\" data-stream-id=\"458659\" href=\"/#narrow/stream/458659-Equational\">#Equational</a> channel could be enough. Maybe with an additional note \"Feel free to contact the repository owner in direct messages\" or something like that.</p>",
        "id": 475025821,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1728165306
    },
    {
        "content": "<p>One drawback by the way from the Polymath model was that many contributors (including myself) were not able to formally include the Polymath papers in their list of papers for internal university review purposes due to authorship rules at their home institution.</p>",
        "id": 475025892,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728165375
    },
    {
        "content": "<p>and of course this issue is even more devastating for early-career researchers</p>",
        "id": 475025950,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728165427
    },
    {
        "content": "<p>The standard code of conduct linked to sounds fine to me, and to have both myself (as repository owner) and the #Equational channel as points of contact.</p>",
        "id": 475026150,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728165622
    },
    {
        "content": "<p>The institutional challenges in recognising contributions to such projects is another challenge.</p>",
        "id": 475026224,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728165685
    },
    {
        "content": "<p>Currently academic hiring doesn't seem badly affected by the trend to use AI filters on resumes (and google scholar profiles) at least in theoretical fields.</p>",
        "id": 475026331,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728165753
    },
    {
        "content": "<p>But the fact that the best record of a person's publications are their orcid or google scholar means that contributions will have to be recognised more broadly, not only on the project side, but also on the institutional side.</p>",
        "id": 475026375,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728165807
    },
    {
        "content": "<p>and any hurdles that archaic publication criterion add to this is detrimental to collaborations on a large scale.</p>",
        "id": 475026446,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728165845
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> <a href=\"#narrow/stream/458659-Equational/topic/Thoughts.20and.20impressions.20thread/near/475026150\">said</a>:</p>\n<blockquote>\n<p>The standard code of conduct linked to sounds fine to me, and to have both myself (as repository owner) and the #Equational channel as points of contact.</p>\n</blockquote>\n<p>Done <a href=\"https://github.com/teorth/equational_theories/pull/338\">https://github.com/teorth/equational_theories/pull/338</a></p>",
        "id": 475026719,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1728166116
    },
    {
        "content": "<p>The code of conduct sets up a puzzle, one that I hope never arises, but one that we should have a way of handling. Let us say an individual is permanently banned from the project. What happens to their contributions? Are the contributions expunged? Is that even tractable? Or are the contributions kept and the individual still gets authorship which requires them to interact with other authors, which might put off other authors from wanting to join in on the publication.</p>",
        "id": 475026919,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728166347
    },
    {
        "content": "<p>If we permit papers authored by a subset of the participants, with an appendix listing the contributions of the participants, then I could imagine the uncomfortable, but perhaps viable, solution of having the banned contributor not listed as one of the paper authors, and not permitted to participate in the paper writing process, but be listed in the appendix as a \"former\" contributor.  This doesn't solve the problem of what to do with the intellectual property though.  I selected an Apache 2.0 licence for this project, but am not expert in the finer details of this licence, and am not sure to what extent contributors retain any claim to their contributions in such a scenario.</p>",
        "id": 475027197,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728166628
    },
    {
        "content": "<p>For want of a better idea I proposed this scenario to GPT.  It said that legally, contributions to an Apache 2.0 licence were irrevocable (which agrees with my untrained reading of the licence) and so there were no legal issues with continuing to use data from a former contributor, but that from an ethical or reputational standpoint there would be concerns, and recommended that in such situations the project make some announcement clarifying their policy on handling such contributions going forward.  Hopefully we never have to deal with such a hypothetical scenario in the first place, but I guess I did ask for \"red teaming\" so this is a valid point to discuss.</p>",
        "id": 475028301,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728167814
    },
    {
        "content": "<p>My initial reaction to this hypothetical would be: if the contributions were severable from the rest of the project with little or medium effort, then one should probably do so, but if the contributions became integral to large portions of the project, to the point where severability is infeasible, then we would have to continue using the contributions, but announce that we are doing so and explain our rationale.  But I think each incident would have to be discussed on this forum on a case by case basis (and I sincerely hope and expect that the number of incidents that arise in this manner is 0).</p>",
        "id": 475028562,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728168105
    },
    {
        "content": "<p>While on the topic of hopefully completely hypothetical scenarios: if for some reason I become incapacitated and am no longer able to work on this project, I explicitly grant permission for the project to be forked and continued under different ownership.</p>",
        "id": 475028918,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728168467
    },
    {
        "content": "<p>I'll create a separate thread for these messages and keep this thread clean. I will also ensure that your reminder message stays in this thread in some form</p>",
        "id": 475030166,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728169721
    },
    {
        "content": "<p>38 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"458659\" href=\"/#narrow/stream/458659-Equational/topic/Thoughts.20and.20impressions.20thread\">#Equational &gt; Thoughts and impressions thread</a> by <span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span>.</p>",
        "id": 475030253,
        "sender_full_name": "Notification Bot",
        "timestamp": 1728169805
    },
    {
        "content": "<p>There was an interesting article about authorship models a while ago<br>\n<a href=\"https://elifesciences.org/labs/b86daa1d/author-contributions-recognising-researchers-for-the-work-they-do\">https://elifesciences.org/labs/b86daa1d/author-contributions-recognising-researchers-for-the-work-they-do</a></p>\n<p>Especially the film-credits one feels like something we could draw inspiration from.</p>",
        "id": 475056298,
        "sender_full_name": "Amir Livne Bar-on",
        "timestamp": 1728191262
    },
    {
        "content": "<p>That does sound appealing to me.  Many of the 14 standard CRediT categories listed in <a href=\"https://docs.google.com/document/d/1aJxrQXYHW5U6By3KEAHrx1Iho6ioeh3ohNsRMwsoGPM/edit#heading=h.bkwyjpjjzcq0\">https://docs.google.com/document/d/1aJxrQXYHW5U6By3KEAHrx1Iho6ioeh3ohNsRMwsoGPM/edit#heading=h.bkwyjpjjzcq0</a> seem to be reasonably applicable for this project.</p>",
        "id": 475058225,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728192926
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/stream/458659-Equational/topic/Authorship.2C.20Security.2C.20and.20Red.20Teaming.20Project.20vulnerabil.2E.2E.2E/near/475021590\">said</a>:</p>\n<blockquote>\n<p>For example, what if one maintainer lets in lean code which has not been imported in the top level file and so never gets checked by CI</p>\n</blockquote>\n<p>We should have CI making sure all files are imported in equational_theories, like in Mathlib (perhaps slightly more sophisticated, allowing files in <code>Generated</code> to be only imported transitively through <code>Generated.lean</code>)</p>",
        "id": 475068286,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1728198704
    },
    {
        "content": "<p>Or use <code>.submodules</code> in the lakefile so that no such top-level file is required and everything is always built</p>",
        "id": 475074070,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1728202720
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> <a href=\"#narrow/stream/458659-Equational/topic/Authorship.2C.20Security.2C.20and.20Red.20Teaming.20Project.20vulnerabil.2E.2E.2E/near/475058225\">said</a>:</p>\n<blockquote>\n<p>That does sound appealing to me.  Many of the 14 standard CRediT categories listed in <a href=\"https://docs.google.com/document/d/1aJxrQXYHW5U6By3KEAHrx1Iho6ioeh3ohNsRMwsoGPM/edit#heading=h.bkwyjpjjzcq0\">https://docs.google.com/document/d/1aJxrQXYHW5U6By3KEAHrx1Iho6ioeh3ohNsRMwsoGPM/edit#heading=h.bkwyjpjjzcq0</a> seem to be reasonably applicable for this project.</p>\n</blockquote>\n<p>I would suggest that any authorship system that deviates too far from the standard form is a bit risky for young researchers.</p>",
        "id": 475080789,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728206907
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/stream/458659-Equational/topic/Authorship.2C.20Security.2C.20and.20Red.20Teaming.20Project.20vulnerabil.2E.2E.2E/near/475074070\">said</a>:</p>\n<blockquote>\n<p>Or use <code>.submodules</code> in the lakefile so that no such top-level file is required and everything is always built</p>\n</blockquote>\n<p>Upto the top level this is fine, but does it help with similar problems deeper in the hierarchy?</p>\n<p>Anyway, the reason I brought this up is to illustrate how human error can complicate matters</p>",
        "id": 475080933,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728207030
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/stream/458659-Equational/topic/Authorship.2C.20Security.2C.20and.20Red.20Teaming.20Project.20vulnerabil.2E.2E.2E/near/475080789\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> <a href=\"#narrow/stream/458659-Equational/topic/Authorship.2C.20Security.2C.20and.20Red.20Teaming.20Project.20vulnerabil.2E.2E.2E/near/475058225\">said</a>:</p>\n<blockquote>\n<p>That does sound appealing to me.  Many of the 14 standard CRediT categories listed in <a href=\"https://docs.google.com/document/d/1aJxrQXYHW5U6By3KEAHrx1Iho6ioeh3ohNsRMwsoGPM/edit#heading=h.bkwyjpjjzcq0\">https://docs.google.com/document/d/1aJxrQXYHW5U6By3KEAHrx1Iho6ioeh3ohNsRMwsoGPM/edit#heading=h.bkwyjpjjzcq0</a> seem to be reasonably applicable for this project.</p>\n</blockquote>\n<p>I would suggest that any authorship system that deviates too far from the standard form is a bit risky for young researchers.</p>\n</blockquote>\n<p>One issue here is, many people's names will appear in multiple places. This might clutter up the name list and result in the same situation as polymath, where non famous authors are ignored.</p>",
        "id": 475089413,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728213288
    },
    {
        "content": "<p>What about having a standard alphabetic listing for the \"official\" author list, but a film credits-like listing of multiple subsets of the authors in an appendix?</p>",
        "id": 475106403,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728227041
    },
    {
        "content": "<p>Yeah that sounds better</p>",
        "id": 475107454,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728227956
    },
    {
        "content": "<p>I just started a Wiki page at <a href=\"https://github.com/teorth/equational_theories/wiki/Plan-of-paper\">https://github.com/teorth/equational_theories/wiki/Plan-of-paper</a> to begin planning out the paper arising from this project - this is still several weeks away at least from being a reality, but I guess it is worth starting a discussion on it now.  I threw together some possible section headings and possible topics, but perhaps there is more to put in there (or some stuff to take out or move to a separate location).  There's actually quite a lot to talk about, I think!  Anyway, we can use this thread to discuss the structure of the paper, and I will try to keep this wiki document updated with the latest consensus.</p>",
        "id": 475119636,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728236432
    },
    {
        "content": "<p>I can volunteer to (co)write the project management section. I see it as analogous to an experience report in some verification conferences, but we also need to explain our contribution workflow and the design considerations behind it. The other natural co-author for this section is <span class=\"user-mention\" data-user-id=\"556875\">@Pietro Monticone</span></p>",
        "id": 475120741,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728237349
    },
    {
        "content": "<p>Although these tools are already used in software engineering, a lot of the subtleties need to be explained to the math audience. Further human factors of trust and use of external checkers will also have to be explained.</p>",
        "id": 475120880,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728237454
    },
    {
        "content": "<p>OK, I've made a note on this.  By the way, what interactivity is there on this wiki - am I the only one that can make or propose edits? Is there some permissions I can grant to give wiki edit privileges to potential contributors?</p>",
        "id": 475121135,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728237549
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"657719\">@Terence Tao</span>, at the moment it's restricted to collaborators, but you can go to <em>Settings &gt; Features &gt; Wikis</em> and remove the restriction.</p>\n<p><a href=\"/user_uploads/3121/dWrXPQbdZdi5iPlRDS200ewI/Screenshot-2024-10-06-at-20.01.41.png\">Screenshot 2024-10-06 at 20.01.41.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/dWrXPQbdZdi5iPlRDS200ewI/Screenshot-2024-10-06-at-20.01.41.png\" title=\"Screenshot 2024-10-06 at 20.01.41.png\"><img data-original-dimensions=\"636x310\" src=\"/user_uploads/thumbnail/3121/dWrXPQbdZdi5iPlRDS200ewI/Screenshot-2024-10-06-at-20.01.41.png/840x560.webp\"></a></div><p>As far as I know GitHub doesn't allows to restrict Wikis to contributors defined as users with at least a merged PR.</p>",
        "id": 475121911,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1728237781
    },
    {
        "content": "<p>Removing that restriction might allow third parties to spam right?</p>",
        "id": 475123303,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728238230
    },
    {
        "content": "<p>Meaning people not connected to the project in any way or bot accounts?</p>",
        "id": 475123375,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728238257
    },
    {
        "content": "<p>Yes, that's exactly the problem unfortunately.</p>",
        "id": 475123404,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1728238267
    },
    {
        "content": "<p>Would something like Mathlib, where there are many collaborators but pushing to main is restricted, work?</p>",
        "id": 475124521,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1728238657
    },
    {
        "content": "<p>Hmm, it seems that my free version of Github might not even have the Wiki management options in the first place.  That's fine, we can use some other platform such as Overleaf to coordinate the actual writing, and have the wiki page just for the planned outline.</p>",
        "id": 475124865,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728238940
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"690858\">Daniel Weber</span> <a href=\"#narrow/stream/458659-Equational/topic/Authorship.2C.20Security.2C.20and.20Red.20Teaming.20Project.20vulnerabil.2E.2E.2E/near/475124521\">said</a>:</p>\n<blockquote>\n<p>Would something like Mathlib, where there are many collaborators but pushing to main is restricted, work?</p>\n</blockquote>\n<p>For we would need the Admin, Maintain, Write and Read roles that are available for organisation accounts and enterprise individual accounts as far as I know.</p>",
        "id": 475125056,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1728239114
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"657719\">@Terence Tao</span> FWIW, you can probably get a pro version of github for free for having an academic affiliation <a href=\"https://github.com/education/teachers\">https://github.com/education/teachers</a></p>",
        "id": 475125285,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1728239310
    },
    {
        "content": "<p>(could still be useful even if not just for the wiki)</p>",
        "id": 475125305,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1728239331
    },
    {
        "content": "<p>I'll keep in mind.  I think this project is close to the upper bound of what can be reasonably managed with a non-enterprise individual Github account; if it significantly expands, or if I (perhaps foolishly) attempt to launch an even larger project, I will definitely look into enterprise options (at this point I think I would seek funding to hire an administrator to handle all the backend issues).</p>",
        "id": 475125458,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728239454
    },
    {
        "content": "<p>I am running this project with $0 funding currently.  My thought was to have this be the \"small\" pilot project that one could then use as a model for myself or others to propose larger projects that may require actual paid labor and services (and compute).  It became larger and faster than I had imagined, but I think still manageable for now with an all-volunteer system.  But probably not if it scales up another 2x or so.</p>",
        "id": 475125710,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728239674
    },
    {
        "content": "<p>It should be possible to <a href=\"https://docs.github.com/en/enterprise-server@3.11/organizations/collaborating-with-groups-in-organizations/creating-a-new-organization-from-scratch\">create a free organization on GitHub</a> and then transfer the Equational Project repository to it to get the specialized roles. </p>\n<p>This of course comes with some wrangling of organization membership and roles and such, but if you want to organize code / papers into separate repos at some point in the future it may be worth the effort. Note that even the <a href=\"https://github.com/leanprover-community\">leanprover-community organization</a> has been able to get by on the free plan so far; so far as I can tell <a href=\"https://docs.github.com/en/organizations/collaborating-with-groups-in-organizations/about-organizations#about-feature-availability\">the difference between paid and free is that private repos are somewhat limited in the free version</a>.</p>",
        "id": 475126175,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1728240094
    },
    {
        "content": "<p>Would this lead to any disruption on the contributor end (e.g., a new URL for the repository)?  If it is seamless to transition, I could try this, but if it would mean everybody has to download a new repo or something then I'm inclined to wait until something is actually close to breaking to execute this.</p>",
        "id": 475126989,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728240601
    },
    {
        "content": "<p>Looks like there could be some non-trivial disruption and/or technical issues in transferring.  I think we will just muddle through with the current setup, but I've added a note in the wiki that for future projects, planning an organizational structure (and setting up the repository appropriately) in advance of the launch may be advisable.</p>",
        "id": 475127967,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728241210
    },
    {
        "content": "<p>GitHub projects can be used to manage multiple repositories</p>",
        "id": 475130143,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728241994
    },
    {
        "content": "<p>Ah, so we could potentially do the writing in a separate repo managed by the same project, with many collaborators.  That could work</p>",
        "id": 475130475,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728242081
    },
    {
        "content": "<p>Regarding disruption: when you transfer a repo, github sets up redirects so that pushing / pulling will work with the old URLs, but unfortunately it seems that getting Github pages to redirect properly requires some more work (see e.g. <a href=\"https://gist.github.com/domenic/1f286d415559b56d725bee51a62c24a7\">these instructions</a>).</p>",
        "id": 475131226,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1728242301
    },
    {
        "content": "<p>Yeah I think the option of setting up a second repo for writing if necessary, but leaving the (currently perfectly functional) repo for the scientific portion of the project untouched seems like the best solution.</p>",
        "id": 475131660,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728242436
    }
]