[
    {
        "content": "<p>One equation which may come up is (xy)(yz) = y, since it contains three multiplications. This is the equation defining so-called \"central groupoids\", and has been studied - among other places - in a note by Knuth (Notes on Central Groupoids) in 1970. For instance, finite magmas satisfying this equation must have a square number of elements.<br>\nI have a formalisation of the majority of this paper (all of it except for parts of sections 4 and 7), but the equations in sections 5 and 6 are particularly interesting from an equational logic point of view. If some part of this is deemed relevant, I can make a PR to the repo. Unfortunately some of the more interesting results in section 6 are conditioned on a more complex expression <code>(x((yz)w)) (zw) = z</code> or two equations.</p>",
        "id": 472965118,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1727380791
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"246273\">Bhavik Mehta</span> <a href=\"#narrow/stream/458659-Equational/topic/Central.20groupoids/near/472965118\">said</a>:</p>\n<blockquote>\n<p>One equation which may come up is (xy)(yz) = y, since it contains three multiplications. This is the equation defining so-called \"central groupoids\", and has been studied - among other places - in a note by Knuth (Notes on Central Groupoids) in 1970. For instance, finite magmas satisfying this equation must have a square number of elements.<br>\nI have a formalisation of the majority of this paper (all of it except for parts of sections 4 and 7), but the equations in sections 5 and 6 are particularly interesting from an equational logic point of view. If some part of this is deemed relevant, I can make a PR to the repo. Unfortunately some of the more interesting results in section 6 are conditioned on a more complex expression <code>(x((yz)w)) (zw) = z</code> or two equations.</p>\n</blockquote>\n<p>This is equation 168 in the <a href=\"https://github.com/teorth/equational_theories/blob/main/scripts/equations.txt\">list</a>.  Given its interest, I will add it to the queue.  I suppose it can't hurt to have some theorems about this equation in the repo.</p>",
        "id": 472966929,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727381583
    },
    {
        "content": "<p>It could be useful to have the fact about cardinality being a square, as it allows arguments of the form \"equation X does not imply equation 168, as there is a finite magma of non-square size satisfying equation X\". This works for a decent chunk of the existing equations actually, even with <code>or</code> on Bool. Although one could argue that a direct proof is easier, in these cases!</p>",
        "id": 472972120,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1727384095
    },
    {
        "content": "<p>I've finished adapting this to the notation in the repo, and a draft PR is here: <a href=\"https://github.com/teorth/equational_theories/pull/492\">https://github.com/teorth/equational_theories/pull/492</a>. This contains all the results I mentioned having proved above, as well as the fact that there are infinite central groupoids with no idempotents. </p>\n<p>The construction for this is to give the confluent rewriting system for the central groupoid law, prove it is confluent and terminating, and thus normalising, and then deduce that there is no way in which x * x and x can be unified. </p>\n<p>This same method should be usable - although I haven't worked out the details yet - to automatically prove every implication and nonimplication from 168: an implication is true iff the rewrite system normalises both sides to the same thing. (There's a slight hiccup in that the reduction as I've implemented it in this PR is not computable, although <code>simp</code> can implement it anyway... the method still works without computable reduction however). </p>\n<p>I've also added the fact that a finite central groupoid of size <code>n</code> exists if and only if <code>n</code> is a square. In addition, Knuth's paper shows that equation 26302 is equivalent to being a natural central groupoid, which follows from my PR. Indeed, he shows that in the presence of equation 168, seven additional equations are equivalent, and each of these are further equivalent to the central groupoid being natural. My PR shows this as well. (I haven't yet figured out which numbers those seven are though!)</p>",
        "id": 476162723,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1728574433
    },
    {
        "content": "<p>Finally I want to mention one of the many reasons I enjoy central groupoids: the question of showing that 26302 implies naturality (or more specifically, that 168 and 3915 imply 3522) is the reason Knuth invented the Knuth-Bendix algorithm.</p>\n<blockquote>\n<p>It appears to be very difficult to derive (11) from (22), and initial attempts by the author to do this were unsuccessful. This provided the motivation to study more general problems of the same nature, and consequently the author developed an algorithm to work with identities in universal algebras (see [2])</p>\n</blockquote>\n<blockquote>\n<p>[2] D. E. KNUTH AND P. B. BENDIX, Simple Word-Problems in Universal Algebras, in \"Computational Problems in Abstract Algebra\" (J. Leech, ed.), pp. 263-297, Pergamon, London/New York, 1969</p>\n</blockquote>",
        "id": 476163513,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1728574664
    },
    {
        "content": "<p>I noticed that Wikipedia has <a href=\"https://en.wikipedia.org/wiki/Central_groupoid\">a page</a> about central groupoids, and it was apparently <a href=\"https://en.wikipedia.org/w/index.php?title=Central_groupoid&amp;action=history\">newly created</a> <strong>today</strong>!</p>",
        "id": 476626137,
        "sender_full_name": "David Renshaw",
        "timestamp": 1728843603
    },
    {
        "content": "<p>On the <a href=\"https://en.wikipedia.org/wiki/Talk:Central_groupoid\">talk page</a> the author says they \"saw a post about it [the Equational Theories project] and learned of this subject through it\".</p>",
        "id": 476630143,
        "sender_full_name": "David Renshaw",
        "timestamp": 1728847186
    },
    {
        "content": "<p>I would guess that they are referring to <a href=\"https://terrytao.wordpress.com/2024/10/12/the-equational-theories-project-a-brief-tour/\">yesterday's blog post</a>.</p>",
        "id": 476630208,
        "sender_full_name": "David Renshaw",
        "timestamp": 1728847224
    }
]