[
    {
        "content": "<p>I just played around a bit with the equation explorer and noticed that Equation 41, which represents our second biggest equivalence class, does not have any commentary. It turns out that Equation 46, which 41 is equivalent to, does have commentary. However, Equation Explorer by default hides all equations but the first in an equivalence class. This leaves Equation 46, with its commentary, pretty much invisible unless you know to look for it.</p>\n<p>I suggest we either:</p>\n<ol>\n<li>Move the commentary from Equation 46 to Equation 41.</li>\n<li>Add commentary to equation 41, referring to equation 46.</li>\n<li>Somehow let Equation 46 represent the equivalence class instead of 41. This makes some sense, as 46 seems to be a more human-readable representation of the class, which is why it probably has the commentary in the first place.</li>\n<li>Let the representative of an equivalence class inherit the commentary of any equivalence class member.</li>\n</ol>\n<p>Are there other good options I might have missed?</p>",
        "id": 476996432,
        "sender_full_name": "Harald Husum",
        "timestamp": 1729000692
    },
    {
        "content": "<p>Maybe have the pages for any equations which aren't representatives of their equivalence class just be redirects to the representative's page (perhaps with some note that you were redirected)</p>",
        "id": 476997651,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1729001034
    },
    {
        "content": "<p>There are some commentaries regarding equivalent pairs (e.g., 1689 and 2, or 14 and 29) that don't naturally belong to the \"canonical\" representative of the class.  I think for now I will manually implement option 2.</p>",
        "id": 477010531,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729004709
    },
    {
        "content": "<p>Yeah, I agree that option 2 is probably the best option for now.</p>\n<p>Perhaps one could consider implementing commentary for an equivalence class as a whole as a separate feature to commentary for equations. The description for Equation 46 seems more general in nature than e.g. 1689.</p>",
        "id": 477070269,
        "sender_full_name": "Harald Husum",
        "timestamp": 1729026211
    },
    {
        "content": "<p>This is a good suggestion to bear in mind if the commentary feature expands significantly beyond its current state, though I think there are only two large equivalence classes (for 2 and 46) for which this will really be an issue.  With \"hide equivalent equations\", the navigation defaults to the minimal element of the equivalence class.  In the case of 46, this is not quite ideal due to its equivalence to 41, but I think in every other circumstance one can safely use that minimal element as the proxy representative for the entire class for the purpose of supplying commentary, at least for now.</p>",
        "id": 477075134,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729028378
    }
]