[
    {
        "content": "<p>We appear to be working at odds in some way: I'm currently writing a chapter on the rewrite theory background, but I see that there is a section on \"confluent theories\" in Chapter 11: all this is related to issue <a href=\"https://github.com/teorth/equational_theories/issues/555\">https://github.com/teorth/equational_theories/issues/555</a> it would seem. How should we work this out?</p>",
        "id": 477557456,
        "sender_full_name": "Cody Roux",
        "timestamp": 1729219586
    },
    {
        "content": "<p>Chapter 10.1 was a temporary measure, written to say something about confluence in the absence of a more detailed treatment.  If your chapter subsumes the material in Chapter 10.1 then that latter material can be safely deleted (or perhaps portions of it can be retained within your new chapter as appropriate).</p>",
        "id": 477557916,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729219853
    },
    {
        "content": "<p>Ok cool!</p>",
        "id": 477558970,
        "sender_full_name": "Cody Roux",
        "timestamp": 1729220379
    },
    {
        "content": "<p>the main issue with my chapter is that there are no references to the lean code (and some cleanup stuff)</p>",
        "id": 477559026,
        "sender_full_name": "Cody Roux",
        "timestamp": 1729220402
    },
    {
        "content": "<p>I'll make a preliminary PR with the expectation that we can discuss changes here</p>",
        "id": 477559122,
        "sender_full_name": "Cody Roux",
        "timestamp": 1729220423
    },
    {
        "content": "<p>Alignment with the lean code can always be done later.  Actually the blueprint in this project seems to have ended up not to be a critical portion of the workflow in practice - people are formalizing directly from Zulip discussions in many cases; it's more of a reference, and also a potential base for the paper at the end of the project.  So the lean integration is a secondary consideration.</p>",
        "id": 477559478,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729220597
    },
    {
        "content": "<p>That's a relief because the blueprint script mystifies me a bit.</p>",
        "id": 477560895,
        "sender_full_name": "Cody Roux",
        "timestamp": 1729221330
    },
    {
        "content": "<p>Ideally the project should be as modular as possible: one doesn't need to know all of LaTeX+Blueprint+Lean+Python/Ruby/etc.+Vampire/Z3/etc.+Math in order to contribute, one just needs to know one or two of these things for any specific contribution, and others can fill in the rest later.</p>",
        "id": 477561314,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729221548
    },
    {
        "content": "<p>Fair, though a poor excuse for me not taking the time to figure it out; I'll work on it tomorrow or Saturday to get it ship shape.</p>",
        "id": 477561554,
        "sender_full_name": "Cody Roux",
        "timestamp": 1729221668
    },
    {
        "content": "<p>One flaw with the blueprint approach is that it separates the mathematics from the code. Ideally we should have special latex parsed  comments in the lean code that is used to generate the blueprint we see online. It is only slightly different from the way docs works, in that the text in a latex comment need not necessarily be associated with a definition, and the editor must be used to provide proper latex highlighting and completion inside these comments</p>",
        "id": 477616151,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729244185
    },
    {
        "content": "<p>Hopefully we can move blueprints to Verso asap! (but not earlier. :-)</p>",
        "id": 477620024,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1729245543
    },
    {
        "content": "<p>Looking at the examples in the verso repository, it seems there is still a lot of verso specific code to write in addition to the contents of the lean + math file, and it varies from one type of publication format to another.</p>",
        "id": 477633872,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729250819
    },
    {
        "content": "<p>Ideally an auto-blueprint tool will read normal lean files, and according to a few config options (for e.g. to only include theorems and not lemmas) generate a doc. There would be a command like <code>lake exe blueprint</code> that does all this. The only extra thing in the normal lean files will be special latex comments containing the math text.</p>",
        "id": 477633994,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729250874
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/channel/458659-Equational/topic/Confluence.20text/near/477620024\">said</a>:</p>\n<blockquote>\n<p>Verso</p>\n</blockquote>\n<p>A link would be helpful. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n<p>The first result for a Google search </p>\n<p><a href=\"/user_uploads/3121/nsykMzKg-QvVttY19GNHK8O3/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/nsykMzKg-QvVttY19GNHK8O3/image.png\" title=\"image.png\"><img data-original-dimensions=\"616x107\" src=\"/user_uploads/thumbnail/3121/nsykMzKg-QvVttY19GNHK8O3/image.png/840x560.webp\"></a></div><p>which I am sure is not correct. Also did not find anything that seemed correct in the first page of results.</p>",
        "id": 477639444,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1729252777
    },
    {
        "content": "<p>It's the first result for \"verso lean\" here</p>",
        "id": 477640187,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1729253013
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover/verso\">https://github.com/leanprover/verso</a></p>",
        "id": 477640211,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1729253019
    },
    {
        "content": "<p>(see also the talk at <a href=\"https://www.youtube.com/watch?v=dv_vmVs3SQQ\">https://www.youtube.com/watch?v=dv_vmVs3SQQ</a>)</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"dv_vmVs3SQQ\" href=\"https://www.youtube.com/watch?v=dv_vmVs3SQQ\"><img src=\"https://uploads.zulipusercontent.net/3259822e27f90e2086e1d564a4fb28f844c9ea78/68747470733a2f2f692e7974696d672e636f6d2f76692f64765f766d5673335351512f64656661756c742e6a7067\"></a></div>",
        "id": 477640498,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1729253122
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/channel/458659-Equational/topic/Confluence.20text/near/477616151\">schrieb</a>:</p>\n<blockquote>\n<p>One flaw with the blueprint approach is that it separates the mathematics from the code. </p>\n</blockquote>\n<p>I very much agree with this. <br>\nI hope the future of math is agentic and that ML/SW engineers who love mathematics can contribute a lot by building tools, creating and deploying agents, building projects like egg, building models generating tactics, using ml to analyze data etc. , creating and formalizing \"claims\" (informal theories), developing higher-order languages on top of Lean (or similar) etc.</p>\n<p>Keeping math close to code seems like a great idea.</p>",
        "id": 477649323,
        "sender_full_name": "Michael Bucko",
        "timestamp": 1729256069
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/channel/458659-Equational/topic/Confluence.20text/near/477616151\">said</a>:</p>\n<blockquote>\n<p>One flaw with the blueprint approach is that it separates the mathematics from the code. Ideally we should have special latex parsed  comments in the lean code that is used to generate the blueprint we see online. It is only slightly different from the way docs works, in that the text in a latex comment need not necessarily be associated with a definition, and the editor must be used to provide proper latex highlighting and completion inside these comments</p>\n</blockquote>\n<p>In the <a href=\"https://github.com/AlexKontorovich/PrimeNumberTheoremAnd\">Prime Number Theorem+ project</a>, we used a hack to encode the blueprint as comments inside Lean files; there is a script at compile time that extracts all these comments back out into temporary tex files that become the \"classical\" blueprint.  It works reasonably well, save for the annoyance that VSCode likes to convert various \\LaTeX \\macros into Unicode.</p>\n<p>At the other extreme, in the (still in beta) <a href=\"https://github.com/teorth/expdb\">Analytic Number Theory Exponent Database</a>, we use a blueprint but have 0% Lean code at present; instead, we use some ad hoc macros to link up blueprint theorems with Python code.  (The database is set up so that it can <em>in the future</em> be formalized into Lean, but the more immediate purpose is to supply executable (but not formally verified) code to perform various analytic number theory calculations.)</p>\n<p>So I think any future version of blueprint should retain a lot of flexibility in how the LaTeX and Lean are to be integrated; there are a lot of different use cases.</p>",
        "id": 477675912,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729263959
    },
    {
        "content": "<p>A more robust solution would be to do this with metaprogramming, and adding LSP support to ensure that latex-comments are not processed for unicode inside math-mode delimiters, maybe even rendering them in the infoview. Just like one can synch latex source with the pdf, the infoview would automatically scroll with the cursor position on the source code and show the tactic state where required.</p>",
        "id": 477678330,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729264678
    },
    {
        "content": "<p>In principle with some engineering effort it should be possible to render markdown+math and tactic state in the infoview. The trouble with markdown as it exists is getting all the labels and referencing to equation and theorem numbers and lean identifiers.</p>",
        "id": 477678624,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729264751
    },
    {
        "content": "<p>Historically, this kind of \"literate programing\" was promoted in the 70s and 80s, but hasn't seemed to gain much traction. Maybe the time is right now though.</p>",
        "id": 477679769,
        "sender_full_name": "Cody Roux",
        "timestamp": 1729265089
    },
    {
        "content": "<p>Arguably jupyter notebooks are a form of literate programming</p>",
        "id": 477679911,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729265128
    },
    {
        "content": "<p>But we might be able to do better. If we stick to the notebook approach, vscode has a notebook API for extensions. Live rendering lean files + math comments without the jupyter machinery of cells would be even better.</p>",
        "id": 477680062,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729265170
    },
    {
        "content": "<p>also: I'm happy to have some discussion on the body of the rewriting chapter, it exposes the \"classic\" theory of rewriting,  I intentionally didn't try to conform to what the code is doing exactly, since it felt like a re-discovery of the classic theory with slightly non-standard notations (though kudos to reinventing a whole field of mathematics in a week!)</p>",
        "id": 477680166,
        "sender_full_name": "Cody Roux",
        "timestamp": 1729265205
    },
    {
        "content": "<p>Probably best to try to align with standard existing notations in the LaTeX side of the project, even if we use some slightly nonstandard terminology on the Lean side.</p>",
        "id": 477684949,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729266655
    },
    {
        "content": "<p>Instead of using the PNT+ approach I've been writing latex in .tex files in FLT (so I can benefit from VS Code latex plugins) and then copying it wholesale into comments in lean code and hoping that copilot is inspired by it.</p>",
        "id": 477730530,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1729283503
    },
    {
        "content": "<p>That'd be a paper in itself in the right venue (e.g. how often it can come up with something, what mistakes it makes...)</p>",
        "id": 477731445,
        "sender_full_name": "Cody Roux",
        "timestamp": 1729283892
    },
    {
        "content": "<p>Writing an extension that upgrades the infoview to a full blown notebook-like view could be a nice ITP paper</p>",
        "id": 477741878,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729289756
    }
]