[
    {
        "content": "<p>I think the workflow is becoming clearer now, especially with the recent creation of <code>AllEqations.lean</code>, the suggestion of <span class=\"user-mention\" data-user-id=\"684366\">@Edward van de Meent</span> to incorporate the <code>proof_wanted</code> feature of Lean, and the move to Github Issues to manage tasks.  I have thus started a first draft of the <a href=\"https://github.com/teorth/equational_theories/blob/main/CONTRIBUTING.md\">CONTRIBUTING.md</a> file to try to codify how we want contributions to proceed going forward.  Suggestions and feedback welcome!</p>",
        "id": 473345366,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727529353
    },
    {
        "content": "<p>I think the contribution file should link to the project dashboard and explain the process of claiming issues</p>",
        "id": 473356561,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727535803
    },
    {
        "content": "<p>That sounds good.  Would you be able to edit the file directly to add the links?  Right now I just linked to the relevant Zulip thread but a direct explanation is probably better.</p>",
        "id": 473356729,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727535932
    },
    {
        "content": "<p>Yeah I can do that.</p>",
        "id": 473356740,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727535946
    },
    {
        "content": "<p>Another point : about the decentralisation, a github project can manage any number of repositories. I am still learning the strange language github uses for automating the project task actions. But if someone pitches in, we should be able to assign tasks, link PRs and move tasks to the correct column automatically</p>",
        "id": 473357046,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727536187
    },
    {
        "content": "<p>Done</p>",
        "id": 473359704,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727538259
    },
    {
        "content": "<p>One more thought I just had, is that we should ask that contributions are reduced to their transitive reduction (e.g. fewest number of implications). If they don't do it over all of Lean, then at least doing it among their own theorems would be useful. It may be nice to say this for now, and when there is slightly more tooling for pulling out all implications then providing a handy command to do so. I'll PR if no one objects.</p>",
        "id": 473385269,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1727557455
    },
    {
        "content": "<p>This sounds like a good idea to me.  Having tooling both to expand out to a maximal set of implications, and also reduce to a minimal spanning set of implications, both sound useful to have.  Please go ahead and update the language in CONTRIBUTING.md accordingly.</p>",
        "id": 473385845,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727558008
    },
    {
        "content": "<p>Unless we provide the tooling to reduce transitive implications, it may not be easy for authors to do this, especially in auto-generated proofs</p>",
        "id": 473386141,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727558323
    },
    {
        "content": "<p>Well, we can express a preference then for putting a reduced set implications in the Lean file (but perhaps a completed set of implications in some other data file that is not loaded by Lean).  But it is not essential that it is maximally reduced, just that efforts are made to make it lightweight</p>",
        "id": 473386186,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727558392
    },
    {
        "content": "<p>Let me see if I can arrive at a first approximation of the problem: Given a graph of implications, we want to break cycles and topologically sort the resultant DAG</p>",
        "id": 473386448,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727558575
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/stream/458659-Equational/topic/CONTRIBUTING.2Emd/near/473386141\">said</a>:</p>\n<blockquote>\n<p>Unless we provide the tooling to reduce transitive implications, it may not be easy for authors to do this, especially in auto-generated proofs</p>\n</blockquote>\n<p>I have some tooling upstream that will give you the transitive reduction of a graph given a CSV of the graph edges. The rest is just filtering, which I assume the authors should be capable of</p>",
        "id": 473386451,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1727558580
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/stream/458659-Equational/topic/CONTRIBUTING.2Emd/near/473386448\">said</a>:</p>\n<blockquote>\n<p>Let me see if I can arrive at a first approximation of the problem: Given a graph of implications, we want to break cycles and topologically sort the resultant DAG</p>\n</blockquote>\n<p>See <code>scripts/transitive_reduction.rb</code></p>",
        "id": 473386499,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1727558604
    },
    {
        "content": "<p>can you embed it in lean such that it will throw a warning on theorems</p>",
        "id": 473386517,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727558612
    },
    {
        "content": "<p>This sounds like something which should already be standard (e.g., in TAOCP)</p>",
        "id": 473386518,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727558614
    },
    {
        "content": "<p>(There is also the opposite, <code>scripts/transitive_closure.rb</code> to generate the maximal list of implications)</p>",
        "id": 473386576,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1727558645
    },
    {
        "content": "<p>Lean has a nice way of doing FFI, but I think you'd find it easier to call the scripts from the shell and read the resultant output file into lean</p>",
        "id": 473386597,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727558687
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/stream/458659-Equational/topic/CONTRIBUTING.2Emd/near/473386517\">said</a>:</p>\n<blockquote>\n<p>can you embed it in lean such that it will throw a warning on theorems</p>\n</blockquote>\n<p>It is not that fast, and more over, we already have some overlap. I think once we have tools to generate lists of implications, we can tell submitters to filter out duplicates</p>",
        "id": 473386610,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1727558703
    },
    {
        "content": "<p>Ah, I am remembering the timing of looking at massive unreduced data sets. For reduced graphs it's actually fairly fast. Definitely can fit in CI, even on large data sets it was &lt;1 min.</p>",
        "id": 473386725,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1727558798
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> <a href=\"#narrow/stream/458659-Equational/topic/CONTRIBUTING.2Emd/near/473386518\">said</a>:</p>\n<blockquote>\n<p>This sounds like something which should already be standard (e.g., in TAOCP)</p>\n</blockquote>\n<p>It starts out simple. But what you really need is a dynamic algorithm. as you add nodes to the graph and edges (dependencies), you need the algorithm to update its minimal and maximal implication structures. Dynamic algorithms are only good if they compute much faster than their static counterparts.</p>",
        "id": 473386787,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727558880
    },
    {
        "content": "<p>Dynamic algorithms on graphs seem simple when you only insert nodes or edges, but things get complicated node and edge deletions are involved.</p>",
        "id": 473386852,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727558919
    },
    {
        "content": "<p>Well the main thing I guess is to not lose an order of magnitude in the number of things Lean has to verify in order to compile everything.  Losing 10% is probably no big deal though.</p>",
        "id": 473387023,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727559104
    },
    {
        "content": "<p>It would be interesting to implement these ruby scripts in lean using the metaprogramming facilities to track dependencies among lean declarations</p>",
        "id": 473389557,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727561672
    },
    {
        "content": "<p>We might then be able to use this graph to search and find a directed path between two statements to prove implications between new statements</p>",
        "id": 473389621,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727561752
    },
    {
        "content": "<p>Term rewriting algorithms in lean would be an interesting experiment</p>",
        "id": 473389691,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727561811
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"761203\">Vlad Tsyrklevich</span> <a href=\"#narrow/stream/458659-Equational/topic/CONTRIBUTING.2Emd/near/473385269\">said</a>:</p>\n<blockquote>\n<p>One more thought I just had, is that we should ask that contributions are reduced to their transitive reduction (e.g. fewest number of implications). If they don't do it over all of Lean, then at least doing it among their own theorems would be useful. It may be nice to say this for now, and when there is slightly more tooling for pulling out all implications then providing a handy command to do so. I'll PR if no one objects.</p>\n</blockquote>\n<p><a href=\"https://github.com/teorth/equational_theories/pull/91\">https://github.com/teorth/equational_theories/pull/91</a></p>",
        "id": 473391660,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1727563968
    },
    {
        "content": "<p>I have just found a bit more time to rewrite the description of our dashboard-based project coordination in the <a href=\"https://github.com/teorth/equational_theories/blob/main/CONTRIBUTING.md\">CONTRIBUTING guide</a> as follows: </p>\n<h2>How to Contribute</h2>\n<p>Contributions to the project are made through GitHub pull requests (PRs) that correspond to specific tasks outlined in the project's issues.<br>\nThe following instructions detail the process for claiming and completing tasks.</p>\n<h3>1. Task Identification</h3>\n<ul>\n<li>Tasks are posted as GitHub issues and can be found in the <code>Unclaimed Outstanding Tasks</code> column of the project dashboard.</li>\n<li>Each issue represents a specific task to be completed. The issue title and description contain relevant details and requirements.</li>\n</ul>\n<h3>2. Claiming a Task</h3>\n<ul>\n<li>To claim a task, comment <code>claim</code> on the relevant GitHub issue.</li>\n<li>If no other user is assigned, you will automatically be assigned to the task, and the issue will move to the <code>Claimed Tasks</code> column.</li>\n<li>You may only claim one task at a time. If you decide not to work on a task after claiming it, comment <code>disclaim</code> on the issue. This will unassign you and return the issue to the <code>Unclaimed Outstanding Tasks</code> column, making it available for others to claim.</li>\n</ul>\n<h3>3. Working on the Task</h3>\n<p>Once you are assigned to an issue, begin working on the corresponding task. You should create a new branch from the <code>main</code> branch to develop your solution.</p>\n<h3>4. Submitting a Pull Request</h3>\n<ul>\n<li>When you are ready to submit your solution, create a PR from your working branch to the project’s <code>main</code> branch.</li>\n<li>After submitting the PR, comment <code>propose PR #PR_NUMBER</code> on the original issue. This links your PR to the task, and the task will move to the <code>In Progress</code> column on the dashboard.</li>\n<li>A task can only move to <code>In Progress</code> if it has been claimed by the user proposing the PR.</li>\n</ul>\n<h3>5. Withdrawing or Updating a PR</h3>\n<ul>\n<li>If you need to withdraw your PR, comment <code>withdraw PR #PR_NUMBER</code> on the issue. The task will return to the <code>Claimed Tasks</code> column, but you will remain assigned to the issue.</li>\n<li>To submit an updated PR after withdrawal, comment <code>propose PR #NEW_PR_NUMBER</code> following the same process outlined in step 4.</li>\n</ul>\n<h3>6. Review Process</h3>\n<ul>\n<li>After finishing the task and ensuring your PR is ready for review, comment <code>awaiting-review</code> on the PR. This will add the <code>awaiting-review</code> label to your PR and move the task from <code>In Progress</code> to the <code>PRs in Review</code> column of the dashboard.</li>\n<li>The project maintainers will review the PR. They may request changes, approve the PR, or provide feedback.</li>\n</ul>\n<h3>7. Task Completion</h3>\n<ul>\n<li>Once the PR is approved and merged, the task will automatically move to the <code>Completed</code> column.</li>\n<li>If further adjustments are needed after merging, a new issue will be created to track additional work.</li>\n</ul>\n<h3>Additional Guidelines and Notes</h3>\n<ol>\n<li>Please adhere to the issue claiming process. If an issue is already assigned to another contributor, refrain from working on it without prior communication with the current claimant. This ensures a collaborative and respectful workflow that values each contributor’s efforts.</li>\n<li>Be aware that this contribution process is still in an experimental phase. As a result, occasional issues and inefficiencies may arise. We are committed to continuously refining the process, and your constructive feedback is highly appreciated. You can share your thoughts and suggestions on the <a href=\"#narrow/stream/458659-Equational/\">Lean Zulip chat channel</a>.</li>\n<li>Until the integration of sufficient CI automation, the management of the project dashboard is handled manually by the maintainers. We ask for your patience and understanding as we work to keep the process running smoothly.</li>\n</ol>",
        "id": 474078507,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1727800705
    },
    {
        "content": "<p>In the next few days I'll probably do the same for the Blueprint instructions.</p>",
        "id": 474078870,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1727800812
    }
]