[
    {
        "content": "<p>The script <code>equational_theories/Generated/All4x4Tables/src/check_redundant.py</code> purports to count how many implications are refuted by magmas of size 2, 3, 4.  Running it yields output like</p>\n<blockquote>\n<p>When going from ../data/refutations2x2.txt to ../data/refutations3x3.txt<br>\nThe number of solved equations goes from 12567055 to 13602457 for a delta of 1035402</p>\n</blockquote>\n<p>which supposedly means that magmas of size 2 refute 12567055 implications and magmas of sizes 2 and 3 together refute 13602457 implications.  The numbers I get from independent code are different, slightly lower by a couple of thousands.  I think the data files <code>equational_theories/Generated/All4x4Tables/data/refutations2x2.txt</code> etc are correct. But I think the Python script <code>check_redundant.py</code> has some off-by-one mistakes.  For instance it allocates a matrix of size 4966, two more than the number of equations.   It may be behaving as if there were equations numbered 0 and 4965 that are not satisfied by any magma.  This could explain getting a bit too many implications.</p>\n<p>Can someone check independently of me?  We can then compare with what I got: 12560783 refutations by size-2 magmas, 1035338 additional ones by size-3 magmas, 157861 additional ones by size-4 magmas.</p>",
        "id": 546852568,
        "sender_full_name": "Bruno Le Floch",
        "timestamp": 1761298616
    },
    {
        "content": "<p>Ok, I confirm my numbers: the pre-existing <code>check_redundant.py</code> scripts, corrected to count only entries in <code>matrix[1:4695, 1:4695]</code> instead of <code>matrix</code> (which is <code>matrix[0:4696, 0:4696]</code>), gives the same answer as independent code that runs the Mace4 ATP with domain size ≤4 on every implication one by one.  I also got the same data as refutations2x2 using very basic Python code.  PR incoming with corrected numbers in section 5 of the paper.</p>\n<p>The start of section 5 also claims that 524 magmas are enough for all refutations by small magmas.  I've changed this to 523, computed as follows.  The three files <code>equational_theories/Generated/All4x4Tables/data/refutations2x2.txt</code> and 3x3 and 4x4 list respectively 10, 299, and 515 magmas.  The output of <code>check_redundant.py</code> (given in <code>equational_theories/Generated/All4x4Tables/README.md</code>) ends with a claim that 10 / 10 magmas of size 2 are already covered by magmas of size 4 (which is obvious since a size-2 magma can be squared), and 291/299 magmas of size 3 are covered by magmas of size 4, in the sense that any non-implication with a size-3 model among these 291 has a size-4 model.  This means we can get away with the 515 models of size 4, plus 299-291=8 of size 3, for a total of 515+8=523.  Does that sound correct?</p>",
        "id": 546923249,
        "sender_full_name": "Bruno Le Floch",
        "timestamp": 1761319296
    },
    {
        "content": "<p>Brute force confirms \"12560783 refutations by size-2 magmas, 1035338 additional ones by size-3 magmas\"; 178M&gt;&gt;3300 so that one will have to run for a bit..</p>",
        "id": 547015655,
        "sender_full_name": "Douglas McNeil",
        "timestamp": 1761353506
    },
    {
        "content": "<p>And I can confirm 157861 additional ones by size-4 magmas as well.</p>",
        "id": 547082604,
        "sender_full_name": "Douglas McNeil",
        "timestamp": 1761426294
    },
    {
        "content": "<p>Thanks a lot!  It's reassuring to have confirmation.</p>",
        "id": 547083221,
        "sender_full_name": "Bruno Le Floch",
        "timestamp": 1761427173
    }
]