[
    {
        "content": "<p>Now that we have (provisionally) resolved all implications in the main implication graph, we can now turn to the process of writing the paper associated to the project.  Building on some earlier work of <span class=\"user-mention\" data-user-id=\"556875\">@Pietro Monticone</span> , the <a href=\"#narrow/channel/458659-Equational/topic/Authorship.2C.20Security.2C.20and.20Red.20Teaming.20Project.20vulnerabil.2E.2E.2E\">plan of the paper</a> has now been converted to a LaTeX document (<a href=\"https://github.com/teorth/equational_theories/blob/main/paper/main.pdf\">PDF here</a>), which is broken up into multiple files in <a href=\"https://github.com/teorth/equational_theories/tree/main/paper\">https://github.com/teorth/equational_theories/tree/main/paper</a> that can be worked on separately.</p>\n<p>In an <a href=\"#narrow/channel/458659-Equational/topic/Authorship.2C.20Security.2C.20and.20Red.20Teaming.20Project.20vulnerabil.2E.2E.2E\">old discussion</a>, we had tentatively settled on having a large number of authors of the paper, ordered alphabetically, and in an appendix listing the author contact information, affiliations, and contributions, using the <a href=\"https://credit.niso.org/\">standard CReDiT system categories</a> as a template.  It is perhaps good to continue discussion in this; it was pointed out that the categories do not perfectly align with the roles we have ended up assigning here, and we may want to add re-interpretations of the categories as needed.  In the meantime, I have made a mockup in the paper of how I imagine the author listing would go, using myself as an example.  My thought was to have all contributors who wish to be listed as an author self-report their contributions in this fashion via PRs, but am open to discussion on this process. [EDIT: to perhaps forestall potential spam or other frivolous attempts to subvert the process, the PR should be accompanied by a more detailed self-description of the contributions to the project for the moderators to approve.]</p>\n<p>Anyway, I would like to discuss next steps.  Perhaps we can discuss section structure, and if some sections are stable enough in intended content, we can create issues on Github for individuals to work on expanding them.</p>",
        "id": 483761061,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732213037
    },
    {
        "content": "<p>For the project management section I would like to prepare a free flow draft before planning and structuring it better</p>",
        "id": 483764649,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732214322
    },
    {
        "content": "<p>OK. Should we create a formal issue for this to \"reserve\" <code>project.tex</code> for now so that no-one else edits it in the meantime?</p>",
        "id": 483764912,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732214422
    },
    {
        "content": "<p>Yes</p>",
        "id": 483764932,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732214430
    },
    {
        "content": "<p>opened <a href=\"https://github.com/teorth/equational_theories/pull/873\">equational#873</a>.</p>",
        "id": 483765160,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732214522
    },
    {
        "content": "<p>We can create a column in the project dashboard to  of author contribution issues. I'd suggest a one or two sentence description of your contributions to the project, using suitable conjunctions and clauses such as : </p>\n<ol>\n<li>\"I built the XYZ tool\"</li>\n<li>\"I developed (and/or) formalised abc approach to prove/refute such and such class of implications\", or, \"I authored XYZ in the blueprint/paper\" </li>\n<li>\"I mentored XYZ to do ABC\"</li>\n<li>\"I maintained such and such aspects/tools\"</li>\n</ol>\n<p>Sometimes your contributions could be much more scattered. You might have participated in the discussion of some refutations, and in that, you might have found a variation of an idea or run an ATP on some constraints or even found a bug. I suggest that  summarising them all in a sentence and maybe using GitHub comments to add details.</p>",
        "id": 483793586,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732225212
    },
    {
        "content": "<p>We could do this, but to me this seems roughly equivalent to asking everyone to submit a PR to directly adjust <code>contributions.tex</code> in which they can describe their contributions in Github comments.  Are there any particular advantages to routing it through the Github projects page?</p>",
        "id": 483797097,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732226659
    },
    {
        "content": "<p>It would be useful to have guidance on how much participation is required for authorship (in particular if moderators have to decide, it is best if they can do so consistently).</p>\n<p>A related question is the scope of the article, as the main project gave a few off-shoots that are not all closely tied to it (the study of order 5 equations, Higman-Neumann axioms, the finite implication table).</p>",
        "id": 483801382,
        "sender_full_name": "Bruno Le Floch",
        "timestamp": 1732228545
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> <a href=\"#narrow/stream/458659-Equational/topic/Drafting.20the.20paper/near/483797097\">said</a>:</p>\n<blockquote>\n<p>We could do this, but to me this seems roughly equivalent to asking everyone to submit a PR to directly adjust <code>contributions.tex</code> in which they can describe their contributions in Github comments.  Are there any particular advantages to routing it through the Github projects page?</p>\n</blockquote>\n<p>I don't mind it that way either. It's just that depending on how we merge the PRs, other PRs will have to constantly fix merge conflicts</p>",
        "id": 483802052,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732228843
    },
    {
        "content": "<p>Because all 45 PRs are touching the same file</p>",
        "id": 483802117,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732228872
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"773643\">Bruno Le Floch</span> <a href=\"#narrow/stream/458659-Equational/topic/Drafting.20the.20paper/near/483801382\">said</a>:</p>\n<blockquote>\n<p>It would be useful to have guidance on how much participation is required for authorship (in particular if moderators have to decide, it is best if they can do so consistently).</p>\n<p>A related question is the scope of the article, as the main project gave a few off-shoots that are not all closely tied to it (the study of order 5 equations, Higman-Neumann axioms, the finite implication table).</p>\n</blockquote>\n<p>As a computer science person, I have a broad understanding of the term contribution. Keeping in mind the unconventional nature and form of this project, contributions can range from good theoretical ideas, to formalisation, blueprint write ups, maintenance work, authorship, mentorship on some portion of the project, etc. On the technical side you might have added some proof, or improved and fixed another person's proof, fixed bugs in the proof search prcedures, or even simplified an existing refutation for formalisation purposes.  On the other hand I don't know how far it should go. This contribution elicitation process should allow a good filter. If someone feels they didn't contribute much, they might hesitate to add their names since it will appear along side their contribution.</p>",
        "id": 483803238,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732229427
    },
    {
        "content": "<p>I tend to prefer to approach this systematically by discussing, interpreting, and extending each of the <a href=\"https://credit.niso.org/\">CReDiT categories</a>. </p>\n<p>Once these extended categories are well-defined and agreed upon, individual contributors can easily identify their contributions across the relevant categories and propose to attribute them accordingly via a PR filling a simple table with <span aria-label=\"check\" class=\"emoji emoji-2705\" role=\"img\" title=\"check\">:check:</span>. </p>\n<p>We could have a longer, less schematic description too written below the table to make sure that some major not-easily-classifiable contribution is not left out.</p>",
        "id": 483819651,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1732238803
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"657719\">@Terence Tao</span> Should we have an array of tools to generate models of a given equation in the paper?</p>",
        "id": 483836045,
        "sender_full_name": "Fan Zheng",
        "timestamp": 1732250590
    },
    {
        "content": "<p>Yes, I plan to make such a list in the introduction soon, and then create some sections in the paper to discuss individual techniques (or families of techniques).</p>",
        "id": 483837568,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732251650
    },
    {
        "content": "<p>Here is the temporary markdown file containing the contributions table mentioned above with the default (i.e. not yet interpreted and extended) categories: <a href=\"https://github.com/teorth/equational_theories/blob/main/paper/contributions.md\">https://github.com/teorth/equational_theories/blob/main/paper/contributions.md</a>.</p>",
        "id": 483930493,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1732288084
    },
    {
        "content": "<p>I like this table approach.  At <a href=\"https://github.com/teorth/equational_theories/pull/844\">equational#844</a> I made a sample PR in which I add my name and appropriate checkmarks to the table, and explain in the PR my justification for the categories.  Hopefully this is a suitable workflow for everyone else to add to the table as well?  The one issue is with merge conflicts.  I was thinking of perhaps first collecting a list of contributors, adding them as rows to the table, and then allowing PRs for each person fill in their row; hopefully this will allow git to work out how to avoid conflicts.</p>\n<p>I interpreted \"Investigation\" as \"worked to analyze at least one implication\", and \"Methodology\" as \"developed at least one technique to analyze implications\".  Some categories may end up being unused; we had no funding and I don't think there was any supervision/mentoring happening, but perhaps there was some activity of this sort that I was unaware of.</p>",
        "id": 483963593,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732298493
    },
    {
        "content": "<p>One activity which does not seem well represented in current categories is contributing to the blueprint for the project.  Perhaps either \"Data Curation\" or an extended category?</p>",
        "id": 483968640,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732300419
    },
    {
        "content": "<p>/poll Are you interested in being a co-author in the report for this project?<br>\nYes.  I have made at least one contribution to the project, and will submit a PR describing my contributions in due course.<br>\nNo, but I would be happy to be listed as a participant in the acknowledgments section.<br>\nNo, I do not wish to be either a co-author or listed as a participant.</p>",
        "id": 483969489,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732300765
    },
    {
        "content": "<p>I guess there may be some co-authors who do not use Github.  We can discuss (either in this thread, or by private DM) if there should be an alternate way to declare one's contributions that does not involve a Github PR, if this is an issue.</p>",
        "id": 483970518,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732301198
    },
    {
        "content": "<p>For now, if there is a co-author or acknowledgment request that one would prefer to submit privately, you can DM me and I can try to work out some reasonable solution.</p>",
        "id": 483971059,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732301442
    },
    {
        "content": "<p>Maybe all the code review, code cleaning and upstreaming should go under “Software”?</p>",
        "id": 483971241,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1732301520
    },
    {
        "content": "<p>Either that or \"Data Curation\".  It's possible that some contributions span more than one category.</p>",
        "id": 483971374,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732301566
    },
    {
        "content": "<p>What about CI infrastructure design and development?</p>",
        "id": 483971575,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1732301643
    },
    {
        "content": "<p>Hmm, that could plausibly go under \"Software\" or \"Validation\", I think.  Maybe \"Validation\", though I was thinking of using this category for Lean formalization, so maybe we would split into subcategories if we want to make the distinction.  (Or we could just keep the CReDiT categories as they are for the paper, and rely on the individual PR self-descriptions for any nuances.)</p>",
        "id": 483971824,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732301763
    },
    {
        "content": "<p>I created a <code>contribution</code> label for PRs, so that we can go find all the contributions of all the coauthors later if need be.</p>",
        "id": 483972291,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732301896
    },
    {
        "content": "<p>Regarding co-authors that don't use Github: I guess I can just submit a PR on behalf of anyone who doesn't want to use Github directly.  I titled my own PR with my own name, but I could just as easily submit PRs for other people by mentioning their name in the title.</p>",
        "id": 483972644,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732302004
    },
    {
        "content": "<p>I think it might be good if, for each category, contributors could add a link to a representative contribution (specific commit, PR, Zulip topic, others).</p>",
        "id": 483973198,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1732302197
    },
    {
        "content": "<p>Good idea, I will update my own PR to do this later today. [UPDATE: now done.]</p>",
        "id": 483973416,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732302286
    },
    {
        "content": "<p>Just to facilitate reviewers’ work</p>",
        "id": 483973458,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1732302304
    },
    {
        "content": "<p>Regarding the blueprint, we could declare it to be \"metadata\", in which case all blueprint contributions would come under \"Data Curation\".  (It's a bit of a stretch, but the categories will likely just be a zeroth order approximation no matter what, and I'm leaning towards using the PR descriptions as the more definitive reference for precise contributions.)</p>",
        "id": 483985527,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732307049
    },
    {
        "content": "<p>What category does helping fix formalisations fall in? I think we could have a category that is or subsumes \"maintenance\"</p>",
        "id": 484016306,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732323603
    },
    {
        "content": "<p>Hmm.  None of the categories are a great fit, but \"Data Curation\" or \"Validation\" could work I think.</p>",
        "id": 484017379,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732324347
    },
    {
        "content": "<p>I've gone ahead and added rows to <code>contributions.md</code> for everyone so far who has identified as a co-author.  If there are no objections, I think it is now fine for people to PR their contributions modifying each row (I'm <em>hoping</em> this does not create merge conflicts) and provide some brief justification of each entry with some representative links (like I did at <a href=\"https://github.com/teorth/equational_theories/pull/884\">https://github.com/teorth/equational_theories/pull/884</a> as a template).  If the PRs have the title \"Contributions - &lt;name&gt;\" and use the <code>contribution</code> label then it should be easy to organize them for future reference.</p>\n<p>I estimate it will take at least a month to get the paper finalized (and of course we still have 50 odd statements to formalize), so there is absolutely no rush on this.</p>",
        "id": 484018467,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732325151
    },
    {
        "content": "<p>Helping with formalizations seems to fit well under Validation.</p>\n<blockquote>\n<p>I think we could have a category that is or subsumes \"maintenance\"</p>\n</blockquote>\n<p>It's tempting to create more and more precise categories, but I'm not sure it'd be all that useful in the long run. CReDiT seems to be a well-designed standard for describing the different types of contributions people made, and communicate them reasonably clearly to the referees, readers and even to onlookers.</p>\n<p>Should historians, hiring panels, tenure committees or anyone else ever need a more in-depth account of specific contributions made by specific individuals, they’ll still have (and will want to use) the Github repositories and Zulip discussions as primary sources, assuming no catastrophic data loss occurs.</p>",
        "id": 484018562,
        "sender_full_name": "Zoltan A. Kocsis (Z.A.K.)",
        "timestamp": 1732325211
    },
    {
        "content": "<p>My inclination is to try using the standard CReDiT categories first and see whether they are a reasonable fit.  If we keep having lots of square-peg-in-round-hole issues then we can always refactor later.</p>",
        "id": 484018681,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732325283
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"556875\">@Pietro Monticone</span> has just completed his contributions PR at <a href=\"https://github.com/teorth/equational_theories/pull/891\">equational#891</a>.  This can serve as a template for other such PRs.</p>",
        "id": 484084951,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732385890
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"657719\">@Terence Tao</span> I'm not using Github so I'll declare here. So far my contribution is the proof that equation 477 is confluent, as is also shown latter by some automated tools. I'm not sure what category that falls in. Also is there any interest in listing all known confluent (maybe after completion) equations? Or more generally, all equations with a \"universal model\" in which its implication to other equations can be checked directly?  If there is, then I have some work done already and you can start from equation with 3 operations.</p>",
        "id": 484092159,
        "sender_full_name": "Fan Zheng",
        "timestamp": 1732392363
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"562644\">@Fan Zheng</span> I've marked you down at <a href=\"https://github.com/teorth/equational_theories/pull/896\">equational#896</a> for \"Investigation\" and \"Methodology\".  You are also welcome to contribute to \"Writing\", for instance if you want to share your work on equations with a known universal model (there are currently stubs in the paper for \"Confluence\" and \"Complete rewriting systems\" that may need some volunteers to help write, as this is not a topic I am expert in).</p>\n<p>I think <span class=\"user-mention\" data-user-id=\"302984\">@Amir Livne Bar-on</span> had some listing of confluent and/or confluent-after-completion equations, but I don't know how exhaustive this list is.</p>",
        "id": 484095845,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732395587
    },
    {
        "content": "<p>I'd like to help write the paper/blueprint if there is a section appropriate for me. Perhaps if the formalizers desire it I can write up some of the remaining vanilla greedy algorithms in detail.</p>",
        "id": 484104492,
        "sender_full_name": "Matthew Bolan",
        "timestamp": 1732404366
    },
    {
        "content": "<p>That would be helpful actually!  I just PR'ed some additions to Section 7.4 of the blueprint that should land soon that put in some of the text from the various outstanding greedy arguments (expanding upon the previous version that just discussed 1722), but perhaps there is a way to organize the material in a more coherent way that reduces repetition and may suggest a more systematic way to formalize.  If you'd like to take a stab at organizing that blueprint material, that could be helpful (and also give some insight as to how to arrange the corresponding section of the paper, currently a stub at Section 5.5).</p>",
        "id": 484105069,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732405038
    },
    {
        "content": "<p>created <a href=\"https://github.com/teorth/equational_theories/pull/902\">equational#902</a> to officially record this (so that the rest of us know that this section is being worked on).</p>",
        "id": 484105266,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732405242
    },
    {
        "content": "<p>Alright, I couldn't work on it as much as I would have liked to today, but I made <a href=\"https://github.com/teorth/equational_theories/pull/912\">equational#912</a> which adds the remaining algorithms to the blueprint. I also of course corrected 1722 and added some detail about its square case.</p>",
        "id": 484214587,
        "sender_full_name": "Matthew Bolan",
        "timestamp": 1732513217
    },
    {
        "content": "<p>There still are some easy arguments handwaved away, but I think the situation should be better than it was this morning. I can continue to work on this if it seems important. Besides 1722, 63 proved tricky for me to understand, so I added some detail there about how Law 2 is used to avoid various edge cases.</p>",
        "id": 484214735,
        "sender_full_name": "Matthew Bolan",
        "timestamp": 1732513324
    },
    {
        "content": "<p>Thanks!  Hopefully this is a sufficient level of detail to help with formalization.  I'll update the issues to point to the blueprint once it lands.</p>",
        "id": 484219994,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732517143
    },
    {
        "content": "<p>Opened some issues <a href=\"https://github.com/teorth/equational_theories/pull/920\">equational#920</a> <a href=\"https://github.com/teorth/equational_theories/pull/921\">equational#921</a> <a href=\"https://github.com/teorth/equational_theories/pull/922\">equational#922</a> <a href=\"https://github.com/teorth/equational_theories/pull/923\">equational#923</a> <a href=\"https://github.com/teorth/equational_theories/pull/924\">equational#924</a> to write first drafts of specific sections of the paper.  There are some sections that I'm leaving fluid for now, such as the conclusions section, but this should already get us a long way to a reasonably complete first draft.</p>",
        "id": 484408286,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732577730
    },
    {
        "content": "<p>One thing I'm not sure about here is the target audience, should the paper have an audience that's about as general as the group of contributors (e.g. shhould we assume no background in any specialized subfield like, just a general ineterest in this intersection), or are we targeting a particular, albeit wide, audience (e.g. mathematicians at large, computer scientists), etc?</p>",
        "id": 484443488,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1732603158
    },
    {
        "content": "<p>What background knowledge could be relevant? There's some logic, what else?</p>",
        "id": 484455783,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1732609255
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"562644\">Fan Zheng</span> <a href=\"#narrow/channel/458659-Equational/topic/Drafting.20the.20paper/near/484092159\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> I'm not using Github so I'll declare here. So far my contribution is the proof that equation 477 is confluent, as is also shown latter by some automated tools. I'm not sure what category that falls in. Also is there any interest in listing all known confluent (maybe after completion) equations? Or more generally, all equations with a \"universal model\" in which its implication to other equations can be checked directly?  If there is, then I have some work done already and you can start from equation with 3 operations.</p>\n</blockquote>\n<p>There is <a href=\"https://github.com/teorth/equational_theories/blob/main/equational_theories/Generated/Confluence/confluent_equations.txt\">a listing</a> of equations that are confluent as one-rule rewriting systems. This was generated by the script in the same directory. The script can only detect equations whose LHS is <code>x</code>, and not equations that have operations on both sides. I wrote this script from scratch after some armchair-thinking about the problem, and improved its algorithms when new classes of confluent equations were found. I later understood from Cody Roux's explanations on other threads that the final method is complete for this class of equations. The code and the data may still have some bugs: the full output wasn't verified by any other automatic method (either Lean or existing implementations of rewriting systems).</p>\n<p>In addition to equations that are confluent as a 1-rule rewriting system, there are some that are solvable by the Knuth-Bendix algorithm, meaning that they become confluent after adding more rewriting rules. These aren't included at all.</p>",
        "id": 484475235,
        "sender_full_name": "Amir Livne Bar-on",
        "timestamp": 1732615512
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> <a href=\"#narrow/channel/458659-Equational/topic/Drafting.20the.20paper/near/484408286\">ha dicho</a>:</p>\n<blockquote>\n<p>Opened some issues <a href=\"https://github.com/teorth/equational_theories/pull/920\">equational#920</a> <a href=\"https://github.com/teorth/equational_theories/pull/921\">equational#921</a> <a href=\"https://github.com/teorth/equational_theories/pull/922\">equational#922</a> <a href=\"https://github.com/teorth/equational_theories/pull/923\">equational#923</a> <a href=\"https://github.com/teorth/equational_theories/pull/924\">equational#924</a></p>\n</blockquote>\n<p>I'm new to Github and there are things that I don't know yet. Can an issue be claimed by several people at the same time? Writing paper sections can be very collaborative. I'd be glad to claim the Higman-Neumann section, but it would benefit if <span class=\"user-mention\" data-user-id=\"773643\">@Bruno Le Floch</span> and <span class=\"user-mention\" data-user-id=\"761203\">@Vlad Tsyrklevich</span> can also collaborate at the same time (if they want/can).</p>",
        "id": 484507376,
        "sender_full_name": "Jose Brox",
        "timestamp": 1732625844
    },
    {
        "content": "<p>Just to be clear: the ability to 'claim' an issue is specific infrastructure for this project, not GitHub generally. The way it works is that only a single person can claim an issue, but you can think of this as a formality to avoid unwitting duplication of effort. There's nothing to stop you from working with others.</p>",
        "id": 484507836,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1732625973
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"690858\">Daniel Weber</span> <a href=\"#narrow/channel/458659-Equational/topic/Drafting.20the.20paper/near/484455783\">said</a>:</p>\n<blockquote>\n<p>What background knowledge could be relevant? There's some logic, what else?</p>\n</blockquote>\n<p>well, most of the refutations use some basic constructions that require some undergradute level of algebra/analysis at least, many potential readers with a computer science or AI background wouldn't know that. Or for for example in the context of ATPs, it makes sense to have a bit of proof theory (e.g. for the saturation proofs) and universal algebra (and term rewriting specifically) to explain differences between the techniques, and I don't know how much of that is sensible to assume, also necessary for some of the constructions.</p>",
        "id": 484520074,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1732629537
    },
    {
        "content": "<p>I probably should have said this earlier, but I was thinking of submitting this paper, when it is completed, to the newly formed <a href=\"https://afm.episciences.org/\">Annals of Formalized Mathematics</a>.  So the audience would be very diverse, ranging from experts in universal algebra at one end and experts in automated theorem proving or formal proof assistants at the other.  Almost nobody would have expertise in all the areas covered in the project.  So it would be good to keep the paper as accessible as possible.  To that end, it would be helpful for people to review sections of the paper draft not in their area and point out places where the exposition is assuming expert knowledge, for instance by using a technical term without defining it or giving a suitable reference (in some cases we might be able to point to our own blueprint for more details).</p>",
        "id": 484539701,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732634875
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> <a href=\"#narrow/channel/458659-Equational/topic/Drafting.20the.20paper/near/484539701\">ha dicho</a>:</p>\n<blockquote>\n<p>I was thinking of submitting this paper, when it is completed, to the newly formed <a href=\"https://afm.episciences.org/\">Annals of Formalized Mathematics</a>. </p>\n</blockquote>\n<p>I was wondering if we would try Nature and Science <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 484542923,
        "sender_full_name": "Jose Brox",
        "timestamp": 1732635727
    },
    {
        "content": "<p>It's possible that we may end up having multiple papers come out of this project, though for now I have just kept things as a single paper.  The first Polymath project led to <a href=\"https://link.springer.com/chapter/10.1007/978-3-642-14444-8_22\">two mathematical papers</a> (<a href=\"https://annals.math.princeton.edu/2012/175-3/p06\">one in Annals of Math</a>) but also <a href=\"https://link.springer.com/chapter/10.1007/978-3-642-14444-8_21\">several</a> <a href=\"https://link.springer.com/chapter/10.1007/978-3-642-14444-8_20\">retrospective</a> articles (including <a href=\"https://www.nature.com/articles/461879a\">an opinion piece in Nature</a>).  If it turns out that we have a lot to say about collaborative math research projects built on a formalized foundation I could imagine that being a separate paper.  Perhaps once we have a more developed \"Conclusions\" / \"Reflections\" section in the current draft, this will become clearer.</p>",
        "id": 484545103,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732636350
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"761203\">Vlad Tsyrklevich</span> <a href=\"#narrow/stream/458659-Equational/topic/Drafting.20the.20paper/near/484507836\">said</a>:</p>\n<blockquote>\n<p>Just to be clear: the ability to 'claim' an issue is specific infrastructure for this project, not GitHub generally. The way it works is that only a single person can claim an issue, but you can think of this as a formality to avoid unwitting duplication of effort. There's nothing to stop you from working with others.</p>\n</blockquote>\n<p>This is correct. I designed it based on how the previous outstanding tasks mechanism was intended to work. That being said collaboration is fine and has been happening quite a bit already.</p>\n<p>You could also make dependent PRs if you wish.</p>",
        "id": 484601136,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732657318
    },
    {
        "content": "<p>From the maintainers side, it also allows us to track who is working on a task and which PRs to accept, in case someone else isn't following the process.</p>",
        "id": 484601530,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732657502
    },
    {
        "content": "<p>For the <strong>machine learning section</strong>, recall that <strong>Fernando Vaquerizo</strong> and myself trained a 4-layer CNN with the implication graph data, with 1% of the implications for the training set and another 1% for validation (1/1/98), the accuracy being 99.3%. On the other hand, <span class=\"user-mention\" data-user-id=\"243562\">@Adam Topaz</span> used a vectorized model and a different way of producing the dataset, also with high accuracies.</p>\n<p>Two experiments that we have not done yet (because I went to work on the remaining implications), but that we have talked about before in Zulip, and we can do easily and quickly are: 1) Try Adam's dataset on our CNN model and see how it performs, and 2) try our CNN model on the dataset of implications with the identities erased (just random numbers as labels) to see how much of the accuracy is due to the CNN learning transitivity, and not because of patterns in the identities.</p>\n<p>I just wanted to check (<span class=\"user-mention\" data-user-id=\"657719\">@Terence Tao</span>)  that we should go ahead and perform these two experiments (I'd do the data conversion and Fernando the CNN training). </p>\n<p>In any case, if we use any of these results from the CNN, I think Fernando Vaquerizo should be added as a coauthor (he is not in Zulip).</p>",
        "id": 484614148,
        "sender_full_name": "Jose Brox",
        "timestamp": 1732664399
    },
    {
        "content": "<p>That sounds good to me.  Are the results comparable with the Graph ML section already in the paper that <span class=\"user-mention\" data-user-id=\"556875\">@Pietro Monticone</span> uploaded?  In particular, would there be a way to unify the discussions of these results?</p>",
        "id": 484619661,
        "sender_full_name": "Terence Tao",
        "timestamp": 1732668047
    },
    {
        "content": "<p>From my last recollection, the graph prediction algorithm was looking for patterns and predicting implications and anti-implications. I don't remember how this was tested and validated against the final implication graph</p>",
        "id": 484621466,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732669311
    },
    {
        "content": "<p>Also, I am not sure how to interpret such a prediction</p>",
        "id": 484621523,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732669329
    },
    {
        "content": "<p>What pattern is the algorithm seeing?</p>",
        "id": 484621776,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732669525
    },
    {
        "content": "<p>Do we know for instance that the algorithm isn't finding a spurious pattern based on topological properties of the graph or the shapes of equations or some combination?</p>",
        "id": 484621949,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1732669653
    },
    {
        "content": "<p>Thanks to <span class=\"user-mention\" data-user-id=\"315434\">@Andrés Goens</span> for writing the first draft of the \"Proof Automation\" section at <a href=\"https://github.com/teorth/equational_theories/pull/930\">equational#930</a>!  I encourage other contributors to review it, and I will merge it soon into the paper when the comments are incorporated and all the merge conflicts are resolved.  I've not attempted to write a paper through github pull requests before, but I can see the value in it now; for any significant edits to the paper going forward I may also try to use the PR mechanism rather than just unilaterally editing the paper directly.</p>\n<p>I am thinking of promoting the finite magma part of the project to the level of primary objective, so that the ETP main objective retroactively becomes determining both the general magma implication graph and the finite magma implication graph for the 4694 equations.  I would probably introduce a symbol such as <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mo>⊢</mo><mrow><mi mathvariant=\"normal\">f</mi><mi mathvariant=\"normal\">i</mi><mi mathvariant=\"normal\">n</mi></mrow></msub></mrow><annotation encoding=\"application/x-tex\">\\vdash_{\\mathrm{fin}}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8444em;vertical-align:-0.15em;\"></span><span class=\"mrel\"><span class=\"mrel\">⊢</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361em;\"><span style=\"top:-2.55em;margin-left:0em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\"><span class=\"mord mathrm mtight\">fin</span></span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span> to define finite entailment, and instead of having a separate section for the finite implications as the structure is currently, one would instead discuss both the general implication and finite implication simultaneously in each section (e.g., for each construction of counterexamples, indicate whether the counterexample is finite).</p>\n<p>I'm also thinking of not having a \"reflections\" section in which individual contributors discuss their experiences, as this would make the paper somewhat self-referential (and also quite long).  I was thinking instead when we finally declare \"victory\" for this project (a reasonable milestone for this would be when all the implications for both the infinite and finite graph are formalized in Lean) to collect such recollections, which perhaps could be a basis for a subsequent retrospective paper (along the lines of <a href=\"https://arxiv.org/abs/1409.8361\">this retrospective Polymath paper</a>).</p>\n<p>Finally, if anyone has any general comments on the paper, e.g., if there are any topics that are currently not discussed in the draft but are worth mentioning, please mention them here.</p>",
        "id": 486554436,
        "sender_full_name": "Terence Tao",
        "timestamp": 1733503541
    },
    {
        "content": "<p>yes, sorry I've been quite slow on this,  but thanks for the comments (and also <span class=\"user-mention\" data-user-id=\"761203\">@Vlad Tsyrklevich</span> ), I'll get to them soon!  I guess the merge conflict is because the pdf is checked into the paper. Maybe it makes sense to delete it and have it be built in CI,  like the blueprint?</p>",
        "id": 486558198,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1733504616
    },
    {
        "content": "<p>That sounds like a good idea, though I don't know how to implement the CI on a technical level.  One can override the merge conflict and replace the pdf directly, but it would perhaps be better (particularly as more sections start coming in) to not have to deal with this issue with each PR.</p>",
        "id": 486565231,
        "sender_full_name": "Terence Tao",
        "timestamp": 1733506892
    },
    {
        "content": "<p>Isn’t it better to just .gitignore the <code>main.pdf</code> file?</p>",
        "id": 486565796,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733507083
    },
    {
        "content": "<p>but then people cannot just download the latest version without building it themselves</p>",
        "id": 486565924,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1733507118
    },
    {
        "content": "<p>Ok, I’ll write a paper.yml later today or tomorrow.</p>",
        "id": 486566047,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733507157
    },
    {
        "content": "<p>But then we’ll need: </p>\n<ol>\n<li>Contributors should not push the main.pdf in their PRs</li>\n<li>The compile-paper workflow should be triggered only on push events to main and not on PR events</li>\n</ol>",
        "id": 486567415,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733507686
    },
    {
        "content": "<p>If we're doing CI, maybe we .gitignore *.pdf and just put the paper.pdf in home_page?</p>",
        "id": 486567523,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1733507738
    },
    {
        "content": "<p>Yes exactly</p>",
        "id": 486567560,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733507760
    },
    {
        "content": "<p>Ah ok, I thought you were saying keep the .pdfs on main</p>",
        "id": 486567634,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1733507778
    },
    {
        "content": "<p>I think is better to have a separate workflow file so that for [PAPER] contributions people don’t have to wait for whole blueprint to compile etc.</p>",
        "id": 486568077,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733507962
    },
    {
        "content": "<p>I’ll also add a “Paper” button on the project website.</p>",
        "id": 486568335,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733508055
    },
    {
        "content": "<p>If we push and share the gitignore, the issue goes away</p>",
        "id": 486569670,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1733508619
    },
    {
        "content": "<p>Another solution is to use overleaf, if someone has a professional or enterprise overleaf account</p>",
        "id": 486569802,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1733508683
    },
    {
        "content": "<p>Overleaf will save us a lot of trouble that might come from incompatible latex installations, packages etc</p>",
        "id": 486570807,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1733509091
    },
    {
        "content": "<p>I would stick to the mono-platform solution.</p>",
        "id": 486570923,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733509142
    },
    {
        "content": "<p>Here is the associated task issue <a href=\"https://github.com/teorth/equational_theories/issues/989\">https://github.com/teorth/equational_theories/issues/989</a></p>",
        "id": 486571841,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733509522
    },
    {
        "content": "<p>a concrete point against overleaf in this case is that it would also remove the PR and review process, which in this case we probably want to keep</p>",
        "id": 486575727,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1733510958
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"556875\">Pietro Monticone</span> <a href=\"#narrow/channel/458659-Equational/topic/Drafting.20the.20paper/near/486568077\">said</a>:</p>\n<blockquote>\n<p>I think is better to have a separate workflow file so that for [PAPER] contributions people don’t have to wait for whole blueprint to compile etc.</p>\n</blockquote>\n<p>Oh right, I cannot do that  because GitHub Pages deployments overwrite the previously published site... I will integrate everything into a single \"Compile blueprint and paper\" workflow then.</p>",
        "id": 486578480,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733512011
    },
    {
        "content": "<p>Done: </p>\n<ul>\n<li>PR <a href=\"https://github.com/teorth/equational_theories/pull/990\">https://github.com/teorth/equational_theories/pull/990</a></li>\n<li>Homepage: <a href=\"https://teorth.github.io/equational_theories/\">https://teorth.github.io/equational_theories/</a></li>\n<li>Paper: <a href=\"https://teorth.github.io/equational_theories/paper.pdf\">https://teorth.github.io/equational_theories/paper.pdf</a></li>\n</ul>",
        "id": 486596471,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733520055
    },
    {
        "content": "<p>Resolved the conflict, fixed typos and merged <code>main</code> in <a href=\"https://github.com/teorth/equational_theories/pull/930\">equational#930</a>.</p>",
        "id": 486604933,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733524508
    },
    {
        "content": "<p>I am working towards a draft of the project management and explaining my design of the project process. Before I write it out fully (maybe a draft by Saturday night German time), I wanted to get some feedback and thoughts about how participants of the project felt about it. During the project we already accumulated a list of points to talk about and this can be seen in the draft notes. I want to get a sense of what worked, what didn't and what could have been better.</p>",
        "id": 487011072,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1733754869
    },
    {
        "content": "<p>On the paper draft this is section 4</p>",
        "id": 487011163,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1733754895
    },
    {
        "content": "<p>Also, since FLT is using a similar process <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>  : I would like to get your take on it so far</p>",
        "id": 487011381,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1733754952
    },
    {
        "content": "<p>One small thing I wished we had, was something like #rss for equational commits/issues/PRs. It could just be a single thread on Zulip instead of a whole channel, just announcing what happened without necessarily requiring the same level of detail. For those who care to keep track of what's going on, it just makes it a lot easier if it's pushed to a thread somewhere instead of looking multiple places on GitHub to keep track</p>",
        "id": 487023903,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1733757923
    },
    {
        "content": "<p>You mean over and above the project dashboard? Specifically, is it the linear feed of events that #rss channel provides?</p>",
        "id": 487024521,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1733758060
    },
    {
        "content": "<p>I guess I never used that dashboard much, it's busy and it also doesn't include commits without PRs. (Also, it would be nice if it reverse-sorted it's columns so you saw what was most-fresh instead of what is most-stale.)</p>\n<p>Yes, I want a linear feed of events to make it easy to keep track of what others are doing.</p>",
        "id": 487026272,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1733758407
    },
    {
        "content": "<p>One nice consequence of this for the maintainers is that it may invite more PR feedback from other contributors.</p>",
        "id": 487027481,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1733758649
    },
    {
        "content": "<p>(By the way, the paper draft is now officially available from the dashboard, or <a href=\"https://teorth.github.io/equational_theories/paper.pdf\">at this link</a>, thanks to some recent interface upgrades by <span class=\"user-mention\" data-user-id=\"556875\">@Pietro Monticone</span> .)</p>\n<p>Certainly from the perspective of the person issuing a large fraction of the tasks, I find the Github issues based system a marked improvement over the previous ad hoc system of manually updating a Zulip thread of tasks.  Not all tasks are perfectly suited for the system - in particular the tasks that require a lot of ongoing discussion between a large number of project participants, such as attacking an equation for which the way forward is not yet clear - but for the ones in which the task can be safely assigned to a single participant, it seems to work well.  At the same time, I appreciate the flexibility to also propose tasks and PRs (e.g., for correcting minor typos) outside of the formal issue system.</p>",
        "id": 487030271,
        "sender_full_name": "Terence Tao",
        "timestamp": 1733759288
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"761203\">Vlad Tsyrklevich</span> <a href=\"#narrow/channel/458659-Equational/topic/Drafting.20the.20paper/near/487023903\">said</a>:</p>\n<blockquote>\n<p>One small thing I wished we had, was something like #rss for equational commits/issues/PRs. It could just be a single thread on Zulip instead of a whole channel, just announcing what happened without necessarily requiring the same level of detail. For those who care to keep track of what's going on, it just makes it a lot easier if it's pushed to a thread somewhere instead of looking multiple places on GitHub to keep track</p>\n</blockquote>\n<p>Wouldn’t the GitHub “Watch” feature suffice for this purpose? It provides customisable notifications for all activity on a repository, including commits, issues, and pull requests.</p>",
        "id": 487057878,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733765777
    },
    {
        "content": "<p>Or we could have used a GitHub bot <a href=\"https://zulip.com/integrations/doc/github\">https://zulip.com/integrations/doc/github</a></p>",
        "id": 487058926,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1733766078
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"556875\">Pietro Monticone</span> <a href=\"#narrow/channel/458659-Equational/topic/Drafting.20the.20paper/near/487057878\">said</a>:</p>\n<blockquote>\n<p>Wouldn’t the GitHub “Watch” feature suffice for this purpose?</p>\n</blockquote>\n<p>I suppose it could have, if I 1) had the mobile GitHub app installed, or 2) looked at GitHub regularly outside of submitting PRs/addressing feedback</p>",
        "id": 487059819,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1733766358
    },
    {
        "content": "<p>Regarding <a href=\"https://github.com/teorth/equational_theories/pull/923\">equational#923</a> (paper section for order 5 trivial/Austin laws), I wanted to solicit feedback on what I should do. I've run out of juice to keep pushing that effort any further. I've exhausted the basic methods of finding finite examples and finite implications for the remaining set of unknowns. I will briefly summarize the results as: Outside of equations with known finite models or with only trivial models, there are 3 sets of remaining (interesting) equations: 1) verified Austin laws (where their infinite non-triviality is derived from Vampire, not by formalization in Lean), 2) laws that are finite-trivial and it is unknown whether they have infinite models (these are likely Austin laws), and 3) 12 remaining equations for which I have been unable to find finite models or prove that they are trivial. (Note that 1 of these unknowns is known to have infinite models according to Vampire.)</p>\n<p>This is the start of something interesting, but given that it's half-done and likely won't be pushed any further, I was unsure if it's worth documenting the current state. If it is, I'll gladly take it on, but I'd like to get feedback on whether it's worth reporting the partial progress.</p>",
        "id": 488717953,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1734037496
    },
    {
        "content": "<p>I think it's good to report the partial progress so that any future researcher can build upon it.  If you don't feel like it's definitive enough to put in the paper, we can instead make a blueprint chapter for it and make a reference to that chapter in the paper (that way, even if the paper remains static, the blueprint chapter can be updated in the future with more progress, and the reference will remain current).  Would you be more comfortable with that approach?</p>",
        "id": 488719048,
        "sender_full_name": "Terence Tao",
        "timestamp": 1734037928
    },
    {
        "content": "<p>I'm comfortable with either--I just don't feel qualified to make the call on where it belongs</p>",
        "id": 488721786,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1734038914
    },
    {
        "content": "<p>In that case why don't we aim for making a blueprint chapter for now?  If there is unexpected progress on this front beyond the current state, we can always try to incorporate whatever you write into the paper itself, but the tentative plan would just be to state in the paper that some partial results are known on the order 5 question and refer the reader to the blueprint for the latest updates.  I've modified the task at <a href=\"https://github.com/teorth/equational_theories/pull/923\">equational#923</a> to reflect this option.</p>",
        "id": 488723189,
        "sender_full_name": "Terence Tao",
        "timestamp": 1734039421
    },
    {
        "content": "<p>Just skimming though the paper now. I noticed that Chapter 8 starts out by stating:</p>\n<blockquote>\n<p>85 laws have been shown to be equivalent to the constant law (Definition 2.20), and 815 laws<br>\nhave been shown to be equivalent to the singleton law (Definition 2.2).</p>\n</blockquote>\n<p>Shouldn't these numbers be 418 and 1495? Or am I missing some context?</p>",
        "id": 488934511,
        "sender_full_name": "Harald Husum",
        "timestamp": 1734130681
    },
    {
        "content": "<p>I think you are looking at the blueprint, which is distinct from the paper (which can be found at <a href=\"https://teorth.github.io/equational_theories/paper.pdf\">https://teorth.github.io/equational_theories/paper.pdf</a> ).</p>\n<p>Chapter 8 referred to a very early stage of the project (in the first few days, I think) in which we just started to implement some algorithms to prove equivalence with constant or singleton laws, for instance by locating laws of the form <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi><mo>=</mo><mi>f</mi><mo stretchy=\"false\">(</mo><mi>y</mi><mo separator=\"true\">,</mo><mi>z</mi><mo separator=\"true\">,</mo><mi>w</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">x = f(y,z,w)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">x</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">y</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.04398em;\">z</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.02691em;\">w</span><span class=\"mclose\">)</span></span></span></span> (which are automatically equivalent to the singleton law).  As you indicate, they are only a fraction of the total number of laws that are equivalent to these laws.  The corresponding place in the paper where they should be mentioned is Section 6.1, although I didn't actually get around to putting those statistics yet.</p>",
        "id": 488935091,
        "sender_full_name": "Terence Tao",
        "timestamp": 1734130993
    },
    {
        "content": "<p>Yeah, you're right, it was the blueprint. Thank you for pointing me in the right direction. I got to the blueprint by clicking the paper badge on github; maybe we should point that to the actual paper instead.</p>\n<p><a href=\"/user_uploads/3121/-x0dfKjCYsPZPaUgDI_1_Vrb/Screenshot-2024-12-14-at-00.05.53.png\">Screenshot 2024-12-14 at 00.05.53.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/-x0dfKjCYsPZPaUgDI_1_Vrb/Screenshot-2024-12-14-at-00.05.53.png\" title=\"Screenshot 2024-12-14 at 00.05.53.png\"><img data-original-dimensions=\"586x188\" src=\"/user_uploads/thumbnail/3121/-x0dfKjCYsPZPaUgDI_1_Vrb/Screenshot-2024-12-14-at-00.05.53.png/840x560.webp\"></a></div>",
        "id": 488935760,
        "sender_full_name": "Harald Husum",
        "timestamp": 1734131411
    },
    {
        "content": "<p><a href=\"https://github.com/teorth/equational_theories/pull/1024\">https://github.com/teorth/equational_theories/pull/1024</a></p>",
        "id": 488937932,
        "sender_full_name": "Harald Husum",
        "timestamp": 1734132788
    },
    {
        "content": "<p>Are we still planning on finishing the paper for the end of the year? I propose to extend the provisional deadline, say, to the end of January. For my part, I'd like to write the first draft of the Higman-Neumann section, collaborate on the ATPs section, keep working on HN, work a little more on 677-&gt;255 before admitting defeat, and do a couple of neural network computations. And I'm going on vacation on December 22nd... There are too many things left to do and too little time to do them. I guess more people will be in a similar situation.</p>",
        "id": 489454691,
        "sender_full_name": "Jose Brox",
        "timestamp": 1734432339
    },
    {
        "content": "<p>Yeah, that end-of-year deadline in retrospect was far too optimistic, given that we haven't even formalized all the proofs in the main project yet.  I'm also going on vacation soon, so perhaps Jan 31 will indeed be a more reasonable target at this stage.</p>",
        "id": 489519249,
        "sender_full_name": "Terence Tao",
        "timestamp": 1734451114
    },
    {
        "content": "<p>I apologise for the delays from my end. End of year deadline runs have been taking up all my time.</p>",
        "id": 489519437,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1734451168
    },
    {
        "content": "<p>I'm super late to the party, and my contributions were not substantial, but:</p>\n<ol>\n<li>I wrote some things for the basic theory of rewriting, did we want to keep those?</li>\n<li>I did write a couple lines for the completeness and compactness theorems. Should I add myself to <a href=\"https://github.com/teorth/equational_theories/blob/main/paper/contributions.md\">https://github.com/teorth/equational_theories/blob/main/paper/contributions.md</a>?</li>\n</ol>",
        "id": 491413178,
        "sender_full_name": "Cody Roux",
        "timestamp": 1735658707
    },
    {
        "content": "<p>Regarding 1, <a href=\"https://github.com/teorth/equational_theories/pull/926\">equational#926</a> is still open for writing about confluence/term rewriting in the paper itself (it looks like this is currently sections 6.3/6.4). Perhaps the text you contributed to the blueprint could be easily adapted to the paper?</p>",
        "id": 491421091,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1735663954
    },
    {
        "content": "<p>Yes, it would be great if someone with familiarity with confluence can contribute to the paper (and thus also to contributions.md), so feel free to list yourself as a contributor!</p>",
        "id": 491475361,
        "sender_full_name": "Terence Tao",
        "timestamp": 1735712791
    },
    {
        "content": "<p>I have a short 1-page section on user interfaces up for review at <a href=\"https://github.com/teorth/equational_theories/pull/1035\">equational#1035</a> if anyone would like to provide feedback.</p>",
        "id": 491593618,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1735815600
    },
    {
        "content": "<p>While working on the paper draft, I noticed a number of notes to check later. Could we use the todonotes package and inline todonotes instead?</p>",
        "id": 491629739,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1735833467
    },
    {
        "content": "<p>Sure, feel free to implement this.</p>",
        "id": 491822386,
        "sender_full_name": "Terence Tao",
        "timestamp": 1735944750
    },
    {
        "content": "<p>The interfaces section looks good!  It's probably about the right amount of detail - I thought about expanding more on the use cases of the interfaces, but they are all pretty self-explanatory, e.g., using FME as an immediate way to verify a finite magma produced by some theoretical construction (e.g., the cohomological construction).</p>",
        "id": 491822733,
        "sender_full_name": "Terence Tao",
        "timestamp": 1735945024
    },
    {
        "content": "<p>Ok, so I'm looking at writing the section on confluence: at the moment in the blueprint there are 2 such sections: <a href=\"https://teorth.github.io/equational_theories/blueprint/abstract-nonsense-chapter.html#a0000000039\">https://teorth.github.io/equational_theories/blueprint/abstract-nonsense-chapter.html#a0000000039</a> and (my own) <a href=\"https://teorth.github.io/equational_theories/blueprint/rewriting-chapter.html\">https://teorth.github.io/equational_theories/blueprint/rewriting-chapter.html</a>.</p>\n<p>Obviously it's tempting to adapt my own writing, since, well, it's my own writing. But I'd rather be consistent and uniform in style and notation, and I'd much rather refer to a lemma or theorem proven in the development than some other theorem in the literature (though they have also been machine checked _somewhere_).</p>\n<p>However the definition in the former section confuses me a bit: defining a reduction as \"does not increase the size of the term\" seems non-standard, though I guess we're just picking the orientation that (weakly) decreases the length + lex of the equation. The \"unique simplification\" bit seems also a bit weird: are we ordering reductions? Here it feels like we need to operate on ground terms, otherwise the rule <code>x + y -&gt; y + x</code> cannot get ordered.</p>",
        "id": 491905431,
        "sender_full_name": "Cody Roux",
        "timestamp": 1736022455
    },
    {
        "content": "<p>Note that in general, the \"free theory\" of a confluent system is not the set of normal forms, since there still is the possibility of terms without any normal form.</p>",
        "id": 491905966,
        "sender_full_name": "Cody Roux",
        "timestamp": 1736022979
    },
    {
        "content": "<p>I wrote the abstract nonsense chapter and at some point I decided to add some stuff about confluence, but I am not an expert on this topic and may have gotten the terminology and statements somewhat wrong here.  Probably the material in Section 10.1 of the blueprint is a better fit for the term rewriting chapter anyway, so feel free to move it there and edit appropriately.  I don't think that portion of the blueprint is directly connected to anything in the Lean codebase; there is some code (at <code>Confluence.lean</code>, <code>Confluence1.lean</code>, etc.) there establishing confluence but it is not connected to Section 10.1.  It would make sense to align the discussion to that code (or your own rewriting chapter) rather than to Section 10.1 of the blueprint.</p>",
        "id": 491917409,
        "sender_full_name": "Terence Tao",
        "timestamp": 1736033261
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"556875\">@Pietro Monticone</span> , could we get the todonotes package added to the CI runner?</p>",
        "id": 492105615,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1736170430
    },
    {
        "content": "<p>Just opened a draft PR <a href=\"https://github.com/teorth/equational_theories/pull/1039\">equational#1039</a> to check whether the latest TeXLive-Full version works in our case.</p>",
        "id": 492124021,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1736176570
    },
    {
        "content": "<p>It worked. It should have solved all the packages-related issues.</p>\n<p>Now it's ready to merge <a href=\"https://github.com/teorth/equational_theories/pull/1039\">equational#1039</a></p>",
        "id": 492128560,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1736178094
    },
    {
        "content": "<p>Done</p>",
        "id": 492128776,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1736178158
    }
]