[
    {
        "content": "<p>Opened PR: <a href=\"https://github.com/teorth/equational_theories/pull/625\">https://github.com/teorth/equational_theories/pull/625</a> to perform the following enhancements to the equation explorer</p>\n<ol>\n<li>Allow you to search by equation number</li>\n<li>Download the explorer table as a CSV </li>\n</ol>\n<p>If there are any other code / infra improvements I'd love to take them on, as I feel thats where I will be able to add the most value</p>",
        "id": 477541501,
        "sender_full_name": "Joe McCann",
        "timestamp": 1729209412
    },
    {
        "content": "<p>Feel free to discuss this / any other enhancements</p>",
        "id": 477541528,
        "sender_full_name": "Joe McCann",
        "timestamp": 1729209435
    },
    {
        "content": "<p>Thanks!  I see you also suggested being able to download the entire implication graph as a CSV.  That's like a 50MB file or something, but if that's doable I think it's a good idea. I've opened <a href=\"https://github.com/teorth/equational_theories/pull/626\">equational#626</a> for this.</p>",
        "id": 477543204,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729210534
    },
    {
        "content": "<p>Yerrrrrrr, I'll see if I can get that working</p>",
        "id": 477543641,
        "sender_full_name": "Joe McCann",
        "timestamp": 1729210853
    },
    {
        "content": "<p>By the way the jump to equation number doesn't seem to work in the live version, any number gets sent to <a href=\"https://teorth.github.io/equational_theories/implications/?0\">https://teorth.github.io/equational_theories/implications/?0</a></p>",
        "id": 477545144,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729211893
    },
    {
        "content": "<p>thanks for the find, Ill see if I can diagnose</p>",
        "id": 477549898,
        "sender_full_name": "Joe McCann",
        "timestamp": 1729215391
    },
    {
        "content": "<p>I was able to determine the bug. Will push a fix when I address, for now it at least has not impacted any prior functionality, so I will try to push with the download implication graph as a CSV</p>",
        "id": 477550370,
        "sender_full_name": "Joe McCann",
        "timestamp": 1729215832
    },
    {
        "content": "<p>This is a sweet QoL enhancement!</p>\n<p>In the long run, I'd like to see:</p>\n<ol>\n<li>the Filter feature from Finite Magma Explorer ported to the Equation Explorer. It really helps with exploration, and since externals are starting to analyze the data, now feels like the right moment. Too bad I don't have the time to work on it :(</li>\n<li>a background worker to speed up the initial loading times and not freeze the whole page while it loads. </li>\n</ol>\n<p>So if you're looking for further dev work to do shortly <span class=\"user-mention\" data-user-id=\"766565\">@Joe McCann</span>  I think implementing any of these would be really useful.</p>\n<p><a href=\"/user_uploads/3121/lyaaWO0Aw3Zy8IsITYxOCJzF/filter-by-number.png\">filter-by-number.png</a><br>\n<a href=\"/user_uploads/3121/TgF4O-hg9-FGI63Qe4obvi-F/filter-by-pattern.png\">filter-by-pattern.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/lyaaWO0Aw3Zy8IsITYxOCJzF/filter-by-number.png\" title=\"filter-by-number.png\"><img data-original-dimensions=\"446x292\" src=\"/user_uploads/thumbnail/3121/lyaaWO0Aw3Zy8IsITYxOCJzF/filter-by-number.png/840x560.webp\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/3121/TgF4O-hg9-FGI63Qe4obvi-F/filter-by-pattern.png\" title=\"filter-by-pattern.png\"><img data-original-dimensions=\"468x299\" src=\"/user_uploads/thumbnail/3121/TgF4O-hg9-FGI63Qe4obvi-F/filter-by-pattern.png/840x560.webp\"></a></div>",
        "id": 477550525,
        "sender_full_name": "Zoltan A. Kocsis (Z.A.K.)",
        "timestamp": 1729215937
    },
    {
        "content": "<p>About page load time - I looked at the profiler, and it looks like the time is spent in <code>mapThroughLUT</code>, <code>isImplies</code> and <code>isAntiImplies</code>. Probably if we didn't convert back from IDs to strings it would go faster. We can index into an array to get at the properties of each ID. (or define the IDs to have the properties we want as bit-fields if we want to be fancy about it)</p>",
        "id": 477570350,
        "sender_full_name": "Amir Livne Bar-on",
        "timestamp": 1729226223
    },
    {
        "content": "<p>Raised PR: <a href=\"https://github.com/teorth/equational_theories/pull/628\">https://github.com/teorth/equational_theories/pull/628</a> so now we can download the full raw implication table from the equation explorer. This includes a download popup so that we can have the psychological effect of distractions making it feel shorter lmao</p>\n<p>I also provided a bugfix for the searching by int which should work. <span class=\"user-mention\" data-user-id=\"763356\">@Zoltan A. Kocsis (Z.A.K.)</span> I can work on adding the filter feature in. Do you think filtering in the search bar would be the best way to integrate the two? </p>\n<p>Also hopefully theres no more bugs cause it is sleep time on the east coast haha, see y'all in the morn <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 477573357,
        "sender_full_name": "Joe McCann",
        "timestamp": 1729228290
    },
    {
        "content": "<p>The biggest speed improvement we can make is not using the output of <code>lake exe extract_implications outcomes</code> and instead using the condensed graph representation that graphiti does. It's only ~20k edges for implications (for the closure), and probably not too much more for the non-implications. This means we lose the ability to differentiate explicit/implicit but no one uses that anyway (or so I think).</p>",
        "id": 477589885,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729235776
    },
    {
        "content": "<p>Slightly more simply, I think a huge portion of time is spent in <code>calculateStats</code> due to it doing the 4694**2 loop to calculate the stats. Optimizing that shouldn't be too hard (e.g. compute by equivalence class, pre-compute it, etc.)</p>",
        "id": 477590087,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729235855
    },
    {
        "content": "<p>I haven't had time to think about it due to being busy, but I think there's very low hanging fruit there.</p>",
        "id": 477590131,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729235881
    },
    {
        "content": "<p>(Deleted)</p>",
        "id": 477590838,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729236104
    },
    {
        "content": "<blockquote>\n<p>Do you think filtering in the search bar would be the best way to integrate the two?</p>\n</blockquote>\n<p>Yeah, I think this would be the best way to do it (you can load up the FME with multiplication table 0 to see how it works there).</p>",
        "id": 477601988,
        "sender_full_name": "Zoltan A. Kocsis (Z.A.K.)",
        "timestamp": 1729239464
    },
    {
        "content": "<blockquote>\n<p>Optimizing that shouldn't be too hard (e.g. compute by equivalence class, pre-compute it, etc.)</p>\n</blockquote>\n<p>Is there any reason <em>not</em> to have CI pre-compute at least the main equation table? A CI that takes 5 seconds longer, in exchange for 5 seconds less each time somebody visits the Equation Explorer, seems totally worth it.</p>",
        "id": 477602453,
        "sender_full_name": "Zoltan A. Kocsis (Z.A.K.)",
        "timestamp": 1729239616
    },
    {
        "content": "<p>There are forms of filtering that can change those numbers (e.g. does conjecture count as unknown?) hence why it's computed online now I think. But no, there is no reason not to precompute it given the lag. I just haven't had the time to implement the better solution of using condensed representations that would simplify the problem and not require the caching.</p>",
        "id": 477622297,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729246379
    },
    {
        "content": "<p>Basically we could make that loop 10 or 40 [(4694/1450)^2 or (4694/725)^2] times faster depending on how we process the graph, but perfect shouldn't be the enemy of good.</p>",
        "id": 477622538,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729246462
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"766565\">Joe McCann</span> <a href=\"#narrow/channel/458659-Equational/topic/Equation.20Explorer.20Enhancements/near/477541501\">said</a>:</p>\n<blockquote>\n<p>If there are any other code / infra improvements I'd love to take them on</p>\n</blockquote>\n<p>While static displays such as with <a href=\"https://graphviz.org/\">GraphViz</a> are nice, I find <a href=\"https://js.cytoscape.org/\">Cytoscape.js</a> offers more features to deal with large graphs, interaction with the graph, making selections, etc. <br>\nNote: <a href=\"https://cytoscape.org/\">Cytoscape</a> and <a href=\"https://js.cytoscape.org/\">Cytoscape.js</a> are different code bases, they are similar tools but search engines often don't make the distinction with results.</p>\n<p>A downside is that if one wants to store the data in a <a href=\"https://www.w3schools.com/js/js_json_intro.asp\">JSON</a> file then a <a href=\"https://developer.mozilla.org/en-US/docs/Learn/Common_questions/Web_mechanics/What_is_a_web_server\">web server</a> is needed to avoid <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS\">CORS</a> errors when retrieving. I do find that using AI such as ChatGPT to help write the <a href=\"https://www.w3schools.com/js/\">JavaScript</a>, <a href=\"https://www.w3schools.com/html/default.asp\">HTML</a>, <a href=\"https://www.w3schools.com/css/default.asp\">CSS</a>, and <a href=\"https://www.w3schools.com/js/js_json_intro.asp\">JSON</a> for such a project is often helpful, but not always accurate the first time but quite often able to get to working code correctly with some error messages given to the AI.</p>\n<p>I have also been working on this myself but the large data, 50 M, or more with possible multiple files is something I have not done with Cytoscape.js which is pushing me to learn more about the technology and if it can be effectively done.</p>\n<p>If you are curious and have questions, please ask.</p>",
        "id": 477634616,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1729251108
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"366057\">@Eric Taucher</span> You shouldn't need 50mb of data, check out the data graphiti exports. It's pretty tiny, and I use an even smaller portion of it (I export the closure of the condensed graph, but in graphiti itself I compute the reduction due to reasons of how graphiti works.)</p>",
        "id": 477645226,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729254761
    },
    {
        "content": "<p>Technically d3-graphviz also allows interactivity, I just didn't implement it due to limited time and at least for drawing the full graph it was already pushing the limits of what it can handle. I do believe though that other technologies might be useful. In particular I looked at maybe using cytoscape's dagre layout but it couldn't handle the full (condensed-reduced) graph</p>",
        "id": 477645604,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729254885
    },
    {
        "content": "<p>(Also for the CORS errors, one can just use e.g. <code>python -m http.server 8000 --directory home_page/graphiti</code> to launch a web server and get around them but perhaps you have already figured that out)</p>",
        "id": 477645923,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729254980
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"761203\">Vlad Tsyrklevich</span> <a href=\"#narrow/channel/458659-Equational/topic/Equation.20Explorer.20Enhancements/near/477645923\">said</a>:</p>\n<blockquote>\n<p>(Also for the CORS errors, one can just use e.g. <code>python -m http.server 8000 --directory home_page/graphiti</code> to launch a web server and get around them but perhaps you have already figured that out)</p>\n</blockquote>\n<p>Yes, thanks.</p>\n<p>Cytoscape.js can be used in a single HTML page without a server if all the data is included within it. This requires generating a static HTML page containing the HTML, CSS, JSON, and JavaScript whenever an update to the graph data is detected.</p>\n<p>The reason for exploring the use of external JSON files was to allow the pages to update automatically based on graph data being generated and stored in a repository as the project progresses.</p>\n<p>I typically use Cytoscape.js with <a href=\"https://en.wikipedia.org/wiki/Prolog\">Prolog</a> and run a server using <a href=\"https://www.swi-prolog.org/\">SWI-Prolog</a> (<a href=\"https://swi-prolog.discourse.group/t/wiki-discussion-generating-cytoscape-js-graphs-with-swi-prolog/2816/9?u=ericgt\">reference</a>). As you noted, I have also used other simple servers to host such pages dynamically.</p>\n<p>The final goal is to include a single HTML page in the GitHub repository so that a user who wants to experiment with the graph would not need to understand how to set up a web server or install additional software, and thus this would not require the maintenance of a web server after the project is done. <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span></p>",
        "id": 477651140,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1729256615
    },
    {
        "content": "<p>just an FYI if you weren't aware: there is a github workflow action that re-generates data on commits, so if you were to integrate your tool upstream you'd get this for free, e.g. graphiti/equation explorer do this for the data they consume. And GitHub also provides free hosting, e.g. the dashboard/equation explorer/graphiti all run for free</p>",
        "id": 477652459,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729257006
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"761203\">Vlad Tsyrklevich</span> <a href=\"#narrow/channel/458659-Equational/topic/Equation.20Explorer.20Enhancements/near/477652459\">said</a>:</p>\n<blockquote>\n<p>there is a github workflow action that re-generates data on commits</p>\n</blockquote>\n<p>Thank you. </p>\n<p>I did not know this and will definitely take a look.</p>",
        "id": 477652672,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1729257092
    },
    {
        "content": "<p><code>.github/workflows/blueprint.yml</code></p>",
        "id": 477652837,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729257138
    },
    {
        "content": "<p>By the way, even if the implicit/explicit distinction is not currently utilized in Equation Explorer, I think it could potentially do so in the future, e.g., through <a href=\"https://github.com/teorth/equational_theories/pull/343\">equational#343</a>.</p>",
        "id": 477670580,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729262360
    },
    {
        "content": "<p>I think that tool probably makes more sense outside of equation explorer (though I'm not particularly qualified to comment on what such a tool requires)</p>",
        "id": 477671233,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729262533
    },
    {
        "content": "<p>It would also be nice to be able to:<br>\n1) Search by equation name: Astérix, Obélix, Dupont, Dupond, Ramanujan, Hardy, Littlewood...<br>\n2) Filter by properties, like Austin law, or properties with respect to the implication graph.</p>",
        "id": 477910774,
        "sender_full_name": "Jose Brox",
        "timestamp": 1729443645
    },
    {
        "content": "<p>I guess a text search of the commentary files could be triggered if the search box input does not parse as a number or an equation. Also a minor thing: pressing “enter” in the search box does not currently trigger search.</p>",
        "id": 477918892,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729451375
    },
    {
        "content": "<p>As an amateur trying to grasp the landscape of equational laws, one question that I often end up pondering is: What could a law that is slightly weaker or slightly stronger than some other law look like? This questions is essentially a generalization of the MathOverflow <a href=\"https://mathoverflow.net/questions/450890/is-there-an-identity-between-the-commutative-identity-and-the-constant-identity\">question</a> question that provided some of the background for the project.</p>\n<p>I'd love to somehow use Equation Explorer to identify equations that \"as directly as possible\" implies, or are implied by, an equation. By \"directly\" I mean that there are no (as of yet identified) equivalence classes between the equations in the implication graph. I realize that this \"directness\" is an artifact of the set of laws the project considers. If we were to expand the set to e.g. laws using five operations, we'd get different results. Still, I feel like this way of navigating the graph is interesting and useful in an orthogonal way to what can be done in EE today.</p>\n<p>Perhaps better suited in another thread, but I realize this goes for Graphiti as well. Being able to filter the visualized graph by only drawing laws that are within a certain number of implication steps away from some origin would be nice.</p>",
        "id": 477990722,
        "sender_full_name": "Harald Husum",
        "timestamp": 1729499032
    },
    {
        "content": "<p>As the proofs are transitively reduced, a good approximation of this is using the \"Show only explicit proofs\" option</p>",
        "id": 477991145,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1729499157
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"767479\">Harald Husum</span> <a href=\"#narrow/channel/458659-Equational/topic/Equation.20Explorer.20Enhancements/near/477990722\">said</a>:</p>\n<blockquote>\n<p>Perhaps better suited in another thread, but I realize this goes for Graphiti as well. Being able to filter the visualized graph by only drawing laws that are within a certain number of implication steps away from some origin would be nice.</p>\n</blockquote>\n<p>Yeah I've thought about this, it shouldn't be too hard to only display vertices a given depth away from some vertex, it just starts to get hard sometimes to make different search options compose well with these more complicated query forms. Not to say that they shouldn't be implemented though, that's just what's stopped me from doing it so far.</p>",
        "id": 478017126,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729506503
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"690858\">Daniel Weber</span> <a href=\"#narrow/channel/458659-Equational/topic/Equation.20Explorer.20Enhancements/near/477991145\">said</a>:</p>\n<blockquote>\n<p>As the proofs are transitively reduced, a good approximation of this is using the \"Show only explicit proofs\" option</p>\n</blockquote>\n<p>I would be curious how that feature works with the duality support in the closure code actually. (Also while implications are mostly reduced, there are still some theorems outside of the reduction in the repo.)</p>",
        "id": 478017452,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729506605
    },
    {
        "content": "<p>But this question fundamentally seems to be asking a question you could answer by visualizing one forward/backward edge away in graphiti, so perhaps that's the right tool for the job instead of adding yet another mode to EE.</p>",
        "id": 478017726,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729506696
    },
    {
        "content": "<p>As you point out, Graphiti is also well suited to cater to this need. Perhaps better suited. As long as I have a tool to reach for, I don't particularly mind which one it is.</p>",
        "id": 478047669,
        "sender_full_name": "Harald Husum",
        "timestamp": 1729513790
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"761203\">Vlad Tsyrklevich</span> <a href=\"#narrow/channel/458659-Equational/topic/Equation.20Explorer.20Enhancements/near/477622538\">said</a>:</p>\n<blockquote>\n<p>Basically we could make that loop 10 or 40 [(4694/1450)^2 or (4694/725)^2] times faster depending on how we process the graph, but perfect shouldn't be the enemy of good.</p>\n</blockquote>\n<p>still slow, but better <a href=\"https://github.com/teorth/equational_theories/pull/705\">https://github.com/teorth/equational_theories/pull/705</a> Caching would help, but now loading the raw data is starting to be ~half the load time so there's less benefit</p>",
        "id": 478161450,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729549661
    },
    {
        "content": "<p>Deleting the 'Try this' links improves equation page load times another ~360ms. I don't think they're worth noticeable delay, but I'll let others decide. It's also possible that there's a better way of rendering them, but I don't know much about web optimization</p>",
        "id": 478161717,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729549780
    },
    {
        "content": "<p>Maybe we could disable \"try this\" by default, and then load them if a relevant checkbox is enabled?</p>",
        "id": 478165521,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729551500
    }
]