[
    {
        "content": "<p>Hello all, I'm writing an article about the Equational Theories Project so that other math beginners and school students like me can learn about the concepts involved. I limited my article to equations with only 0 or 1 instances of the binary operation which gives 5 unique laws and 20 possible implications to be proven or disproven. This is what I came up with:</p>\n<p><a href=\"/user_uploads/3121/1ge4w2HXw8_fIZCAILW0OJB_/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/1ge4w2HXw8_fIZCAILW0OJB_/image.png\" title=\"image.png\"><img data-original-dimensions=\"1442x1226\" src=\"/user_uploads/thumbnail/3121/1ge4w2HXw8_fIZCAILW0OJB_/image.png/840x560.webp\"></a></div><p>Does this seem alright?</p>\n<p>It would really help me if some of you could check <a href=\"https://docs.google.com/document/d/11J6D6RLu-zQhheCJaY8b84qpait8aN4ClmaPCV8fAzc/edit?usp=sharing\">my draft</a> and give suggestions for improvement. Thanks :)</p>",
        "id": 475844455,
        "sender_full_name": "Riya",
        "timestamp": 1728476181
    },
    {
        "content": "<p>You can take a look at <a href=\"https://teorth.github.io/equational_theories/graphiti/?render=true&amp;max_operations=1\">https://teorth.github.io/equational_theories/graphiti/?render=true&amp;max_operations=1</a></p>",
        "id": 475844838,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1728476290
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"690858\">@Daniel Weber</span> Thanks, that's quite helpful (and this graph is simpler than mine). In fact, I might include the graph for max_operations=2 from here in my article :) Though, shouldn't the edges have arrows to show directions of the implication?</p>",
        "id": 475848687,
        "sender_full_name": "Riya",
        "timestamp": 1728477354
    },
    {
        "content": "<p>The convention is that the implications are from bottom to top</p>",
        "id": 475860119,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1728479618
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"765022\">Riya</span> <a href=\"#narrow/stream/458659-Equational/topic/Explaining.20the.20Equational.20Theories.20Project.20to.20Math.20Beginners/near/475848687\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"690858\">Daniel Weber</span> Thanks, that's quite helpful (and this graph is simpler than mine). In fact, I might include the graph for max_operations=2 from here in my article :) Though, shouldn't the edges have arrows to show directions of the implication?</p>\n</blockquote>\n<p>At the moment it is using the Hasse diagram convention as Daniel mentioned, though I suppose it would not be hard to just add a button that allowed you to have the implication arrowheads if you liked. I've added it to my TODO list</p>",
        "id": 475875774,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1728483355
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"765022\">@Riya</span> if you're pre-uni, this is a great effort! Here ar some comments.</p>\n<ul>\n<li>\n<p>I don't think it's true that \"Even now, there are very few instances of people working together to solve a big problem\"; collaboration at small scale (groups of up to 5 people) is commonplace. It's groups of 10 or 20 or more people which are extremely rare in mathematics, although they're very common in other branches of science. That's the new/exciting thing here -- not \"more than 1\" but \"more than 10\" people working on a project.</p>\n</li>\n<li>\n<p>After your example of the table of size 3 I would be tempted to stress that the point is that there isn't a pattern in the answer, and that this is the point: each of those 9 entries can be any of a,b,c and you can get thousands of different magmas this way, even of size 3.</p>\n</li>\n<li>\n<p>Eq2: x = y. My impression is that you haven't really stressed that what this equation means is that <em>for all x and y in the set</em>, x = y. Maybe worth stressing at this point? And you could then hammer home the argument that this shows that the magma must have at most 1 element, because if there were 2 or more elements then you could let x and y be different elements and there's your contradiction. </p>\n</li>\n<li>\n<p>Eq3: I object to your \"it basically means that multiplying by x twice has the same effect as multiplying by x once\". It means what it says (every element is its own square). If you multiply a random element a by x twice then you get <code>(a * x) * x</code>, which is not in general the same as <code>a * (x * x)</code> so you can't prove it's the same as multiplying by it once. </p>\n</li>\n<li>\n<p>I think your table could be simplified, which would make it easier to read. Just deal separately with the two observations that everything implies 1, and 2 implies everything, and now your table is half the size. This makes it easier to focus on the more interesting arguments. And I would be tempted to define some examples of magmas outside the table (especially if they give counterexamples to more than one implication) rather than defining the examples inside the table. Big tables are just a bit intimidating and here there's clearly potential to make things smaller.</p>\n</li>\n</ul>\n<p>But overall this looks like a very nice and accessible summary. My instinct would not be to feel like you have to either stick here or go to \"all magmas where <code>*</code> is mentioned twice\" (which will make things much longer). If you want to go further I would suggest introducing new magmas one at a time, e.g. you might want to consider <code>x * y = y * x</code> which is a law which is familiar to many of your readers, and explain how that fits into the picture. Now ask yourself if things have already gotten a bit unwieldy, and quit while you're ahead. If you still want to do more then instead of being all-inclusive you could just talk about random examples e.g. this law does or doesn't imply that one, rather than introducing new laws and then feeling obliged to fill in all implications which you can now write down.</p>",
        "id": 475876070,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1728483409
    },
    {
        "content": "<p>Maybe it helps to describe how conventional mathematics projects of under 10 people work and why it doesn't get bigger.</p>\n<p>At least in the algorithms community, we typically discuss a problem, in person if possible, and with a whiteboard. Once people agree on the problem there are hours and hours of staring at the whiteboard and scribbling things. Then people take the lead on writing up on pieces of the problem that they helped find a solution for. A latex document is setup, where someone organises the content and people write out their parts. Note that this doesn't mean people don't know or understand the stuff others wrote. There is a lot of discussion and cross checking and re-drafting to make the proofs fit together. A lot of human effort goes into this process and to some small  extent there is an element of trust that everyone was thorough with their work, because writing every little detail is not feasible.</p>",
        "id": 475885569,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728485388
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/stream/458659-Equational/topic/Explaining.20the.20Equational.20Theories.20Project.20to.20Math.20Beginners/near/475885569\">said</a>:</p>\n<blockquote>\n<p>ics projects of under 10 people work and why it doesn't get bigger.</p>\n<p>At least in the algorithms community, we typically discuss a problem in person if possible, and with a whiteboard. Once people agree on the problem there are hour and hours of staring at the whiteboard and scribbling things. Then people take the lead on writing up on pieces of the problem that they helped find a solution for. A latex document is setup, where someone organises the content and people write out their parts. Note that this doesn't mean people don't know or understand the stuff others wrote. There is a lot of discussion and cross checking and re-drafting to make the proofs fit together. A lot of human effort goes into this process and to some small extent there is an element of trust that everyone was thorough with their wo</p>\n</blockquote>\n<p>This is also a perfect description of how it works in pure mathematics except we use blackboards, not whiteboards.</p>",
        "id": 475906237,
        "sender_full_name": "Will Sawin",
        "timestamp": 1728489534
    },
    {
        "content": "<p>I have two boxes of hagoromo chalks and I have to find opportunities to use them because the only blackboards we have are in a couple of lecture rooms. It's whiteboards everywhere.</p>",
        "id": 475906804,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728489707
    }
]