[
    {
        "content": "<p>Hello,</p>\n<p>I'm new here and mostly interested in machine learning applications for automated theorem provers (ATPs).</p>\n<p>I'm curious about roughly how many of the 10,657 explicitly true relations were (or could be) proven by ATP. </p>\n<p>From what I've gathered, it seems out of <a href=\"https://teorth.github.io/equational_theories/dashboard/\">10,657</a> explicitly true relations, about 1,775 were proved by (<a href=\"https://teorth.github.io/equational_theories/blueprint/vampire-chapter.html\">Vampire</a>), 5,574 were identified by <a href=\"https://teorth.github.io/equational_theories/blueprint/egraphs-chapter.html#a0000000048\">MagmaEgg</a> (though many were later found to be implied), and 86 by <a href=\"https://teorth.github.io/equational_theories/blueprint/egraphs-chapter.html\">lean-egg</a>.</p>\n<p>I also noticed from Terence Tao's log that all explicitly true relations were established quite early on (by day <a href=\"https://github.com/teorth/equational_theories/wiki/Terence-Tao's-personal-log#day-16-oct-11\">14–16</a>). Meaning more than 3,500 of the proofs were found manually in 2 weeks! But is it because these were too easy, or too hard to give to ATPs?</p>\n<p>Thanks!</p>",
        "id": 504083756,
        "sender_full_name": "Ruhollah Majdoddin",
        "timestamp": 1741350845
    },
    {
        "content": "<p>It's a bit hard to give meaningful numbers here because at some point we transitively reduced the set of explicitly true relations to a smaller generating subset, so any statistics reported before that reduction are no longer accurate.  We had proposed (in <a href=\"https://github.com/teorth/equational_theories/pull/171\">equational#171</a>) something like a daily dump of what the current status of the implication graph was at any given point in time, which would allow for some automated way to answer your question, though we never did get around to it.  It's still in principle possible to do with due to the ability to roll back the git repository, but this would require some effort.</p>\n<p>The early phase of the project included a \"Subgraph\" subproject which generated a few dozen implications (mostly trivial in nature).  Some of these are still in the codebase as legacy relations, but I think at some point there was a large-scale Vampire run which was able to prove all of the explicitly true relations though.</p>\n<p>See also the previous thread <a class=\"stream-topic\" data-stream-id=\"458659\" href=\"/#narrow/channel/458659-Equational/topic/What.20are.20the.20hardest.20positive.20implications.20for.20an.20ATP.3F/with/484160998\">#Equational &gt; What are the hardest positive implications for an ATP?</a></p>",
        "id": 504126241,
        "sender_full_name": "Terence Tao",
        "timestamp": 1741362463
    },
    {
        "content": "<p>Thank you for the answer. It seems that this wasn't really a challenge for ATPs, as they  could easily beat all the explicitly true relations.</p>\n<p>So  I am curious about the follow up projects—how challenging would they be  for ATPs?<br>\n Will it be the Hasse diagram but for equations that use magma operations many more times (not just four), <br>\nor will it be, as Pace Nielsen <a href=\"https://terrytao.wordpress.com/2024/09/25/a-pilot-project-in-universal-algebra-to-explore-new-ways-to-collaborate-and-use-machine-assistance/#comment-685891\">suggests</a>, the Euler diagram between Boolean combinations of the identities. </p>\n<p>In either case, I assume it would be the job of ATPs for FOL to prove the true relations. Or a more specialized ATP would be a better fit? Even if that ATP needs to be developed.</p>",
        "id": 504655186,
        "sender_full_name": "Ruhollah Majdoddin",
        "timestamp": 1741629858
    }
]