[
    {
        "content": "<p>There are some peculiar experimental results I'm getting, which make me suspect that all (or almost all) remaining implications are false. Essentially, they are \"Vampire can prove all true implications I know of in &lt;0.05s, and running it with a time limit of 5 seconds there are no further implications it can prove.\" Another explanation, of course, is that there is some kind of huge gap between \"easy\" implications and \"hard\" implications, but it feels to me like that makes less sense</p>",
        "id": 475102133,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1728223286
    },
    {
        "content": "<p>I'm hoping a run of linear magmas may clarify things further.  From the few data points we have it seems that many remaining implications are in fact easily refuted by linear magmas, they were simply missed in the earlier quadratic runs because linear laws are too sparse a subset of the quadratic laws.  </p>\n<p>The hardest positive implication I know of was 1689 -&gt; 2.  How long does this take on Vampire?  Are there any other ones that take Vampire even longer?</p>",
        "id": 475106664,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728227277
    },
    {
        "content": "<blockquote>\n<p>Another explanation, of course, is that there is some kind of huge gap between \"easy\" implications and \"hard\" implications, but it feels to me like that makes less sense</p>\n</blockquote>\n<p>I am not at all convinced. Vampire is pretty much the state-of-the-art in first-order theorem proving, and has been for a while. It can establish a lot of easy stuff quickly. And yet, year-by-year, CADE comes up with easy problems that it can't solve (and sometimes older not SoTA provers, like Prover9, can! This happened in e.g. 2020.) </p>\n<p>Moreover, Prover9 used to be state-of-the-art too. This project could have started back then, and then we would actually see the graph split into faux \"easy\" and \"hard\" implications, with Prover9 handling the \"easy\" ones quickly, and the hard ones not at all!</p>\n<p>I think e.g. 65 might imply 3862. It's easy to prove that there are no finite counterexamples, and while I didn't give it more than 30 mins of thought, I had a hard time imagining what infinite counterexamples could look like.</p>",
        "id": 475106869,
        "sender_full_name": "Zoltan A. Kocsis (Z.A.K.)",
        "timestamp": 1728227425
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> <a href=\"#narrow/stream/458659-Equational/topic/Is.20it.20plausable.20that.20all.20remaining.20implications.20are.20false.3F/near/475106664\">said</a>:</p>\n<blockquote>\n<p>I'm hoping a run of linear magmas may clarify things further.  From the few data points we have it seems that many remaining implications are in fact easily refuted by linear magmas, they were simply missed in the earlier quadratic runs because linear laws are too sparse a subset of the quadratic laws.  </p>\n<p>The hardest positive implication I know of was 1689 -&gt; 2.  How long does this take on Vampire?  Are there any other ones that take Vampire even longer?</p>\n</blockquote>\n<p>It takes 0.05s. I had a histogram somewhere, but I can't find it now. I'll try to search again</p>",
        "id": 475107003,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1728227539
    },
    {
        "content": "<p>It might be fun to publish a list of Vampire-hard implications on the web page.  With a link to a lean playground to challenge humans to solve them.  UPDATE: proposed at <a href=\"https://github.com/teorth/equational_theories/pull/370\">equational#370</a></p>",
        "id": 475107586,
        "sender_full_name": "Terence Tao",
        "timestamp": 1728228068
    },
    {
        "content": "<p>Once we add stuff Vampire can disprove but we can't formalize yet as conjectures that should be possible in the equation explorer</p>",
        "id": 475107740,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1728228233
    },
    {
        "content": "<p>How stable is vampire under adding additional binary operations? To me after pondering the problem of whether 65 implies 3862 it seemed like it was clearer if you express 65 as two equations in two binary operations *, o given by y * (y o x) =x and y o x = x * (y * x)  (where o is the original one). Could that possibly affect the difficulty of a proof or disproof?</p>",
        "id": 475109361,
        "sender_full_name": "Will Sawin",
        "timestamp": 1728229681
    },
    {
        "content": "<p>It doesn't seem to help</p>",
        "id": 475109729,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1728229990
    },
    {
        "content": "<p>As a general rule, additional symbols tend to hinder instead of help the current generation of ATPs (you can engineer exceptions, of course). Indeed, some include heuristics specifically to detect and eliminate operations that are definable from others.</p>",
        "id": 475109941,
        "sender_full_name": "Zoltan A. Kocsis (Z.A.K.)",
        "timestamp": 1728230193
    }
]