[
    {
        "content": "<p>Does there exist (equational) laws strictly between the singleton law and the constant law? If so, how many operations are needed to express them?</p>",
        "id": 479378430,
        "sender_full_name": "Harald Husum",
        "timestamp": 1730159576
    },
    {
        "content": "<p>All non-trivial constant magmas satisfy exactly the same set of laws (those laws with at least one application of the operation on both sides, as well as the trivial law <code>x=x</code>), so the answer is \"no\".</p>",
        "id": 479378667,
        "sender_full_name": "Terence Tao",
        "timestamp": 1730159769
    },
    {
        "content": "<p>That implies one can divide the edges in the Hasse diagram into two classes - let me call them atomic and non-atomic. The edge between the singleton law and the constant law can be called atomic because it won't be replaced by a more complex structure if we were to look into laws with more operations. Other edges clearly hide further equivalence classes and can be considered non-atomic.</p>\n<p>I'm sure this observation has been made already and that there is better terminology for this.</p>\n<p>In general, do we know which edges are atomic or not? Are there further examples of atomic ones, presumably on the \"strong\" side of the Hasse diagram?</p>",
        "id": 479380545,
        "sender_full_name": "Harald Husum",
        "timestamp": 1730161116
    },
    {
        "content": "<p>Instead of atomicity, I guess one can talk about \"completeness\". 2 ⇒ 46 is a connection  in a cut-set of the Hasse diagram that is \"complete\" in the sense that there is nothing more to discover as one generalizes the project to more operations.</p>\n<p>If this \"complete\" cut-set is nontrivial, it is in it self an interesting structure to keep track of. My intuition on this is poor, but I'm imagining that such a subset could grow as the number of operations under consideration grows, albeit at a slower rate than the overall Hasse diagram.</p>",
        "id": 479417966,
        "sender_full_name": "Harald Husum",
        "timestamp": 1730188044
    }
]