[
    {
        "content": "<p>Since we are talking about ways to analyze a given equation, I'd like to share an unpolished idea I had to construct infinite magmas and try to solve Astérix/Obélix (then it was solved). I don't know if it has any merit, perhaps it is equivalent to other already existing methods, or perhaps someone with more tools to automate computations can actually apply it with ease:</p>\n<p>The idea is vaguely inspired by surreal numbers or Dedekind cuts: our set M is composed by cuts, which are pairs of sets, or pairs of pairs, or something similar, written in notation (a|b) (with a,b again in M). Then we try to write a product satisfying an specific equation, by guessing and imposing relations involving the left and right cuts, until we find a (finite or recursive) completion (this is if our \"forcing\" is not too restrictive, for which one can look at anti-implications, etc.).</p>\n<p>For example, for the Astérix equation x = y(x(yx)) one would start with the following rules, valid only when \"everything is disjoint enough\":<br>\nyx = (x|y)<br>\nx(x|y) = (x|y)<br>\ny(x|y) = x<br>\nThen one would, if lucky, iteratively resolve the ambiguities.</p>\n<p>Does anyone have any thoughts on this?</p>",
        "id": 477090870,
        "sender_full_name": "Jose Brox",
        "timestamp": 1729036578
    },
    {
        "content": "<p>My initial reaction is that it is quite challenging to enforce all of these rules for all values of x and y without creating contradictions between the rules. There were some early attempts to create models of Asterix in this fashion which obeyed that law in some ranges of variables, but not all.</p>",
        "id": 477098274,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729041176
    },
    {
        "content": "<p>Thinking of an algorithm.<br>\nCould this type of work be done by multiple workers doing different cuts and communicating about the results until the task is solved? Could that communication in any way help the workers with additional information avoid contradictions better?</p>",
        "id": 477123395,
        "sender_full_name": "Michael Bucko",
        "timestamp": 1729055242
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"672170\">Michael Bucko</span> <a href=\"#narrow/stream/458659-Equational/topic/Magmas.20from.20cuts/near/477123395\">ha dicho</a>:</p>\n<blockquote>\n<p>Thinking of an algorithm.<br>\nCould this type of work be done by multiple workers doing different cuts and communicating about the results until the task is solved? Could that communication in any way help the workers with additional information avoid contradictions better?</p>\n</blockquote>\n<p>Thank you for thinking about this!<br>\nI'm not that sure about parallelization: you need to do saturation as in other cases. E.g., Astérix would be solved by the above, except that at the start, we may have x=(a|y) and then instead of yx=(x|y) we would have yx=a by the third rule, so we have to follow that case and see what happens, then impose any relation that is not yet fixed and is not incompatible with the previous ones... So it is a very sequential process in my opinion, in which in addition you may get infinite metarules of the form x(x|y|y...|y)=x and the such.</p>",
        "id": 477274609,
        "sender_full_name": "Jose Brox",
        "timestamp": 1729102999
    },
    {
        "content": "<p>Assuming the process seems to be strongly sequential, I have a couple of questions:</p>\n<ul>\n<li>can we potentially speculatively parallelize (ie. aggressively predict certain outcomes and continue the work given certain assumptions across multiple workers)?</li>\n<li>is there any overlap in the work between across different steps?</li>\n<li>can this problem be perhaps seen from the dependency graph perspective? (different paths, shortest paths etc.)</li>\n<li>can any information be broadcasted across steps? (some rules)</li>\n</ul>",
        "id": 477282897,
        "sender_full_name": "Michael Bucko",
        "timestamp": 1729105844
    }
]