[
    {
        "content": "<p>There seems to be three different ways of computing the transitive closure of implications and I've lost the overview of which one is which (or why there's three different ones). There's:</p>\n<ul>\n<li><code>scripts/extract_implications.lean</code> I thought this was the canonical one, as it actually checks the Lean implications, and it seem to be used by <code>generate_dashboard.py</code></li>\n<li><code>scripts/transitive_closure.rb</code> which seems to be used by <code>graph.rb</code> and <code>generate_graphviz_graph.rb</code></li>\n<li><code>scripts/process_implications.py</code> which seems to be used by <code>generate_imaghe.py</code> and <code>generate_most_wanted_list.py</code>. </li>\n</ul>\n<p>Is it just three concurrent efforts to do this? Can we agree one a single one that's going to be the ground truth?</p>\n<p>(I'm asking for <a href=\"https://github.com/teorth/equational_theories/pull/174\">equational#174</a> to know where we should calculate this, but I think it's a more general question)</p>",
        "id": 474966452,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1728122818
    },
    {
        "content": "<p>I think ground truth should be <code>lake exe extract_implications --closure</code>, but the others are still useful for tooling and re-computing things so they should stick around</p>",
        "id": 474971201,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1728127040
    },
    {
        "content": "<p>Author of process_implications here. Everything it does is included in the extract_implications.<br>\nI looked at the 2 scripts that import it, they only use it for parsing, which is provided by \"extract_implication raw\". And actually, both scripts only calculate the transitive closure of implications and not of non-implications, so they better use \"extract_implications outcomes\" instead to get that closure too.</p>",
        "id": 474971298,
        "sender_full_name": "Amir Livne Bar-on",
        "timestamp": 1728127074
    },
    {
        "content": "<p>yeah so the ruby and python implementation authors both say use <code>extract_implications</code> as ground truth</p>",
        "id": 474971645,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1728127195
    }
]