[
    {
        "content": "<p>I just realized that as a byproduct of filing a progress report for my NSF grant, all of my collaborators (including multiple people here) will have received an email asking to confirm your participation in the project.  Sorry for the hassle, this is a bureaucratic reporting requirement that has been implemented by the NSF in recent years.</p>\n<p>In my reporting I may have reported your affiliation / support information inaccurately; feel free to correct it as appropriate.</p>",
        "id": 563937945,
        "sender_full_name": "Terence Tao",
        "timestamp": 1765838048
    },
    {
        "content": "<p>So far I haven’t received a request and there is a fairly high chance my institute’s email spam detection will block it before I ever get that email</p>",
        "id": 563938529,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1765838397
    },
    {
        "content": "<p>Speak of the devil. I just got it.</p>",
        "id": 563938576,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1765838423
    },
    {
        "content": "<p>It asks for basic demographic information. Affiliations are not mentioned</p>",
        "id": 563939265,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1765838849
    },
    {
        "content": "<p>Project Title: Structure theory for measure-preserving systems, additive combinatorics, and correlations of multiplicative functions</p>\n<p><span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 563939644,
        "sender_full_name": "Douglas McNeil",
        "timestamp": 1765839115
    },
    {
        "content": "<p>Yeah, that's the title of my NSF grant, awarded two years ago.  The connection to Equational Theories is <em>very</em> tangential, to put it mildly, but I did technically work on ETP while receiving NSF support, so I felt obligated to report it.</p>",
        "id": 563939777,
        "sender_full_name": "Terence Tao",
        "timestamp": 1765839208
    },
    {
        "content": "<p>We'll have to formalize the connection in subsequent work :)</p>",
        "id": 563947695,
        "sender_full_name": "Cody Roux",
        "timestamp": 1765844898
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"657719\">Terence Tao</span> <a href=\"#narrow/channel/458659-Equational/topic/NSF.20information.20request/near/563937945\">ha dicho</a>:</p>\n<blockquote>\n<p>all of my collaborators (including multiple people here) will have received an email asking to confirm your participation in the project</p>\n</blockquote>\n<p>I haven't received the email (nor in the spam folder). Just saying in case we need to do something about it.</p>",
        "id": 564218598,
        "sender_full_name": "Jose Brox",
        "timestamp": 1765967775
    },
    {
        "content": "<p>I don't think it is mandatory; NSF is interested in self-reported demographic data but as far as I know this is not a prerequisite for funding.</p>",
        "id": 564287674,
        "sender_full_name": "Terence Tao",
        "timestamp": 1765987461
    }
]