[
    {
        "content": "<p>Currently, the universally quantified variables we use for equations are ordered <code>x y z w u v</code>.  This is not in alphabetical order, and also does not obviously continue into a seventh variable in the possible scenario that we may need to introduce such variables somehow.  In <a href=\"https://github.com/leanprover-community/mathlib4/pull/170\">#170</a>, the alternate ordering <code>x y z w v u</code> was proposed, which could then continue downwards alphabetically for 20 more variables without difficulty.  One could also just use the usual alphabetical ordering <code>a b c d e f</code>, or index <code>x</code> by natural numbers or positive integers.  Given the high participation rate of previous polling, it seems this issue is another one that could be settled by a poll, so here we go.</p>",
        "id": 474205625,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727851156
    },
    {
        "content": "<p>/poll How should universally quantified variables be ordered?<br>\nx y z w u v (current ordering)<br>\nx y z w v u<br>\na b c d e f<br>\nx0 x1 x2 x3 x4 x5<br>\nx1 x2 x3 x4 x5 x6</p>",
        "id": 474205944,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727851231
    },
    {
        "content": "<p>Hmm, while there seems to be reasonable consensus to change the ordering of variables, there is not strong consensus on what to change the ordering <em>to</em>.  Some more discussion on this thread might be appropriate.</p>\n<p>Furthermore, I would like to discuss the technical challenges of implementing a refactor.  Changing the blueprint text is of course trivial.  Changing <code>Equations.lean</code> and <code>AllEquations.lean</code> should also be easy, as well as the auto-generated list of equations such as <a href=\"https://github.com/teorth/equational_theories/blob/main/data/equations.txt\">https://github.com/teorth/equational_theories/blob/main/data/equations.txt</a> , but we should also change any software that generates such lists.</p>\n<p>As for the already millions of existing Lean proofs that (implicitly or explicitly) use the current ordering... perhaps they can just be left untouched?  I believe changing the variable names will keep all <code>EquationX</code> definitions syntactically equivalent, and so if a legacy proof introduces variables with the \"wrong\" names, Lean should still compile.  Of course going forward it would be good to align the notation of any computer generated proofs with the new naming, but I don't see it as a priority to make sure the legacy proofs have exactly the same notation.  But maybe I'm missing something, would be happy to hear more thoughts.</p>",
        "id": 474366011,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727893041
    },
    {
        "content": "<p>Given the lack of consensus on what new ordering of variables to switch to, I am proposing that we keep the status quo at present.  However, if someone wishes to push for a new ordering, and is also willing to perform the refactor needed, I will keep the discussion open here so that they may make a proposal.</p>",
        "id": 474623067,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727970250
    },
    {
        "content": "<p>I think the refactor is the big dampener here. Because the project has grown organically people will be hesitant to fix other people's code.</p>",
        "id": 474630848,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727971847
    }
]