[
    {
        "content": "<p>Just for fun I started working on some local scripts to try to generalize the 2 simple proofs we have of Austin pairs to other non-implications. I've hit the roadblock that it is not possible to derive the list of non-implications without finite proofs without resorting to some ugly hacks. I built a small proof-of-concept locally, changing one (finite) non-implication from <code>∃ (G : Type) (_ : Magma G), Facts G [...] [...]</code> to <code>∃ (G : Type) (_ : Magma G) (_: Finite G), Facts G [...] [...]</code> and then plumbing support for this through the <code>@[equational_result]</code> attribute into <code>lake exe extract_implications</code> to pull this data out.</p>\n<p>My proposal is to add support for this upstream, first adding support for parsing this form of theorem correctly, and then going through and re-factoring all non-implications we have in the repository to explicitly add the Finite typeclass where appropriate. I think it would also be interesting to then consider adding <code>Infinite</code> to the rest, and if no issues come up then enforcing that new non-implications have one of the two going forward to keep this from rotting.</p>\n<p>I am not experienced with Lean, so objections or design suggestions are very welcome!</p>",
        "id": 477933508,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729463828
    },
    {
        "content": "<p>Outside of the Austin pair motivation, I think it may also be interesting to see if there are non-implications that we did not discover at the beginning because they are only captured by large finite magmas and we were able to rule them out with infinite constructions before realizing they had this property. In the other direction, if there is some 'abstract nonsense' way to construct infinite counterexamples from finite ones then it would be possible to prove that they are as complete as the set of all known non-implications, though whether this is difficult/trivial/interesting to others is not something I can answer.</p>",
        "id": 477933762,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729464074
    },
    {
        "content": "<p>That's a nice extension to the original project (namely, to calculate the \"finite magma implication graph\" as well as the \"arbitrary magma implication graph\", the former being the latter minus the Austin pairs).  If there is some relatively painless way to add <code>Finite</code> tags to the (99% of the) anti-implications that were disproven by finite means, that would certainly help with this extended version of the project.</p>\n<p>We know that all commutative linear counterexamples have a finite model (this observation in fact basically goes back to the original paper of Austin, and was recently formalized (<a href=\"https://github.com/teorth/equational_theories/pull/442\">equational#442</a>).  On the other hand, the greedy constructions are inherently infinitary in nature, and they have been used to resolve anti-implications (Asterix &lt;-&gt; Obelix, Dupont &lt;-&gt; Dupond, Hardy -&gt; Ramanujan, etc.) that are known to be immune to finite models.  They also have been used to resolve implications for which we don't know how to use finiteness (and, as <span class=\"user-mention\" data-user-id=\"230900\">@Will Sawin</span> observed some time ago, all of our uses of finiteness boil down to one trick, namely to pass from injectivity to surjectivity or vice versa).  To give one recent example, we can now construct greedy (translation-invariant) countermodels of 3308, but it's not clear at all what happens if we require finiteness here.</p>",
        "id": 477935783,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729466109
    },
    {
        "content": "<p>Are there any examples of nonimplications where counterexamples are necessarily <em>finite</em>? The only case that comes to mind is that a model of the singleton law is necessarily a singleton, but this will not feature in any counterexamples.</p>",
        "id": 477939093,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1729469242
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/channel/458659-Equational/topic/Proposal.3A.20Add.20Finite.20typeclasses.20to.20non-implications/near/477939093\">said</a>:</p>\n<blockquote>\n<p>Are there any examples of nonimplications where counterexamples are necessarily <em>finite</em>? The only case that comes to mind is that a model of the singleton law is necessarily a singleton, but this will not feature in any counterexamples.</p>\n</blockquote>\n<p>No, since for every non-singleton finite model you can take an infinite product of copies of it which is infinite but satisfies all the same laws.</p>",
        "id": 477939172,
        "sender_full_name": "Will Sawin",
        "timestamp": 1729469332
    },
    {
        "content": "<p>Oh, that's a nice result to have</p>",
        "id": 477939275,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1729469412
    },
    {
        "content": "<p>That does mean that it's unnecessary to have a <code>`∃ (G : Type) (_ : Magma G) (_: Infinite G), ...</code> theorem since you can upgrade any counterexample to an infinite one</p>",
        "id": 477939319,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1729469488
    },
    {
        "content": "<p>I don't think you necessarily want to have a rule saying every counterexample must be one or the other, several proofs produce countable but not obviously infinite models, and abstract nonsense constructions like <code>FreeMagmaWithLaws</code> could go either way in general</p>",
        "id": 477939414,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1729469581
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/channel/458659-Equational/topic/Proposal.3A.20Add.20Finite.20typeclasses.20to.20non-implications/near/477939414\">said</a>:</p>\n<blockquote>\n<p>I don't think you necessarily want to have a rule saying every counterexample must be one or the other, several proofs produce countable but not obviously infinite models, and abstract nonsense constructions like <code>FreeMagmaWithLaws</code> could go either way in general</p>\n</blockquote>\n<p>Yeah, the main things of interest for this are (1) collecting all disproofs using models known to be finite and (2) automating proofs that implications hold in the finite case using the injective implies surjective step. There's no need to figure out if models that are not obviously infinite are in fact finite, until steps (1) and (2) both fail.</p>",
        "id": 477939892,
        "sender_full_name": "Will Sawin",
        "timestamp": 1729470026
    },
    {
        "content": "<p>I don't know of any painless way to add those tags in the main branch directly. . If your suggestion is to \"detect finite counterexample &gt; add attribute\" this will be hard and add merge conflicts to PRs which are also working on counterexamples. </p>\n<p>One dirty trick might be to generate new versions of each counterexample theorem with the extra  <code>[Finite G]</code> instance and copy the proofs verbatim, with an extra <code>let</code> declaration  that creates a <code>Finite</code> instance and tries to run \"interInstance\" on it. Then delete those theorems which have an error. I don't have enough metaprogramming skills to do this</p>",
        "id": 477940044,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729470209
    },
    {
        "content": "<p>Put these theorems in a separate folder and generate the Vitalstatistix of finite counterexamples from that folder</p>",
        "id": 477940121,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729470252
    },
    {
        "content": "<p>I don't wish to rule out the first option either, but we will need a metaprogramming expert to check whether that is feasible and implement it</p>",
        "id": 477940175,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729470322
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"230900\">Will Sawin</span> <a href=\"#narrow/channel/458659-Equational/topic/Proposal.3A.20Add.20Finite.20typeclasses.20to.20non-implications/near/477939892\">said</a>:</p>\n<blockquote>\n<p>Yeah, the main things of interest for this are (1) collecting all disproofs using models known to be finite and (2) automating proofs that implications hold in the finite case using the injective implies surjective step. There's no need to figure out if models that are not obviously infinite are in fact finite, until steps (1) and (2) both fail.</p>\n</blockquote>\n<p>I could try doing (2), but (1) should be done before that to avoid running on all implications which are known to have a finite counterexample</p>",
        "id": 477951321,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1729480011
    },
    {
        "content": "<p>Yeah, that should cut things down by 99% or so hopefully from the raw 13 million.  We could also look at extremal anti-implications (not implied by any other anti-implication) just to get started.   It's still going to be a far larger set though than the 88 (!) conjecturally open implications we have right now - we've relied a fair bit on infinitary methods (particularly confluence, saturation, and greedy methods) to get us to this point.</p>",
        "id": 477952047,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729480646
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/channel/458659-Equational/topic/Proposal.3A.20Add.20Finite.20typeclasses.20to.20non-implications/near/477940044\">said</a>:</p>\n<blockquote>\n<p>I don't know of any painless way to add those tags in the main branch directly</p>\n</blockquote>\n<p>There are only ~1k non-implication theorems on main and most of them are in a few auto-generated folders. I think this refactor should be fairly trivial.</p>\n<p>I also don't think it will lead to merge conflicts as 1) all of the active work is necessarily not on simple operator-table non-implications, and 2) anyways if it does lead to a merge conflict it should be a trivially resolvable one</p>",
        "id": 477961695,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729487905
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"230900\">Will Sawin</span> <a href=\"#narrow/channel/458659-Equational/topic/Proposal.3A.20Add.20Finite.20typeclasses.20to.20non-implications/near/477939892\">said</a>:</p>\n<blockquote>\n<p>(2) automating proofs that implications hold in the finite case using the injective implies surjective step</p>\n</blockquote>\n<p>This is exactly what I had begun doing before realizing I didn't have the data I needed.</p>",
        "id": 477961859,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729487999
    },
    {
        "content": "<p>I'll take a look at converting most of the auto-generated finite non-implications before submitting anything upstream, to ensure that I have a good working model first.</p>",
        "id": 477962241,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729488207
    },
    {
        "content": "<p>I was able to convert all but 11.5k non-implications in the closure with relatively little effort. I have to get some work done now, but I'll return to it this evening to clean it up and cover the remaining finite counterexamples.</p>",
        "id": 477973101,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729493258
    },
    {
        "content": "<p>We probably want to change the transitive reduction to only rely on finite-cardinality implications</p>",
        "id": 478010967,
        "sender_full_name": "Amir Livne Bar-on",
        "timestamp": 1729504728
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"761203\">Vlad Tsyrklevich</span> <a href=\"#narrow/channel/458659-Equational/topic/Proposal.3A.20Add.20Finite.20typeclasses.20to.20non-implications/near/477961695\">said</a>:</p>\n<blockquote>\n<p>all of the active work is necessarily not on simple operator-table non-implications</p>\n</blockquote>\n<p>Well, speak of the devil. (I still don't think it should be an issue though.)</p>",
        "id": 478095225,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729525948
    },
    {
        "content": "<p><a href=\"https://github.com/teorth/equational_theories/pull/702\">equational#702</a> is just the plumbing necessary to correctly parse Finite non-implications and report them in <code>extract_implications</code>, no theorems are updated yet (though that change has already been staged and tested locally.)</p>",
        "id": 478109244,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729530186
    },
    {
        "content": "<p>This has been merged, but a review would still be appreciated from anyone with more Lean experience</p>",
        "id": 478131506,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729537922
    },
    {
        "content": "<p><a href=\"https://github.com/teorth/equational_theories/pull/711\">equational#711</a> and <a href=\"https://github.com/teorth/equational_theories/pull/712\">equational#712</a> should finish this off by marking non-implications with the Finite typeclass. I've started generating some Austin pair proofs locally and next I'll work on trying to get finite implications wired into <code>extract_implications</code> locally and then propose something</p>",
        "id": 478214430,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729579345
    },
    {
        "content": "<p><a href=\"https://github.com/teorth/equational_theories/pull/729\">equational#729</a> completes this series and allows adding Finite to implications as well. Note that I've updated the extract_implications script to ignore finite implications by default and tested this. Comments welcome.</p>",
        "id": 478773365,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729793498
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"761203\">Vlad Tsyrklevich</span> <a href=\"#narrow/channel/458659-Equational/topic/Proposal.3A.20Add.20Finite.20typeclasses.20to.20non-implications/near/478773365\">schrieb</a>:</p>\n<blockquote>\n<p><a href=\"https://github.com/teorth/equational_theories/pull/729\">equational#729</a> completes this series and allows adding Finite to implications as well. Note that I've updated the extract_implications script to ignore finite implications by default and tested this. Comments welcome.</p>\n</blockquote>\n<p>Can you please elaborate on GraphEdge? It's not yet in the latest main.</p>",
        "id": 478775357,
        "sender_full_name": "Michael Bucko",
        "timestamp": 1729794320
    },
    {
        "content": "<p>GraphEdge is added in one of the commits in that PR: <a href=\"https://github.com/teorth/equational_theories/pull/729/commits/ec74640b0dba9045b835de72fd1db60f7cd21b2c\">https://github.com/teorth/equational_theories/pull/729/commits/ec74640b0dba9045b835de72fd1db60f7cd21b2c</a></p>\n<p>It's a refactor to not use the ParseImplications.Implication structure, as the Closure code was just using it as a general data structure to store edges, but that no longer works after this change (since a finite Bool is added), so I changed it to use it's own structure.</p>",
        "id": 478775581,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1729794415
    }
]