[
    {
        "content": "<p>The project has been mentioned in the <em>Quanta Magazine</em> article published on April 30 entitled <em><a href=\"https://www.quantamagazine.org/mathematical-beauty-truth-and-proof-in-the-age-of-ai-20250430\">Mathematical Beauty, Truth and Proof in the Age of AI</a></em>.</p>\n<p>The article contains passages that could potentially lead to some misunderstanding:</p>\n<blockquote>\n<p>Within a couple of months, more than 50 participants, many of them amateurs, had proved the truth or falsehood of nearly all 22 million implications. Some used AI; others solved implications by hand. [...] This provides a glimmer of what AI-assisted mathematical research will look like.</p>\n</blockquote>\n<p>Given the context provided in the article, these remarks may be interpreted as referring to ML systems. However, as far as I recall (and as others have already noted in <a class=\"stream-topic\" data-stream-id=\"458659\" href=\"/#narrow/channel/458659-Equational/topic/https.3A.2F.2Farxiv.2Eorg.2Fpdf.2F2504.2E10101/with/513033666\">#Equational &gt; https://arxiv.org/pdf/2504.10101</a>), such systems played little to no direct role in the discovery or formalisation of the proofs of the implications. The proofs were primarily obtained through ATPs, combined with human insight and collaboration, and were formalised both manually and automatically.</p>\n<p>While ATPs are generally considered \"symbolic AI\" tools, they differ substantially from the ML models that many readers may associate with the term. Clarifying this distinction may help avoid potential confusion for those unfamiliar with the technical details of the project.</p>",
        "id": 515416128,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1746055101
    },
    {
        "content": "<p>I agree with ATPs ⊆ AI \\ ML.</p>",
        "id": 515471134,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1746089796
    },
    {
        "content": "<p>I had a brief correspondence with the author of the article.  She was using the term AI quite broadly to encompass both traditional symbolic AI and more modern LLMs (this is more obvious at the beginning of the article), but it is true that snippets of the article taken out of that broader context may be give the wrong impression as to what type of AI is being referred to here.  She says she will try to get the editor to update the article.</p>",
        "id": 515526317,
        "sender_full_name": "Terence Tao",
        "timestamp": 1746112967
    }
]