[
    {
        "content": "<p>This is an announcement of the first of possibly three refactorings of the entire Lean codebase: following the outcome the polls at <a class=\"stream-topic\" data-stream-id=\"458659\" href=\"/#narrow/stream/458659-Equational/topic/Metatheory.3A.20meta-thread\">#Equational &gt; Metatheory: meta-thread</a> , I have opened <a href=\"https://github.com/teorth/equational_theories/pull/199\">equational#199</a> to reverse the ordering on equational laws to align with Mathlib.</p>\n<p>This one is the smallest and least disruptive refactoring, because this ordering is not used widely in our Lean codebase, so I believe this should be relatively simple to implement, and can be done in advance of any other refactorings (namely, the potential refactorings to change the ordering on variables, and to switch from [Magma] to [Mul]).  I have already updated the blueprint to reflect this new convention.</p>\n<p>As a related policy change, we will now have the following recommendations for Hasse diagrams going forward:</p>\n<blockquote>\n<p>Hasse diagrams will be oriented with the largest element <code>x=x</code> (in the new ordering) ontop and the smallest element <code>x=y</code> on bottom, and arrows should be depicted by upwards implication arrows =&gt; (or left unoriented, if implication arrows are not available).</p>\n<p>Legacy Hasse diagrams created before this policy change do not need to be updated, but a note should be attached to any documentation referencing these diagrams to indicate the reversed orientation.</p>\n</blockquote>\n<p>I will now go ahead and add this guidance to CONTRIBUTING.md and to the places in the documentation that reference visualizations.  I don't know if there are any of the graph visualization tools in the codebase need to be adjusted in view of this policy, but perhaps this can be done by the creators of each individual tool separately, without the need for an overarching refactor?</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code>\n</code></pre></div>",
        "id": 474303864,
        "sender_full_name": "Terence Tao",
        "timestamp": 1727877277
    }
]