[
    {
        "content": "<p>I'm trying to locate the Mace4, Prover9, and Vampire input files that produced useful results in the project.</p>\n<p>I found the Mace4 file <code>equational_theories/Generated/All4x4Tables/src/cancellative5x5.in</code> in the repository, which seems to work as intended:</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"bp\">$</span><span class=\"w\"> </span><span class=\"n\">mace4</span><span class=\"w\"> </span><span class=\"bp\">&lt;</span><span class=\"w\"> </span><span class=\"bp\">./</span><span class=\"n\">equational_theories</span><span class=\"bp\">/</span><span class=\"n\">Generated</span><span class=\"bp\">/</span><span class=\"n\">All4x4Tables</span><span class=\"bp\">/</span><span class=\"n\">src</span><span class=\"bp\">/</span><span class=\"n\">cancellative5x5</span><span class=\"bp\">.</span><span class=\"k\">in</span>\n<span class=\"bp\">…</span>\n<span class=\"n\">Exiting</span><span class=\"w\"> </span><span class=\"k\">with</span><span class=\"w\"> </span><span class=\"mi\">10944</span><span class=\"w\"> </span><span class=\"n\">models</span><span class=\"bp\">.</span>\n<span class=\"bp\">…</span>\n</code></pre></div>\n<p>However, I couldn’t find any Vampire files (<code>*.p</code>) or Prover9 files (<code>*.p9</code>) in the repository.</p>\n<p>Were the useful Mace4 results obtained exclusively from <code>cancellative5x5.in</code>?</p>\n<p>Are the Vampire and Prover9 input files that produced useful results available in the repository, or perhaps located elsewhere?</p>",
        "id": 522854523,
        "sender_full_name": "Louis Cabarion",
        "timestamp": 1749249398
    },
    {
        "content": "<p>The vampire files were not archived. The most interesting ones, the ones that were used to search for counterexamples using human assistance are probably in specific threads. Just to generate a <code>.p</code> files for a specific pair you can generate vampire files using scripts, see e.g. <code>equational_theories/Generated/FiniteImplicationSearch/README.md</code> though there are others in the repo as well, e.g. <code>equational_theories/Generated/VampireProven/src</code></p>",
        "id": 522901638,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1749309404
    },
    {
        "content": "<p>A few of us, including I, obtained counterexamples from Mace4 using long runs from both standard and manually tuned input files (some posts on how this was done are linked from <a href=\"https://github.com/teorth/equational_theories/wiki/Terence-Tao's-personal-log\">the log</a>). The Mace4 inputs were not retained in the repo: only the outputs (converted into the planner's format) were saved into the txt files in the <a href=\"https://github.com/teorth/equational_theories/tree/main/equational_theories/Generated/All4x4Tables/data\">data/</a> directory. Since the claims are checked independently by Lean, there was no reproducibility concern: as long as you know the multiplication tables, you can verify the claims .</p>\n<p>You might find more information about how the specific structures were by following the commits and PRs involving the data directory. The PRs will sometimes have an explanation of how the tables were obtained, or links to surrounding discussions which might have the Mace4 inputs.</p>",
        "id": 523018292,
        "sender_full_name": "Zoltan A. Kocsis (Z.A.K.)",
        "timestamp": 1749438807
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"761203\">@Vlad Tsyrklevich</span> <span class=\"user-mention\" data-user-id=\"763356\">@Zoltan A. Kocsis (Z.A.K.)</span> Thanks for the clarifications! Just to be clear, I wasn’t suggesting there are any reproducibility issues with the results themselves: those are formalized, so their correctness is fully trusted.</p>\n<p>What I'm hoping to reproduce isn't the final result, but the <em>process</em> that led to it: specifically, how the tools like Mace4, Prover9, or Vampire were used along the way. I'm interested in retracing those steps more precisely to better understand the workflow and how the tools contributed to the development.</p>",
        "id": 523378977,
        "sender_full_name": "Louis Cabarion",
        "timestamp": 1749593601
    },
    {
        "content": "<p>More concretely, for pedagogical purposes, I’d like to collect one example for each of Mace4, Prover9, and Vampire that shows how the tool produced a result meaningful (and ideally significant/important) to the project, along with the specific input that led to it.</p>",
        "id": 523379495,
        "sender_full_name": "Louis Cabarion",
        "timestamp": 1749593900
    },
    {
        "content": "<p>I'll see if I have anything retained from my Mace4 explorations of finite models, but probably not: the laptop I was using to work on the project last October has already been repurposed.  I am tagging <span class=\"user-mention\" data-user-id=\"761825\">@Jose Brox</span> as well, I suspect he'll have some interesting searches.</p>\n<p>Also, Mace4 supplied one of the last pieces of the puzzle when we worked on the <a href=\"#narrow/channel/458659-Equational/topic/Equations.20with.20full.20spectrum/near/490016628\">full spectrum problem</a>: the Python script which generated the relevant parts of the Mace4 input was retained there, so we can reconstruct the input file used.</p>",
        "id": 523584954,
        "sender_full_name": "Zoltan A. Kocsis (Z.A.K.)",
        "timestamp": 1749655092
    }
]