[
    {
        "content": "<p>An example of someone in the pre-computer era trying to master a large collection of equations is given by Ernst Schröder's work up to 1890 on 990 equations in the language of what are now called quasigroups, with three binary operations, multiplication and left and right division. His invention of quasigroups was evidently as some sort of generalized arithmetic.  This was applied in 1890 in Vol. I of his master work \"Algebra der Logik\" to give (in modern terms) an example of a 5-element lattice of closed subsets (relative to the 990 equations) that was not distributive, a counter-example to a claim of C.S. Peirce in 1880 that the distributive law followed from the lattice axioms. The main tool to show that certain subsets A were closed was, for any of the 990 equations E not in A, to find a small quasigroup (at most 9 elements) that was satisfied by A but not by E. There was no attempt to develop a notion of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>⊢</mo></mrow><annotation encoding=\"application/x-tex\">\\vdash</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mrel\">⊢</span></span></span></span> in an equational logic.</p>\n<p>Refuting Peirce's claim was perhaps a short-lived triumph by Schröder because a very few years later Dedekind viewed lattices abstractly as a set with two binary operations that satisfied certain laws, and simply gave a 5x5 table for the counter-example lattice. There was no need for Schröder's elaborate quasigroup machinery.</p>",
        "id": 547559502,
        "sender_full_name": "Stanley Burris",
        "timestamp": 1761674696
    },
    {
        "content": "<p>An interesting peek into the mentality of late-19th century concrete thinking, like how every (finite) group was a group of permutations, and this was a big deal: you didn't have abstract algebra in the sense post-Dedekind, Noether, Artin, Bourbaki,....  The lattice <em>had</em> to be a sublattice of a poset, not just an algebraic object</p>",
        "id": 547607787,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1761696569
    }
]