[
    {
        "content": "<p>Minor terminology suggestion: I recommend to change the terminology of \"conjecture\"/\"proof\" by \"proof\"/\"formalization\". So e.g. on day 22 there are 362 implications without formalization and 132 implications without proof.</p>\n<p>If someone writes a proof on Zulip or an ATP finds and checks a countermodel, I would say that the anti-implication is proven, just not formalized. And most of us do actually have a conjecture about the remaining 132 unproven(unconjectured) implications.</p>",
        "id": 477514365,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1729194834
    },
    {
        "content": "<p>I view \"conjecture\"/\"proof\" in this context as \"formal conjecture\"/\"formal proof\" rather than \"informal conjecture\"/\"informal proof\".  So, a statement which we have proven informally, but can only mark in Lean as a <code>conjecture</code> rather than a <code>theorem</code>, would be a \"formal conjecture\" even if it has an \"informal proof\".</p>\n<p>I can also imagine that theoretically we might in future create some formal conjectures that we can only obtain by techniques less rigorous than \"informal proof\", for instance by applying some probabilistic heuristic that we strongly believe (but cannot prove) to be accurate.  (Though for this current project there are so few outstanding implications without conjectures remaining that I doubt we would do so.)</p>\n<p>It's also true that using the standard of \"informal conjecture\" we could simply mark all outstanding implications as conjectured to be false, but this gives us no useful guidance on which implications to focus on next.</p>",
        "id": 477521227,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729197755
    },
    {
        "content": "<p>so how do you distinguish between a counterexample found by vampire waiting to be placed in lean from a completely informal proof, or a guess?</p>",
        "id": 477533639,
        "sender_full_name": "Jared green",
        "timestamp": 1729204087
    },
    {
        "content": "<p>The category of \"conjecture\"s is meant to be a temporary category, since hopefully all implications will eventually be proven or disproven in Lean; it's main purpose (besides the psychological morale boost of having a smaller number of completely unresolved implications) is to allow us to focus our efforts, either on formalizing the implications that are classified as conjectures, or to find new techniques to turn completely open (anti-)implications into conjectures, as a first step towards formalizing them in Lean.</p>\n<p>Because of this, a \"guess\" with no actionable path towards converting the guess into a Lean formalization would probably not qualify for the label of \"conjecture\" for practical purposes, though of course nothing strictly prevents us from doing so.  However, a Vampire proof or a completely informal proof both offer such an actionable path, and so could usefully be placed in the \"conjecture\" category.  (Because of this, I think I retract my previous claim that a plausible probabilistic heuristic argument would be sufficient to qualify for the \"conjecture\" label, since such a heuristic would likely also not offer a plausible path to formalization.)</p>",
        "id": 477535329,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729205145
    },
    {
        "content": "<p>I think the particular usage of the \"conjecture\" category that we landed on is also a consequence of our widespread belief that pretty much all outstanding implications are in fact false.  (This was not quite the case though when the category was first introduced about two weeks ago, and we initially used the <code>proof_wanted</code> keyword instead of the <code>conjecture</code> keyword.) If the situation was different in that the split between true and false implications was suspected to be 50/50, then using \"conjecture\" in the more traditional sense of identifying what we believe to be true even in the absence of actionable ways to obtain a proof could be useful to the project, in cutting down the number of statements we would try to prove by about 50% (since presumably we would not look for counterexamples if we believe the implication to be true, or vice versa).   In that case it might even make sense to have three categories \"conjectured\", \"informally proven\", and \"formally proven\", but this is currently unnecessary as we have simply repurposed \"conjectured\" to mean \"informally proven / proven by a non-Lean calculation\".</p>",
        "id": 477536202,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729205687
    },
    {
        "content": "<p>I tend to agree with Floris here, this usage of \"conjecture\" is slightly confusing because it misrepresents the level of understanding we have in the claim (and also unfairly maligns unformalized proofs in general). What you describe as \"a 'guess' with no actionable path towards converting the guess into a Lean formalization\" is exactly what I would call a \"conjecture\", e.g. the Birch–Swinnerton-Dyer conjecture, and I think most onlookers will have a similar association for the word. A proof sketch is not a conjecture, but a probabilistic heuristic could be.</p>",
        "id": 477544607,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1729211518
    },
    {
        "content": "<p>For reference, here is the discussion from two weeks ago when we landed semi-randomly on the <code>conjecture</code> keyword for implications lacking a formalized proof: <a href=\"#narrow/channel/458659-Equational/topic/Lean.20script.20for.20extracting.20current.20set.20of.20implications/near/473366542\">https://leanprover.zulipchat.com/#narrow/channel/458659-Equational/topic/Lean.20script.20for.20extracting.20current.20set.20of.20implications/near/473366542</a><br>\nThe choices at the time were between <code>conjecture</code>, <code>claim</code>, and <code>proof_wanted'</code>.</p>\n<p>I'd say all of our subsequent use of the word \"conjecture\" flows from this Lean keyword <code>conjecture</code>.  I guess I can open a poll to see if there are strong feelings about changing it.</p>",
        "id": 477555064,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729218486
    },
    {
        "content": "<p>/poll What should we do with the <code>conjecture</code> keyword?<br>\nKeep it as is<br>\nChange to <code>proof_wanted'</code> or similar<br>\nChange to <code>informal_theorem</code> or similar</p>",
        "id": 477555178,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729218538
    },
    {
        "content": "<p>Isn't this the role of the blueprint in similar formalization projects? If you want to represent informal proofs in lean, one thing which I think is important is a link to the proof and any other information relevant for a formalizer to use</p>",
        "id": 477642772,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1729253901
    },
    {
        "content": "<p>Another possible representation is as a regular proof with a <code>sorry</code> in it (and comments with the informal proof or a link to it)</p>",
        "id": 477642860,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1729253938
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/channel/458659-Equational/topic/terminology.20of.20conjecture.2Fproof/near/477642860\">said</a>:</p>\n<blockquote>\n<p>Another possible representation is as a regular proof with a <code>sorry</code> in it (and comments with the informal proof or a link to it)</p>\n</blockquote>\n<p>This seems nice because it lets you prove theorems up to some different conjecture, and <code>@[equational_result]</code> has a check to prevent it from accidentally being marked as a theorem</p>",
        "id": 477644497,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1729254486
    },
    {
        "content": "<p>I think one thing we've discovered is that the blueprint works differently for a project like this (in which we want to (formally) prove a very large number of small new theorems) than in a more \"traditional\" formalization project (in which we want to formalize a single existing theorem (or cluster of such theorems), broken up into many pieces).  Obviously there is no way we would place all 22 million implications in the blueprint.  But even the human-generated portion is mostly present in the blueprint in the form of representative examples, and often contributors are formalizing directly from the relevant Zulip thread informal discussion than via the intermediate step of writing up a blueprint proof.</p>\n<p>Currently we are simply entering in <code>conjecture</code> statements arising from informal proofs in Zulip chats in <code>[Conjectures.lean](https://github.com/teorth/equational_theories/blob/main/equational_theories/Conjectures.lean)</code> with a Lean comment giving a URL back to the relevant Zulip discussion; the intermediate blueprint seems to be unnecessary (one reason for this being that the individual proofs are somewhat decoupled from each other, so the blueprint dependency graph setup is not all that helpful here).  Perhaps there is a more systematic way to do this, but at this point we only have 65 implications to go (modulo duality) and I think _ad hoc_ procedures that evolve as we go will be sufficient.</p>",
        "id": 477673889,
        "sender_full_name": "Terence Tao",
        "timestamp": 1729263345
    }
]