[
    {
        "content": "<p>Hi, I am new to program verification in Lean  (I have done work on program verification in Isabelle before). What are some good resources to get me started? I also would like to see examples of what has been done to get an idea of the state of the art.</p>",
        "id": 438865615,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1715798791
    },
    {
        "content": "<p>I would say that there is not really much material tailored for program verification. Perhaps the hitchhiker's guide <a href=\"https://github.com/blanchette/logical_verification_2021/raw/main/hitchhikers_guide.pdf\">#hglv</a> (lean3) is useful? For the most part, proving theorems about programs is no different from any other kind of theorems in lean. There are some ideas for having a more streamlined experience in this situation but they have not yet materialized. But you can still reason about the definition of a function by cases or induction, use <code>split</code> liberally to break up match statements and so on. This is how most of the program verification theorems in Batteries are proved</p>",
        "id": 438894187,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1715811094
    },
    {
        "content": "<p>In the semester that just finished I taught a class based on the Lean NNG and the Logic Game to CS students ... <a href=\"https://hackmd.io/@alexhkurz/rJDrv_qDT\">https://hackmd.io/@alexhkurz/rJDrv_qDT</a> ... this was just one 50 min session per week and some of the students were first year students, so we didnt get to program verification ... but I was very happy with how much the students learned, even if some of it must have remained mysterious to them. Anyway, I want to explore the possibilities of teaching a  follow-up course about verification of programs in Lean.</p>",
        "id": 438917808,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1715826765
    },
    {
        "content": "<p>I like this chapter in the Lean 4 version of The Hitchhiker's Guide to Logical Verification:<br>\n<a href=\"https://browncs1951x.github.io/static/files/hitchhikersguide.pdf#page=147\">https://browncs1951x.github.io/static/files/hitchhikersguide.pdf#page=147</a></p>",
        "id": 438966648,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1715847983
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"417654\">@Martin Dvořák</span> , that's a very useful resource!</p>",
        "id": 452580411,
        "sender_full_name": "Miguel Raz Guzmán Macedo",
        "timestamp": 1721398455
    },
    {
        "content": "<p>Note that the guide is being maintained by the theoretical cs group at LMU in this repo <a href=\"https://github.com/lean-forward/logical_verification_2024\">https://github.com/lean-forward/logical_verification_2024</a> it has slightly more updated things (since this is 2024 while the version linked above is 2023) and new stuff is likely to evolve there first. AFAIK the Brown version mostly differs in terms of the exercises provided with the book.</p>",
        "id": 452586993,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1721400190
    }
]