[
    {
        "content": "<p>Has anyone tried formalizing a legal matter with lean4 ?<br>\nCould it be possible to implement the program to verify decisions from courts with lean4 program.</p>",
        "id": 512515531,
        "sender_full_name": "Vasu Cho",
        "timestamp": 1744798623
    },
    {
        "content": "<p>None that I have heard of. There <em>is</em> a language for formalizing legal texts though: <a href=\"https://catala-lang.org/\">https://catala-lang.org/</a></p>",
        "id": 512520494,
        "sender_full_name": "suhr",
        "timestamp": 1744800221
    },
    {
        "content": "<p>I haven't heard of this language. Thanks a lot!<br>\nWhat do you think about the impact of lean4 implementation on other industries ?</p>",
        "id": 512530183,
        "sender_full_name": "Vasu Cho",
        "timestamp": 1744803194
    },
    {
        "content": "<p>I am curious about lean4 stuffs that could be possibly deployed in other fields alongside startups. Do we have someone in our community try applying this to solve other problems that are related with the daily problem (that as an individual can do with no need large amount of funding) ?</p>",
        "id": 512531570,
        "sender_full_name": "Vasu Cho",
        "timestamp": 1744803619
    },
    {
        "content": "<p>Software verification is usually done using Rocq, but it is slowly changing as more libraries are written in Lean.</p>\n<blockquote>\n<p>What do you think about the impact of lean4 implementation on other industries ?</p>\n</blockquote>\n<p>Most industries are not very formalizable, so proof assistants do not have much impact there.</p>",
        "id": 512531889,
        "sender_full_name": "suhr",
        "timestamp": 1744803716
    },
    {
        "content": "<p>That means mostly experts are using lean4 shipping an internal tools rather than building the products ?</p>\n<p>In my current understanding, there are some projects/startups like Numina, Harmonic building the new models/products with lean4 <br>\nbut after I dig into this language more<br>\nIt makes me feel good about helping me structuring logics and want to do more proofs but if I want to apply it for the application or use the knowledge from learning lean4 to build my product. I only see the room for new frontier models developments like Harmonic are doing or go hard mode on pure mathematic as a mathematician</p>\n<p>Do you have any suggestions on getting quick wins learning lean4 (for a novice software engineer) and what do you see in a future impact of lean4 ?🙏🏻</p>",
        "id": 512534514,
        "sender_full_name": "Vasu Cho",
        "timestamp": 1744804507
    }
]