[
    {
        "content": "<p>In case this is of interest to others, I have formalized some modular reduction algorithms here <a href=\"https://github.com/atrieu/lean-cryptolib\">https://github.com/atrieu/lean-cryptolib</a> while trying out Lean a couple months ago.</p>",
        "id": 508768271,
        "sender_full_name": "Alix Trieu",
        "timestamp": 1743171852
    },
    {
        "content": "<p>Nice! How does your experience compare to Fiat Cryptography which also contains these components?</p>",
        "id": 509404978,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1743500361
    },
    {
        "content": "<p>I'm not sure what comparison you mean?</p>",
        "id": 509434593,
        "sender_full_name": "Alix Trieu",
        "timestamp": 1743509527
    },
    {
        "content": "<p>I'm curious both any kind of comparison, usability issues, code size, ...<br>\nDo you have plans to develop this further? Fiat-Crypto is very well developed and used in industry.</p>",
        "id": 509623619,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1743579811
    },
    {
        "content": "<p>I don't think there is much difference in terms of using the specifications I wrote to verify code in Lean, versus directly using the same specs in Fiat-Crypto to verify code in Rocq. The main strength of Fiat-Crypto in my opinion is that one mostly does not need to do that and can automatically derive correct code. Not much difference in proof size either I think.<br>\nAs a side note, I also contributed the signed Barrett reduction algorithm to Fiat-Crypto, it took me less than a day of work to prove in Rocq, versus a bit more than a week for the same thing in Lean. But I think that's mostly due to  how little I know/knew about Lean/Mathlib.<br>\nNo immediate future plan, though I will probably add some more stuff when I have time.</p>",
        "id": 509641465,
        "sender_full_name": "Alix Trieu",
        "timestamp": 1743584935
    }
]