[
    {
        "content": "<p><a href=\"https://github.com/girving/debate/blob/main/Learn/Indistinguishable.lean\">https://github.com/girving/debate/blob/main/Learn/Indistinguishable.lean</a> formalises <a href=\"https://proceedings.mlr.press/v167/dwork22a/dwork22a.pdf\">Dwork et al. 2022</a>'s multiplicative weights algorithm for outcome indistinguishability, using a simple model of <a href=\"https://github.com/girving/debate/blob/main/Learn/Circuit.lean\">real-valued circuits</a> over an arbitrary primitive set.</p>\n<p>Roughly, the theorem is that if we have a ground-truth distribution of input/output pairs <code>(x,y)</code> for <code>y : Y</code>, and a class of [-1,1]-bounded functions which act to distinguish ground truth from an attempted learned distribution, then we can learn an ε-indistinguishable circuit of size <code>O(|Y| log |Y| / ε^2)</code>.</p>\n<p>Caveat: The theorem in Dwork et al. pays attempt to sample complexity and the size of the distinguisher set. For our application we'll need only the existence of the small circuit, so I haven't formalised that part.</p>",
        "id": 518402496,
        "sender_full_name": "Geoffrey Irving",
        "timestamp": 1747344094
    },
    {
        "content": "<p>Hey, so do you need a notion of substitution in your arithmetic circuits ?</p>",
        "id": 518410493,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1747347905
    },
    {
        "content": "<p>I am trying to find the substitution operation</p>",
        "id": 518410530,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1747347925
    },
    {
        "content": "<p>In our (not yet public)  formalisation of arithmetic circuit complexity I carry a context of circuits and use natural number metavars.</p>",
        "id": 518410655,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1747347979
    },
    {
        "content": "<p>Our goal is to formalise certain lower bounds relevant to the VP vs VNP problem.</p>",
        "id": 518410758,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1747348029
    },
    {
        "content": "<p>I can’t immediately find the definition of substitution in your repository</p>",
        "id": 518410812,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1747348070
    },
    {
        "content": "<p>I don’t need or define substitution currently. My Circuit type is admittedly a bit weird as it is defined relative to a set of primitives which take (1) one input x from a fixed type X and (2) some number of circuits. As a result, there are no “leaves” in the circuit, just calls to primitives that take (1) but not (2).</p>\n<p>This is the kind of circuit I need for indistinguishability (and the downstream AI safety complexity theory), but it’s certainly weaker than a general circuit type.</p>\n<p>I initially tried to define a Circuit type that took a bunch more type arguments, so that Circuits of different types could be plugged together when inputs and outputs matched. However, I ran into problems with Lean refusing to define recursive functions when the parameter types of the thing you’re inducting on vary. And then I realized I didn’t need that, and stopped trying (at least for the moment).</p>",
        "id": 518412146,
        "sender_full_name": "Geoffrey Irving",
        "timestamp": 1747348806
    },
    {
        "content": "<p>But do you need a list of types? Aren’t all these circuits just taking in and outputting reals?</p>",
        "id": 518414335,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1747350203
    },
    {
        "content": "<p>Okay I think I am beginning to wrap my head around what you mean by these circuits. My circuits are different in that they are doing pure arithmetic (ring operations) to compute polynomials</p>",
        "id": 518414852,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1747350537
    },
    {
        "content": "<p>The circuits always take X (which can be anything) and output a real. When eval’ed on <code>x : X</code>, x is passed as the first argument to every node in the circuit.</p>\n<p>And yeah, these are fundamentally real-valued circuits rather than arithmetic circuits: we want to prove theorems that hold even if the set of primitives is very arbitrary, and then we construct very nonlinear stuff on top of that when doing the proof here.</p>",
        "id": 518415581,
        "sender_full_name": "Geoffrey Irving",
        "timestamp": 1747351027
    }
]