[
    {
        "content": "<p>Hello!</p>\n<p>Is there any ongoing work for verification of while loops? The current implementation is marked as <code>partial</code>, preventing us from proving anything about it: <a href=\"https://github.com/leanprover/lean4/blob/master/src/Init/While.lean#L25\">https://github.com/leanprover/lean4/blob/master/src/Init/While.lean#L25</a><br>\nThe only way I see around this is to add a second definition that uses <code>partial_fixpoint</code>, whenever the employed monad allows it. Then it should be fairly easy to add a spec for mvcgen as well.</p>\n<p>Would the lean4 maintainers be interested in a PR in this direction?</p>",
        "id": 558160788,
        "sender_full_name": "Alexander Bentkamp",
        "timestamp": 1763547147
    },
    {
        "content": "<p>I think this intersects with plans that <span class=\"user-mention\" data-user-id=\"221653\">@Paul Reichert</span> has regarding extrinsic termination</p>",
        "id": 558161611,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1763547369
    },
    {
        "content": "<p>I believe <span class=\"user-mention\" data-user-id=\"130195\">@Sebastian Graf</span> is thinking about having a <code>while...decreasing</code> syntax that lets you provide a termination proof in place, an then this loop will not rely on <code>partial</code> such that you can prove things about it.</p>\n<p>Henrik is right that I'm planning to provide a mechanism to defer such termination proofs. This makes the definition much simpler, but you will still need to prove termination before you can prove things. Rught now, we are still making sure that the machanism is actually compatible with the compiler's behavior, so it's not 100% certain that it will happen.</p>",
        "id": 558168032,
        "sender_full_name": "Paul Reichert",
        "timestamp": 1763549138
    },
    {
        "content": "<p>I think in order to have <code>while ... decreasing</code> syntax (or even just <code>while</code> with extrinsic termination proofs) we first need to touch WF preprocessing to add support for monadic attach. Without that, it would be very inconvenient to write <code>while</code> loops in such a way that termination proofs are feasible.</p>\n<p>So yes, it's on our radar, but it won't happen in this Q. If we as the FRO decide to work on it, then Q2 next year seems realistic.</p>",
        "id": 558170250,
        "sender_full_name": "Sebastian Graf",
        "timestamp": 1763549682
    },
    {
        "content": "<p>Okay, thanks for the quick replies!</p>",
        "id": 558176078,
        "sender_full_name": "Alexander Bentkamp",
        "timestamp": 1763551350
    }
]