[
    {
        "content": "<p>Hello, I'm a beginner with Lean (and git).  I'm planning to learn Lean with my students when I teach an intro proof course starting in a few weeks.  So far, I finished just the first two sections of Heather Macbeth's Mechanics of Proof and I'm so impressed -  even if we do just a little in my class - I will be thrilled with any progress.  I set up a github classroom but unfortunately I'm also a beginner with git.  My question is for any guidance on the autograder.  I found this: <a href=\"https://github.com/adamtopaz/hw_template\">https://github.com/adamtopaz/hw_template</a> but all this looks pretty confusing to a beginner.  What does it mean \"Just modify the hash in the file <code>.github/classroom/autograding.json</code>. So far I managed to make an assignment that students can modify a file and I can see the edits... I don't know how to accomodate the dependencies \"lean_grader\" and \"mathlib4\".  Basically what do I need in the repo I create for students? thank you!!!!!</p>",
        "id": 491435242,
        "sender_full_name": "Scott Vaughen",
        "timestamp": 1735673443
    },
    {
        "content": "<p>I’ll <span class=\"user-mention\" data-user-id=\"243562\">@Adam Topaz</span> answer questions about his setup, but I’d like to point out <a href=\"https://leanprover-community.github.io/teaching/index.html\">https://leanprover-community.github.io/teaching/index.html</a> in case you don’t know about it.</p>",
        "id": 491441869,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1735678970
    },
    {
        "content": "<p>thank you - if anyone has any experience using Heather MacBeth's book for an intro to proof course, I'd be very interested to hear from you - I'm particularly interested in using an autograder and I'm a very new beginner with Lean and GitHub so if you have patience to answer questions I have lots but I'm very excited about Lean as educational tool.</p>",
        "id": 492348105,
        "sender_full_name": "Scott Vaughen",
        "timestamp": 1736268687
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"814748\">@Scott Vaughen</span> here are some additional details on how my autograder works, in case it helps. As I mentioned in the PM, this currently only grades for complete correctness (so either 100% or 0%, nothing in between). </p>\n<p>First a note: the homework template mentioned above uses the <code>hash_approach</code> branch of the autograder repo. What the autograder does is simply look for a file called <code>Solution.lean</code> in the homework assignment repo, and in that file it looks for a term called <code>solution</code>. It then looks at the type of <code>solution</code>, computes the \"hash\" of that type, and compares it with the hash provided when you run the command. It also ensures that the only axioms used in <code>solution</code> are the \"standard\" ones (the axiom of choice, soundness of quotients, and <code>propext</code>).</p>\n<p>To work with this tool you can clone the <code>homework_template</code> repo, and add the command <code>#type_hash solution</code> after <code>solution</code> is declared in the <code>Solution.lean</code> file in order to get the hash (the default one should be <code>421340980</code>, which you can see in the <code>autograding.json</code> file in the github classroom folder of the homework template). To grade the assignment, use <code>lake exe grade 421340980</code> (replacing the number with the correct hash, of course). This is exactly the command that is run by github classrooms during the autograding step.</p>",
        "id": 492349667,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1736269252
    },
    {
        "content": "<p>super - thanks for the follow up - yes - this is very helpful - I'll keep experimenting and perhaps I can be a part of future conversations about autograders for Lean assignments</p>",
        "id": 492503355,
        "sender_full_name": "Scott Vaughen",
        "timestamp": 1736342446
    }
]