[
    {
        "content": "<p>Is there a current best practice or recommendation for <em>live</em> collaboration with Lean in VS Code?</p>\n<p>Last week we tried out three different ways, see below for my quick comparison notes.</p>\n<p>The main problem we ran into: No method makes the Lean Infoview available to the guest. As mentioned in other threads here, the \"Problems\" list is visible to the other person, but it is not as nice as the InfoView.<br>\nI think in an ideal collaboration setting it would be good to have InfoViews for each cursor? If that is not possible, then it would be nice to have something like one person at a time \"driving\" as in CodeTogether, and that cursor determining the InfoView.<br>\nI guess corresponding to this is the question whether (as all those tools seem to do) there is only one instance of Lean running on the host or (maybe better?) each participant is running their own Lean instance locally.</p>\n<p>In both LiveShare and CodeTogether the InfoView is not shared. Instead, in the guest VS code it fails with \"Lean 4 server operating in restricted single file mode. Please open a valid Lean 4 project containing a 'lean-toolchain' file for full functionality.\"<br>\n(This happens when the Lean 4 extension is installed. If not, as in the browser clients, then nothing happens and there is not even syntax highlighting.)</p>\n<p><em>Mircosoft LiveShare</em></p>\n<ul>\n<li>NICE: easy to join, even in browser</li>\n<li>BAD: no syntax highlighting in BRwoser</li>\n<li>BAD: needs account</li>\n<li>BAD: Not FLOSS, not available in VS Codium by default.</li>\n<li>BAD: No InfoView, see error above.</li>\n</ul>\n<p><em>CodeTogether</em></p>\n<ul>\n<li>NICE: easy to join, no account needed</li>\n<li>NICE: multiple cursors + \"driving\" mode</li>\n<li>NICE: audio integration? (not tried)</li>\n<li>BAD: No syntax highlighting when in browser or when not trusted</li>\n<li>BAD: No InfoView, see error above.</li>\n</ul>\n<p><em>Gitpod (sharing the link, ugly)</em></p>\n<ul>\n<li>BAD: needs (github) account and asks first-time guests job/project questions</li>\n<li>BAD: other cursors not visible, overwriting each others changes</li>\n<li>BAD: gives other person full git rights in your name</li>\n</ul>\n<p><em>other silly ideas</em> <span aria-label=\"crazy\" class=\"emoji emoji-1f61c\" role=\"img\" title=\"crazy\">:crazy:</span> </p>\n<ul>\n<li>in parallel to LiveShare or CodeTogether, screen-share the InfoView via another tool.</li>\n<li>get something/someone like <a href=\"http://replit.com\">replit.com</a> to support Lean?</li>\n<li>hack together a combination of <a href=\"https://live.lean-lang.org/\">https://live.lean-lang.org/</a> and etherpad</li>\n</ul>",
        "id": 407454258,
        "sender_full_name": "Malvin Gattinger",
        "timestamp": 1702380459
    },
    {
        "content": "<p>For Lean 3 I thought that CoCalc had a really good attempt. The problem was that they were not able to keep up with the fast paced nature of Lean releases.</p>",
        "id": 407466640,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1702384835
    },
    {
        "content": "<p>CodeTogether seems nice, why can't it show Lean InfoView exactly?</p>",
        "id": 407506532,
        "sender_full_name": "Utensil Song",
        "timestamp": 1702395778
    },
    {
        "content": "<p>I updated the notes above a bit after trying both again. The error is \"Lean 4 server operating in restricted single file mode. Please open a valid Lean 4 project containing a 'lean-toolchain\" and I guess it happens when the client starts its own Lean server but does not have a folder with all the files.</p>",
        "id": 407564158,
        "sender_full_name": "Malvin Gattinger",
        "timestamp": 1702414083
    }
]