[
    {
        "content": "<p>Dear All,</p>\n<p>I am teaching a course on formalisation and I created a project depending on mathlib.  To allow <code>lake exe cache get</code> to work on gitpod, I very simply copied the files</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"bp\">.</span><span class=\"n\">gitpod.yml</span>\n<span class=\"bp\">.</span><span class=\"n\">docker</span><span class=\"bp\">/</span><span class=\"n\">gitpod</span><span class=\"bp\">/</span><span class=\"n\">Dockerfile</span>\n</code></pre></div>\n<p>to my project and opened it in gitpod.  Gitpod took a couple of minutes to set everything up.  While it was setting up, I had the impression that several instructions were not actually working, but eventually, I could <code>import Mathlib</code> and it worked well.</p>\n<p>Is this normal?  Should I do something else?  I am mostly concerned by the fact that this will be potentially used by all my students and I am wary of the fact that some of them might have problems and I will not be able to help them at all!</p>\n<p>Note: it is the first time that I use gitpod, so if something looks wrong to you, it probably is!</p>",
        "id": 394525641,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1696288102
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> you could alternatively use GitHub codespaces. Just copy the devcontainer folder from mathlib4 and it should work out of the box.</p>",
        "id": 394532195,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1696292735
    },
    {
        "content": "<p>I don’t know about git pod, but with codespaces it does take a little while to set up, but everything should be automatic</p>",
        "id": 394532311,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1696292800
    },
    {
        "content": "<p>Do you know what is the difference between codespaces and gitpod?  Or why should I prefer one over the other?</p>",
        "id": 394532745,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1696293047
    },
    {
        "content": "<p>Personally I prefer github codespaces because it's part of my github account. I don't have to worry about setting up anything separately with gitpod. But overall I think the two are quite similar.</p>",
        "id": 394541128,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1696297486
    },
    {
        "content": "<p>You can copy the gitpod stuff from <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a></p>",
        "id": 394541538,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1696297698
    },
    {
        "content": "<ul>\n<li>Codespaces has unlimited access for classes but the specs on the container are pretty low </li>\n<li>Gitpod has better default specs but is capped for free use </li>\n</ul>\n<p>People generally get used to one and stay with it.</p>",
        "id": 394541700,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1696297795
    },
    {
        "content": "<p>I set up both at <a href=\"https://github.com/kbuzzard/IISc-experiments\">https://github.com/kbuzzard/IISc-experiments</a> and documented in the README what needed to be done to do this.</p>",
        "id": 394561429,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1696310090
    },
    {
        "content": "<p>Great, thank you all very much!  It seems that <code>.gitpod.yml</code> and <code>.docker/gitpod/Dockerfile</code> are some of those files that were never created but always copied along -- I hope that my students will not be the ones to cut this unbroken chain.</p>",
        "id": 394566176,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1696313597
    },
    {
        "content": "<p>I think the slow gitpod setup time goes away if lots of people are opening the same repo; I see it on my own projects, but never on mathlib.</p>",
        "id": 394587929,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1696322944
    }
]