[
    {
        "content": "<p>This semester is my first honest rodeo with GH classrooms so I am noticing some sharp edges. For example, it appears that instructors cannot set student groups for assignments. In fact, an instructor cannot create the (empty) named groups themselves. All group creation and membership is on the student end. There is a time-intensive <a href=\"https://education.github.community/t/using-existing-teams-in-group-assignments/6999/12\">workaround</a> to create the empty groups but it still relies on students correctly joining their assigned group. You cannot fix a mistake without dumping the whole assignment and starting over.</p>",
        "id": 295071371,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1661355354
    },
    {
        "content": "<p>Perhaps people here are better versed, but is this really the state of things for student group creation/curation?</p>",
        "id": 295071518,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1661355403
    },
    {
        "content": "<p>I haven't used groups specifically, but in a general sense last semester I found GitHub classroom to be very... unpolished, to be generous, so I wouldn't be surprised if that were the case. A similar thing was true for student rosters, you can't even modify them after a sync with the LMS without blowing a bunch of stuff away.</p>",
        "id": 295102481,
        "sender_full_name": "Julian Berman",
        "timestamp": 1661365525
    },
    {
        "content": "<p>Asking on the teaching GH discussion board though was helpful in a case or two, if no one knows here you might want to ask there.</p>",
        "id": 295102538,
        "sender_full_name": "Julian Berman",
        "timestamp": 1661365557
    },
    {
        "content": "<p><a href=\"https://github.com/community/Global-Campus-Teachers/discussions\">https://github.com/community/Global-Campus-Teachers/discussions</a></p>",
        "id": 295102738,
        "sender_full_name": "Julian Berman",
        "timestamp": 1661365633
    },
    {
        "content": "<p>Done. Thanks for pointing that out.</p>",
        "id": 295106938,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1661367269
    }
]