[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"453098\">Dan Velleman</span> <a href=\"#narrow/stream/113486-announce/topic/How.20to.20prove.20it.20in.20Lean/near/356343974\">said</a>:</p>\n<blockquote>\n<p><em>How To Prove It</em> can be used as a textbook for a discrete math course as you describe--or for a \"transition to advanced math\" course.  I have used it that way, as have others.  It does not mention Lean--it is about writing proofs in English.</p>\n<p><em>How To Prove It with Lean</em> is (or will be, when it's done) a companion to <em>How To Prove It</em>, explaining how to use Lean to write the proofs in <em>How To Prove It</em>.  I have not used it with students--I haven't even finished writing it.  But I hope it will be useful to students who are trying to learn to write proofs from <em>How To Prove It</em>.</p>\n</blockquote>\n<p>At some point in the near future, as a pilot experiment, I plan to teach an introductory discrete-math course with a proof assistant. This is all part of an on-going conversation in a small group of colleagues at my university (Boston University). Are proof assistants a good way to teach and promote the rigor of mathematical proofs, or do they hinder students' ability to communicate in the language of written mathematics (in plain semi-formal math prose)? Are the syntactic rigor of proof assistants and the overhead of learning them largely independent of -- or an obstacle to -- developing intuition and semantic understanding of math concepts?</p>",
        "id": 356783187,
        "sender_full_name": "Assaf Kfoury",
        "timestamp": 1683569581
    },
    {
        "content": "<p>There is an entire stream on Lean for teaching, which would be a much better place to have this discussion.</p>",
        "id": 356783478,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1683569666
    },
    {
        "content": "<p>2 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"113486\" href=\"/#narrow/stream/113486-announce/topic/How.20to.20prove.20it.20in.20Lean\">#announce &gt; How to prove it in Lean</a> by <span class=\"user-mention silent\" data-user-id=\"260507\">Heather Macbeth</span>.</p>",
        "id": 356783543,
        "sender_full_name": "Notification Bot",
        "timestamp": 1683569690
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"496406\">Assaf Kfoury</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/How.20to.20prove.20it.20in.20Lean/near/356783187\">said</a>:</p>\n<blockquote>\n<p>Are proof assistants a good way to teach and promote the rigor of mathematical proofs, or do they hinder students' ability to communicate in the language of written mathematics (in plain semi-formal math prose)? Are the syntactic rigor of proof assistants and the overhead of learning them largely independent of -- or an obstacle to -- developing intuition and semantic understanding of math concepts?</p>\n</blockquote>\n<p>These are great questions ... of course, on this discussion board, you are reaching the formal-mathematics enthusiasts, and we all hope the answer is \"yes\".</p>\n<p>One recent forum where these questions were discussed was the <a href=\"https://sites.google.com/view/learning-maths-with-lean2/\">Learning Mathematics with Lean</a> workshop organised in April by <span class=\"user-mention\" data-user-id=\"134231\">@Athina</span> and Paola Iannone.  I hope that the talks from that workshop will be on YouTube soon.</p>",
        "id": 356784310,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1683569951
    },
    {
        "content": "<p>So yeah this is a great question. Paola Iannone and Athina Thoma recently organised a conference on Lean for teaching where various people discussed what they were doing and what their goals were. Roughly speaking some of us (including me) were just teaching a Lean maths course with the goal of teaching the students how to use Lean, and were not really concerned with how it was changing things like the students' perception of mathematics and in particular whether it was \"making them better at maths\" or whether it was just making them able to use a theorem prover.</p>\n<p>However others (including Heather and Patrick) were teaching more introductory courses with other goals in mind. I'll perhaps let them speak for themselves.</p>",
        "id": 356784351,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1683569967
    },
    {
        "content": "<p>Here's a quick version of my own opinions on the subject.  I taught a Lean-bilingual intro-to-proof this semester -- <a href=\"https://hrmacbeth.github.io/math2001/\">here's the book</a> I wrote for it, and <a href=\"/user_uploads/3121/pJop8k9MmVekrpXBh41ckCLt/lml2.pdf\">here are my slides</a> about the course from the Southampton workshop.  The course worked well, but I spent a <em>ton</em> of effort writing my own custom dialect of Lean to support it, with tactics automating exactly the steps I wanted my students to think of as \"one chunk of reasoning\".  I don't think it would be possible to teach a Lean-bilingual course for early-undergrad students with off-the-shelf Lean.</p>",
        "id": 356785756,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1683570466
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> has also taught a Lean-bilingual course at this level and also spent a lot of effort developing custom automation for that course.</p>",
        "id": 356785999,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1683570544
    },
    {
        "content": "<p>I've twice taught our intro to proofs course using Lean. Introducing a theorem prover at the lower level was part of the reason I won our university award for innovative pedagogy so I think it can definitely be a positive for math education. </p>\n<p>You will not be able to convince the majority of faculty to completely turn over such a class to an ITP. The expectation is that students will emerge with the ability to communicate as mathematicians do currently: in writing and orally. As such, you will want to gear your use to addressing how learning to Lean can help students achieve these skills. </p>\n<p>Lots of translation exercises are essential. Students should be able to understand the mathematics in the written, oral, and digitized form. The ability to pass faithfully between them is a good signal for comprehension. </p>\n<p>Students learn in a variety of ways. Lean will be the way some really grok an concept. Others it may not help so much. Providing different incarnations of a mathematical truth in this way provides a better chance at reaching a broader section of the students. With group work, students can gather their strengths and teach each other. </p>\n<p>There will always be an extra learning curve, though <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span>'s natural language tactics are the future for education. In general, when you teach such a class, you want to ask yourself if student should walk out of the course able to consume existing code in mathlib. The answer here depends on the time and your goals. </p>\n<p>Lean also presents opportunities for gamification not usually present in such courses. I often lead students through a embedding of predicate logic into blockly to help open their mind as to the form of mathematics and proof. </p>\n<p>In my experience, using Lean as component in such a class can improve outcomes.</p>",
        "id": 356790427,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1683572019
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"260507\">Heather Macbeth</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/How.20to.20prove.20it.20in.20Lean/near/356785756\">said</a>:</p>\n<blockquote>\n<p>Here's a quick version of my own opinions on the subject.  I taught a Lean-bilingual intro-to-proof this semester -- <a href=\"https://hrmacbeth.github.io/math2001/\">here's the book</a> I wrote for it, and <a href=\"/user_uploads/3121/pJop8k9MmVekrpXBh41ckCLt/lml2.pdf\">here are my slides</a> about the course from the Southampton workshop.  The course worked well, but I spent a <em>ton</em> of effort writing my own custom dialect of Lean to support it, with tactics automating exactly the steps I wanted my students to think of as \"one chunk of reasoning\".  I don't think it would be possible to teach a Lean-bilingual course for early-undergrad students with off-the-shelf Lean.</p>\n</blockquote>\n<p>Many thanks, Heather, for referring me to your book and sharing your slides. I already read several parts. Maybe this is the way to go in the future, Lean-bilingual math books. I still have to experiment myself and also compare your presentation with Patrick Massot's Lean-bilingual course. In support of what you did, it seems to me that a little hand-waving and intuitive understanding of concepts will never be divorced from the way we (humans) do mathematics and enjoy doing it, from the earliest baby steps to the most advanced research-level arguments -- and it is nice that we have (and will have) a proof assistant next to us to confirm our semi-formal reasoning.</p>",
        "id": 357038146,
        "sender_full_name": "Assaf Kfoury",
        "timestamp": 1683649391
    }
]