[
    {
        "content": "<p>I could use advice on a related topic. I'd like to incrementally publish the Lean game I'm working on over the course of the semester, so my students can work on a few levels while I'm building the next ones. Everything is still under development and I'll be editing constantly so the game is not at all ready for public hosting on the Lean game server as described <a href=\"https://github.com/leanprover-community/lean4game/blob/main/doc/publish_game.md\">here</a>. </p>\n<p>What other options are available? How difficult would it be to change the URL. (For calibration, my personal website is on github and I maintain it myself, but don't understand any of the details of how it is built.)</p>\n<p>Another thought I've had is to follow the instructions to publish on the Lean game server but just not advertising the link anywhere (eg so it would be at the indicated URL but not listed on the main page). Is this an abuse of the Lean game server or would this work as a compromise?</p>",
        "id": 535494095,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1755779204
    },
    {
        "content": "<p>That's not an abuse of the game server. Thats how it is intended to be used.</p>",
        "id": 535501493,
        "sender_full_name": "Alexander Bentkamp",
        "timestamp": 1755781842
    },
    {
        "content": "<p>Emily, I'm trying to do the same thing! :) We can commiserate in our suffering... Here's my prototype, set up thanks to Jon: <a href=\"https://adam.math.hhu.de/#/g/AlexKontorovich/RealAnalysisGame\">https://adam.math.hhu.de/#/g/AlexKontorovich/RealAnalysisGame</a> Happy to compare notes at some point...</p>",
        "id": 535508049,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1755783929
    },
    {
        "content": "<p>(I guess I'm not as shy about airing my dirty laundry, it's out there for all to see...)</p>",
        "id": 535508229,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1755783981
    },
    {
        "content": "<p>There are at least two games written by me+students as part of summer projects on the server and which I've never publically advertised.</p>",
        "id": 535538760,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1755793310
    },
    {
        "content": "<p>Thanks for the advice. It's now on the web:</p>\n<p><a href=\"https://adam.math.hhu.de/#/g/emilyriehl/ReintroductionToProofs\">https://adam.math.hhu.de/#/g/emilyriehl/ReintroductionToProofs</a></p>\n<p>To make the public version I've done something which is perhaps a bit stupid which is clone two different versions of the Lean Game Server, one public and one private. The idea is I can work ahead of the class in the private version building future levels, which I periodically copy over to the public repository. So far I've just copied across the current drafts of the first two levels and kept the other five hidden (among other things, I'm still debating about the ordering). </p>\n<p>This is a bit annoying for implementing late stage edits (eg the typo I just caught in the intro text) but if there's a way to keep part of a git repository private while making the rest public, I've never figured this out...</p>",
        "id": 535583853,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1755812976
    },
    {
        "content": "<p>In case it helps: I eventually managed to figure out (with help) how to run the game locally, just from my laptop. So there's now a public version online, and also a private version on my computer. Whenever I want to move what I'm doing locally to the web, I PR to my branch, and set off the \"import trigger\" to the game server...</p>",
        "id": 535585020,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1755813623
    },
    {
        "content": "<p>PS: the local version is also really great because once I'm done editing the code, I run <code>lake build</code> in the terminal (3 secs), and refresh my browser (1 sec), and I see the outcome, as opposed to PRing to the branch, waiting ~5 mins for everything to compile, and then waiting another 5-10 mins for the trigger...</p>",
        "id": 535585528,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1755813833
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246635\">@Emily Riehl</span> You could use two git branches, one main branch and one work-in-progress branch. When you find typos in the main branch, you can fix them there. When you want to get the new levels from the work-in-progress branch into the main branch you can use 'git merge', which allows you to keep both the typo fixes and the new levels.</p>",
        "id": 535702638,
        "sender_full_name": "Alexander Bentkamp",
        "timestamp": 1755875036
    }
]