[
    {
        "content": "<p>Have any teachers used Lean to improve a mathematics course, without requiring the students themselves to learn Lean? I'm interested in how Lean might be used to improve a maths course while keeping it accessible to students with zero programming experience.</p>\n<p><span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span>'s <a href=\"https://arxiv.org/abs/2311.00007\">\"Mathematics and the formal turn\"</a> and <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span>'s <a href=\"https://www.imo.universite-paris-saclay.fr/~patrick.massot/files/exposition/why_formalize.pdf\">\"Why formalize mathematics?\"</a> both mention the possibility of providing proofs where the reader can choose the level of detail, which could be great for students. <span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span>'s <a href=\"https://kmill.github.io/#:~:text=Informalization\">website</a> contains some info and demos of a prototype of \"informalization\", but I gather the code hasn't been released yet.</p>\n<p>I know there have been <a href=\"https://leanprover-community.github.io/teaching/courses.html\">maths courses that teach Lean</a>, but informalisation opens up the possibility of using Lean/mathlib in a more unobtrusive way, eg for generating/checking course notes.</p>\n<p>I'm thinking of hacking together something along these lines myself. Are there any similar prototypes/ideas I should take a look at first?</p>",
        "id": 470542434,
        "sender_full_name": "Xander Mackay",
        "timestamp": 1726482471
    },
    {
        "content": "<p>I've used lean in a course to go through occasional proofs which I thought were nice to do in lean. I didn't introduce the software at all or talk about tactics, I just discussed how the infoview was changing as I typed more gobbledegook. I did short sessions in several classes and told people that if they had no idea what was going on then they could just read the proof in the printed notes.</p>",
        "id": 470548598,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1726483580
    },
    {
        "content": "<p>This is definitely a target of the Informal Lean project, but unfortunately this project does not move as much as we would like.</p>",
        "id": 470554885,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1726484875
    },
    {
        "content": "<p>About Kevin’s idea, you can also use the <a href=\"https://github.com/PatrickMassot/verbose-lean4\">Verbose Lean</a> library so that what is written in the proof script is also readable.</p>",
        "id": 470555151,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1726484931
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Informalisation.20for.20teaching/near/470554885\">said</a>:</p>\n<blockquote>\n<p>This is definitely a target of the Informal Lean project, but unfortunately this project does not move as much as we would like.</p>\n</blockquote>\n<p>Where is this project, and how do I join? I want to help make it move!</p>",
        "id": 470556641,
        "sender_full_name": "Xander Mackay",
        "timestamp": 1726485191
    },
    {
        "content": "<p>It is not yet ready for external contribution. Unfortunately Kyle and I are always overwhelmed by other tasks and we didn’t manage to reach the point where we want external contributions.</p>",
        "id": 470562284,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1726486209
    },
    {
        "content": "<p>Fair, I figured that might be the case. (Something something Mythical Man-Month, Brooks's law, etc.) I'll hack away at something similar myself, and see if I end up with anything worth sharing.</p>",
        "id": 470564579,
        "sender_full_name": "Xander Mackay",
        "timestamp": 1726486576
    }
]