[
    {
        "content": "<p>Hello all, I installed Lean and joined the Zulip last year after some conversations with <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> and <span class=\"user-mention\" data-user-id=\"130308\">@Neil Strickland</span> , but never managed to do anything. But now my postdoc <span class=\"user-mention\" data-user-id=\"562819\">@Bernhard Reinke</span> will be offering a Lean summer project for some A-level students from the University of Liverpool Maths School, so I think it is time to make an attempt to get into Lean. One question that has slightly held me back - and is relevant for the project as well, I think - is Lean 3 or Lean 4? Last year I think the work on porting MathLib to Lean 4 was under way, but still some way off, so in some sense it seemed to make sense to hold off on using Lean 4. Is that still the case, or should we start with Lean 4 straight away? Also, are there resources (in English) specifically useful for school students, beyond Kevin's \"Natural Numbers Game\"? Thanks, and apologies since probably this has been covered somewhere on here before, and if I was more proficient at navigating Zulip I might be able to find the information myself ...</p>",
        "id": 367917926,
        "sender_full_name": "Lasse Rempe",
        "timestamp": 1687265949
    },
    {
        "content": "<p>Mathlib is <a href=\"https://leanprover-community.github.io/mathlib-port-status/\">more than 90% ported</a> and will likely be fully ported in less than a month. Starting with Lean 4 is now unconditionally the best approach.</p>",
        "id": 367919559,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1687266230
    },
    {
        "content": "<p><a href=\"https://djvelleman.github.io/HTPIwL/\">https://djvelleman.github.io/HTPIwL/</a> and <a href=\"https://hrmacbeth.github.io/math2001/\">https://hrmacbeth.github.io/math2001/</a> both target Lean 4 and could be used with bright high-school students who have done NNG. By the way, a Lean 4 version of NNG is available at <a href=\"https://adam.math.hhu.de/#/g/hhu-adam/NNG4\">https://adam.math.hhu.de/#/g/hhu-adam/NNG4</a>.</p>",
        "id": 367920978,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1687266527
    },
    {
        "content": "<p>One possible snag with recommending Lean 4 now is that the documentation might be a bit confusing before Mathlib is fully ported, but as long as you provide install guidance to the students that should be fine.</p>",
        "id": 367921697,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1687266667
    },
    {
        "content": "<p>Thank you! That is great news that mathlib is almost ported. We'll go with Lean 4 on that recommendation!</p>",
        "id": 367943211,
        "sender_full_name": "Lasse Rempe",
        "timestamp": 1687270412
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathematics_in_lean\">Mathematics in Lean</a> is also working with Lean 4. The port from Lean 3 was done quickly and some cleanup and improvements are still needed (and in progress), but it should still be usable in its current state.</p>",
        "id": 368043240,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1687291712
    }
]