[
    {
        "content": "<p>I am planning to make an overview website  of Lean courses as part of our community website. If you've taught a course using Lean and you have some resources available, please write a reply in this thread. It doesn't have to be long, just an itemized list including things like:</p>\n<ul>\n<li>website for the course</li>\n<li>repository for the course</li>\n<li>pdf with course notes</li>\n<li>some tags (<code>algebra</code>, <code>analysis</code>, <code>logic</code>, <code>intro to proofs</code>, <code>software verfication</code>, <code>automated proofs</code>, ...)</li>\n<li>if you want: a short abstract/summary</li>\n<li>if you want: a reflection (would you teach this course again, or were there problems with it that you want to avoid, did you learn general lessons about \"teaching Lean\" that others should be aware of)</li>\n</ul>\n<p>All those items are optional, but the more data the merrier.</p>",
        "id": 341546528,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1678733123
    },
    {
        "content": "<p>You're aware of the following webpage maintained by <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span>, right? <a href=\"https://avigad.github.io/formal_methods_in_education/\">https://avigad.github.io/formal_methods_in_education/</a><br>\nI don't know if it is up-to-date or complete, but it is definitely a good place to start.</p>",
        "id": 341547545,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1678733418
    },
    {
        "content": "<p>Although I guess that's about resources, not exactly courses</p>",
        "id": 341547716,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1678733465
    },
    {
        "content": "<p>Course: formalising mathematics 2023. </p>\n<p>Website (under construction): <a href=\"https://www.ma.imperial.ac.uk/~buzzard/xena/formalising-mathematics-2023/index.html\">https://www.ma.imperial.ac.uk/~buzzard/xena/formalising-mathematics-2023/index.html</a><br>\nRepo : <a href=\"https://github.com/ImperialCollegeLondon/formalising-mathematics-2023\">https://github.com/ImperialCollegeLondon/formalising-mathematics-2023</a><br>\nTags: algebra, analysis, geometry, topology, logic, sets, functions, groups, lattices, finiteness, filters, vector spaces, measure theory, number theory, commutative algebra<br>\nShort abstract/summary: The course is project-based; the students must write three projects on undergraduate mathematics. The lectures are me live Lean coding, solving the <code>sorry</code>s in the repo.<br>\nI'm teaching the course again in 2024 and then it will be in Lean 4.</p>",
        "id": 341548413,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1678733673
    },
    {
        "content": "<p>Thanks, Floris! I started that page during the summer at the Isaac Newton Institute in 2017. But I haven't touched it in a few years now. It is worth a quick look to see if there is anything still relevant, but I don't think there is much. </p>\n<p>Johan, later today I'll add data on courses I have taught at CMU: Interactive Theorem Proving (based on MIL), Logic and Mechanized Reasoning, and the old course based on Logic and Proof.</p>",
        "id": 341548896,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1678733812
    },
    {
        "content": "<p>Course: Interactive Theorem Proving (Department of Mathematical Sciences, Carnegie Mellon University)<br>\nWebsite: <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">https://leanprover-community.github.io/mathematics_in_lean/</a> <br>\nRepository: <a href=\"https://github.com/leanprover-community/mathematics_in_lean\">https://github.com/leanprover-community/mathematics_in_lean</a> (lectures and assignments are in a private repository)<br>\nPDF with course notes: <a href=\"https://leanprover-community.github.io/mathematics_in_lean/mathematics_in_lean.pdf\">https://leanprover-community.github.io/mathematics_in_lean/mathematics_in_lean.pdf</a><br>\nTags: formalization of mathematics<br>\nAbstract: This was taught as a third year undergraduate course. We spent a little more than half the semester working through the first 6 chapters of MIL with weekly homework assignments. Students did a small independent project at the halfway point, and a larger one at the end.</p>\n<p>Course: Logic and Mechanized Reasoning (Department of Computer Science, Carnegie Mellon University)<br>\nWebsite: <a href=\"https://www.cs.cmu.edu/~mheule/15217-f21/\">https://www.cs.cmu.edu/~mheule/15217-f21/</a>, <a href=\"https://avigad.github.io/lamr/\">https://avigad.github.io/lamr/</a><br>\nRepository: <a href=\"https://github.com/avigad/lamr\">https://github.com/avigad/lamr</a><br>\nPDF with course notes: <a href=\"https://avigad.github.io/lamr/logic_and_mechanized_reasoning.pdf\">https://avigad.github.io/lamr/logic_and_mechanized_reasoning.pdf</a><br>\nTags: logic, automated reasoning, SAT, SMT, first-order theorem provers<br>\nAbstract: This course does three things: introduces students to the theory of propositional and first-order logic, shows them how to implement fundamental logical algorithms in Lean 4, and shows them how to use automated reasoning tools.</p>\n<p>Course: Logic and Proof (Department of Philosophy, Carnegie Mellon University)<br>\nWebsite:  <a href=\"https://leanprover.github.io/logic_and_proof/\">https://leanprover.github.io/logic_and_proof/</a><br>\nRepository for the course: none<br>\nPDF with course notes: <a href=\"https://leanprover.github.io/logic_and_proof/logic_and_proof.pdf\">https://leanprover.github.io/logic_and_proof/logic_and_proof.pdf</a><br>\nTags: introduction to logic, introduction to proof<br>\nAbstract: This is an introduction to logic and mathematical reasoning for a general audience.</p>",
        "id": 341594127,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1678750742
    },
    {
        "content": "<p>Course: Proofs and Programs (Department of Mathematics, Indian Insititute of Science, Bangalore)<br>\nWebsite: <a href=\"http://math.iisc.ac.in/~gadgil/proofs-and-programs-2023/\">http://math.iisc.ac.in/~gadgil/proofs-and-programs-2023/</a><br>\nRepository: <a href=\"https://github.com/siddhartha-gadgil/proofs-and-programs-2023\">https://github.com/siddhartha-gadgil/proofs-and-programs-2023</a> (both course code and website source).<br>\nDocs: <a href=\"http://math.iisc.ac.in/~gadgil/proofs-and-programs-2023/doc/PnP2023.html\">http://math.iisc.ac.in/~gadgil/proofs-and-programs-2023/doc/PnP2023.html</a> (generated by docgen4).</p>\n<p>Summary: This was an introduction to proving, programming and proving programs in Lean, and also the Dependent Type Theory foundations of Lean. The evaluation was based mainly on projects but also on labs.</p>\n<p>Experience so far: My plan was to live code, then clean-up and add documentation and generate notes with DocGen4. This worked very well for a month, with a lot of questions and my adapting explanations. Once the projects started the decoupling of lectures and evaluation led to a sharp drop in attendance. I course corrected and made lectures into project demo/help/live-coding. Advanced students explaining what they had done and less advanced explained what they had, where they were stuck, what they  needed etc and I (and their felow students) helped them get unstuck. This is working well. Next time I teach I will transition earlier and in a more planned way to this mode.</p>",
        "id": 341608888,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1678760203
    },
    {
        "content": "<p>Course: Theorem Prover Lab -- Applications in Programming Languages (Faculty of Informatics, KIT)<br>\nRepository: <a href=\"https://github.com/IPDSnelting/tba-2022\">https://github.com/IPDSnelting/tba-2022</a> (includes slides and exercises)<br>\nWebsite: <a href=\"https://pp.ipd.kit.edu/lehre/SS2022/tba/?lang=de\">https://pp.ipd.kit.edu/lehre/SS2022/tba/?lang=de</a> (partially German, includes more slides and the project descriptions)</p>\n<p>Summary: Masters course for computer science students with the first half of the term consisting of a hands-on introduction to Lean 4 and type theory and the second half consisting of the students working on either a semantics/compiler project or a formalisation of a graph theory problem.</p>\n<p>Experience: This was already the second year we used Lean 4 and it was good to do it in person again after teaching exclusively online due to Covid the year before. We had different levels of learning speed among the students but in the end everybody go the point where they intuitively could use Lean. Some students were really eager to golf every proof.</p>",
        "id": 341826611,
        "sender_full_name": "Jakob von Raumer",
        "timestamp": 1678807232
    },
    {
        "content": "<p>Course: Discrete Mathematics (Fordham University)<br>\nLecture notes/website:  <a href=\"https://hrmacbeth.github.io/math2001\">https://hrmacbeth.github.io/math2001</a><br>\nRepository: <a href=\"https://github.com/hrmacbeth/math2001\">https://github.com/hrmacbeth/math2001</a><br>\nTags: intro to proofs, number theory, combinatorics</p>\n<p>Summary: I have written this as a course which is completely bilingual between English and Lean, with every example presented both ways (students also have to solve every homework problem both ways).  It's the standard syllabus of a US \"intro to proofs\" course for first/second-year undergraduates, covering \"proof techniques\" (cases/existentials/contradiction/induction), good style in proof writing, parity/divisibility/modular arithmetic/GCD/primes, \"sufficiently large\", recurrence relations, injective/surjective/bijective functions, reflexive/symmetric/antisymmetric/transitive relations, and set operations.</p>\n<p>Reflection:  The course is ongoing, but so far so good!   I invested a lot of energy in writing <a href=\"https://hrmacbeth.github.io/math2001/Index_of_Tactics.html\">custom tactics</a> which perform exactly one step of reasoning that I would permit on paper, and deliberately never mentioned several more powerful tactics.  This is very useful if the course is explicitly supposed to teach good style in proof writing.  It lets you off the hook in grading -- you can just say \"that's not enough detail -- Lean wouldn't accept it!\"</p>",
        "id": 341922028,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1678835182
    },
    {
        "content": "<p>Thanks for all the replies so far! I will collect them into a <code>.yaml</code> file in a couple of days.</p>",
        "id": 341956368,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1678854036
    },
    {
        "content": "<p>Hi Everyone and thank you for all this work &amp; sharing. (1st time I'm posting in Zulip!).  I'm quite new with proof assistants, here is my small experience.</p>\n<p>Esisar_MA121_HA_lean_2023</p>\n<ul>\n<li>Course : Complement to general Analysis/Algebra 1st year undergraduate course</li>\n<li>Context : Esisar engineering school, 1st year students, 6 x 1,5h </li>\n<li>Website: <a href=\"https://github.com/ftranminh/Esisar_MA121_HA_lean_2023\">https://github.com/ftranminh/Esisar_MA121_HA_lean_2023</a></li>\n<li>Repository : <a href=\"https://github.com/ftranminh/Esisar_MA121_HA_lean_2023\">https://github.com/ftranminh/Esisar_MA121_HA_lean_2023</a></li>\n<li>\n<p>Summary : Short module introducing proof to 1st year undergraduates using Lean3 - in French.<br>\n  We used proof-term style in Lean.</p>\n</li>\n<li>\n<p>Experience : </p>\n<ul>\n<li>1st time we use a proof assistant to teach maths</li>\n<li>students globally appreciated it (feedback, autonomy, playful)</li>\n<li>some of them think it helped them with maths</li>\n<li>most of them found the Lean syntax difficult (they also tended to attribute their shortcomings in maths to a programming difficulties)</li>\n<li>many of them found the Lean error messages helpless</li>\n</ul>\n</li>\n</ul>\n<p>Thanks Johan Commelin for your initiative.</p>",
        "id": 342313435,
        "sender_full_name": "Frédéric Tran Minh",
        "timestamp": 1678973755
    },
    {
        "content": "<p>Thank you Johan!  You might also be interested in this thread from last year: <a href=\"#narrow/stream/113488-general/topic/List.20of.20Lean.20.28university.29.20courses/near/305068451\">https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/List.20of.20Lean.20.28university.29.20courses/near/305068451</a></p>",
        "id": 342442810,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1679009906
    },
    {
        "content": "<p>My course is called \"Logique et démonstrations assistées par ordinateur\" (Logic and computer assisted proofs)</p>\n<ul>\n<li>website for the course: <a href=\"https://www.imo.universite-paris-saclay.fr/~patrick.massot/enseignement/\">https://www.imo.universite-paris-saclay.fr/~patrick.massot/enseignement/</a> (the course is mentioned there but the actual webpage is not public unfortunately, it's in a moodle website)</li>\n<li>repository for the course: <a href=\"https://github.com/PatrickMassot/MDD154/\">https://github.com/PatrickMassot/MDD154/</a> (of course there is also a private repo with solutions, and I can give solutions to interested teachers)</li>\n<li>pdf with course notes: no single pdf but lecture notes at <a href=\"https://www.imo.universite-paris-saclay.fr/~patrick.massot/mdd154/\">https://www.imo.universite-paris-saclay.fr/~patrick.massot/mdd154/</a>, tactic cheat sheets at <a href=\"https://www.imo.universite-paris-saclay.fr/~patrick.massot/mdd154/aide-memoire.pdf\">https://www.imo.universite-paris-saclay.fr/~patrick.massot/mdd154/aide-memoire.pdf</a>, full tactic reference at <a href=\"https://www.imo.universite-paris-saclay.fr/~patrick.massot/mdd154/reference.pdf\">https://www.imo.universite-paris-saclay.fr/~patrick.massot/mdd154/reference.pdf</a></li>\n<li>tags:  <code>intro to proofs</code>, <code>analysis</code>, <code>natural language input</code></li>\n<li>abstract/summary: Since January 2019, I am using Lean to teach first year undergrad double major maths/CS students how to find and write mathematical proofs. I first did it alone and then with Frédéric Bourgeois and Christine Paulin. The main mathematical topic of this course is elementary real analysis, especially the theory of convergent sequences and continuous functions. Since 2021 I use a controlled natural language for input in order to facilitate transferring Lean proofs to pen and paper proofs.</li>\n<li>Reflection: This course really works well, and it will probably continue for a long time. The idea to use controlled natural language tactics seems a lot more efficient than the native syntax to ensure students improve at pen and paper proofs.</li>\n</ul>",
        "id": 342498908,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1679042564
    },
    {
        "content": "<p>A first version of the yaml file is available here: <a href=\"https://gist.github.com/8499d85596230c3b412fdf439c84f76d\">https://gist.github.com/8499d85596230c3b412fdf439c84f76d</a></p>",
        "id": 342821654,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1679162339
    },
    {
        "content": "<p>It will need a bit more curation. And eventually it will generate a nice website on the community home page</p>",
        "id": 342821691,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1679162358
    },
    {
        "content": "<p>I have not yet gone through the thread that Gabriel linked to.</p>",
        "id": 342821723,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1679162374
    },
    {
        "content": "<p>I taught an Introduction To Proofs course at Johns Hopkins in Fall 2022 entirely in Lean (teaching and assessment) culminating in the proof of Yoneda Lemma. </p>\n<p>Here's the course website: <br>\n<a href=\"https://sinhp.github.io/teaching/2022-introduction-to-proofs-with-Lean\">https://sinhp.github.io/teaching/2022-introduction-to-proofs-with-Lean</a></p>\n<p>and here's the github repo for lectures and homework problem sets: <br>\n<a href=\"https://github.com/sinhp/ProofLab\">https://github.com/sinhp/ProofLab</a></p>",
        "id": 348836385,
        "sender_full_name": "Sina",
        "timestamp": 1681335058
    },
    {
        "content": "<p>Late to the party:</p>\n<ul>\n<li>Fall 2020: Transition to Advanced Mathematics. Our intro to proofs course. Lean was about 1/3 of the course. Unfortunately, I put all course materials in the university Office 365 account so it is difficult to share. </li>\n<li><a href=\"https://300.f22.matthewrobertballard.com\">Fall 2022: Transition to Advanced Mathematics</a> A second iteration using Lean 4. </li>\n<li><a href=\"https://411.s23.matthewrobertballard.com\">Spring 2023: Formalization and mathematics</a> More a hybrid math-CS course that was focused on building ability with Lean and expanding students perspectives on math and programming. </li>\n<li><a href=\"https://github.com/UofSC-Spring-2023-Math-768-001\">Spring 2023: Formalization of mathematics</a> A graduate course where we spent about 2/3's of the course working through exercises from one of Kevin's classes in Lean 3 and then switched to bounding the edge chromatic number of graphs in Lean 4.</li>\n</ul>",
        "id": 351136976,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1681932392
    },
    {
        "content": "<p>Also late to the party, as we just finished our course.</p>\n<p>Course: Lean learning group 2023</p>\n<p>Website: <a href=\"https://www.maths.ed.ac.uk/~pkinnear/leancourse/\">https://www.maths.ed.ac.uk/~pkinnear/leancourse/</a> </p>\n<p>Tags: algebra</p>\n<p>Summary: A 1-semester course aimed at graduate students in algebra and related topics at Edinburgh, Heriot-Watt and Glasgow universities. Aimed to approach Lean as mathematicians and future formalisers, establishing proficiency in tactic mode. For the first part of the course we learned the basics of first-order logic in Lean using the tutorials project, before discussing some basics if types and type classes to talk about formalising algebra. Also made use of lftcm2020 exercise sheets, and MiL. Concluded with a hackathon working on some group projects.</p>\n<p>Reflections: We tried to avoid touching on too much type theory early on to get people confidently interacting with Lean quickly. In retrospect, it would have been good to cover this in more depth (albeit only later in the course, after establishing confidence interacting with Lean) to aid in dealing with the inevitable issues that arise when formalising an interesting piece of mathematics. Also, we originally aimed for the outcome of the course to be group projects working on mathlib contributions, but would now say that re-framing the goal as formalising something new in a format that is useful to you as a learner (e.g. as a worksheet/interactive part of a textbook) is a better goal pedagogically (and could still lead to, e.g., a mathlib contribution in the process even if that isn't the explicit goal).</p>",
        "id": 357910193,
        "sender_full_name": "Patrick Kinnear",
        "timestamp": 1683905185
    },
    {
        "content": "<p>A common theme on Lean-related courses in maths departments is that they seem to steer well clear of any type theory. I tell my students that a type is just what Lean calls a set, and Patrick doesn't even mention the word in his course (which is about \\R and \\N).</p>",
        "id": 357920441,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1683907131
    },
    {
        "content": "<p>Yes, we basically said \"types are like sets\" in this course, which was mostly fine but we did brush up against some minor issues when we tried to formalise things which do use actual sets and not types. Not insurmountable but I think next time I'd want to think a bit more about how to say something more about types. But in the above tradition of maths Lean courses, we'll try to steer clear of mentioning them, at least to start with.</p>",
        "id": 357926215,
        "sender_full_name": "Patrick Kinnear",
        "timestamp": 1683908307
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Lean.20courses.20around.20the.20world/near/357920441\">said</a>:</p>\n<blockquote>\n<p>A common theme on Lean-related courses in maths departments is that they seem to steer well clear of any type theory. I tell my students that a type is just what Lean calls a set, and Patrick doesn't even mention the word in his course (which is about \\R and \\N).</p>\n</blockquote>\n<p>Is this also what folks are recommending in CS or proofs courses, or is this specific to math courses? #TPIL leads with types in chapter 2, after all</p>",
        "id": 358122669,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1683989515
    },
    {
        "content": "<p>I don't know if this is the right place, but I joined this Quantum Formalism group, and they're starting a Software Verification / Lean course. The repo is here: <a href=\"https://github.com/quantumformalism/software-verification\">https://github.com/quantumformalism/software-verification</a> and Benedikt Ahrens is facilitating it (we do the leg work, and we come each week with questions). It's supposed to focus on functional programming, lean and software verification (starting around May 22nd-ish?). Week 1 has already been released, reading LeanProver chapters 1-4 and working through assigned problem sets. At the end of six weeks, the goal is to work on a project, also.</p>",
        "id": 359058436,
        "sender_full_name": "Krystal Maughan",
        "timestamp": 1684349483
    },
    {
        "content": "<p>What is \"LeanProver chapters 1-4\"? Edit: looking at the web page it might be Logical Verification.</p>",
        "id": 359067672,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1684352470
    },
    {
        "content": "<p>What is the <a href=\"https://zaikugroup.com\">Zaiku Group</a>?</p>",
        "id": 359459038,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1684431669
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> <span aria-label=\"yes\" class=\"emoji emoji-1fae1\" role=\"img\" title=\"yes\">:yes:</span> it's the Logic and Proof chapter! <span class=\"user-mention\" data-user-id=\"306577\">@Matthew Ballard</span> it's a group I heard about through a Quantum Computing Meetup I was attending online based in the Bay area. A couple people in that Meetup study together and have been doing the Quantum Formalism workshop (see <a href=\"https://quantumformalism.substack.com/\">https://quantumformalism.substack.com/</a>), and they usually have the sessions on YouTube each week: <a href=\"https://www.youtube.com/@ZaikuGroup/videos\">https://www.youtube.com/@ZaikuGroup/videos</a></p>",
        "id": 359460188,
        "sender_full_name": "Krystal Maughan",
        "timestamp": 1684431960
    },
    {
        "content": "<p>I joined the Quantum Computing Meetup group because we are going through (currently at Chapter 5) the Quantum Computation and Quantum Information book by Nielsen and Chuang together, but the Discord is a larger one with people who have intersecting interests in Quantum Mechanics, Category Theory and other stuff like that. I heard about the Zaiku group through that and the people seem nice so far, but I just started by signing up for the Software Verification workshop.</p>",
        "id": 359460774,
        "sender_full_name": "Krystal Maughan",
        "timestamp": 1684432120
    },
    {
        "content": "<p>I teach Lean 4 as a part of M&amp;M, which is something like an online course for math-olympiad highschoolers:<br>\n<a href=\"https://cs.wikipedia.org/wiki/M%26M_(%C4%8Dasopis)\">https://cs.wikipedia.org/wiki/M%26M_(%C4%8Dasopis)</a></p>\n<p>Repository here:<br>\n<a href=\"https://github.com/madvorak/lean-mam\">https://github.com/madvorak/lean-mam</a></p>\n<p>README will contain links to all texts that will have been published.<br>\nIt is entirely in Czech (an obscure Slavic language).</p>\n<p>PS: Riki is the name of the fox (our mascot). Say hi to him!</p>",
        "id": 364498858,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1686217092
    },
    {
        "content": "<p>Thanks for providing all the data. There is now a website collecting these courses: <a href=\"https://leanprover-community.github.io/courses.html\">https://leanprover-community.github.io/courses.html</a><br>\nIn the near future, it should be added to the menu of the website.</p>\n<p>To add a new course to this page, please PR data for the course to <a href=\"https://github.com/leanprover-community/leanprover-community.github.io/blob/lean4/data/courses.yaml\">https://github.com/leanprover-community/leanprover-community.github.io/blob/lean4/data/courses.yaml</a></p>",
        "id": 370305829,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1687936877
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"513593\">@Phil Wood</span> and <span class=\"user-mention\" data-user-id=\"347475\">@Bjørn Kjos-Hanssen</span> who have been teaching with Lean afaik.<br>\nIf you like the idea of having your course listed on this page, please make a PR <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 370306142,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1687936937
    },
    {
        "content": "<p>ditto <span class=\"user-mention\" data-user-id=\"233737\">@Gihan Marasingha</span>: I think your course is also not in the list collected so far.</p>",
        "id": 370484894,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1687967737
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Lean.20courses.20around.20the.20world/near/370306142\">said</a>:</p>\n<blockquote>\n<p>cc <span class=\"user-mention silent\" data-user-id=\"513593\">Phil Wood</span> and <span class=\"user-mention silent\" data-user-id=\"347475\">Bjørn Kjos-Hanssen</span> who have been teaching with Lean afaik.<br>\nIf you like the idea of having your course listed on this page, please make a PR <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>\n</blockquote>\n<p>Thanks <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span>, request sent!</p>",
        "id": 370534364,
        "sender_full_name": "Bjørn Kjos-Hanssen",
        "timestamp": 1687976773
    },
    {
        "content": "<p>Should <span class=\"user-mention\" data-user-id=\"453098\">@Dan Velleman</span>'s <em>How to Prove it With Lean</em> (<a href=\"https://djvelleman.github.io/HTPIwL/\">https://djvelleman.github.io/HTPIwL/</a>) go on this list, or should we wait until the Lean Resources page is updated? (As far as I know, the materials have not yet been used for a course, but they are ready to go for that purpose.)</p>",
        "id": 370555850,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1687981195
    },
    {
        "content": "<p>I think this list should be for actual courses taught in front of actual students. So HTPIwL as a resource itself should go on the page of resources / learning materials. But if someone uses it in the classroom then that course should go on this list.</p>",
        "id": 370556296,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1687981303
    },
    {
        "content": "<p>HTPIwL is not quite ready to go, but it's getting close--I'm still working on the last chapter, and then there will probably be some cleaning up to do.  I don't think anyone has used it in a course, but that may happen next year.</p>",
        "id": 370557027,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1687981469
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"260507\">Heather Macbeth</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Lean.20courses.20around.20the.20world/near/370484894\">said</a>:</p>\n<blockquote>\n<p>ditto <span class=\"user-mention silent\" data-user-id=\"233737\">Gihan Marasingha</span>: I think your course is also not in the list collected so far.</p>\n</blockquote>\n<p>Thanks Heather! I think I've made a PR now.</p>\n<p>I should also say that I've been writing up a book to go with the interactive resource and have been talking to an editor a Springer. The draft version is in Lean 3 (as that's what I've been using with my students), but I should be updating to Lean 4 over the summer. It would be great to get some feedback from the community.</p>",
        "id": 372052881,
        "sender_full_name": "Gihan Marasingha",
        "timestamp": 1688398806
    },
    {
        "content": "<p>I just sent a pull request with a course I am currently  teaching. It is not about Lean, we just use Lean as an optional complementary tool to teach general topology. I hope it fits.</p>",
        "id": 395550758,
        "sender_full_name": "Miguel Marco",
        "timestamp": 1696777402
    },
    {
        "content": "<p>As long as the use of Lean is not infinitesimal then it fits.</p>",
        "id": 395551813,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1696778103
    },
    {
        "content": "<p>Assuming the description is clear.</p>",
        "id": 395551829,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1696778110
    },
    {
        "content": "<p>Could you explain whether only the instructor is using Lean or students are expected to write Lean code? Both are interesting uses, but very different.</p>",
        "id": 395551948,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1696778201
    },
    {
        "content": "<p>So far I just showed some examples to the students. They are not expected to touch lean at all if they don't want to (that was something we had very clear from the beginning: the usage of lean should be totally optional). However, several students have shown interest in it, so we will do some introductory seminars. So we sill see what happens from there.</p>",
        "id": 395553199,
        "sender_full_name": "Miguel Marco",
        "timestamp": 1696779069
    },
    {
        "content": "<p>Ok, so this is similar to how Kevin Buzzard used Lean in the very beginning. This is a very valid use case. Could you add this information to your PR?</p>",
        "id": 395553979,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1696779666
    },
    {
        "content": "<p>It's how I'm still using lean now in one of the courses I'm teaching. I'll be playing the natural number game live in lectures a week tomorrow but the students don't have to play if they don't want to</p>",
        "id": 395554795,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1696780402
    },
    {
        "content": "<p>I just updated the PR.</p>",
        "id": 395558044,
        "sender_full_name": "Miguel Marco",
        "timestamp": 1696782956
    },
    {
        "content": "<p>I finally decided to advertise some of the classes I have been teaching here in Brazil on the community's website—thank you, <span class=\"user-mention\" data-user-id=\"378478\">@Ashley Blacquiere</span>  for the reminder/invitation!</p>\n<p>However, before submitting the PR with my entries, I would like some help.<br>\nContext: I have worked in reforming the curriculum of my department, and now some <em>required</em> courses are expected to be taught using proof assistants, although professors teaching them for the time being are free to opt-out from this—hey, baby steps!  This means I have been teaching some required courses on a yearly (or even \"semesterly\") basis for quite some time now (since 2016).  Before 2021 use of proof assistants was optional for students of <em>my</em> classes (offering bonus marks for solving related exercises, etc.) and they could choose Lean, Agda, or Coq; but starting from 2021 use of Lean specifically is required for my classes.</p>",
        "id": 540685276,
        "sender_full_name": "Thanos Tsouanas",
        "timestamp": 1758489361
    },
    {
        "content": "<p>Question 1: Should I create a separate entry for each course-instance taught (i.e., one per year)?  There is a clear and long “evolution” of these courses throughout the years (2016–2025) (in content, methodology, focus, tools), so an alternative would be to submit a few representative instances instead of all 15(!).  Ideas?</p>\n<p>I see that there are already examples on this site with a couple of instances, but the maximum number of repeated instances that I spotted was 2.  The course with the most instances I have taught now has 7 instances with <em>required</em> use of Lean by the students, and 8 more when its use was still optional (also: earlier instances used Lean 3, while newer ones use Lean 4).<br>\nEach instance does have its own separate website, with complete log of classes, some have complete video recordings, exams, lecture notes, blackboard PDFs, etc.</p>",
        "id": 540685293,
        "sender_full_name": "Thanos Tsouanas",
        "timestamp": 1758489376
    },
    {
        "content": "<p>Question 2: I am also the creator/coordinator of a teaching assistance project that operates in a course-independent manner: the students-who-work-for-it (2–4 TA's per year, with funding) use Lean in their classes (they prepare and deliver their own classes that involve stating and proving a couple of theorems in each class, the objective being achieving properly written proofs in natural language), and they also organize weekly Lean games/arenas for the students-who-benefit-from-it (students of the department enrolled in any math-related course that involves proofs).  Technically this is not an official course in the syllabus—in the sense that students do not enroll to get a grade in it: it is more like a seminar—but I think it is reasonable to list it as well given that some seminars do show up on the courses list.  Is that OK?</p>",
        "id": 540685303,
        "sender_full_name": "Thanos Tsouanas",
        "timestamp": 1758489385
    },
    {
        "content": "<p>Question 3: The comments on <code>courses.yaml</code> mention a <code>language</code> field for non-English courses, but I see that none of the current entries use it: instead they include the language name in the <code>tags</code> list.  I guess it is safe/better to use both?</p>",
        "id": 540685308,
        "sender_full_name": "Thanos Tsouanas",
        "timestamp": 1758489400
    },
    {
        "content": "<p>Question 4: On a related note, is it better to translate the course titles?  (Looking at the existing entries I guess  the common practice is to leave it intact, but I think it would be better to see all course titles in English on that list.)</p>",
        "id": 540685315,
        "sender_full_name": "Thanos Tsouanas",
        "timestamp": 1758489407
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"384773\">@Thanos Tsouanas</span> - thanks for the message and questions. I'll provide a bit of an answer here from the FRO's perspective, but I do want to stress that the course list is a community resource and so serves a number of different purposes.</p>\n<p>From the FRO perspective it's easiest to answer your first two questions: Having all types of university-sponsored events (courses, workshops, seminars, etc.) recorded is very valuable, and having a clear indicator of number of instances is also highly valuable. So I'd be all for you adding your seminar. As for unique entries per course, I would say that updating a single entry to include each year offered would be great, and unique entries are probably only necessary when some metadata (like instructor name) changes. In your specific case, it's probably ok to indicate in the summary that the course had been offered 7 times previously with Lean optional.</p>\n<p>I have no strong opinion on question 3 or 4. Consistency is probably your best bet.</p>\n<p>Thanks again for adding your courses. The FRO very much appreciates the community's willingness to self-report and maintain this list, since it helps us better understand global Lean use.</p>",
        "id": 541942138,
        "sender_full_name": "Ashley Blacquiere",
        "timestamp": 1759119515
    }
]