[
    {
        "content": "<p>(asking for a friend) is there a lean tutorial aimed at self-motivated younger newbies like 8th graders? Maybe that is too early. But many schools introduce programming as early as 6th grade (my school in India did), so I don't see why Lean cannot be introduced at 8th grade to help solidify mathematical understanding. for example, some of the \"solve for x equational problems\" that 8th graders solve can be formalized in Lean.</p>",
        "id": 518129051,
        "sender_full_name": "Abhishek Anand",
        "timestamp": 1747245913
    },
    {
        "content": "<p>How does the <a href=\"https://adam.math.hhu.de/#/g/leanprover-community/nng4\">natural number game</a> go down with a self-motivated 8th grader? I don't usually go that low but I wonder whether the tutorial level would be fine</p>",
        "id": 518132994,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747247193
    },
    {
        "content": "<p>Another alternative is Heather Macbeth's \"the mechanics of proof\" <a href=\"https://hrmacbeth.github.io/math2001/\">https://hrmacbeth.github.io/math2001/</a> . That has a bunch of \"solve for x equational problems\" at the start.</p>",
        "id": 518133234,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747247277
    },
    {
        "content": "<p>Thanks. I will pass these on. Also, something like NNG for 8th-grade-level geometry, with a tool to visualize the hypotheses would be great.</p>",
        "id": 518160444,
        "sender_full_name": "Abhishek Anand",
        "timestamp": 1747257373
    },
    {
        "content": "<p>Yes I totally agree, in the UK we teach so-called \"circle theorems\" to what we call year 9 kids, I would love to make a geometry game where you can click on points and angles and then invoke theorems but it's basically a very big project which will need expertise in several areas</p>",
        "id": 518160894,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747257590
    },
    {
        "content": "<p>And I've kind of got my hands full with some polynomial equation for the next 4.5 years</p>",
        "id": 518161009,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747257627
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"259905\">@Abhishek Anand</span>   you may want to take a look at <a href=\"https://github.com/mirefek/geo_logic\">GeoLogic</a></p>",
        "id": 518300502,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1747315018
    }
]