[
    {
        "content": "<p>Hi all,</p>\n<p>I started hacking on a very early stage, very minimal project that aims to be an independent version of mathlib digestible to newcomers. I'm mainly working on this to teach _myself_ Lean. I don't anticipate it'll be of much use to anyone - and it is likely full of juvenile decisions - but in my experience throwaway projects like this tend to become useful once they pick up a bit of steam. </p>\n<p><a href=\"https://github.com/daniel-levin/Minimathlib\">https://github.com/daniel-levin/Minimathlib</a></p>",
        "id": 531374795,
        "sender_full_name": "Daniel Levin",
        "timestamp": 1753710337
    },
    {
        "content": "<p>Starting with abstract definitions (like TopologicalSpace) rather than specific problems to solve/prove?</p>",
        "id": 531376350,
        "sender_full_name": "suhr",
        "timestamp": 1753710752
    },
    {
        "content": "<p>The abstract definitions only exist so that I can later define interesting theorems that can be dispatched with undergrad level mathematics. One of my goals is to make the statements of interesting theorems not just easy to understand but also relatively self-contained. That probably means a lot of 'flattened' type classes and a lot of time spent figuring out appropriate definitions.</p>",
        "id": 531377662,
        "sender_full_name": "Daniel Levin",
        "timestamp": 1753711044
    },
    {
        "content": "<p>My target audience is me: someone who has an undergraduate degree in mathematics and works as a programmer but has _no idea_ how to formalize mathematics</p>",
        "id": 531378030,
        "sender_full_name": "Daniel Levin",
        "timestamp": 1753711124
    },
    {
        "content": "<p>Proving some result is usually a good way to figure out all the definitions and lemmas you actually need.<br>\nAnd it usually turns out that you need a lot of lemmas.</p>",
        "id": 531379571,
        "sender_full_name": "suhr",
        "timestamp": 1753711471
    },
    {
        "content": "<p>Doing the exercises in <a href=\"https://github.com/teorth/analysis\">https://github.com/teorth/analysis</a> achieves a similar goal and has been my source of material to learn Lean. Especially chapter 2 and chapter 3 have self isolated Peano and ZFC set axiomatization not using mathlib along with basically every basic theorem you would like to proof for those.</p>",
        "id": 531744521,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1753849381
    },
    {
        "content": "<p>We discuss those in <a class=\"stream\" data-stream-id=\"514017\" href=\"/#narrow/channel/514017-Analysis-I\">#Analysis I</a> btw</p>",
        "id": 531744552,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1753849402
    }
]