[
    {
        "content": "<p>I like to send a Lean4 proof of a mathematical problem to a mathematician who has no Lean installed. I thought it would be nice to have a tool, that converts a Lean4 proof to a kind of flip-book animation packaged in a PDF. That is, the PDF shall present the view of, say, VSCode, that is, the proof script on the left side and the current variables and goals on the right side. Landscape paper orientation would be prefered. Every PDF page highlights one proof step and shows the according outcome on the right side.<br>\nIs there already a tool that can do this?<br>\nCould be also nice for preserving proofs and may simplify upgrading them to future versions of Mathlib.</p>",
        "id": 521056033,
        "sender_full_name": "thielema",
        "timestamp": 1748511041
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover/verso\">Verso</a> lets you generate websites and PDFs where you can see the proof states. <a href=\"https://storage.googleapis.com/deepmind-media/DeepMind.com/Blog/imo-2024-solutions/P1/index.html\">Here's an example.</a> (Ignore the ugly proof; it's AI-generated.) You might be able to get Verso to produce a document in your desired format by mashing together the verso-blog and verso-manual <a href=\"https://github.com/leanprover/verso/tree/main/src\">genres</a>.</p>",
        "id": 521070962,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1748516519
    },
    {
        "content": "<p>I made such displays in <em><a href=\"https://djvelleman.github.io/HTPIwL/\">How To Prove It with Lean</a></em>, especially in Chapter 3.  However, I didn't have a tool to do it--I just created the displays by hand.</p>",
        "id": 521172725,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1748553628
    },
    {
        "content": "<p>Unless you really really want a pdf rather than a web page then verso is definitely the way to go.</p>",
        "id": 521331732,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1748622509
    },
    {
        "content": "<p>Is there a verso tutorial in the style of markdown tutorials?</p>",
        "id": 521356924,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1748632422
    }
]