[
    {
        "content": "<p>Hoi allemaal!</p>\n<p>Spreek je nederlands, en ben je fan van <span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span>'s <code>verbose-lean4</code> controlled-natural-language tactics? Help dan mee om een nederlandse versie te maken.</p>\n<p>Ik heb een beginnetje gemaakt op <a href=\"https://github.com/jcommelin/verbose-lean4/tree/dutch\">https://github.com/jcommelin/verbose-lean4/tree/dutch</a></p>\n<p>Als je mee wilt helpen, reageer dan op dit bericht, dan geef ik je push-access op deze repo. Wanneer we klaar zijn met de vertaling kunnen we een PR maken naar de originele repo van Patrick.</p>",
        "id": 452346485,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1721309725
    },
    {
        "content": "<p>Bij sommige vertalingen heb ik niet het gevoel dat ik de optimale keuze heb gemaakt. Dus feedback op mijn vertalingen/keuzes is van harte welkom!</p>",
        "id": 452346704,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1721309768
    },
    {
        "content": "<p>I am considering to write a German version over the next year...</p>",
        "id": 452347203,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1721309893
    },
    {
        "content": "<p>You can find the Italian version I am working on <a href=\"https://github.com/pitmonticone/verbose-lean4/tree/italian\">here</a>.</p>",
        "id": 452859079,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1721492214
    },
    {
        "content": "<p>You should not need to fork the library to write a version in your own language. You should import it in your library. If this isn’t sufficient then you should tell me about this issue.</p>",
        "id": 453118395,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1721638014
    },
    {
        "content": "<p>Note that I’m currently working on porting my Lean 3 course to Lean 4 and this will probably uncover issues with the Lean 4 version of the library. Hopefully this will be done this week (ideally before my talk on Wednesday but this isn’t guaranteed).</p>",
        "id": 453118755,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1721638095
    },
    {
        "content": "<p>But if we want to upstream the translations, then we would need a fork, right?</p>",
        "id": 453119771,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1721638307
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Project.3A.20Dutch.20version.20of.20verbose-lean4/near/453119771\">said</a>:</p>\n<blockquote>\n<p>But if we want to upstream the translations, then we would need a fork, right?</p>\n</blockquote>\n<p>I feel like different meanings/connotations of \"fork\" create confusion here. Sometimes it means you're splitting off the repo into something that is your own and diverging. Other times, especially on GitHub, you are just using it logistically the same way you would a branch, with the intent of upstreaming.</p>",
        "id": 453158204,
        "sender_full_name": "Chris Henson",
        "timestamp": 1721649255
    },
    {
        "content": "<p>If you want to upstream your translation then you need to promise to (try) to maintain it whenever the main library changes. Because I won’t be able to maintain a Dutch (or even German) version. If you keep it separated then you can simply pin the dependency version and update it when you have time.</p>",
        "id": 453175406,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1721654693
    }
]