[
    {
        "content": "<p>Hi all, I'm hoping to run an introduction to Lean workshop at my institution in early May. This will be a single 2-hour session, so I'm hoping to structure it as partly hands-on and partly a demo. I may be able to ask attendees to install Lean in advance, but I'm not certain of it.</p>\n<p>1) Would you recommend just having attendees use the Lean web interface? Alternately, should I hold a pre-workshop \"help with installing Lean\" session?</p>\n<p>2) Has anyone done a single-session workshop like this before? If so, any suggestions would be totally welcome.</p>\n<p>I'm thinking of something like the following:</p>\n<ul>\n<li>(10 minutes) Briefly show the Natural Number Game so attendees can find it later if they're interested and don't have Lean installed</li>\n<li>(30 minutes) Demonstrate a couple of proofs in Lean -- first something elementary to demonstrate tactics, then something more high-level to demonstrate how one builds up lemmas and an API.</li>\n<li>(60-80 minutes) Attendees work on a structured set of problems, e.g. part of an LftCM workshop problem set.</li>\n</ul>\n<p>My goal is to get attendees equipped to continue working on Lean after the session -- so the installation and other technical hurdles will be taken care of, and they've done some 'basic' proofs on their own. That seems like the best way for attendees to come away with something real.</p>",
        "id": 338054381,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1677354990
    },
    {
        "content": "<p>I would tell everyone to install beforehand and only let on on the day that if you failed then there's another option ;-)</p>",
        "id": 338054642,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1677355155
    },
    {
        "content": "<p>Using gitpod is usually a more pleasant experience than the (lean3) web editor: it has widgets and performs better.</p>",
        "id": 338055349,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1677355593
    },
    {
        "content": "<p>But local installations are a good thing to encourage too</p>",
        "id": 338055390,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1677355621
    },
    {
        "content": "<p>What is gitpod?</p>",
        "id": 338055528,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1677355688
    },
    {
        "content": "<p>The main problem I suspect you'll have with your setup is that it takes a lot of time to learn the standard finite list of tactics and lemmas necessary to work on problems in a given area. With NNG you can get all the way to (x+y)^2=x^2+2xy+y^2 with three tactics and building your own lemmas. The moment you branch out to more serious mathematics you need to know about ten basic tactics and also perhaps a bunch of standard lemmas depending on what you're doing. If you look at my course this year I think I've managed to find a way through which minimises the pain, but there's a lot of basic logic involved to get students proficient with about ten tactics before we start on real numbers and limits.</p>",
        "id": 338055649,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1677355774
    },
    {
        "content": "<p>Oh I see. Do you recommend people do the NNG before attempting actual Lean?</p>",
        "id": 338055778,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1677355848
    },
    {
        "content": "<p>Gitpod is the \"online play\" link mentioned <a href=\"https://github.com/ImperialCollegeLondon/formalising-mathematics-2023\">here</a></p>",
        "id": 338055825,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1677355876
    },
    {
        "content": "<p>I still think it would be good to show a demo of serious mathematics, just to show people what to be working towards. That it's not all elementary logical manipulations, and that eventually you (hopefully) get to write proofs that sound a bit closer to human-level reasoning, with elementary details taken care of.</p>",
        "id": 338055953,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1677355928
    },
    {
        "content": "<p>(But this wouldn't be part of the hands-on stuff)</p>",
        "id": 338055979,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1677355942
    },
    {
        "content": "<p>As you can see I get into limits of sequences asap but before that I do a bunch of logic. Patrick's tutorial also goes straight for real analysis; this is also definitely worth looking at</p>",
        "id": 338056005,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1677355954
    }
]