[
    {
        "content": "<p>Is it feasible for me to setup a local lean server for students to use Lean on the web, similar to <a href=\"https://live.lean-lang.org/\">https://live.lean-lang.org/</a>, where I can preload libraries for the students to use?  If so, are there instructions for how to do this?</p>\n<p>I'm using Lean in an undergrad course with 150 students running Lean on their own computers.  There are the usual collection of odd behaviours that the students encounter.  Most the problems are caused by students not following the installation instructions, or having oddly configured computers.   Having a web version would be nice for students who are having difficulty installing Lean themselves.</p>\n<p>-mark</p>",
        "id": 473385692,
        "sender_full_name": "Mark Aagaard",
        "timestamp": 1727557834
    },
    {
        "content": "<p>Is gitpod not a good solution for you?</p>",
        "id": 473389032,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1727561140
    },
    {
        "content": "<p>See for example the README of my FLT project <a href=\"https://github.com/ImperialCollegeLondon/FLT\">https://github.com/ImperialCollegeLondon/FLT</a> : just under the title there's a \"gitpod - ready to code\" link and if you click there then you get an online version of the FLT project with a fully compiled mathlib.</p>",
        "id": 473389145,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1727561240
    },
    {
        "content": "<p>Gitpod still requires using vscode. Usually not a big deal but a solution that does not require installing any software would be better.</p>",
        "id": 473389356,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1727561457
    },
    {
        "content": "<p>No it doesn't! (edit: it doesn't require <em>installing</em> VSCode. You have to know how to use the vscode clone that gitpod sends you to of course)</p>",
        "id": 473389554,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1727561666
    },
    {
        "content": "<p>Technically gitpod doesn't require that either, you can use it just fine with e.g. <code>lean.nvim</code> as well (instructions are <a href=\"https://github.com/Julian/lean.nvim/wiki/The-lean.nvim-Manual#using-leannvim-in-gitpod--to-work-on-mathlib4\">here</a>). Though I doubt that's the concern in a teaching channel?</p>",
        "id": 473389808,
        "sender_full_name": "Julian Berman",
        "timestamp": 1727561925
    },
    {
        "content": "<p>Sorry, I wrote that totally wrong. Students have to join (not install) gitpod, which may not be approved.</p>",
        "id": 473390143,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1727562256
    },
    {
        "content": "<p>At my university, there is an approval process for any thing that might store student data on servers not controlled by the university. This is not really enforced and we still ask our students to use things that haven't (yet) been approved, but we're breaking the rules anytime we do that.</p>",
        "id": 473390544,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1727562689
    },
    {
        "content": "<p>Have you looked at distributing devcontainers?</p>",
        "id": 473390732,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727562888
    },
    {
        "content": "<p>Mathlib has devcontainers</p>",
        "id": 473390738,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727562898
    },
    {
        "content": "<p>You need to install vscode but after that you can ask students to open the devcontainer that you provide</p>",
        "id": 473390769,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727562940
    },
    {
        "content": "<p>As a last resort, you can use an old trick, which is distributing virtualbox VMs with lean pre-installed, and a project directory setup</p>",
        "id": 473390860,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727563064
    },
    {
        "content": "<p>I just quickly setup a gitpod clone of Kevin Buzzard's FLT environment.  It provides the features that I want, but I am concerned about asking students to create an account at an external organization.  </p>\n<p>I haven't investigated dev containers yet.  My first choice to have a web interface, so that the students don't have to install anything and I can update the environment easily.</p>\n<p>-mark</p>",
        "id": 473391018,
        "sender_full_name": "Mark Aagaard",
        "timestamp": 1727563210
    },
    {
        "content": "<p>Gitpod allows self hosting, but I have to guess this will cost a bit: <a href=\"https://www.gitpod.io/contact/enterprise-self-serve\">https://www.gitpod.io/contact/enterprise-self-serve</a></p>",
        "id": 473391058,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727563280
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 473391074,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727563300
    },
    {
        "content": "<p>There are good other tools for self-hosting devcontainers a la Gitpod. The one I've seen is... <a href=\"https://github.com/loft-sh/devpod\">https://github.com/loft-sh/devpod</a></p>",
        "id": 473391148,
        "sender_full_name": "Julian Berman",
        "timestamp": 1727563378
    },
    {
        "content": "<p>It'd probably be nice if some day someone tries that out with Mathlib for exactly the reason Francois mentions (which technically I've run into in the past as well...).</p>",
        "id": 473391164,
        "sender_full_name": "Julian Berman",
        "timestamp": 1727563404
    },
    {
        "content": "<p>One thing I learnt about platform agnostic no install process is that someone somewhere has to install docker</p>",
        "id": 473391490,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1727563777
    },
    {
        "content": "<p>Yep definitely, but things like binder hub or that devpod thing mean hopefully the \"someone somewhere\" is \"your uni's container cluster\" and not any individual student.</p>",
        "id": 473391572,
        "sender_full_name": "Julian Berman",
        "timestamp": 1727563862
    },
    {
        "content": "<p>to quickly circle back on the original question, installing lean4web on your own servwr and letting it run your custom lean project (with whatever dependencies you want. The instructions are at the github repo:</p>\n<p><a href=\"https://github.com/leanprover-community/lean4web\">https://github.com/leanprover-community/lean4web</a></p>\n<p>(which btw is directly linked from the menu of <a href=\"http://live.lean-lang.org\">live.lean-lang.org</a>)</p>\n<p>If you run into troubles or have questions, please DM me anytime, I can help<span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span> (or maybe be coerced into improving the docs <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span>).</p>\n<p>For having 150 students on it simultaneously (all using mathlib) you probably need quite a powerhorse of a server... I dont have the numbers in my head right now, you might need to do some testing again yourself. maybe Lean does good memory sharing and all is okay, I dont exactly know/remember these technical details about how Lean processes work</p>",
        "id": 473393966,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1727566598
    },
    {
        "content": "<p>Thanks for the pointer to the github for lean4web.  I should have taken the time to check all of the links on <a href=\"http://live.lean-lang.org\">live.lean-lang.org</a>.  I just assumed that the github link pointed to the main github site for Lean.</p>\n<p>-mark</p>",
        "id": 473395384,
        "sender_full_name": "Mark Aagaard",
        "timestamp": 1727568157
    },
    {
        "content": "<p>Did you try using lean4web? I am looking into doing a similar thing, but for ~300 students, so I am curious if this is a workload lean4web can handle.</p>",
        "id": 476966886,
        "sender_full_name": "Cas Haaijman",
        "timestamp": 1728991786
    }
]