[
    {
        "content": "<p>On January 21, 2023, I wrote a message titled <a href=\"#narrow/stream/113488-general/topic/learning.20about.20lean.20alone.20in.20south.20korea/near/322719921\">\"Learning about Lean alone in South Korea\"</a> in the Lean Zulip chat. At the moment, I know of three Korean graduate students who have used Lean to formalize mathematical theories. However, I still haven't heard of a professor of mathematics or computer science who lives in South Korea and uses Lean to work on formalization of mathematics or software and hardware verification. As a result, most Korean students don't have the opportunity to learn about it at universities or other institutions.</p>\n<p>Luckily, I was selected as a mentor for one of this year's <a href=\"https://www.contribution.ac/2024-ossca-apply-03\">hands-on training programs (Korean)</a> at the Open-Source Software Contribution Academy (OSSCA), organized by NIPA's OSS Support Center (Open UP). Since September 9, I've been using \"Theorem Proving in Lean 4\" to teach Lean to my twelve mentees, including software developers, undergraduates, graduates, and a high-school student. We'll also translate the Natural Number Game into Korean starting this week. The mentorship program will end on October 25.</p>\n<p>I'm also making a <a href=\"https://www.youtube.com/watch?v=Gsek6kw0X24&amp;list=PLOj4iIbJ1k6Y2ev61gg1SrFVUW7upDCOh&amp;pp=gAQBiAQB\">video series (Korean)</a> where I read the textbook and explain its key points in Korean. I didn't expect to take about <em>eight</em> hours to cover Chapter 2, Dependent Type Theory. I'm trying to explain everything my mentees are unfamiliar with because most of them are new to propositional and first-order logic, let alone type theory. So, I'm not sure if I'll be able to finish the book before my mentoring ends. I'm okay with my progress; my mentees already look busy learning Lean's type theory while doing their main jobs.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"Gsek6kw0X24\" href=\"https://www.youtube.com/watch?v=Gsek6kw0X24&amp;list=PLOj4iIbJ1k6Y2ev61gg1SrFVUW7upDCOh&amp;pp=gAQBiAQB\"><img src=\"https://uploads.zulipusercontent.net/4cb593863c59731cda836584f1924b52daba5f4b/68747470733a2f2f692e7974696d672e636f6d2f76692f4773656b366b77305832342f64656661756c742e6a7067\"></a></div><p>Lastly, each of us will create a git repository containing solutions to some of the exercises in \"Theorem Proving in Lean 4.\" Mine is <a href=\"https://git.sr.ht/~chabulhwi/tpil-solutions\">tpil-solutions</a>. It doesn't have any solutions yet, but you can check out the <a href=\"https://git.sr.ht/~chabulhwi/tpil-solutions/tree/master/item/docs/en/quiz/chapter02.md\">quiz</a> I made for Chapter 2. I hope my videos and learning materials will help more Koreans get to know proof assistants like Lean and understand how to use them.</p>",
        "id": 472394234,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1727152136
    }
]