[
    {
        "content": "<p>We will be having a 1 credit lab course <a href=\"https://math.iisc.ac.in/all-courses/ma207.html\">Proofs Lab with Lean</a> at the Indian Institute of Science, Bangalore. I had a few questions about the design: especially for <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> but anyone else with experience with Verbose Lean (and also the Lean server).</p>\n<ul>\n<li>I was planning to use the exercises of <a href=\"https://github.com/PatrickMassot/proofs_with_lean\">proofs_with_lean</a>. However, I see that the first 6 (and even the last two) are about the language and logic. How many weeks are these intended to take?</li>\n<li>Beyond this, a verbose version of selections from <a href=\"https://github.com/PatrickMassot/GlimpseOfLean\">Glimpses of Lean</a> seems a good source. Has anyone made/used such a source.</li>\n<li>To avoid installation issues for students, I was planning to run on our LAN an instance of <a href=\"https://github.com/leanprover-community/lean4web\">lean4web</a> with the relevant exercises added as \"Examples\". Any tips regarding this are welcome <span class=\"user-mention\" data-user-id=\"385895\">@Jon Eugster</span></li>\n</ul>",
        "id": 562215049,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1764994669
    },
    {
        "content": "<p>Personally I'd take installation issues over lean4web any day, it's great for trying stuff out but the client-server architecture just makes it super slow, and it disconnects when switching tabs for a second.<br>\nLAN might make it a bit faster, but still the VSCode experience is pretty smooth IMO. I think VSCode wins if the goal is reducing issues.</p>",
        "id": 562218182,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1764998486
    },
    {
        "content": "<p>I see I never translated the end of my course, it should not stop at file 10. I’ll try to find time for this soon (please remind me to do this if I forget).</p>",
        "id": 562298170,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1765101028
    },
    {
        "content": "<p>The first few files are very quick. For instance the first three files are covered in the first two hours. Student slow down a lot when real mathematical content appears.</p>",
        "id": 562298218,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1765101087
    },
    {
        "content": "<p>That being said, you could also try to remove even more logic if you really don’t want to discuss logic. You can simply say the main tactic is <code>Since A and B we obtain D</code>, with less or more facts before the conclusion, and maybe with the variation<code>we conclude that D</code> at the end. Without discussing any logic rule, you can say there are two <code>Since</code> rules. First <code>A</code> and <code>B</code> must individually follow from at most one local assumption.  Then <code>D</code> must follow from <code>A</code> and <code>B</code> and from lemmas that were registered for automatic use.</p>",
        "id": 562298500,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1765101394
    },
    {
        "content": "<p>And I agree that being able to use Lean directly is much more robust than a lean4web server. However you may be able to setup some GitPod-like server where students can use Lean, and it may be an intermediate solution.</p>",
        "id": 562298564,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1765101459
    },
    {
        "content": "<p>One last thing: I’m slowly updating Verbose Lean to catch up on recent Lean. I’m currently at 4.24 if I recall correctly. One good thing about reaching 4.26 is access to advanced logging information if you want information about what students do. Then I plan to use more automatic naming for newly obtained information because the Verbose Lean style I use (the one you see in proofs with Lean) never refers to those names and students very often forget to provide them.</p>",
        "id": 562298727,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1765101655
    },
    {
        "content": "<p>I also need to experiment to see whether using grind internally can speed up Verbose Lean (which can be a bit slow in proofs with a lot of automation).</p>",
        "id": 562298784,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1765101701
    },
    {
        "content": "<p>Thanks a lot <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> <br>\nI am happy doing some logic so students use it correctly in proofs - maybe two sessions or so. My concern was that if each file was a session most of the course would be logic. But as the files are quick this is perfect.</p>\n<p>I will wait for a newer version before getting my setup. I will probably try a hybrid solution - have a server for those who have installation issues (or just laptops with too little RAM) but encourage local installation (and do this on lab machines).</p>",
        "id": 562312488,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1765118542
    },
    {
        "content": "<p>Fot a semester long course, I would probably do local installations, too. I've been part of 2-4h hour workshops done purely in the webeditor, which worked fine. It doesn't really support handling multiple files and saving progress locally though. Having a git repo with the exercsises to pull sounds like it would be a much cleaner experience. And I've got the impression that the point-and-click installation through VSCode has improved much over the last years,making the installation easier on Windows.</p>\n<p>Regardless if you want to setup a local server. I've bumped Lean and most NPM-dependencies on this branch:</p>\n<p><a href=\"https://github.com/leanprover-community/lean4web/pull/76\">https://github.com/leanprover-community/lean4web/pull/76</a></p>\n<p>I haven't merged it yet because there was a failing test (about Ctrl-click for docs) and I ran out of time fixing it. It might be worth a shot working from that branch if you're trying the installation right now, before it gets merged.</p>",
        "id": 562621077,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1765268461
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"385895\">@Jon Eugster</span> <br>\nIt is likely that we will have the course in a lab and a student has volunteered to install Lean etc on all the machines. So that should take care of the main use. </p>\n<p>I will still try to have a server though for students who may want to work at other times from laptops with too little RAM. The course starts in January, so I will wait a couple of weeks for merger before setting up.</p>",
        "id": 562621996,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1765268775
    },
    {
        "content": "<p>My understanding is that two months ago, having a notebook with 8GB of RAM is the bare minimum you need (and you'd have to be careful; <code>import Mathlib</code> could make your computer run out of memory). If there are problem, tell your students to open fewer tabs at the same time.</p>\n<p>This situation has recently improved a bit: the module system work reduces this a lot (you need to use the module system in the course repository for this to apply), recent fixes to Lean core also help. (Not sure if these are released already, but the next stable version should surely have them.)</p>",
        "id": 562655143,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1765278323
    },
    {
        "content": "<p>If you don't want to do a local install (and want to do real analysis), another option is the Real Analysis Game... <a href=\"https://adam.math.hhu.de/#/g/AlexKontorovich/RealAnalysisGame\">https://adam.math.hhu.de/#/g/AlexKontorovich/RealAnalysisGame</a></p>",
        "id": 562805394,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1765316643
    },
    {
        "content": "<p>This is really a completely different aim. The aim of Verbose Lean is to train students to read and write traditional proofs on paper, not to learn Lean.</p>",
        "id": 563036893,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1765396058
    },
    {
        "content": "<p>Having just taught and graded a topology course, it is clear that many students should be taught to write proofs clearly (and think clearly as they write proofs). That is indeed the goal here as with Patrick's course.</p>",
        "id": 563092146,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1765418111
    },
    {
        "content": "<p>Kontorivich's ItaLean presentation slides <a href=\"https://github.com/pitmonticone/ItaLean2025/blob/main/presentations/ItaLeanKontorovich.pdf\">https://github.com/pitmonticone/ItaLean2025/blob/main/presentations/ItaLeanKontorovich.pdf</a>  are also worth a look.</p>",
        "id": 563148376,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765448239
    },
    {
        "content": "<p>Indeed, my course is actually designed <em>not</em> to teach Lean (just as little as absolutely necessary to interact with the system); after the first few lectures, it's almost all Real Analysis... While it's true that I use actual tactics like <code>intro</code>, <code>use</code>, <code>choose</code>, etc (unlike Verbose where those are wrapped in natural language), I actually prefer the precision they offer the students! I now find reading natural language analysis proofs in books to feel similar to reading algebra in the 16th century (as I discuss in the slides which Kevin kindly posted)... My exams are all paper and pen, timed, in-class, and ~80% purely natural language proofs, and 20% actual Lean formal proofs.</p>",
        "id": 563187243,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1765460047
    },
    {
        "content": "<p>The question here is whether writing proofs in Lean helps students write better proofs without Lean, and whether having verbose Lean helps with this transition.</p>",
        "id": 563191420,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1765461137
    },
    {
        "content": "<p>There are some articles that try to address your first question.  Here are a couple:<br>\n<a href=\"https://www.ams.org/journals/notices/202507/noti3184/noti3184.html\">Teaching Mathematics with Lean: Interactive Theorem Provers in the Classroom</a><br>\n<a href=\"https://link.springer.com/article/10.1007/s40753-021-00140-1\">Learning about Proof with the Theorem Prover LEAN: the Abundant Numbers Task</a></p>",
        "id": 563231131,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1765470081
    },
    {
        "content": "<p>It’s was a fun read. I could see myself six years ago. And then I started developing Verbose Lean to overcome the disappointment.</p>",
        "id": 563278304,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1765485241
    },
    {
        "content": "<p>Thanks all. My goal here is not teaching Lean or teaching Analysis, but only teaching writing proofs. Even there we can debate (and should experiment) what works best, but to avoid chaos I will follow verbose Lean, which in my judgement is most promising.</p>\n<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> I can try to update Verbose Lean as well as the exercises to v4.26.0 next week if you are not working on it now. I find <code>grind</code> is incredibly good with this. </p>\n<p>At least with my examples (admittedly for a programming workshop so atypical) I did not need a single <code>rw</code> and  in general very few tactics. I had to specify induction, sometimes the correct use of induction, and use <code>if</code> to split into cases. Everything else was <code>grind</code>. <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> should there be a new version of NNG?</p>",
        "id": 564204063,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1765963272
    },
    {
        "content": "<p>As a concrete example, I had to work much harder till not long ago for <a href=\"https://github.com/siddhartha-gadgil/LeanLangur/blob/main/LeanLangur/QuickSort.lean\">QuickSort</a> with proofs.</p>",
        "id": 564204481,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1765963410
    },
    {
        "content": "<p>I don't want to go back to NNG myself -- we have plenty of evidence that it works for people, but experience shows that it can be a big time sink and I need to focus on FLT or I'm going to look like an idiot in 4 years' time when I've got nowhere.</p>",
        "id": 564207144,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765964256
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/187764-Lean-for-teaching/topic/Teaching.20with.20Verbose.20Lean/near/564207144\">said</a>:</p>\n<blockquote>\n<p>I don't want to go back to NNG myself -- we have plenty of evidence that it works for people, but experience shows that it can be a big time sink and I need to focus on FLT or I'm going to look like an idiot in 4 years' time when I've got nowhere.</p>\n</blockquote>\n<p>Agreed. I did not mean that you personally battle it again. Just commenting that the style of learning Lean may change where a lot of things we need to do skillfully are automated and the next generation of NNG -like intros may look different.</p>",
        "id": 564207559,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1765964379
    },
    {
        "content": "<p>I would be more than happy for people to experiment with it.</p>",
        "id": 564208668,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765964719
    },
    {
        "content": "<p>With the more powerful <code>grind</code>, Lean is really moving towards where the user provides the high-level guidance and the low level is automated. Should bring in more mathematicians, programmers and better AI.</p>",
        "id": 564209040,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1765964817
    },
    {
        "content": "<p>Yes, that's the viewpoint of the Real Analysis Game; it's currently being refactored to use more powerful tactics as much as possible, while keeping all the \"analysis\" for the user to do... The only <code>rewrite</code>s I want are of the form, e.g.: <code>rewrite [show |1/n - 0| = 1/n by grind]</code>, no low-level theorem names...</p>",
        "id": 564293683,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1765988928
    },
    {
        "content": "<p>I worry that this is too much automation for students who are just learning to write proofs.  Such students need to learn how to do some of the low-level steps, so automating those steps may be counterproductive.  (For students in Real Analysis, this level of automation may be appropriate.)</p>",
        "id": 564298425,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1765990140
    },
    {
        "content": "<p>It depends how \"low level\" one wants to go; simply a personal preference that each instructor should decide before proceeding. To teach Real Analysis, I personally do <em>not</em> want to start with the construction of the naturals (or even the reals), I want to go straight to epsilon-delta, and not be bothered with things that are \"obvious\" to high schoolers but painful to prove from first principles. To each their own!</p>",
        "id": 564304895,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1765991790
    },
    {
        "content": "<p>I really think <code>grind</code> is not suitable for math teaching. It is simply too powerful. In Verbose Lean, the teacher decides the level of automation. Alex, do you know that in my course students never ever type any lemma name? I tell them: Lean knows the following bunch of facts, and the library takes care of everything I don’t want to see on paper.</p>",
        "id": 564660192,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1766139233
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/channel/187764-Lean-for-teaching/topic/Teaching.20with.20Verbose.20Lean/near/564660192\">said</a>:</p>\n<blockquote>\n<p>I tell them: Lean knows the following bunch of facts, and the library takes care of everything I don’t want to see on paper.</p>\n</blockquote>\n<p>So how does it work exactly? <code>aesop</code>? <code>sorry</code>?</p>",
        "id": 564664648,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1766140633
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/channel/187764-Lean-for-teaching/topic/Teaching.20with.20Verbose.20Lean/near/564660192\">said</a>:</p>\n<blockquote>\n<p>I really think <code>grind</code> is not suitable for math teaching. It is simply too powerful. In Verbose Lean, the teacher decides the level of automation. Alex, do you know that in my course students never ever type any lemma name? I tell them: Lean knows the following bunch of facts, and the library takes care of everything I don’t want to see on paper.</p>\n</blockquote>\n<p>One thing that I've been thinking about is running grind in parallel to tunable automation, in order to give feedback of the form \"This fact is true, but you should formulate extra steps\" (if grind terminates successfully terminates, but the weaker automation does not\", or \"This is not true\" (if grind proves the negation)</p>",
        "id": 564711240,
        "sender_full_name": "Pim Otte",
        "timestamp": 1766155421
    },
    {
        "content": "<p>I agree that <code>grind</code> as it currently stands is too strong; I'll need to figure out a way to implement <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span>'s Verbose tactic strengths in my game. That said, we have completely different goals for what we're trying to accomplish (which is perfectly fine! Let's run lots of experiments!). I'm currently refactoring my game and adding some more text. I'm curious to hear what people think about this bit of it:<br>\n\"<br>\nIn the 17th century, an algebra problem might read as follows:</p>\n<p><em>You have some unknown quantity. When you create a second copy of this quantity and combine it with a known amount, then multiply this total by your original unknown quantity, you get a specified result.</em></p>\n<p>The mathematics was correct, but the expression was verbose, prone to ambiguity, and difficult to manipulate efficiently. At some point between then and now, we managed to sort out how to replace such paragraphs with the equivalent:</p>\n<p><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi><mo stretchy=\"false\">(</mo><mi>x</mi><mo>+</mo><mi>a</mi><mo stretchy=\"false\">)</mo><mo>=</mo><mi>b</mi><mi mathvariant=\"normal\">.</mi></mrow><annotation encoding=\"application/x-tex\">x(x+a)=b.</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\">x</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\">x</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">+</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\">a</span><span class=\"mclose\">)</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">b</span><span class=\"mord\">.</span></span></span></span></p>\n<p>This transition from rhetorical algebra to modern symbolic notation was nothing short of revolutionary. What had once required careful prose could now be expressed in a single, precise line. Variables could be isolated, equations could be solved systematically, and the logical structure became transparent. But note: it takes a nontrivial amount of training (now commonplace, and hence familiar) to understand what exactly those letters arranged in that way mean, and what to do with them in practice.</p>\n<p>Today, we find ourselves at a remarkably similar inflection point, but this time in the realm of proof writing. With but a modicum of training in formal mathematics, we can replace verbose, ambiguous, and error-prone prose with precise, compact, and mechanically verifiable formal proofs.</p>\n<p>In this text, we not only <em>allow</em> ourselves to write formal proofs, we unapologetically <em>embrace</em> and indeed, <em>celebrate</em> them, not as a pathway for writing good natural language proofs, but as the <strong>end goal</strong>!</p>\n<p>This is a deliberate departure from how formal methods are often introduced. Many excellent projects use proof assistants as training wheels — wrapping tactics in controlled natural language so that students can later transition to writing traditional proofs on paper. That approach makes sense if traditional prose proofs remain the target. But we take a different view: just as no one today laments that students learn <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi><mo stretchy=\"false\">(</mo><mi>x</mi><mo>+</mo><mi>a</mi><mo stretchy=\"false\">)</mo><mo>=</mo><mi>b</mi></mrow><annotation encoding=\"application/x-tex\">x(x+a)=b</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\">x</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\">x</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">+</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\">a</span><span class=\"mclose\">)</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">b</span></span></span></span> instead of rhetorical algebra, we are betting that, in the not-too-distant future, people will not lament that students learned to write proofs directly in a formal language. The mathematical community may not quite yet be fully ready for this shift, but the way to get there is to begin.</p>\n<p>There is a historical parallel in programming education. For years, conventional wisdom held that students should first learn pseudocode or flowcharts before touching a real programming language — the actual tools were thought too technical, too unforgiving for beginners. Then educators simply started teaching Python directly, and it worked. The intermediate representations turned out not to be load-bearing; they were artifacts of an era when the real tools were worse. Proof assistants have now reached a similar threshold. With modern interfaces, helpful error messages, and the interactive feedback loop of a system like Lean, students can learn to write formal proofs directly — no natural-language scaffolding required.</p>\n<p>This text is an experiment. We're wagering that you, dear gamer, can learn to write formal proofs directly, and that doing so will make you a better mathematician, not despite skipping the traditional prose stage, but because of it.<br>\n\"</p>",
        "id": 564728978,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1766159957
    },
    {
        "content": "<p>I like this idea, but with an additional requirement: a formal proof should be readable without having to interact with a proof assistant. Like, you print it on paper and someone else is still able to read it.</p>",
        "id": 564742987,
        "sender_full_name": "suhr",
        "timestamp": 1766164152
    },
    {
        "content": "<p>That's what this request was about! :) <a href=\"#narrow/channel/187764-Lean-for-teaching/topic/adding.20type.20annotation.20to.20.60choose.60/near/564323626\">#Lean for teaching &gt; adding type annotation to &#96;choose&#96; @ 💬</a></p>",
        "id": 564743197,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1766164221
    },
    {
        "content": "<p><code>choose</code> is easy to replace though, the lack of type annotations in <code>induction ... with</code> is more painful.</p>",
        "id": 564743457,
        "sender_full_name": "suhr",
        "timestamp": 1766164311
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"252920\">Alex Kontorovich</span> <a href=\"#narrow/channel/187764-Lean-for-teaching/topic/Teaching.20with.20Verbose.20Lean/near/564728978\">said</a>:</p>\n<blockquote>\n<p>I'm curious to hear what people think about this bit of it</p>\n</blockquote>\n<p>I love this take, and the Python analogy is cool, but I still doubt the willingness of the math community to adopt such a drastic change in the near future (even 30 years).<br>\nAlso unfortunately in my experience Lean doesn't have \"helpful error messages\". I'm not sure this is a requirement for mass adoption as we've seen beginners successfully learn Lean, but most errors I get are very cryptic, similar to C++ compilers exploding every time you forget a semicolon.</p>",
        "id": 564775425,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1766178250
    },
    {
        "content": "<p>Yes, maybe I should go easy on touting helpful error messages... Good catch.</p>",
        "id": 564782271,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1766182335
    },
    {
        "content": "<p>And yes, I say that the math community isn't ready. But this is an experimental step in that direction... (And maybe adoption will happen faster than we think...)</p>",
        "id": 564782351,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1766182377
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"933054\">Snir Broshi</span> <a href=\"#narrow/channel/187764-Lean-for-teaching/topic/Teaching.20with.20Verbose.20Lean/near/564775425\">said</a>:</p>\n<blockquote>\n<p>Also unfortunately in my experience Lean doesn't have \"helpful error messages\". I'm not sure this is a requirement for mass adoption as we've seen beginners successfully learn Lean, but most errors I get are very cryptic, similar to C++ compilers exploding every time you forget a semicolon.</p>\n</blockquote>\n<p>Whenever you see bad error messages, please shout it from the rooftops. We need to be addressing these, and sometimes it's hard for experts to do because it's hard to remember what you didn't know when you were less experienced.</p>",
        "id": 564783284,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1766183082
    },
    {
        "content": "<p>Do people actually read the error messages in practice? When I get errors, I do things like <code>convert</code> to see where what I've written differs from what I think I'm seeing in the goal state... I rarely find error messages useful...</p>",
        "id": 564785024,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1766184291
    },
    {
        "content": "<p>Yes, always. The errors tell me what I did wrong.</p>",
        "id": 564785395,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1766184672
    },
    {
        "content": "<p>I find using <code>convert</code> in the scenario you describe a nightmare (unless maybe you do <code>using x</code>), because it will try to set lots of things equal for me to prove which are nonsense.</p>",
        "id": 564785511,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1766184768
    },
    {
        "content": "<p>Oh, yes, sorry I use <code>convert</code> iteratively. So first <code>using 1</code> to see if the big picture worked, and then increase <code>x</code> until I see where the discrepancy is... Maybe somebody should do a little tutorial on how to read error messages effectively? I'd be very happy to learn how others get use out of them</p>",
        "id": 564786045,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1766185151
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> I have made a <a href=\"https://github.com/PatrickMassot/verbose-lean4/pull/19\">pull-request</a> updating the toolchain to v4.26.0. Some of the changes are ad hoc so this is as much for comments as for merging. On the positive side, all examples compiled.</p>",
        "id": 564984997,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1766403204
    },
    {
        "content": "<p>Thank you very much <span class=\"user-mention\" data-user-id=\"266304\">@Siddhartha Gadgil</span>! I already had local partial progress so I will probably continue but your work will be <em>very</em> useful as a reference.</p>",
        "id": 565182496,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1766507171
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"252920\">Alex Kontorovich</span> <a href=\"#narrow/channel/187764-Lean-for-teaching/topic/Teaching.20with.20Verbose.20Lean/near/564728978\">said</a>:</p>\n<blockquote>\n<p>I'm curious to hear what people think about this bit of it</p>\n</blockquote>\n<p>I think your writing should be nominated for the Nobel Prize in Literature!</p>",
        "id": 565512794,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1766844059
    },
    {
        "content": "<p>Do you mean in the \"fiction\" category...?</p>",
        "id": 565608278,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1766977175
    },
    {
        "content": "<p>I’m not sure where to ask, but I notice sample of Verbose Lean in other threads and curios where it’s living. I’m quite interested in the controlled natural languages and current one seems to be quite interesting in itself.</p>",
        "id": 575213915,
        "sender_full_name": "Andrii Kurdiumov",
        "timestamp": 1771812341
    },
    {
        "content": "<p><a href=\"https://github.com/PatrickMassot/verbose-lean4/\">https://github.com/PatrickMassot/verbose-lean4/</a></p>",
        "id": 575214399,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1771812759
    },
    {
        "content": "<p>I did try translate Verbose Lean to Ukrainian to take a look at how it can work, but seems to be Lean allergic to non-Latin characters, and this is hard block for this initiative anywhere except West European languages it seems. Mildly annoyed.</p>",
        "id": 575979256,
        "sender_full_name": "Andrii Kurdiumov",
        "timestamp": 1772099755
    },
    {
        "content": "<p>This is really sad. It comes up from time to time and I never really understood the motivation for those restrictions. I hope they will be lifted in the future. Could you please post examples of things that would help you and Lean refuses to do? Ideally those examples should depend on nothing from Verbose Lean or Mathlib, simply replace the actual content to keep only the syntax issue.</p>",
        "id": 575985553,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1772101350
    },
    {
        "content": "<p>See also <a class=\"stream-topic\" data-stream-id=\"270676\" href=\"/#narrow/channel/270676-lean4/topic/Accept.20more.20Unicode.20in.20identifiers.3F/with/573896042\">#lean4 &gt; Accept more Unicode in identifiers?</a>  for instance.</p>",
        "id": 575985732,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1772101406
    },
    {
        "content": "<p>That's great that there revitalized discussion for Unicode identifiers, I definitely want have them on couple occasions. Also I was pleased to learn a bit of French that way, since I can translate from French.  BTW: I did submit <a href=\"https://github.com/PatrickMassot/verbose-lean4/pull/20\">PR</a> with small translation inconsistencies for English to Verbose Lean</p>",
        "id": 576040908,
        "sender_full_name": "Andrii Kurdiumov",
        "timestamp": 1772116789
    }
]