[
    {
        "content": "<p>Hello, I'm new to the Lean Zulip community, but I've been studying Lean and working on AI4Math research for a while. I'm a leading member of Shanghai Jiao Tong University (School of Mathematical Science) AI4Math team, and we have been trying to make academical contributions to the territory, though no papers have been officially published yet. Several months ago, our team decided to host a summer school course, which started this morning, to attract more interested people to learn and use Lean. <br>\n<a href=\"/user_uploads/3121/g2oOGr_huRu8CLXpJCVqrHwc/1.jpg\">1.jpg</a><br>\n(Picture of me teaching what a tactic proof is)<br>\nI designed a board game based on the mechanisms of tactic proof, as shown in the photos below. The original intention was to help the beginners memorize the tactics quickly to prove propositions of logical operators. But since I posted a photo of our team testing the game in a chat group, many people have shown great interest and would like to get the cards or the design. <br>\nThe problem is, making these customized cards costs a lot of money, and is simply beyond the budget of our team to give them out for free. Also we never intend to make a profit with the game, and I fear there might be copyright problems. <br>\nI believe the idea is so great, and has the potential to attract many who still don't know or aren't interested in Lean, especially kids or Math beginners, to learn about Lean and join the community and make contributions, so I want to make the game accessible to everyone around the world. But I don't want to distribute my original card design all around and get pirated by some company starting to make money out of it. So I wonder if there are any possible ways that the design of the game gets support from the Lean developers officially, and gets a better way for people around the world to access it, either for fun or to inspire kids about formal mathematics. <br>\nI sincerely look forward to your help, community members, thank you. <br>\n<a href=\"/user_uploads/3121/YBQSjS_4dP_oMeyE_NEORKoN/2.jpg\">2.jpg</a><br>\n<a href=\"/user_uploads/3121/-XIoxW22-PrK6VTubxPLOqya/3.jpg\">3.jpg</a><br>\n<a href=\"/user_uploads/3121/o_E1gRtZ7XzDL1pjzzO8cMKJ/4.jpg\">4.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/g2oOGr_huRu8CLXpJCVqrHwc/1.jpg\" title=\"1.jpg\"><img data-original-content-type=\"image/jpeg\" data-original-dimensions=\"4608x3456\" src=\"/user_uploads/thumbnail/3121/g2oOGr_huRu8CLXpJCVqrHwc/1.jpg/840x560.webp\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/3121/YBQSjS_4dP_oMeyE_NEORKoN/2.jpg\" title=\"2.jpg\"><img data-original-content-type=\"image/jpeg\" data-original-dimensions=\"4096x1907\" src=\"/user_uploads/thumbnail/3121/YBQSjS_4dP_oMeyE_NEORKoN/2.jpg/840x560.webp\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/3121/-XIoxW22-PrK6VTubxPLOqya/3.jpg\" title=\"3.jpg\"><img data-original-content-type=\"image/jpeg\" data-original-dimensions=\"3072x4096\" src=\"/user_uploads/thumbnail/3121/-XIoxW22-PrK6VTubxPLOqya/3.jpg/840x560.webp\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/3121/o_E1gRtZ7XzDL1pjzzO8cMKJ/4.jpg\" title=\"4.jpg\"><img data-original-content-type=\"image/jpeg\" data-original-dimensions=\"1280x1707\" src=\"/user_uploads/thumbnail/3121/o_E1gRtZ7XzDL1pjzzO8cMKJ/4.jpg/840x560.webp\"></a></div>",
        "id": 528689690,
        "sender_full_name": "Yuntian Liu",
        "timestamp": 1752507586
    },
    {
        "content": "<p>I suppose one option would be to try to make a virtual version using <a href=\"https://en.boardgamearena.com/doc/Create_a_game_in_BGA_Studio:_Complete_Walkthrough\">Board Game Arena</a></p>",
        "id": 528691208,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1752508052
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/channel/187764-Lean-for-teaching/topic/We.20made.20a.20board.20game.20for.20LEAN/near/528691208\">said</a>:</p>\n<blockquote>\n<p>I suppose one option would be to try to make a virtual version using <a href=\"https://en.boardgamearena.com/doc/Create_a_game_in_BGA_Studio:_Complete_Walkthrough\">Board Game Arena</a></p>\n</blockquote>\n<p>Okay, we will try to develop one later. <br>\nBut still I want people to get tangible cards, since playing video games deprives part of the fun playing real cards. I wonder if some kind of official repository can be set up for people to download the design and make their own cards?</p>",
        "id": 528693516,
        "sender_full_name": "Yuntian Liu",
        "timestamp": 1752508727
    },
    {
        "content": "<p>If you make the design public but do not want anyone else to make money from it, maybe consider putting it under a Creative Commons \"NC\" license that only allows non-commercial use? (Assuming the cards do not contain anything that you are not allowed to put under that license. And I am not a lawyer etc.)</p>",
        "id": 528728785,
        "sender_full_name": "Malvin Gattinger",
        "timestamp": 1752522342
    },
    {
        "content": "<p>Nice board game!</p>\n<p>I'm not sure I fully understand your worries about copyright issues. Are you worried that you are infringing someone else's copyright, or that someone else “steals” your work?</p>\n<p>If it's the latter, I suggest to not worry. Maybe unfortunately, but I don't think the market for lean themed board games is commercially attractive yet <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>.</p>\n<p>If you want to share, I'd say just put them online (e.g. A GitHub repo), maybe put a CC license on it, and cherish if someone uses it. All of Lean is distributed that way!</p>",
        "id": 528788257,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1752561410
    },
    {
        "content": "<p>What are the rules?</p>",
        "id": 528912087,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1752601502
    },
    {
        "content": "<p>Whatever they are, I'm sure they are <code>macro_rules</code> :-)</p>",
        "id": 528934670,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1752610514
    }
]