[
    {
        "content": "<p>Hello all. For some background, I'm an SDE @ AWS with an undergrad degree in maths. I've been doing plenty of Lean with Mathlib for the last few weeks and it's been loads of fun doing maths again. I've got a decent handle on the literature of undergrad maths. I perceive there to be a noticeable lack of the use of filters (explicitly recognized as filters that is) in this body of literature.</p>\n<p>In a topology class in my final year, we were introduced to filters. They were used by our instructor as a mere convenience, a tool for brevity. But, filters are _everywhere_ in mathlib - presumably because they are <em>everywhere</em> in mathematics. Mathlib would have been much more accessible to me if I'd had a strong grip on filters first, saw why they were useful, and could reframe all the stuff I already knew in terms of filters. I feel as though I kind of missed the spiritual point of fourth year topology.</p>\n<p>Anyhow, I'm asking those with an interest in the pedagogy of mathematics - and professional instructors in actual universities - why aren't undergrads typically exposed to filters earlier? Why aren't they used pervasively?</p>\n<p>(I don't just mean the definition and basic properties. I mean the ultrafilter lemma and its use as a <em>deus ex machina</em> in so many problems)</p>",
        "id": 508908582,
        "sender_full_name": "Daniel Levin",
        "timestamp": 1743243221
    },
    {
        "content": "<p>First let me clarify that filters are not everywhere in mathematics. Most professional mathematicians never think in terms of filters. I think the main reason is self-referential: we don’t teach filters because we have not learned filters. There are also more scientific reasons. Filters are generalized subsets. There is no way you can teach that to people who are not really at ease with ordinary subsets. So that rules out first year students. But you need to teach limits in first year because limits are everywhere (at least hidden under the definition of derivatives of functions). So when you reach a stage where student’s mathematical maturity could handle filters, you’ve already lost a lot of opportunities to use filters.</p>",
        "id": 508909414,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1743243986
    },
    {
        "content": "<p>It’s a very hard sell is a curriculum because people know you can do math without filters. And there are <em>so</em> many things to teach and so little time and resources.</p>",
        "id": 508909443,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1743244023
    },
    {
        "content": "<p>This year I’ve been teaching filters for the first time, and this was in a fourth year course where I was allowed to do whatever I wanted.</p>",
        "id": 508909490,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1743244064
    },
    {
        "content": "<p>Zorich's \"Mathematical Analysis\" introduces limits over a base, and also mentions filters:</p>\n<blockquote>\n<p>We note also that the term \"base\" used here is an abbreviation for what is called a \"filter base\", and the limit over a base that we introduce below is, as far as analysis is concerned, the most important part of the concept of a limit over a filter12, created by the modern French mathematician H. Cartan.</p>\n</blockquote>\n<p>So there's at least one introduction book that mentions filters.</p>\n<blockquote>\n<p>Anyhow, I'm asking those with an interest in the pedagogy of mathematics - and professional instructors in actual universities - why aren't undergrads typically exposed to filters earlier? Why aren't they used pervasively?</p>\n</blockquote>\n<p>Courses are somewhat conservative, also concepts like filters are believed to be too abstract for first year students. I would argue it's a mistake to completely avoid mention these concepts, but again courses are conservative.</p>",
        "id": 508910388,
        "sender_full_name": "suhr",
        "timestamp": 1743244868
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"394485\">suhr</span> <a href=\"#narrow/channel/187764-Lean-for-teaching/topic/Why.20are.20filters.20not.20used.20pervasively.20in.20undergrad.20education.3F/near/508910388\">said</a>:</p>\n<blockquote>\n<p>Zorich's \"Mathematical Analysis\" introduces limits over a base, and also mentions filters:</p>\n<blockquote>\n<p>the limit over a base that we introduce below is, as far as analysis is concerned, the most important part of the concept of a limit over a filter12, created by the modern French mathematician H. Cartan.</p>\n</blockquote>\n</blockquote>\n<p>This misconception indeed plays a crucial role. People simply don’t know how versatile filters are.</p>",
        "id": 508911453,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1743245731
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"394485\">suhr</span> <a href=\"#narrow/channel/187764-Lean-for-teaching/topic/Why.20are.20filters.20not.20used.20pervasively.20in.20undergrad.20education.3F/near/508910388\">said</a>:</p>\n<blockquote>\n<p>Courses are somewhat conservative, </p>\n</blockquote>\n<p>For emphasis: this is also what I tried to explain as the most important reason.</p>",
        "id": 508911520,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1743245771
    },
    {
        "content": "<p>Thanks for the answers. I suspected as much but didn't want to use the word \"conservative\" without substantiation.</p>",
        "id": 508911742,
        "sender_full_name": "Daniel Levin",
        "timestamp": 1743245945
    },
    {
        "content": "<p>With that being said it beggars belief that 13 weeks of fighting epsilonics as one does in analysis 1 is still the way things are done.</p>",
        "id": 508911795,
        "sender_full_name": "Daniel Levin",
        "timestamp": 1743246000
    },
    {
        "content": "<p>The beauty of Mathlib is that this is a reference that is modern, broad and error-free. Now one only needs to build an actual course around it...</p>",
        "id": 508912675,
        "sender_full_name": "suhr",
        "timestamp": 1743246758
    },
    {
        "content": "<p>My dream project is a bit more ambitious than that, I also want to pay a bit of attention to things being constructive.</p>",
        "id": 508912812,
        "sender_full_name": "suhr",
        "timestamp": 1743246903
    },
    {
        "content": "<p>I'm actually considering using mathlib as a learning resource, but sometimes I don't know where to begin</p>",
        "id": 508912830,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1743246919
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"818413\">Daniel Levin</span> <a href=\"#narrow/channel/187764-Lean-for-teaching/topic/Why.20are.20filters.20not.20used.20pervasively.20in.20undergrad.20education.3F/near/508911795\">said</a>:</p>\n<blockquote>\n<p>With that being said it beggars belief that 13 weeks of fighting epsilonics as one does in analysis 1 is still the way things are done.</p>\n</blockquote>\n<p>Zorich is a classical text to be fair (it was the one my analysis 1 prof recommended), and as mentioned it almost has filters. Having said that, epsilons and deltas have their sense too, especially from a perspective of following numerical courses afterwards.</p>",
        "id": 508913202,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1743247231
    },
    {
        "content": "<p>Filters are useful in developing math rigorously and efficiently, but they are too abstract and difficult for first year students, in my opinion.</p>",
        "id": 508984935,
        "sender_full_name": "Yosuke Ito",
        "timestamp": 1743305153
    },
    {
        "content": "<p>I think they are not that much more abstract and difficult compared to topological spaces</p>",
        "id": 508987328,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1743307442
    },
    {
        "content": "<p>why are we talking about closure under arbitrary union? Where's my donut and coffee cup?</p>",
        "id": 508987348,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1743307478
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/channel/187764-Lean-for-teaching/topic/Why.20are.20filters.20not.20used.20pervasively.20in.20undergrad.20education.3F/near/508987328\">said</a>:</p>\n<blockquote>\n<p>I think they are not that much more abstract and difficult compared to topological spaces</p>\n</blockquote>\n<p>Topological spaces come two years later.  That’s part of the issue.</p>",
        "id": 509025854,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1743341343
    },
    {
        "content": "<p>Then should they be introduced along with topological spaces?</p>",
        "id": 509027442,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1743342491
    },
    {
        "content": "<p>That’s probably what should be done, yes.</p>",
        "id": 509027516,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1743342545
    }
]