[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"761171\">@Daniel Carranza</span> is starting to PR his work on enriched cotensors. The first PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/35144\">#35144</a> constructs enriched bifunctors. </p>\n<p>This may be of interest to <span class=\"user-mention\" data-user-id=\"406521\">@Arnoud van der Leer</span> and others.</p>",
        "id": 573372033,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1770838608
    },
    {
        "content": "<p>Ah, nice!<br>\nDid not know that he also wrote the bifunctor stuff. That came in handy for the tensors as well.</p>\n<p>Would it be an idea to PR the tensors and cotensors together, making them consistent with eachother? I can help with that, when the time comes.</p>",
        "id": 573374700,
        "sender_full_name": "Arnoud van der Leer",
        "timestamp": 1770839579
    },
    {
        "content": "<p>I'm hoping <span class=\"user-mention\" data-user-id=\"761171\">@Daniel Carranza</span> will weigh in to indicate which approach he'd prefer. Maybe this will depend a bit on how the PR process goes...</p>",
        "id": 573760800,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1770994352
    },
    {
        "content": "<p>Thanks a bunch, I appreciate the interest in the PR!</p>\n<p>I have some code on my machine which generalizes a few lemmas in the cotensor file to the braided monoidal setting  (as opposed to symmetric monoidal), as well as a proof that if V is closed symmetric monoidal then V itself is a V-category with cotensors. However, because it is old, it does not compile with the current version of mathlib. As soon as the code is error-free, I can PR it to the infinity-cosmos repository in an unpolished state, so that everyone has access to the proofs. Is this okay?</p>\n<p>What I <em>don't</em> want to do is slow anyone else down. While I'm polishing, I'm more than happy to make any code publicly accessible (e.g. via a PR marked as WIP) if it's any benefit, but I would feel bad if  <span class=\"user-mention\" data-user-id=\"406521\">@Arnoud van der Leer</span> has to wait for me to submit a joint PR.</p>",
        "id": 573813835,
        "sender_full_name": "Daniel Carranza",
        "timestamp": 1771010279
    },
    {
        "content": "<p>Don't worry about me. I'll find something fun to do, and if you'd like, we can, at some point, PR some (co)tensor stuff together.<br>\nIf you'd like, I can also try to help polish some stuff (for some definition of polish ^^)</p>",
        "id": 573830537,
        "sender_full_name": "Arnoud van der Leer",
        "timestamp": 1771018062
    },
    {
        "content": "<p>I'm fairly new here, so in any joint stuff, I'll follow you, I think</p>",
        "id": 573830618,
        "sender_full_name": "Arnoud van der Leer",
        "timestamp": 1771018097
    }
]