[
    {
        "content": "<p>I've been working on expanding the blueprint for the infinity-cosmos project to introduce more low-hanging fruit: namely the definitions, constructions, and lemmas now appearing in section 1.4 (warning: the lemmas vary considerably in difficulty). To make this feasible I've been working on developing some basic API around the isofibrations in an infinity-cosmos.</p>",
        "id": 494937483,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1737418331
    },
    {
        "content": "<p>But I have no idea how to develop good API for further formalization! So I'd love it if folks had a look at <a href=\"https://emilyriehl.github.io/infinity-cosmos/docs/InfinityCosmos/ForMathlib/InfinityCosmos/Isofibrations.html\">this file</a> to offer comments and suggestions (and it would be great if someone filled in the final pesky sorry).</p>",
        "id": 494937635,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1737418414
    },
    {
        "content": "<p>On paper, the oo-cosmos axioms are used to construct various new objects (new oo-categories in the oo-cosmos) and new maps between them (new oo-functors). These are all just objects and morphisms in the underlying 1-category of the oo-cosmos, though the axioms assume that various limits exist and are simplicially enriched. But enriched conical limits are in particular ordinary unenriched limits and Lean knows this now in all the cases we need (I believe).</p>",
        "id": 494937997,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1737418566
    },
    {
        "content": "<p>Specific questions: </p>\n<ul>\n<li>should these terms have different names?</li>\n<li>is it bad to have so many non-computable definitions?</li>\n<li>should I have the <code>simp</code>tags at the lemmas I've simped? </li>\n<li>should anything be an instance?</li>\n<li>what is missing?</li>\n</ul>\n<p>If anyone wants to contribute further extensions please go ahead!</p>",
        "id": 494938204,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1737418683
    },
    {
        "content": "<blockquote>\n<p>is it bad to have so many non-computable definitions?</p>\n</blockquote>\n<p>I wouldn't worry about that. It just means that we can't let the kernel compute with these definitions. But we weren't really planning on doing that anyways.</p>\n<p>You could start your file with <code>noncomputable section</code> (and finish the file with <code>end</code>) so that you can remove the <code>noncomputable</code> keyword everywhere.</p>",
        "id": 495216686,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1737531623
    },
    {
        "content": "<blockquote>\n<p>should I have the <code>simp</code>tags at the lemmas I've simped?</p>\n</blockquote>\n<p>Those look good to me. The final lemma in the file also looks like a good simp lemma.</p>",
        "id": 495216876,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1737531714
    },
    {
        "content": "<blockquote>\n<p>should anything be an instance?</p>\n</blockquote>\n<p>The rule of thumb is: if <code>X</code> is a class, and your definition is providing the canonical term of type <code>X</code>, then you can make your definition into an instance.</p>",
        "id": 495217127,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1737531824
    },
    {
        "content": "<blockquote>\n<p>should these terms have different names?</p>\n</blockquote>\n<p>As far as I can see, the names look good.</p>",
        "id": 495217231,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1737531861
    },
    {
        "content": "<p>Maybe there is a reason for avoiding this (e.g. naming), but I think many of the lemmas like <code>compIsofibration_map</code> can be automatically generated by tagging the corresponding def with <code>@[simps]</code>. In the case of <code>compIsofibration_map</code>, the generated lemma is called <code>compIsofibration_coe</code>.</p>",
        "id": 495371458,
        "sender_full_name": "Nick Ward",
        "timestamp": 1737579209
    },
    {
        "content": "<p>Tagging the def with <code>@[simps?]</code> will print the generated simp lemmas for comparison.</p>",
        "id": 495371629,
        "sender_full_name": "Nick Ward",
        "timestamp": 1737579275
    }
]