[
    {
        "content": "<p>I thought it might be useful to have a catch-all topic for learning Mathlib's implementation of category theory (assuming basic familiarity with 1-, 2-category theory mathematically) for people who might like to contribute to this project, but who don't have the library familiarity (like myself).</p>\n<p>I'd encourage anyone else who's learning Mathlib's take on categories to ask questions here as well, and to share things they found unexpected or counterintuitive! (That is, please don't consider this \"my\" topic.) :)</p>\n<p>For a point to start from, I'm currently working through <a href=\"https://github.com/adamtopaz/CopenhagenMasterclass2023/tree/master/CategoryTheoryExercises\">these exercises</a> which were linked in <a class=\"stream-topic\" data-stream-id=\"474713\" href=\"/#narrow/channel/474713-Lean-Together-2025/topic/Emily.20Riehl.3A.20The.20infty-cosmos.20project\">#Lean Together 2025 &gt; Emily Riehl: The infty-cosmos project</a>.</p>",
        "id": 493683707,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1736894654
    },
    {
        "content": "<p>Good idea! The category theory library can be tough to get used to :) I've been thinking for a while that something like the natural number game could be useful for this (but I've been too busy to work on something like it)</p>",
        "id": 493694015,
        "sender_full_name": "Jack McKoen",
        "timestamp": 1736900779
    },
    {
        "content": "<p>By the way, re: those exercises, I'm noticing that there have been some adjustments to the <code>RingCat</code> API in the time since Exercise 2 was written; some imports are renamed, and the data of the category is structured a bit differently (arrows are wrapped in a one-field structure, for instance)! Also, some hints are in fact misleading (e.g. \"use <code>cancel_mono</code>\"): it seems that the warning in the README ought to be heeded :)</p>\n<blockquote>\n<p>Note: Others could have ported these exercises. Right now some of the hints no longer exist, others might be misleading. I have only solved half of the exercises so can't guarantee that I ported them all correctly.</p>\n</blockquote>",
        "id": 493982932,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1736962979
    },
    {
        "content": "<p>Please feel free to update! I think that exercises are the best way to learn, my imperial undergrad course is basically just all exercises (covering a bunch of mathlib but notel category theory) and I update it once a year (in fact it's now Bhavik's course and hopefully he updated it this year) but the category theory exercises are just a random thing which gets occasionally noticed. Maybe <span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span> you want to add them to the Imperial course repo?</p>",
        "id": 494010186,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1736972873
    },
    {
        "content": "<p>I haven't added them yet, but I'm hoping to soon!</p>",
        "id": 494011304,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1736973273
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/455414-Infinity-Cosmos/topic/Learning.20Mathlib's.20category.20theory/near/494010186\">said</a>:</p>\n<blockquote>\n<p>Please feel free to update!</p>\n</blockquote>\n<p>Happy to! :) Let me know where the best place to PR is, ultimately; some updates (like misleading hints) would make sense for the CopenhagenMasterclass2023 repo, but some API-based updates would only make sense on current Mathlib (which hasn’t propagated to that course). (I deliberately tried to solve these exercises on current Mathlib to make sure I wasn’t learning outdated API. :) )</p>",
        "id": 494011525,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1736973359
    },
    {
        "content": "<p>And/or I can help prepare them for the Imperial course, if that’s desired. :)</p>",
        "id": 494011767,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1736973438
    },
    {
        "content": "<p>Bhavik did you release an FM25 course? If so then Thomas could just PR them as section 23 or whatever we're up to!</p>",
        "id": 494018422,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1736975807
    },
    {
        "content": "<p>Yup, it's here: <a href=\"https://github.com/b-mehta/formalising-mathematics-notes\">https://github.com/b-mehta/formalising-mathematics-notes</a></p>",
        "id": 494018908,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1736976003
    },
    {
        "content": "<p>I'm compiling a little dictionary between category theoretic concepts and Mathlib's notation/implementation/design choices. Would this table be welcome in some communal location, e.g. the Mathlib manual or the wiki? (Does something like this exist already?)</p>\n<p>(Also, I'm back from some time away now, so I'll hopefully get around to PRing those exercises soon. :) )</p>",
        "id": 499597603,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1739485807
    },
    {
        "content": "<p>There is <a href=\"https://leanprover-community.github.io/theories/category_theory.html\">https://leanprover-community.github.io/theories/category_theory.html</a> but it's very incomplete and I would be very happy to review and merge PRs that expand this page.</p>",
        "id": 499646174,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1739511718
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260921\">@Markus Himmel</span>  I think it would be extremely helpful to have more notation/implementation/design choices on the page you mentioned! I'll PR bunch of things I recorded locally for my own use. I intended to put them in a blog post on website, but i think the page you shared is a much better place.</p>",
        "id": 499748215,
        "sender_full_name": "Sina Hazratpour 𓃵",
        "timestamp": 1739541281
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"260921\">Markus Himmel</span> <a href=\"#narrow/channel/455414-Infinity-Cosmos/topic/Learning.20Mathlib's.20category.20theory/near/499646174\">said</a>:</p>\n<blockquote>\n<p>There is <a href=\"https://leanprover-community.github.io/theories/category_theory.html\">https://leanprover-community.github.io/theories/category_theory.html</a> but it's very incomplete and I would be very happy to review and merge PRs that expand this page.</p>\n</blockquote>\n<p>Ok, great! :)</p>\n<p>I'm trying out a couple different ways of organizing the information, which you can see in (only) the Categories section <a href=\"https://github.com/thorimur/leanprover-community.github.io/blob/patch-1/templates/theories/category_theory.md#Categories\">here</a>.</p>\n<p>This would split each section into Design and Notation subsections; the design subsection would start by introducing the basic way the mathematical concept is represented in Mathlib, then elaborate on implementation details.</p>\n<p>The Notation subsection could either be a bulleted list or a small table; I've tried out a bulleted list, a table, and a condensed table in that branch.</p>\n<p>I'm also wondering if it would be useful to have a single table somewhere on that page that collects all the notation, and just the notation. Maybe it would make sense to stick to a textual bulleted list in each individual Notation subsection in this case!</p>\n<p>(My first approach was to have a single table that collected everything, but introducing the design in that table ultimately seemed unwieldy and not reader-friendly.)</p>\n<p><span class=\"user-mention\" data-user-id=\"420917\">@Sina Hazratpour 𓃵</span>, please feel free to propose organizing it a different way, given your own notes! I'm just experimenting here. :)</p>",
        "id": 499820813,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1739564541
    },
    {
        "content": "<p>Thanks for sharing your thoughts.  I like the idea of a table that collects all the notations. <br>\nI also don't know how long we think this page would/should be, so for instance thing like why we implement concept X in this way and not the standard way in the Elephant or nlab or whatever canonical reference. My notes are basically a personal mnemonic device for useful tactics and tricks in category theory, but I don't know if or to what extent they are prescriptive.  And ofc things get outdated/updated sometimes (e.g. <code>tidy</code> is now subsumed by <code>aesop</code>?).</p>",
        "id": 499834316,
        "sender_full_name": "Sina Hazratpour 𓃵",
        "timestamp": 1739568869
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"420917\">Sina Hazratpour 𓃵</span> <a href=\"#narrow/channel/455414-Infinity-Cosmos/topic/Learning.20Mathlib's.20category.20theory/near/499834316\">said</a>:</p>\n<blockquote>\n<p>I also don't know how long we think this page would/should be, so for instance thing like why we implement concept X in this way and not the standard way in the Elephant or nlab or whatever canonical reference.</p>\n</blockquote>\n<p>Hmm, good point—I think a worthy mission for this page should be to prioritize \"initiating the uninitiated\", i.e. explaining the basics of how category theory is set up in Mathlib and how to work with it.</p>\n<p>Maybe detailed explanations and justifications of the implementation details (e.g. \"we do it this way, not that way, because of this technical reason...\") should be either (1) in a toggleable \"Implementation details\" subsection—accessible for the curious, but doesn't take up space or scare off new users or (2) only present in the cource code documentation, and removed from the page entirely.</p>\n<p>I'd favor (1) (or some other way of making this information accessible here!), but I could understand (2).</p>\n<p><span class=\"user-mention silent\" data-user-id=\"420917\">Sina Hazratpour 𓃵</span> <a href=\"#narrow/channel/455414-Infinity-Cosmos/topic/Learning.20Mathlib's.20category.20theory/near/499834316\">said</a>:</p>\n<blockquote>\n<p>My notes are basically a personal mnemonic device for useful tactics and tricks in category theory, but I don't know if or to what extent they are prescriptive.  And ofc things get outdated/updated sometimes (e.g. <code>tidy</code> is now subsumed by <code>aesop</code>?).</p>\n</blockquote>\n<p>I think it would be useful to have another section called something like \"How to work with category theory\" or \"Proving theorems\" that catalogued this sort of information! That is: there's understanding how Mathlib's category theory is set up conceptually and how to read statements (in Design and Notation), then there's understanding how to interact with the library. Both are important, and decouple nicely!</p>",
        "id": 499842209,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1739571928
    },
    {
        "content": "<p>Between (1) and (2) you suggested above, i also think (1) is more feasible.</p>",
        "id": 499848361,
        "sender_full_name": "Sina Hazratpour 𓃵",
        "timestamp": 1739574724
    }
]