[
    {
        "content": "<p>I've just drafted <a href=\"https://github.com/leanprover-community/mathlib4/pull/33974\">#33974</a> for the 'pushout-product' and 'pullback-power' constructions, see <a href=\"https://ncatlab.org/nlab/show/pushout-product\">https://ncatlab.org/nlab/show/pushout-product</a>, <a href=\"https://ncatlab.org/nlab/show/pullback-power\">https://ncatlab.org/nlab/show/pullback-power</a>. These are also called Leibniz constructions, though I'm not sure what naming scheme to commit to for mathlib (please advise). Using Joël's <code>PushoutObjObj</code> and <code>PullbackObjObj</code> API, I've defined these constructions in what I think is a suitable generality, culminating in the associated bifunctors on the arrow categories.</p>\n<p>In another WIP PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/33935\">#33935</a>, I'm using these to define a monoidal structure on the arrow category of a cartesian closed category.</p>",
        "id": 568089212,
        "sender_full_name": "Jack McKoen",
        "timestamp": 1768428615
    },
    {
        "content": "<p>While the historical motivation for the term \"Leibniz\" is a bit of a stretch, it is nice to have an adjective that can modify any functor of two variables. For me the name \"pushout product\" suggests that this is the product bifunctor.</p>",
        "id": 568100040,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1768434445
    },
    {
        "content": "<p>From context (variance of the functor, whether it is a left adjoint or a right adjoint), you can typically tell whether this Leibniz thing should involve a pushout in the target category (for left adjoints, with everything covariant) or a pullback (for right adjoints, with the first argument contravariant). So I don't say \"Leibniz pushout tensor\" for the Leibniz construction using a pushout associated to the functor \"tensor\"; I just say \"Leibniz tensor\". Similarly \"Leibniz hom\", \"Leibniz weighted limit\" both of which, as right adjointy things, use pullbacks.</p>",
        "id": 568100363,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1768434611
    },
    {
        "content": "<p>But this is all on paper. Maybe in mathlib we need something more like \"LeibnizPushout F\" (for the bifunctor associated to <code>F</code> using a pushout) or \"LeibnizPullback F\" (for the bifunctor associated to <code>F</code> using a pullback)?</p>\n<p>This sort of thing has bothered me in other settings too. For <code>F : C =&gt; Type</code>, I'd like <code>Elements F</code> to be the category that projects to <code>C</code>, while for <code>F : C^op =&gt; Type</code>, I'd like <code>Elements F</code> to be the category that also projects to <code>C</code> (a different construction than in the first case).</p>",
        "id": 568100644,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1768434745
    },
    {
        "content": "<p>I think <code>LeibnizPushout F</code> and <code>LeibnizPullback G</code> are good choices, I'll go with them!</p>",
        "id": 568278650,
        "sender_full_name": "Jack McKoen",
        "timestamp": 1768499542
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/33974\">#33974</a> is merged, next is <a href=\"https://github.com/leanprover-community/mathlib4/pull/33935\">#33935</a></p>",
        "id": 571524730,
        "sender_full_name": "Jack McKoen",
        "timestamp": 1770066325
    },
    {
        "content": "<p>I opened a small PR for the Leibniz adjunction (<a href=\"https://github.com/leanprover-community/mathlib4/pull/34887\">#34887</a>), and once <a href=\"https://github.com/leanprover-community/mathlib4/pull/33935\">#33935</a> is merged I'll try to formalize the rest of Prop. C.2.9 in <a href=\"https://emilyriehl.github.io/files/elements.pdf\">Elements</a>. I formalized some of this prop specifically for SSet in my thesis, so I don't think it will be too bad.</p>",
        "id": 572248872,
        "sender_full_name": "Jack McKoen",
        "timestamp": 1770325593
    }
]