[
    {
        "content": "<p>Save the date for a synchronous meeting of the infinity-cosmos team at <time datetime=\"2025-11-24T16:00:00Z\">2025-11-24T11:00:00-5:00</time> - <time datetime=\"2025-11-24T18:00:00Z\">2025-11-24T13:00:00-5:00</time> .</p>\n<p>The aim will be to discuss plans to formalize the formal theory of quasi-categories described here: <a class=\"message-link\" href=\"/#narrow/channel/455414-Infinity-Cosmos/topic/time.20for.20the.20formal.20category.20theory.20of.20quasicategories.21/near/548029403\">#Infinity-Cosmos &gt; time for the formal category theory of quasicategories! @ 💬</a></p>",
        "id": 554574811,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1762705719
    },
    {
        "content": "<p>Reminder that we will be holding a synchronous meeting <a href=\"https://zoom.com/my/infinite.cosmos\">on Zoom</a> at <time datetime=\"2025-11-24T16:00:00Z\">2025-11-24T11:00:00-5:00</time> - <time datetime=\"2025-11-24T18:00:00Z\">2025-11-24T13:00:00-5:00</time> to discuss near term applications of bicategory theory to quasicategory theory. All are welcome (newcommers included).</p>",
        "id": 558917862,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1763927106
    },
    {
        "content": "<p>The universe issue is caused by an unnecessarily restrictive universe annotation upstream, fixed in <a href=\"https://github.com/leanprover-community/mathlib4/pull/32063\">#32063</a></p>",
        "id": 559121256,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1764008696
    },
    {
        "content": "<p>cleaned up and pushed the live coding session: <a href=\"https://github.com/emilyriehl/infinity-cosmos/commit/cd00b6324a96e193a645dc522d1927c66c068ad5\"><code>cd00b63</code></a></p>",
        "id": 559123454,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1764009360
    },
    {
        "content": "<p>How did you figure this out?</p>",
        "id": 560044576,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1764029145
    },
    {
        "content": "<p>I promised a summary of the meeting that <span class=\"user-mention\" data-user-id=\"459699\">@Joël Riou</span>, <span class=\"user-mention\" data-user-id=\"735051\">@Spencer Woolfson</span>, <span class=\"user-mention\" data-user-id=\"488744\">@Jack McKoen</span>, <span class=\"user-mention\" data-user-id=\"580947\">@Rida Hamadani</span>, <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span>, <span class=\"user-mention\" data-user-id=\"519559\">@Dagur Asgeirsson</span>, <span class=\"user-mention\" data-user-id=\"879277\">@Julian Komaromy</span>, <span class=\"user-mention\" data-user-id=\"581787\">@Judah Towery</span>, Jonathan Weinberger and I had yesterday.</p>\n<p>We discussed:</p>\n<ol>\n<li>The new <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/AlgebraicTopology/Quasicategory/StrictBicategory.html\">strict bicategory</a> of quasicategories, now in Mathlib.</li>\n<li>We constructed an analogous <a href=\"https://emilyriehl.github.io/infinity-cosmos/docs/InfinityCosmos/ForMathlib/InfinityCosmos/Goals.html#InfinityCosmos.strictBicategory\">strict bicategory</a> of infinity-categories in an infinity-cosmos. Later when we build the infinity-cosmos of quasicategories the strict bicategory of quasicategories will be a special case of this construction.</li>\n<li>We discussed that the <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/CategoryTheory/Bicategory/Adjunction/Basic.html\">standard theory of adjunctions in a bicategory</a>, much of which has already been formalized in Mathlib, specializes to define and develop <a href=\"https://emilyriehl.github.io/infinity-cosmos/docs/InfinityCosmos/ForMathlib/InfinityCosmos/Goals.html#SSet.QCat.Adjunction\">adjunctions between quasicategories</a>. So once we import the definition, Mathlib will have proofs of many interesting theorems about adjunctions between quasicategories!</li>\n<li>We mentioned, but didn't really explain, that to develop the analogous formal theory of limits and colimits in a quasicategory, we need to know that the strict bicategory of such is cartesian closed. This will follow from the fact that quasicategories define a cartesian closed subcategory of simplicial sets.</li>\n<li>We worked on the definition of a <a href=\"https://github.com/emilyriehl/infinity-cosmos/blob/main/InfinityCosmos/ForMathlib/CategoryTheory/Bicategory/Strict/Closed.lean\">cartesian closed strict bicategory</a> but haven't proven any theorems or developed API to work with this.</li>\n</ol>",
        "id": 560166616,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1764080218
    },
    {
        "content": "<p>In the near term, I think it would be interesting to simultaneously:</p>\n<ol>\n<li>Develop the theory of cartesian closed strict bicategories.</li>\n<li>Develop the theory of limits in a cartesian closed strict bicategory (using Mathlib's existing notion of absolute lifting diagram. </li>\n<li>Formalize the proof, assuming <span class=\"user-mention\" data-user-id=\"488744\">@Jack McKoen</span>'s result about functor quasicategories, that the strict bicategory of quasicategories is cartesian closed. </li>\n</ol>\n<p>Unfortunately none of this is reflected by the current blueprint. So if there is any interest in working on any of these, let me know, and I'll get to work on writing up / finding references.</p>",
        "id": 560167378,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1764080405
    },
    {
        "content": "<p>About the prerequisites to 3., I recently found an article by Sean Moss, <em>Another approach to the Kan-Quillen model structure</em>, which gives a combinatorial approach to (strong) anodyne extensions, and I used it in my work on the Quillen model category structure on simplicial sets because I needed to know that anodyne extensions are preserved by the subdivision functor. The article by Moss also contains a lemma which allows to show that the inclusion <code>(Λ[p, i] ⊗ Δ[q] ⊔ Δ[p] ⊗ ∂Δ[q]) ⟶ Δ[p] ⊗ Δ[q]</code> is a (strong) anodyne extension (which is inner when <code>Λ[p, i]</code> is an inner horn), which I have also essentially formalized, and it contains as special cases both results about usual anodyne extensions which I had already formalized and a critical (more difficult) lemma that Jack had obtained. Several PRs to mathlib related to this have already been merged and the next are <a href=\"https://github.com/leanprover-community/mathlib4/pull/28346\">#28346</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/28351\">#28351</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/28462\">#28462</a>.</p>",
        "id": 560195874,
        "sender_full_name": "Joël Riou",
        "timestamp": 1764086998
    },
    {
        "content": "<p>The next significant result towards the study of (inner) fibrations is the result that I formalized (and which Jack uses) which is that any monomorphism of simplicial sets is a relative cell complex with basic cells consisting of boundary inclusions <code>∂Δ[q] ⟶ Δ[q]</code>. This builds on previous formalization work about nondegenerate simplices. The first PR towards this result is <a href=\"https://github.com/leanprover-community/mathlib4/pull/31996\">#31996</a>.</p>",
        "id": 560195881,
        "sender_full_name": "Joël Riou",
        "timestamp": 1764087001
    },
    {
        "content": "<p>I'm certainly interested in specifically what theory would be useful to work towards, I'd love to work on something. I did want to ask a perhaps basic question about how we've defined cartesian closed bicategories here. Am I correct in understanding that when we extend <code>CartesianMonoidalCategory C</code>, we get specifically just a monoidal structure on the underlying 1-category of the bicategory? If that is the case, then I wonder if that really is the same as the \"usual\" definition of a monoidal bicategory, which I understand briefly as \"tricategory with one object.\" If we were to write out the algebraic data of this, we would require the monoidal structure to be a 2-functor that holds up to natural 2-isomorphisms with certain modification diagrams on 2-unitors etc., and I'm not sure if just a monoidal structure on the 1-category level can see or guarantee that. Is this idea of a monoidal bicategory not needed for this project?</p>",
        "id": 560205479,
        "sender_full_name": "Judah Towery",
        "timestamp": 1764089475
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"581787\">@Judah Towery</span> you're exactly right about monoidal bicategories, which are a much more complicated definition. In the cartesian monoidal structures on strict bicategories the definition simplifies: it's just a property of the strict bicategory (having finite cartesian products that have a universal property with respect to both 1-dimensional and 2-dimensional morphisms).</p>",
        "id": 560482242,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1764193981
    },
    {
        "content": "<p>That said we should really prove a few properties of the definition to make sure that it's correct. For instance:</p>\n<p>(i) The product should define a 2-functor, not just a functor. <br>\n(ii) We should have equivalences (in fact isomorphisms) of hom-categories into a finite product (essentially from the definition that our coyoneda functor preserves them). </p>\n<p>In the case of cartesian closed strict bicategories we should have<br>\n(i) The exponential defines a 2-functor, not just a functor.<br>\n(ii) We should have equivalences (in fact isomorphisms) of hom-categories, extending currying to a 2-adjunction.</p>",
        "id": 560483080,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1764194425
    },
    {
        "content": "<p>I would be happy to do the first two, and maybe the second two afterwards.</p>",
        "id": 561537981,
        "sender_full_name": "Spencer Woolfson",
        "timestamp": 1764717489
    }
]