[
    {
        "content": "<p>The aim of the infinity-cosmos project is to use convenient abstraction boundaries so we can develop some of the category theory of infinity-categories (equivalences, adjunctions, co/limits, Kan extensions) as painlessly as possible. With a lot of pain, we now have built (a preliminary form of) that abstraction boundary using quasicategories to model infinity-categories. PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/31101\">#31101</a> defines a strict bicategory whose</p>\n<ul>\n<li>objects are quasicategories (defined by a predicate on simplicial sets)</li>\n<li>maps are maps of simplicial sets (i.e., quasicategories form a full subcategory)</li>\n<li>2-cells are homotopy classes of homotopies between such maps</li>\n</ul>\n<p>Now the fun part begins. All general theorems about bicategories of course apply to this specific bicategory. For a non-trivial subset of those theorems, these develop the relevant notions for quasicategories. </p>\n<p>I'd like to schedule another synchronous meeting to explain this and strategize about how best to formalize these specifications and divide up the work. I'm also hoping to recruit some volunteers to help me clean up the infinity-cosmos repository and determine whether other results in there are ready to PR to mathlib.</p>",
        "id": 548029403,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1761856784
    },
    {
        "content": "<p>If you are interested in attending the synchronous meeting, please fill out the following poll:</p>\n<p><a href=\"https://www.when2meet.com/?33279755-b82Hm\">https://www.when2meet.com/?33279755-b82Hm</a></p>",
        "id": 548029803,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1761856933
    },
    {
        "content": "<p>In the meanwhile, if folks have questions, I'm happy to discuss here.</p>",
        "id": 548030054,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1761857027
    },
    {
        "content": "<p>Congrats on this progress! I haven't been following this project closely for the last several months, so I have a few basic questions. Is the focus of the project currently to develop the general theory of  <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∞</mi></mrow><annotation encoding=\"application/x-tex\">\\infty</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord\">∞</span></span></span></span>-categories just for the quasicategory model? Does this involve working towards proving that quasicategories form an <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∞</mi></mrow><annotation encoding=\"application/x-tex\">\\infty</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord\">∞</span></span></span></span>-cosmos? Or is the fact that they form a bicategory enough for now?</p>",
        "id": 548068104,
        "sender_full_name": "Dagur Asgeirsson",
        "timestamp": 1761879941
    },
    {
        "content": "<p>I keep changing my mind about this. </p>\n<ul>\n<li>On the one hand, all the formal theory we'll be developing now is \"model independent\", so it would be more satisfying to state it that way. </li>\n<li>On the other hand, the only model of ∞-categories that exists in mathlib is quasicategories. (Note the simplicial category model doesn't behave well from the point of view of considering ∞-functors, and ∞-natural transformations as well, so the results I'm thinking of above don't apply directly to simplicial categories.) So I don't know how to make \"∞-category\" into a technical term (from the pov of mathlib) without just defining ∞-category to mean quasicategory.</li>\n<li><span class=\"user-mention\" data-user-id=\"752279\">@Dom Verity</span> address this by defining \"∞-category\" to mean an object of an ∞-cosmos. If this is acceptable for the mathlib maintainers, that is one approach, but there are various reasons to object. (Eg there are many examples of ∞-cosmoi whose objects aren't really ∞-categories as usually defined.)</li>\n<li>Also it will involve a lot of work to prove that quasicategories define an example of an ∞-cosmos. I'm hoping that after <span class=\"user-mention\" data-user-id=\"488744\">@Jack McKoen</span>'s work on exponentiating quasicategories is merged, some one will take this on. Thanks to his work, I'm hoping about 2/3rds of the proof will be easy, but the final 1/3 might be a pain.</li>\n<li>In the meanwhile, we can start proving some very basic theorems about quasicategories right now in a way that could be refactored to be made model independent later. So maybe we should just do that? (It's also a lot easier to explain that we've just directly built some 2-category of quasicategories and now plan to work with that.)</li>\n</ul>\n<p>I'd be happy to hear other perspectives on this. Everything I've said above seems kind of provisional.</p>",
        "id": 548207020,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1761930057
    },
    {
        "content": "<p>Is there a \"fully ∞-cosmological\" proof of the straightening/unstraightening equivalence?</p>",
        "id": 548208664,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1761930573
    },
    {
        "content": "<p>No, and frankly I don't think this is the right axiomatic framework for that. I prefer deriving those from a universal left or co-cartesian fibration that is both univalent and directed univalent. See, e.g., the book in progress by <a href=\"https://drive.google.com/file/d/1lKaq7watGGl3xvjqw9qHjm6SDPFJ2-0o/view\">Cnossen, Cisinski, Nguyen, Walde</a>.</p>",
        "id": 548210409,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1761931099
    },
    {
        "content": "<p>I wasn’t aware of this book, only of Cisinski-Nguyen's earlier work on the universal fibration, thanks for the reference!</p>",
        "id": 548211275,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1761931444
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"246635\">Emily Riehl</span> <a href=\"#narrow/channel/455414-Infinity-Cosmos/topic/time.20for.20the.20formal.20category.20theory.20of.20quasicategories!/near/548207020\">said</a>:</p>\n<blockquote>\n<ul>\n<li>Also it will involve a lot of work to prove that quasicategories define an example of an ∞-cosmos. I'm hoping that after <span class=\"user-mention silent\" data-user-id=\"488744\">Jack McKoen</span>'s work on exponentiating quasicategories is merged, some one will take this on. Thanks to his work, I'm hoping about 2/3rds of the proof will be easy, but the final 1/3 might be a pain.</li>\n</ul>\n</blockquote>\n<p>I am happy to try the final 1/3 of this. The 2/3 I've \"done\" will be on their way to Mathlib in the next few weeks. My masters thesis should be submitted in a few days, after which I'll have my free time back.</p>",
        "id": 548211721,
        "sender_full_name": "Jack McKoen",
        "timestamp": 1761931595
    }
]