[
    {
        "content": "<p>This PR changes the notion of a 'set of minimal elements' wrt an unbundled relation r, i.e. <code>minimals (r : α → α → Prop) (s : Set α) : Set α</code>, to a 'minimality predicate' with a bundled relation, i.e. <code>Minimal [LE α] (P : α → Prop) : α → Prop</code>. </p>\n<p>Since it removes a definition, it involves an API overhaul and fixes everywhere the old definition was used. I am fairly confident it is an improvement, though. </p>\n<p>This kind of thing is probably likely to accumulate merge conflicts, so a review soon would be appreciated!</p>",
        "id": 451240312,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1720915655
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 451307720,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1720932190
    },
    {
        "content": "<p>To resort to the initial version, one would use  something like <code>SetOf (@Minimal (LE.mk r) s)</code>?</p>",
        "id": 451419043,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1721024392
    },
    {
        "content": "<p>What if one needs to consider several relations on the same type at the same time? (example: divisibility and usual order on natural integers?)</p>",
        "id": 451419610,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1721024654
    },
    {
        "content": "<p>Probably with a type synonym. This is mildly inconvenient, but so was having to explicitly specify the relation everywhere in the standard use case. (I miss Lean3, where you could write <code>(≤)</code> instead of <code>(· ≤ ·)</code>.)</p>\n<p>Note that there was nowhere in mathlib that actually used <code>maximals</code> with an unbundled order in practice.</p>",
        "id": 451473915,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1721042520
    },
    {
        "content": "<p>A compromise could be having a predicate <code>MinimalWrt (r : α → α → Prop) (P : α → Prop) (a : α) : Prop</code> with  an unbundled relation, and a small amount of API. One could then define <code>Minimal := MinimalWrt (· ≤ ·)</code>. My main point is the <code>Minimal</code> is much nicer to work with.</p>",
        "id": 451522398,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1721055916
    },
    {
        "content": "<p>i personally think specialising is fine here</p>",
        "id": 451630447,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1721077569
    },
    {
        "content": "<p>For context : <a href=\"https://github.com/leanprover-community/mathlib4/pull/14781\">#14781</a> is a PR I just made, depending on this one, that cleans up Zorn's lemma using the new API. Among other things, it means that Zorn doesn't need separate <code>PartialOrder</code> and <code>Preorder</code> versions.</p>",
        "id": 451645162,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1721084243
    },
    {
        "content": "<p>Just bumping this one. I think it should be ready.</p>",
        "id": 453280921,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1721683615
    },
    {
        "content": "<p>I just fixed another merge conflict here. <span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> , perhaps you could maintainer merge after your review? Our slight disagreement on a lemma inclusion could be looked over by such a maintainer.</p>",
        "id": 454329999,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1722009910
    },
    {
        "content": "<p>Sorry for dropping the ball for a week just to then complain that the diff is too big <span aria-label=\"zip it\" class=\"emoji emoji-1f910\" role=\"img\" title=\"zip it\">:zip_it:</span></p>",
        "id": 454423654,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1722055208
    },
    {
        "content": "<p>No worries! For a refactor of a relatively little-used API like this one, I think that to prevent things dragging on, there maybe is a case to be made for just doing it in one go rather than splitting, deprecating, etc. Is there anyone else that can weigh in on this?</p>",
        "id": 454460354,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1722077558
    },
    {
        "content": "<p>I agree with Peter here. If there really is API missing, it can always be added back later. The request to duplicate the API side-by-side and reprove it all, especially after the PR is already ready for review, seems like an unreasonably high bar.</p>",
        "id": 454695799,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1722219057
    },
    {
        "content": "<p>Peter, I saw you had a request for refactoring guidelines. I think we don't have anything like this because what is needed depends on the nature of the refactor. What I would suggest is that, in the future, you discuss your plans on Zulip ahead of time (apologies if you already did this and I missed it!). Then, for complicated refractors, there can be a discussion of how the transition should take place.</p>",
        "id": 454696051,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1722219217
    },
    {
        "content": "<p>I did discuss my plans <a href=\"#narrow/stream/287929-mathlib4/topic/maximals.2Fminimals.20refactor\">here</a>, although the discussion didn’t really get into the nuts and bolts in the way you’re talking about.</p>",
        "id": 454696573,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1722219341
    },
    {
        "content": "<p>I see. I guess the follow-up would be: if you feel a refactor is going to be, or is starting to get, complicated, then it's best to return to Zulip to ask for advice. I know this is perhaps not obvious, so I apologize that there was any inconvenience here.</p>",
        "id": 454697248,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1722219528
    },
    {
        "content": "<p>Thanks for the comments, <span class=\"user-mention\" data-user-id=\"197836\">@Jireh Loreaux</span> . I believe the PR is ready to look at again. (The merge conflict tag should disappear by itself soon). </p>\n<p>I've added in the PR description a summary of the scope, which will hopefully make review easier.</p>",
        "id": 455177094,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1722360050
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"329425\">@Peter Nelson</span> thanks for the new PR description. It helped. I left a review, but it's not incredibly detailed.</p>",
        "id": 455189124,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1722363544
    },
    {
        "content": "<p>Since <span class=\"user-mention\" data-user-id=\"197836\">@Jireh Loreaux</span> and <span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span> have looked and I have addressed the comments, is there a chance of merging at the point? </p>\n<p><span class=\"user-mention\" data-user-id=\"519269\">@Pim Otte</span> ‘s <a href=\"https://github.com/leanprover-community/mathlib4/pull/15357\">#15357</a> includes lemmas that will benefit from this API and it would be nice to have it available</p>",
        "id": 455918676,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1722600622
    },
    {
        "content": "<p>I've just hit merge on this - I think it's a generally positive change, and as has been mentioned above any missing parts can be filled in later. Thanks for working on this, and thanks for your patience here!</p>",
        "id": 456650459,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1722876357
    }
]