[
    {
        "content": "<p>Hi, in <a href=\"https://github.com/leanprover-community/mathlib4/pull/12394\">#12394</a> I define tight measures (if you like the topic, feel free to take a look). The PR is quite long (I don't think I've done PR's yet that added over 400 lines at once), but I think it is reasonable given that the results are straightforward and we need some intermediate stuff to get to the actual definitions and properties. </p>\n<p>My question is: is the current length of the PR okay, or is the length prohibitive for efficient reviewing and should I break it up? (The latter would mean that the first version would probably not even include tight measures, but only the weaker notions of separable measures and pre-tights measures)</p>",
        "id": 437013144,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1714821040
    },
    {
        "content": "<p>I think the length is fine, but you have to be ready for a longish back-and-forth process (I've just started :-)</p>",
        "id": 437013406,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1714821328
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110050\">Sébastien Gouëzel</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2312394.20defines.20tight.20measures.2C.20is.20it.20too.20long.3F/near/437013406\">said</a>:</p>\n<blockquote>\n<p>I think the length is fine, but you have to be ready for a longish back-and-forth process (I've just started :-)</p>\n</blockquote>\n<p>Yes, I've seen that and made the necessary changes! Thank you! I'm fine with the process being longer, as long as this hits Mathlib in some form at some point!</p>",
        "id": 437014100,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1714822059
    },
    {
        "content": "<p>There is another notion about measures also called separable in <a href=\"https://github.com/leanprover-community/mathlib4/pull/12519\">#12519</a> by <span class=\"user-mention\" data-user-id=\"703970\">@Etienne Marion</span> (I think that's the right name? EtienneC30 on github). Could you both choose names for your definitions that describe more precisely what you mean? Also I did not read much of any of your PRs, but the definitions might be related?<br>\nI encourage both of you to look at the other PR, and any help with reviewing is welcome!</p>",
        "id": 437018897,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1714826526
    },
    {
        "content": "<p>I did take a brief look at that PR previously, but I think that the notions are quite different. Etienne is defining separable \"measure spaces\", whereas I'm defining separable \"measures\" (on a given space). I would say that they don't bite each-other. Also, based on a comment by <span class=\"user-mention\" data-user-id=\"110050\">@Sébastien Gouëzel</span>, I've moved my definition of <code>IsSeparable</code> in the <code>MeasureSpace.Measure</code> namespace, which I think makes it sufficiently distinct from what <span class=\"user-mention\" data-user-id=\"703970\">@Etienne Marion</span>  is doing. Do you concur, Etienne?</p>",
        "id": 437020527,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1714827902
    },
    {
        "content": "<p>I will try to take a more in-depth look at that PR later, but I think I've ran out of the majority of my Lean time for today....</p>",
        "id": 437020636,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1714827967
    },
    {
        "content": "<p>I agree that the two definitions don't seem that close to each other. In particular one of them uses a topology on the space, while the other one is about measurability only. But they are both properties of a measure,  and the one defined by Etienne could also be called <code>Measure.something</code>. I'd like the \"something\" to be a bit more specific in both cases.</p>",
        "id": 437021881,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1714828965
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"350992\">Rémy Degenne</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2312394.20defines.20tight.20measures.2C.20is.20it.20too.20long.3F/near/437021881\">said</a>:</p>\n<blockquote>\n<p>I agree that the two definitions don't seem that close to each other. In particular one of them uses a topology on the space, while the other one is about measurability only. But they are both properties of a measure,  and the one defined by Etienne could also be called <code>Measure.something</code>. I'd like the \"something\" to be a bit more specific in both cases.</p>\n</blockquote>\n<p>I see that I misunderstood Etienne's file. I read a bit closer, and I think that what Etienne is defining as <code>SeparableMeasureSpace</code> and what I am defining as <code>IsSeparable</code> probably agree on certain spaces. At first glance I think Etienne's definition is more general (as I'm putting a topological space structure on them). If that is correct, I'm happy to replace my definition by a theorem <code>foo</code> that asserts my definition applies in topological spaces and import the file by Etienne. </p>\n<p>As I'm only defining very little API for <code>IsSeparable</code>, I think this should not bite the reviewing process on my PR; simply writing <code>rw [foo]</code> at the beginning of proofs that work with an <code>IsSeparable</code> hypothesis should to the trick.</p>",
        "id": 437024694,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1714831544
    },
    {
        "content": "<p>In fact I also thought at first that our definitions were not related, but I agree with Josha that they are linked in certain spaces. However I think some hypotheses about the measure are needed. In particular my definition only speaks about sets with finite measure, so my definition of separability could only imply Josha's for sigma finite measures.</p>",
        "id": 437029882,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1714836837
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"703970\">Etienne Marion</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2312394.20defines.20tight.20measures.2C.20is.20it.20too.20long.3F/near/437029882\">said</a>:</p>\n<blockquote>\n<p>In fact I also thought at first that our definitions were not related, but I agree with Josha that they are linked in certain spaces. However I think some hypotheses about the measure are needed. In particular my definition only speaks about sets with finite measure, so my definition of separability could only imply Josha's for sigma finite measures.</p>\n</blockquote>\n<p>So neither generalizes the other? That is a bit unfortunate, although we can always put in a result in either file that links the two in special cases. Do you (or anyone else) have a proposal on how to distinguish them name-wise?</p>",
        "id": 437035807,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1714842542
    },
    {
        "content": "<p>Uninformed remark: Maybe there is a common generalisation?</p>",
        "id": 437036124,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1714842844
    },
    {
        "content": "<p>Well first I could add a more general definition which does not restrict to sets with finite measure, it will not impact my file much I think, I did not do it in the first place because I did not see the point.</p>",
        "id": 437036471,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1714843192
    },
    {
        "content": "<p>But it is still not obvious to me wether it can be generalized, I have to think about it.</p>",
        "id": 437036529,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1714843220
    },
    {
        "content": "<p>I don't see how we can make it more general. The thing is your definition is only about the support of the measure but makes no assumption on the way it behaves on this support, while mine is more the other way around. Conditionnally on a few changes in definitions, I think we can prove that if a sigma-finite measure is separable for you then it is also for me, but I cannot think of an implication in the other direction.</p>",
        "id": 437097554,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1714902486
    },
    {
        "content": "<p>About the naming, maybe yours could be Measure.SeparableSupport? I am not inspired for mine, but maybe Measure.CountableApprox... My use of \"separable\" came from the fact that it is equivalent to saying that the metric space of constant indicators is separable for the L1 norm.</p>",
        "id": 437097715,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1714902678
    },
    {
        "content": "<p>I propose that I use SeparableSupport, you keep your name, and once both PR’s hit Mathlib, we see what the proper relationships between the two are?</p>",
        "id": 437100239,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1714905173
    },
    {
        "content": "<p>Or feel free to propose another approach of course!</p>",
        "id": 437100362,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1714905287
    },
    {
        "content": "<p>It’s fine for me!</p>",
        "id": 437102507,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1714907275
    }
]