[
    {
        "content": "<p>A lot of new theory:<br>\n<a href=\"https://github.com/leanprover-community/mathlib4/pull/11689\">https://github.com/leanprover-community/mathlib4/pull/11689</a><br>\nIt starts with a definition of expressive power of VCSP, proceeds with lemmas about it, and culminates in a proof that, if a VCSP template can express Max-Cut, then it cannot have any commutative fractional polymorphism.</p>\n<p>Who will have time to review it?</p>",
        "id": 429680448,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1711466702
    },
    {
        "content": "<p>Perhaps a reasonable candidate for a separate project?</p>",
        "id": 429750978,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1711492779
    },
    {
        "content": "<p>VCSP theory as a separate project is here:<br>\n<a href=\"https://github.com/madvorak/vcsp\">https://github.com/madvorak/vcsp</a><br>\nYou mean you don't want me to upstream it to Mathlib?</p>",
        "id": 429751607,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1711493170
    },
    {
        "content": "<p>I don't not want you to upstream it. More I would like to work out what good criteria are for deciding whether such projects should be in Mathlib or out.</p>",
        "id": 429751781,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1711493309
    },
    {
        "content": "<p>I think a good rule of thumb is: \"if there isn't an expert reviewer available, then it shouldn't go in Mathlib!\". And more formally, I hope we can evolve from \"everything belongs in Mathlib\" to \"there is a reasonable expectation that more than one other person will later want to build on this\".</p>",
        "id": 429751867,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1711493383
    },
    {
        "content": "<p>Sorry --- this conversation shouldn't be happening here on your PR, it was a mistake to try and start such a discussion locally. I don't want to single out your project / PR.</p>",
        "id": 429751941,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1711493412
    },
    {
        "content": "<p>I was intending it to be in Mathlib from the beginning. Therefore, I created my VCSP repo only as a buffer for things that have been implemented but haven't been upstreamed to Mathlib yet (if something was staying in my repo for a longer time without a Mathlib PR, it was because I was not sure about a certain definition and I wanted to wait before I set it into stone).</p>\n<p>This approach was a reaction to my previous experience, when I developed the theory of grammars completely outside of Mathlib and, when the time for contributing to Mathlib came, it had diverged too far from what Mathlib wanted.</p>\n<p>However, if Mathlib doesn't want to have VCSP at all, it is a very different situation. I thought VCSP theory was naturally highly general and thus suitable for Mathlib, but I might have been wrong.</p>",
        "id": 429752494,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1711493764
    },
    {
        "content": "<p>I think this needs wider discussion, but I can see the point that in order to keep mathlib maintainable, we need people who can review large new additions - preferably more than one</p>",
        "id": 429752813,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1711493956
    },
    {
        "content": "<p>It's not something I'd ever heard of, but of course it's far from my corner of maths. This is why \"exhibit a reviewer\" seems like a good criterion.</p>",
        "id": 429752830,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1711493967
    },
    {
        "content": "<p>How about we pause here, and restart this conversation afresh elsewhere?</p>",
        "id": 429752850,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1711493985
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Scott Morrison</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2311689.20VCSP.20expressive.20power/near/429752850\">said</a>:</p>\n<blockquote>\n<p>How about we pause here, and restart this conversation afresh elsewhere?</p>\n</blockquote>\n<p>-&gt; <a href=\"#narrow/stream/287929-mathlib4/topic/VCSP.20theory\">https://leanprover.zulipchat.com/#narrow/stream/287929-mathlib4/topic/VCSP.20theory</a></p>",
        "id": 429821297,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1711533373
    },
    {
        "content": "<p>Ah -- I intended \"restart a conversation about the abstract scope, regarding areas with few or no reviewers, without mentioning VCSP\". :-)</p>",
        "id": 429834607,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1711537609
    }
]