[
    {
        "content": "<p>This has been sitting on the queue for a while. <span class=\"user-mention\" data-user-id=\"110050\">@Sebastien Gouezel</span> suggested a different definition, which I did not get to work and I think might be impossible to work. The reason is that there is a theorem that says that if one defines the adjoint via the graph (we can't do this because we don't have a <code>inner_product_space</code> structure for products), then the graph gives rise to an operator if and only if the domain is dense.<br>\nHowever, I think I have a usable definition that does not introduce artifical new structures,<code>fact</code> or any other nonsense.</p>",
        "id": 360858934,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1684950992
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"412682\">@Moritz Doll</span> can you explain why the other idea doesn't work? That is, taking the adjoint of <code>T ⊕ 0</code> where <code>0</code> acts on the orthogonal complement of <code>T.domain</code>. It may be the case that this is just painful in comparison to what you have, and adjoints of non-densely-defined operators just don't arise in practice, which is an acceptable answer. (Also note, it would be possible to recover the <code>T ⊕ 0</code> version from what you have if someone wanted such a thing.)</p>",
        "id": 360877629,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1684955784
    },
    {
        "content": "<p>Maybe it technically does work, but as I said there is definition of the adjoint that we cannot implement at the moment, because we don't have L2-prod of Hilbert spaces and that definition does not produce an operator if <code>T</code> is not densely defined. Therefore, I would argue that everything else is just a junk value and since we can define the domain independently of the property that <code>T</code> is densely defined my proposed definition is a good one (maybe not the best, but this might be a perfect is the enemy of good thing). I would think that it is more convenient to have a working definition for now and if find out that some other definition is better suited I am happy to refactor.</p>",
        "id": 360925589,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1684981048
    },
    {
        "content": "<p>Thanks, I'll have a more in-depth look at the PR tomorrow.</p>",
        "id": 360929490,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1684983921
    },
    {
        "content": "<p>Sorry <span class=\"user-mention\" data-user-id=\"412682\">@Moritz Doll</span>, my time was eaten and the weekend was busy. I promise I'll get to it tonight.</p>",
        "id": 362305357,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1685483083
    }
]