[
    {
        "content": "<p>In this PR, we proved that injectivity, surjectivity, bijectivity and exactness are local properties using <code>LocalizedModule</code>. More precisely, we showed that these can be checked at maximal ideals and on standard covers. And we use these to prove that flatness is a local property in <a href=\"https://github.com/leanprover-community/mathlib4/pull/19085\">#19085</a>. <br>\n<span class=\"user-mention\" data-user-id=\"648495\">@Christian Merten</span>  suggested us to formulate all these lemmas for an arbitrary family of module satisfying the correct <code>IsLocalizedModule</code> predicate. (Like the setup in <code>LocalProperties.Submodule</code>)<br>\n<span class=\"user-mention\" data-user-id=\"224323\">@Junyan Xu</span>  told us he's able to get rid of <code>Rₚ</code> in LocalProperties/Submodule by introducing <a href=\"https://github.com/leanprover-community/mathlib4/pull/19118/files#diff-b82a403c68ad063035d33f11de71f74ed1b98bbbe201177ceb9218b3679d3b9aR41\"><code>Submodule.localized₀</code></a> which is a submodule over the base ring rather than the localization in <a href=\"https://github.com/leanprover-community/mathlib4/pull/19118\">#19118</a>. <br>\nWhich of the three setups should we use? <br>\nI think the settings <code>IsLocalization</code> and <code>IsLocalizedModule</code> are more general, but the theorems are more complicated and harder to apply. I'm not sure which is better.</p>",
        "id": 482730047,
        "sender_full_name": "Sihan Su",
        "timestamp": 1731726888
    },
    {
        "content": "<p>I believe we prefer <code>IsLocalizedModule</code> for flexible applicability, and if you are feeling generous you can provide both. You can provide the <code>IsLocalizedModule</code> versions only for your end results if that makes things easier.</p>",
        "id": 482730982,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1731727895
    },
    {
        "content": "<p>I need the theorems like <code>Submodule.eq_of_localization_maximal</code> to prove the version for <code>IsLocalization</code> and <code>IsLocalizedModule</code>, but in <a href=\"https://github.com/leanprover-community/mathlib4/pull/19118\">#19118</a> they will be changed from <code>Submodule.localized'</code> to <code>Submodule.localized₀</code>?</p>",
        "id": 482733439,
        "sender_full_name": "Sihan Su",
        "timestamp": 1731730216
    },
    {
        "content": "<p>If I understand Junyan's suggestion correctly, the <code>Submodule.localized'</code> versions will stay, directly derived from the <code>Submodule.localized₀</code> version, so it should not make a difference for the proofs in the exactness file, which is the one I suggested to generalize to the <code>IsLocalizedModule</code> setting.</p>",
        "id": 482750739,
        "sender_full_name": "Christian Merten",
        "timestamp": 1731746035
    },
    {
        "content": "<p>Membership and ≤ in <code>localized₀</code> is defeq to membership in <code>localized'</code>, but equality isn't. So it might be a good idea to provide <code>localized'</code> version only for the submodule equality lemmas ...</p>",
        "id": 482755155,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1731750025
    }
]