[
    {
        "content": "<p>Hello everyone,</p>\n<p>I submitted <a href=\"https://github.com/leanprover-community/mathlib4/pull/17554\">#17554</a>, which adds a definition of sifted categories (I define them as nonempty categories for which the diagonal functor is a final functor), as well as their characterization as categories <code>C</code> for which the colimit functor <code>(C ⥤ Type) ⥤ Type</code> preserves finite products. </p>\n<p>The PR is rather long (389 lines), and the core of the proof relies on the fact that the product comparison map is \"just\" the colimit comparison map for the diagonal functor, up to a quite lengthy composition of isomorphisms. Due to the rather specific nature of the computation, I marked everything relevant to it as private.</p>\n<p>When writing this, I made a few questionnable choices, and I am still very unsure I did the right things, off the top of my head here are some questions I have:</p>\n<ul>\n<li>The file I introduced puts most of the results in the same place, and because of this it imports a lot of files (7). Is this too much ? For instance, would the fact that filtered limits are sifted better off in a small standalone file?</li>\n<li>Because there are auxiliary computations and isomorphisms everywhere, I had to resort to <code>letI</code> in quite a few places, and sadly even in one (private) definition. Is this really unavoidable? What would be style advices about structuring this kind of proofs?</li>\n<li>I used monoidal notations for the products because it seemed to make some of the auxiliary iso better i.e. <code>NatIso.OfComponents (fun _ ↦ Iso.refl _)</code> worked in more places and seemed to make things shorter. This comes at the cost of having to import <code>CategoryTheory.Monoidal.Types.Basic</code> and <code>CategoryTheory.ChosenFiniteProducts.FunctorCategory</code>. Is this an acceptable tradeoff?</li>\n</ul>\n<p>So overall I would be glad to hear some comments on this PR so that I can improve (and hopefully waste less reviewer time)!</p>",
        "id": 475682082,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1728424922
    },
    {
        "content": "<p>Thanks for this nice PR! </p>\n<p>I feel like it is telling us that we need to change the API related to cartesian closed categories a bit. If we are supposed to use <code>ChosenFiniteProducts</code> for the cartesian monoidal structure in general (which I think is a good idea), then the definition of <code>CartesianClosed</code> as it is now is kind of useless.  We should redefine it to mean <code>MonoidalClosed</code> for the monoidal structure coming from <code>ChosenFiniteProducts</code>. Then for example your <code>preservesColimTensLeftType</code> would just follow directly from the cartesian closed instance on types.</p>\n<p>Then it would be a good idea to develop some API for \"preserving\" <code>ChosenFiniteProducts</code> (I guess this is basically the data of a <code>MonoidalFunctor</code>?), and relate this (using <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.Limits.preservesLimitOfPreservesLimitCone#doc\">docs#CategoryTheory.Limits.preservesLimitOfPreservesLimitCone</a>) to <code>PreservesFiniteProducts</code>.</p>\n<p>As for your PR, I would suggest splitting off the part with the basic definitions as a small, separate PR which could be merged pretty quickly. The stuff about preserving finite products would then need to wait on my suggestions above, which would require some discussion before merging.</p>\n<p>Let me ping <span class=\"user-mention\" data-user-id=\"459699\">@Joël Riou</span> and <span class=\"user-mention\" data-user-id=\"243562\">@Adam Topaz</span> who might have opinions about this. Is there any reason to keep the definition of <code>CartesianClosed</code> as it is?</p>",
        "id": 475800503,
        "sender_full_name": "Dagur Asgeirsson",
        "timestamp": 1728464431
    },
    {
        "content": "<p>Thank you for the comment! In <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/stream/287929-mathlib4/topic/Cartesian.20Monoidal.20categories.2E\">#mathlib4 &gt; Cartesian Monoidal categories.</a> I raised the subject of the API for <code>CartesianClosed</code>, again I think that instead of basing it on <code>ChosenFiniteProducts</code>, one could also introduce an intermediary class on a monoidal category asserting that the monoidal structure is cartesian (this is \"morally\" just a property of the monoidal structure, but it will end up being a non-<code>Prop</code> type in lean since it will bundle a <code>IsLimit</code>), and then have <code>ChosenFiniteProducts</code>and <code>monoidalOfHasFiniteProducts</code> provide this class.<br>\nI agree that <code>preservesColimTensLeftType</code> shouldn’t be here and should follow from a better <code>CartesianClosed</code> API.</p>\n<p>Is it really worth splitting the PR with just the def? To be fair, I think that the definition of Sifted I picked is pretty useless, without this characterization, and I don’t think further work on the subject (such as trying to define the free sifted cocompletion of a small category) can be achieved without it anyway.</p>\n<p>(By the way, if we agree on what changes need to be made on <code>CartesianClosed</code>, I am willing to work on the refactor)</p>",
        "id": 475805459,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1728465788
    },
    {
        "content": "<p>It's up to you if you want to split the PR. If we're doing the refactor it will probably depend on a few other PRs anyway, and in general I think we're in favour of many small PRs (as long as they are working towards a bigger goal that's useful). </p>\n<p>Feel free to start experimenting with the refactor, try changing the definition of <code>CartesianClosed</code> to </p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"kn\">abbrev</span><span class=\"w\"> </span><span class=\"n\">CartesianClosed</span><span class=\"w\"> </span><span class=\"o\">(</span><span class=\"n\">C</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"kt\">Type</span><span class=\"w\"> </span><span class=\"n\">u</span><span class=\"o\">)</span><span class=\"w\"> </span><span class=\"o\">[</span><span class=\"n\">Category</span><span class=\"bp\">.</span><span class=\"o\">{</span><span class=\"n\">v</span><span class=\"o\">}</span><span class=\"w\"> </span><span class=\"n\">C</span><span class=\"o\">]</span><span class=\"w\"> </span><span class=\"o\">[</span><span class=\"n\">ChosenFiniteProducts</span><span class=\"w\"> </span><span class=\"n\">C</span><span class=\"o\">]</span><span class=\"w\"> </span><span class=\"o\">:=</span>\n<span class=\"w\">  </span><span class=\"n\">MonoidalClosed</span><span class=\"w\"> </span><span class=\"n\">C</span>\n</code></pre></div>\n<p>(you might need to change the imports for this to work, and turn off the local instance <code>monoidalOfHasFiniteProducts</code>) and see what errors come up. I know that for example we need to define a <code>ChosenFiniteProducts</code> instance on sheaf categories, but this shouldn't be hard (it's the same as the one on presheaves)</p>",
        "id": 475807981,
        "sender_full_name": "Dagur Asgeirsson",
        "timestamp": 1728466513
    },
    {
        "content": "<p>I agree that the situation would be better if <code>CartesianClosed</code> was defined in terms of <code>ChosenFiniteProducts</code>.</p>",
        "id": 475814318,
        "sender_full_name": "Joël Riou",
        "timestamp": 1728467967
    },
    {
        "content": "<p>Likewise. When I defined <code>CartesianClosed</code>, it was when <code>HasFiniteProducts</code> meant what is now called <code>ChosenFiniteProducts</code>. From the beginning, it was meant to be used with chosen finite products in mind. But after <code>HasFiniteProducts</code> (along with all limits) got changed to no longer be chosen, this stopped being as nice as it used to be...</p>",
        "id": 475886068,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1728485506
    },
    {
        "content": "<p>The first part containing the definition only (+ some easy properties) is now available as <a href=\"https://github.com/leanprover-community/mathlib4/pull/17779\">#17779</a><br>\nAnd the second part is <a href=\"https://github.com/leanprover-community/mathlib4/pull/17781\">#17781</a></p>",
        "id": 477000421,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1729001825
    },
    {
        "content": "<p>Now that the refactor of cartesian closed category is taken care of, may I ask for a review of <a href=\"https://github.com/leanprover-community/mathlib4/pull/17781\">#17781</a> (containing the actually useful characterization of sifted categories)?</p>",
        "id": 489319206,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1734375788
    },
    {
        "content": "<p>Actually, as a prerequiste to this PR, I think there should be a certain development of the preservations of colimits by bifunctors (e.g. how the tensor product commutes with colimits in both variables, which you do in a particular case and in the category of types).</p>",
        "id": 489715627,
        "sender_full_name": "Joël Riou",
        "timestamp": 1734514540
    },
    {
        "content": "<p>Thanks for the review! I agree that those lemmas come from something a bit more general, so I’ll try (hopefully) soon to implement that as well</p>",
        "id": 489934922,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1734605721
    }
]