[
    {
        "content": "<p>This PR introduces three meta properties of morphism properties: Given two morphism properties <code>P</code> and <code>Q</code>, <code>P.RespectsLeft Q</code> holds if <code>P</code> is stable under composition with morphisms satisfying <code>Q</code> on the left.<br>\nSimilarly <code>P.RespectsRight Q</code> is defined and finally <code>P.Respects Q</code> is simply the combination of both.</p>\n<p>This naturally extends two already existing meta properties:</p>\n<ul>\n<li><a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.MorphismProperty.RespectsIso#doc\">docs#CategoryTheory.MorphismProperty.RespectsIso</a>: <code>P.RespectsIso</code> is the same as <code>P.Respects (isomorphisms C)</code>. In this PR I replace the existing <code>RespectsIso</code> by an abbrev for the latter and provide some adapted API as this notion is widely used and will also remain the most used case of the <code>Respects</code> properties.</li>\n<li><a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.MorphismProperty.IsStableUnderComposition#doc\">docs#CategoryTheory.MorphismProperty.IsStableUnderComposition</a>: <code>P.IsStableUnderComposition</code> is the same as <code>P.Respects P</code>. This I do not (yet) touch in this PR.</li>\n</ul>\n<p>Benchmark shows that making <code>RespectsIso</code> an abbrev, does not hurt performance, so I think that is okay. I am unsure if I should also replace <code>IsStabelUnderComposition</code> by an abbrev. What do you think?</p>\n<p>(For context: This came up when developing more algebraic geometry API for morphism properties that are both local at the source and the target. The well-behaved notion of \"local at the source and the target\" is not simply local at the source and local at the target, but rather local at the source, local at the target and stable under postcomposition with open immersions. So that's why I want <code>P.RespectsRight IsOpenImmersion</code>.)</p>",
        "id": 472771057,
        "sender_full_name": "Christian Merten",
        "timestamp": 1727296917
    }
]