[
    {
        "content": "<p>I have uploaded a PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/16584\">#16584</a> that does various things in this direction:</p>\n<ul>\n<li>Define monomial orders</li>\n<li>Prove the division algorithm for a given monomial order (it works in a ring, the only condition is that the leading coefficient of each polynomial to divide by is a unit)</li>\n<li>Define the 4 standard monomial orders (lexicographic, reverse lexicographic, and the two other one that first consider degrees)</li>\n<li>A section (no more used) about Dickson orders, a stronger version of WellFounded which is traditionally used in that area, is somewhat easier to prove, but less general</li>\n</ul>",
        "id": 468459144,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1725734706
    },
    {
        "content": "<p>I need comments on various points :</p>\n<ul>\n<li>What about my definition of a structure <code>MonomialOrder</code>? The point is it has to encapsulate an <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=AddEquiv#doc\">docs#AddEquiv</a> to a type that contains the correct order. It would be simpler to just invoke the correct ordering relation, but then I can't use stuff such as <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Finset.sup#doc\">docs#Finset.sup</a></li>\n<li>Presumably, the four parts need to be split into 4 files (not saying about 4 PRs)</li>\n</ul>",
        "id": 468460434,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1725735054
    },
    {
        "content": "<p>This PR is used to replace the ad hoc division method in <a href=\"https://github.com/leanprover-community/mathlib4/pull/16177\">#16177</a> which formalizes the proof of Alon's Combinatorial Nullstellensatz.</p>",
        "id": 468460689,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1725735122
    },
    {
        "content": "<p>This PR has a lot of nice and small API lemmas. I am hopeful that this theory might go through quickly.</p>\n<ul>\n<li>I don't know of a better way to support these multiple orders. Your approach makes a lot of sense.</li>\n<li>There is a bunch of dead code in this PR. Could you please create a version that is \"minimalistic\" and only contains stuff that you need for <a href=\"https://github.com/leanprover-community/mathlib4/pull/16177\">#16177</a>. (Other stuff could be added later in follow up PRs.)</li>\n<li>As you indicate, this new PR could also split things into multiple files.</li>\n</ul>",
        "id": 469008493,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1725952920
    },
    {
        "content": "<p>I noticed (especially for <a href=\"https://github.com/leanprover-community/mathlib4/pull/16177\">#16177</a>) that the <code>m.toSyn</code> approach has some drawback when one works with specific order because it hides the adequate function (<code>toDegLex</code>, for example) and forces to use <code>change</code> before one can unfold the specific definition of the chosen monomial ordering.</p>",
        "id": 469012175,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1725953649
    },
    {
        "content": "<p>Could a helper lemma be used with <code>rw</code> to expose this, instead of <code>change</code>?</p>",
        "id": 469013096,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1725953806
    },
    {
        "content": "<p>I'll try that. The other possibility would be to work in the type definition, but I don't know.</p>",
        "id": 469014432,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1725954106
    }
]