[
    {
        "content": "<p>Mario wrote <code>lake exe refactor</code> and I think that it is a great tool!  See <a href=\"#narrow/stream/287929-mathlib4/topic/Self-correcting.20code/near/445714858\">this thread</a> for the announcement.</p>\n<p>In particular, it could be used for helping with automatic updates of lean code after breaking changes, or auto-compliance with linters,</p>\n<p>I do not really understand the subtle code that Mario wrote to handle simultaneous editing of a file at multiple locations, but I have tested it a little writing simple scripts to adapt to various circumstances and it has worked well!</p>\n<p>At the moment, the only \"feature\" that is missing, in my opinion, is the possibility of selecting which replacement to make: e.g. if we had a <code>removeDeprecations</code> script, running <code>lake exe refactor --remove-deprecations</code> could do, well just that!</p>\n<p>This can certainly come later, since each one of these \"patches\" needs to go through a separate code-review from <code>refactor</code> anyway.</p>\n<p>So, even though I do not really follow what the code does in detail, I have found it easy to use and working as intended.</p>\n<p>Is that enough to <code>maintainer merge</code> it?</p>\n<p>(<a href=\"https://github.com/leanprover-community/mathlib4/pull/13973\">#13973</a> for those on mobile)</p>",
        "id": 453624964,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1721808738
    },
    {
        "content": "<p>Could maybe <span class=\"user-mention\" data-user-id=\"385895\">@Jon Eugster</span>  or <span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> review this one as well?</p>",
        "id": 453627316,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1721809485
    },
    {
        "content": "<p>I completely missed this, sorry! I now added the <code>t-meta</code> label and will have a look within the next two days!</p>",
        "id": 462287894,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1723622643
    }
]