[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"479299\">@Jovan Gerbscheid</span> wrote <a href=\"https://github.com/leanprover-community/mathlib4/pull/11968\">#11968</a> last April and has kept it up to date, there are no merge conflicts. It's an improved version of the discrimination tree, it's way beyond my comprehension, do we want it and if so is there a plan for getting it over the line? <span class=\"user-mention\" data-user-id=\"306577\">@Matthew Ballard</span> do you have any comments?</p>",
        "id": 497371031,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738573751
    },
    {
        "content": "<p>Probably not until Wednesday at the earliest <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span></p>",
        "id": 497439685,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1738590452
    },
    {
        "content": "<p>Apologies for not attending to this one. I have hesitated to review/merge this one, because with my FRO hat on I'm concerned about duplicating a core piece of functionality from Lean. (That said: it looks very good, and there are some genuine improvements here.)</p>\n<p>Changing the behaviour of <code>DiscrTree</code> is not on the short/medium term FRO agenda. Thus 1) we can't expect to upstream this material, and 2) it's not going to cause a conflict. <em>However</em>, I worry that when/if we do come back to revisit the design of <code>DiscrTree</code> it will be more work (and I'm speaking selfishly here: probably more work for me and the other FRO folks who work on Mathlib) if Mathlib is using a forked version.</p>\n<p>So --- could there by consensus from maintainers that <em>if</em> we found ourselves in a situation where Lean wanted to upgrade its <code>DiscrTree</code>, in a way that essentially made this one obsolete (and/or the tactics built on top of it became obsolete because of new tactics upstream), <em>then</em> we'd be happy to discard this again?</p>\n<p>If that's the case, then I guess we can get moving on this. If that's not the case, I'd probably object to merging this, to avoid close duplication of fundamental tools, even if the duplicate is somewhat better.</p>",
        "id": 498719632,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1739182602
    },
    {
        "content": "<p>To clarify: this PR changes the version of the discrimination tree that fun_prop uses (but not simp) --- so <code>fun_prop</code> gets smarter (and <code>rw??</code> becomes possible), but simp does not change. Is that correct?</p>",
        "id": 498721369,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1739183077
    },
    {
        "content": "<p>I understand the FRO has limited time, a clear mission and a need for focus, and hence has to say no to reasonable requests on their time. I know mathlib benefits <strong>hugely</strong> from all the work Kim, Johan and Anne are doing on FRO time.</p>\n<p>Yet, I worry if genuine mathlib improvements become bottlenecked on FRO priorities. One of the charms of open source is being open to unexpected external contributions. Hearing \"This piece is suboptimal, but you must not change this\" is rather frustrating.</p>\n<p>(I'm not a mathlib maintainer, so please weigh my opinion accordingly.)</p>",
        "id": 498721871,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1739183210
    },
    {
        "content": "<p>yes --- that's a very fair criticism, and one that I agree with!</p>",
        "id": 498728609,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1739184920
    },
    {
        "content": "<p>If core Lean implements a version of <code>DiscrTree</code> that makes this one obsolete, then I'd be happy to remove this one from Mathlib, of course.</p>",
        "id": 498728874,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1739184987
    },
    {
        "content": "<p>I don’t see how the future plans about discrimination trees could be a good reason to not have <code>rw??</code>.</p>",
        "id": 498750084,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1739191131
    },
    {
        "content": "<p>How much do the applications depend on the details of this particular implementation right now?</p>",
        "id": 498766349,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1739195360
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2311968.20improvements.20to.20RefinedDiscrTree/near/498750084\">said</a>:</p>\n<blockquote>\n<p>I don’t see how the future plans about discrimination trees could be a good reason to not have <code>rw??</code>.</p>\n</blockquote>\n<p>I'm not arguing against merging here, just explaining my lack of enthusiasm for doing it myself: I can see a future where <code>DiscrTree</code> gets improvements/changes, and we want to either update <code>RefinedDiscrTree</code> to match, or to drop it because it has become obsolete, and there's no one available to do this work. By merging duplications of core infrastructure, Mathlib is taking on debt that I'm unconvinced is being budgeted for!</p>\n<p>(Repeating, this is not a veto!)</p>",
        "id": 498889056,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1739231108
    },
    {
        "content": "<p>Somehow I hadn't seen this conversation before, sorry about that. Anyways, I gave a little demo of the <code>rw??</code> tactic today, and <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> said that we should get it merged into Mathlib. Here are some points that were discussed.</p>\n<h1>RefinedDiscrTree</h1>\n<ul>\n<li>The code could be made more efficient by compiling it. But this isn't necessary as is reasonably efficient already. (It is efficient because it is lazy, meaning that it only builds the root node of the tree, and the branches that are searched in, instead of the entire tree)</li>\n<li>I could collect more examples where <code>RefinedDiscrTree</code> performs better than lean's <code>DiscrTree</code>, such as <a href=\"#narrow/channel/270676-lean4/topic/.60simp.60.20is.20sometimes.20less.20powerful.20than.20.60rw.60/near/502567698\">this example</a> from today. And add them as tests to the <code>rw??</code> PR.</li>\n<li>Upstreaming: If/when you do want to upstream some of the <code>RefinedDiscrTree</code> features into Lean, I'd be happy to help. I think this would best be done one feature at a time. And of course if all these features get upstreamed, <code>RefinedDiscrTree</code> can be dropped. Strangely there are 2 discrimination trees in Lean, a lazy and a normal one. I think it would be fine to just switch to the lazy one everywhere and eventually deprecate the strict version.</li>\n</ul>\n<h1>rw??</h1>\n<ul>\n<li><span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> suggested that, to ease chaining rewrites, <code>rw??</code> would paste a <code>rw??</code> tactic instead of a <code>rw</code> tactic, so that users can chain multiple rewrites without having to type <code>rw??</code> for every rewrite, and so that the end result becomes a single <code>rw</code> with multiple arguments, instead of multiple separate <code>rw</code> calls. I think this is a good idea and I would like to try to implement it. What this means explicitly is that <code>rw?? [a]</code> means the same as <code>rw [a]; rw??</code>, and if it suggests to rewrite with <code>b</code>, then it pastes the tactic <code>rw?? [a, b]</code>.</li>\n<li>More care could be taken about what expression gets pasted by the tactic. Currently it is the lemma with all of its (implicit and explicit) arguments, but in practice this is often overkill.</li>\n<li>It was suggested that there might be ways to get the suggestions, without typing <code>rw??</code>. For example the suggestions could appear when the curson is on a regular <code>rw</code> tactic. Or via either shift-click or right-click, but I have no idea how to implement this.</li>\n<li>It was also suggested that since <code>rw??</code> is more useful than <code>rw?</code>, we could overwrite <code>rw?</code> in Mathlib, and let this tactic use the <code>rw?</code> syntax. This makes the tactic more easily discoverable for users.</li>\n<li>Benchmarking: I could add some benchmarks of <code>rw??</code>, but I'm not sure in what form this would be expected. (As Mathlib grows, these will slow down, potentially causing annoying failures later).</li>\n</ul>\n<p>I haven't updated the <code>rw??</code> PR with the recent changes in the <code>RefinedDiscrTree</code> PR, as I think this can be done after that gets merged, but let me know if there is a reason to do it earlier.</p>",
        "id": 502691215,
        "sender_full_name": "Jovan Gerbscheid",
        "timestamp": 1740789572
    }
]