[
    {
        "content": "<p>I have an interest in getting <a href=\"https://github.com/leanprover-community/mathlib4/pull/14091\">#14091</a> merged. I'm trying to port a few parts of Gonthier et al.'s proof of the four colour theorem to Lean, and that proof begins with some reasoning on digraphs. Would a maintainer kindly get this in please?</p>",
        "id": 462472983,
        "sender_full_name": "Jeremy Tan",
        "timestamp": 1723698660
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"598052\">@Jeremy Tan</span> did you coordinate with the PR author?</p>",
        "id": 462494563,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1723707552
    },
    {
        "content": "<p>I have not added anything substantial to the PR; I just cleaned up the docs and code style to be compatible with current mathlub</p>",
        "id": 462540343,
        "sender_full_name": "Jeremy Tan",
        "timestamp": 1723724760
    },
    {
        "content": "<p>I think you should avoid pushing to \"other people's\" branches, it can be annoying to deal with for the author especially if they have local changes they haven't pushed yet. Instead, I would encourage you to review the PRs you have an interest in getting merged, and use the \"suggest changes\" feature. Then when the author has addressed your comments you can approve the PR and request a merge here</p>",
        "id": 462541959,
        "sender_full_name": "Dagur Asgeirsson",
        "timestamp": 1723725403
    },
    {
        "content": "<p>Is there an established Git etiquete? That might be interesting since the community members contribute as repo collaborators and have the right to push to arbitrary branches.</p>\n<p>Usually, branching out and opening a new PR that supersedes the original PR is not too bad if there's some way to achieve consensus that the original author has been inactive. This avoids having important work going to limbo such that whoever wants to build on it has to wait too much to get work merged.</p>",
        "id": 462543186,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1723725918
    },
    {
        "content": "<p>In this particular case, <code>jt18chev</code>'s last commit was three weeks ago. Is this too much? Or not enough?</p>",
        "id": 462543607,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1723726105
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"519559\">Dagur Asgeirsson</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2314091.20on.20digraphs/near/462541959\">said</a>:</p>\n<blockquote>\n<p>use the \"suggest changes\" feature</p>\n</blockquote>\n<p>This also touches the \"Git etiquete\": I often find that feature quite limited and noisy, especially when there are too many suggestions or when the suggestions aren't simple.</p>\n<p>What I find myself doing is branching out, pushing my suggestions to another branch and then opening a PR to the original branch. This gives the original author the delight of the whole review experience that GitHub offers</p>",
        "id": 462545398,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1723726634
    },
    {
        "content": "<p>I've occasionally taken the liberty of doing that kind of small fixes on 2+ week old PRs</p>",
        "id": 462545440,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1723726655
    },
    {
        "content": "<p>Particularly when it's e.g. merging changes I made to that file</p>",
        "id": 462545478,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1723726670
    },
    {
        "content": "<p>It all depends on if the PR has been awaiting review for 2 weeks or awaiting the author for 2 weeks. In the latter case everything your saying is probably fine (but you should still try to communicate with the author before pushing to the branch). </p>\n<p>In the former case, I think you should always review instead of push to the branch. If you're suggesting nontrivial changes, you may write code snippets in comments instead of using \"suggest changes\", and let the author implement the suggestion.</p>\n<p>Note that in this case, the PR wasn't awaiting-author.</p>",
        "id": 462562785,
        "sender_full_name": "Dagur Asgeirsson",
        "timestamp": 1723732077
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"451983\">Arthur Paulino</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2314091.20on.20digraphs/near/462543607\">said</a>:</p>\n<blockquote>\n<p>In this particular case, <code>jt18chev</code>'s last commit was three weeks ago. Is this too much? Or not enough?</p>\n</blockquote>\n<p>I consider two weeks as the limit</p>",
        "id": 462872859,
        "sender_full_name": "Jeremy Tan",
        "timestamp": 1723853705
    },
    {
        "content": "<p>I think that is rather short. Please err on the safe side. A bit of extra communication doesn't hurt.</p>",
        "id": 462931724,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1723868846
    },
    {
        "content": "<p>Especially this time of the year, people could be on holiday and not read their messages for 2 weeks...</p>",
        "id": 462931809,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1723868901
    }
]