[
    {
        "content": "<p>A couple of declarations in mathlib have accidentally had a <code>__</code> in because of typos. Do we want a linter to check this or not? This PR was made last October and someone should probably decide what is going to happen with it. I know nothing about linters but one possible con is do we really want this linter running on all of mathlib lots of times when it's only very rare that it will say something? But I have no idea about how much this costs in practice.</p>",
        "id": 497388149,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738577779
    },
    {
        "content": "<p>An alternative is to occasionally grep for <code>\\w__+\\w</code></p>",
        "id": 497389411,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1738578068
    },
    {
        "content": "<p>Sometimes the double underscores come from some larger refactors, like <br>\n<a href=\"https://github.com/leanprover-community/mathlib4/pull/17904\">#17904</a>, where suddenly <code>unitIso_hom_app_tensor_comp_inverse_map_δ_functor__</code> was introduced (which btw won't be found by this grep <span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> suggested, because it is at the end)<br>\nSo best one would have to remember to grep every time doing automatic renaming as well.<br>\nBy now <code>unitIso_hom_app_tensor_comp_inverse_map_δ_functor__</code> has been renamed again (without deprecation note).</p>\n<p>In the way it is currently done in <a href=\"https://github.com/leanprover-community/mathlib4/pull/17580\">#17580</a>, you will get instant feedback as soon as you type a declaration with \"__\", and I think it is not very expensive to run. Of course one could consider of enabling this only in the CI.</p>",
        "id": 497391372,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1738578538
    },
    {
        "content": "<p>Another question: Are there other types of invalid declarations that could be flagged by a linter?</p>",
        "id": 497392324,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1738578755
    },
    {
        "content": "<p>I was partly involved with the linter and I am responsible for also making it go stale: sorry about that.</p>",
        "id": 497419275,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1738585426
    },
    {
        "content": "<p>I think that having some form of validation of \"allowed\" names is good.  However, I also think that there are several linters that do not need to run all the time, but would be a better fit for a \"periodic clean up flow\" that can be an almost automated process, if possible.</p>",
        "id": 497419284,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1738585429
    },
    {
        "content": "<p>Since we do not have that auto-clean up process (yet?), I was unsure about what to do with the linter.  In any case, I am changing my mind on this linter and view it more favourably.</p>",
        "id": 497419297,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1738585432
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> did most of the work here: it is a bit tricky to make this work since internal names add lot's of underscores, also sometime double. Thanks!<br>\nRegarding \"periodic clean up flow\", while I like the sentiment saving cycles for stuff that does not need to run all the time, I do think it will be more useful to catch wrongly named declarations before there are committed, because otherwise we will need to change them afterwards (and then deprecate?). Instead of \"periodic\" I would suggest at least \"as part of the pull request CI\".</p>",
        "id": 497421861,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1738586101
    },
    {
        "content": "<p>Then again, am I mistaken or is is quite cheap to run these kind of linters? Is working in vs-code is getting measurably slower in any way?</p>",
        "id": 497422189,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1738586180
    },
    {
        "content": "<p>Speed of the linters has come up a few times and I have not completely understood what the kind of impact is insightful to measure.</p>",
        "id": 497424062,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1738586688
    },
    {
        "content": "<p>A recent discussion highlighted, I think, how the fact that linters run in parallel makes them have a very small effect on building.  However, I imagine that this comes at a cost of using up threads that, if freed, <em>may</em> be used by other processes.</p>",
        "id": 497424323,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1738586751
    },
    {
        "content": "<p>Also, there is quite a bit of duplication in \"style\" linters, where each one scans from scratch the whole syntax tree looking for some form of pattern, while the scan could be done once and then each linter could simply act on the collected data.</p>",
        "id": 497424561,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1738586805
    },
    {
        "content": "<p>Overall, I think that this specific linter is probably much less intrusive than others and also has a very small computational cost.</p>",
        "id": 497424765,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1738586858
    },
    {
        "content": "<p>I think that it was a little unlucky that it came at a time when people started wondering about \"combined linter performance\", rather than individual linters.</p>",
        "id": 497424929,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1738586896
    },
    {
        "content": "<p>Anyway, I no longer think that the PR should be closed, at least, I no longer think that <em>I</em> will close it!</p>",
        "id": 497425230,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1738586986
    },
    {
        "content": "<p>Personally, I am now more in favour, especially if I interpret Sebastian's comment (<a class=\"message-link\" href=\"/#narrow/channel/287929-mathlib4/topic/Unifying.20linters/near/497045389\">#mathlib4 &gt; Unifying linters @ 💬</a>) correctly as saying that, at least right now, linter performance is not really something to worry about.</p>",
        "id": 497425502,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1738587058
    },
    {
        "content": "<p>Yes, I guess let's proceed.</p>",
        "id": 497559368,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1738629536
    }
]