[
    {
        "content": "<p>I made a tiny RP (<a href=\"https://github.com/leanprover-community/mathlib/pull/18979\">#18979</a>) a few weeks ago. One user approved the changes but didn't <code>bors d+</code> me. Is there something I have to do on my end or was the PR just overlooked?</p>",
        "id": 361771078,
        "sender_full_name": "Aaron Bies",
        "timestamp": 1685285888
    },
    {
        "content": "<p>That's because the user in question doesn't have the power to merge :)</p>\n<p>The reason you're stuck is that most of the maintainers' efforts are going towards the port to lean 4 right now, but asking here is the right next step</p>",
        "id": 361773274,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1685286635
    },
    {
        "content": "<p>Unfortunately the file you're changing was ported in <a href=\"https://github.com/leanprover-community/mathlib4/pull/4140\">!4#4140</a> last week.</p>\n<p>Is this something you need for a larger project or just something you happened to notice was missing?</p>",
        "id": 361773724,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1685286834
    },
    {
        "content": "<p>oh I see, so this file now requires an equivalent PR for mathlib4, I can do that later</p>\n<p>It's a theorem I found out about recently and noticed it wasn't in mathlib</p>",
        "id": 361774576,
        "sender_full_name": "Aaron Bies",
        "timestamp": 1685287137
    },
    {
        "content": "<p>So there's two options here: either we get the mathlib 3 pr reviewed and landed, and then afterwards we use the automatically generated lean 4 code from mathport to make a corresponding mathlib 4 pr. (You could make this second pr, but you wouldn't have to.)</p>\n<p>Alternatively, you can abandon the mathlib 3 pr and make a new mathlib 4 pr either by translating manually or using mathport's \"one shot\" feature.</p>\n<p>What we'd generally prefer you not to do is land the same lemmas in both mathlib 3 and 4 when they're translated manually.</p>",
        "id": 361775942,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1685287622
    },
    {
        "content": "<p>The first option seems preferable</p>",
        "id": 361777947,
        "sender_full_name": "Aaron Bies",
        "timestamp": 1685288335
    },
    {
        "content": "<p>I've left a review; feel free to ping me if I don't respond to your responses</p>",
        "id": 361796714,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1685295753
    },
    {
        "content": "<p>This looks pretty easy to forward-port so doing in mathlib3 seems harmless if that's what you want to do</p>",
        "id": 361796737,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1685295768
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 361799215,
        "sender_full_name": "Aaron Bies",
        "timestamp": 1685296967
    }
]