[
    {
        "content": "<p>I opened a PR (<a href=\"https://github.com/leanprover-community/mathlib4/pull/11534\">#11534</a>) defining a seminorm on a <code>PiTensorProduct</code> (it's the injective norm, i.e. defined using the fact that linear maps from a <code>PiTensorProduct</code> to another space correspond to multilinear maps, and we already have a norm on (continuous) multilinear maps).</p>",
        "id": 427935297,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1710943518
    },
    {
        "content": "<p>I have a few questions:</p>\n<ul>\n<li>First, obviously, does the PR look okay? I have a couple technical issues with it, which are described in the commit message.</li>\n<li>Second, I do not yet prove that this is a norm and not just a seminorm. I think that it requires a condition like <code>SeparatingDual</code> on the spaces, and also, the only proof that I can think of uses the construction of a basis of the <code>PiTensorProduct</code>, which is done in PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/11156\">#11156</a> and is currently blocked by other PRs, in particular <a href=\"https://github.com/leanprover-community/mathlib4/pull/11196\">#11196</a>. Does anybody know another, maybe simpler, way?</li>\n<li>Third, I actually want to define a norm on exterior powers, and it would be nice if it had the same universal property as the seminorm defined here (i.e. continuous linear maps from the exterior power correspond isometrically to continuous alternating maps). The most straightfoward way is to copy this PR and make the obvious adaptations, but one could also try taking the quotient norm from the tensor power, only I am not sure whether this gives the same result. (I think it might in characteristic <code>0</code>, though I am not sure, but I have no idea what to do in positive characteristic.)</li>\n</ul>",
        "id": 427936852,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1710943914
    },
    {
        "content": "<p>Um, so in order to address one of Sébastien's remarks I ended up defining the projective seminorm too. Oops...</p>",
        "id": 428210855,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1711052608
    }
]