[
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/20212\">#20212</a> is a pure generalization PR (replace Ring/AddCommGroup by Semiring/AddCommMonoid and remove IsDirected assumptions) and should not be hard to review. It actually decreases the number of lines.<br>\nThe subsequent PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/20247\">#20247</a> splits the file into two, resulting in 100+ import reduction from 19 files.</p>",
        "id": 490827610,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1735181198
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span>! <a href=\"https://github.com/leanprover-community/mathlib4/pull/20247\">#20247</a> is now ready.</p>",
        "id": 490862210,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1735209247
    },
    {
        "content": "<p>Follow-up PRs:</p>\n<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/20264\">#20264</a> (+113 -9) Show that every module is the direct limit of its f.g. submodules, and prove a technical lemma that roughly says equality in the tensor product is determined within f.g. submodules.</p>",
        "id": 490938430,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1735266797
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/20265\">#20265</a> (+98 -33) Auxiliary lemmas for generalizing flatness to semirings</p>",
        "id": 490938438,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1735266810
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/19115\">#19115</a> (+296 -347) Generalize flatness to semirings (commutative for now): depends on the previous two PRs. It also golfs some instances in Flat/Basic and Flat/Stability.</p>\n<p>A module over a ring is said to be flat if tensoring with it preserves injective linear maps. The same definition remains reasonable over a semiring, because (1) injective linear maps still coincides with monomorphisms over a semiring*; (2) projective modules (in particular, free modules) and localizations are still examples of flat modules over a semiring; (3) we recently fixed the definition of linear independence over semirings (<a href=\"https://github.com/leanprover-community/mathlib4/pull/18426\">#18426</a>), and flatness of S/R means <code>(1:S) ⊗[R] ·</code> preserves linear independence. In fact (2) is the main motivation for this PR: it allows us to unify results about free modules (e.g. polynomial algebras) and localizations over a semiring.</p>\n<p>There is a caveat in the definition: injective linear maps need to come from a particular universe, as we can't quantify over all universes. Over a ring, using Baer's criterion and character modules, we may restrict to inclusion maps of (f.g.) ideals, and that was the definition adopted in Mathlib. However, the proof doesn't work over a semiring due to three difficulties: (1) Baer's criterion for injective modules doesn't work over a semiring; (2) Q/Z isn't an injective object in the category of AddCommMonoids, in fact this category <a href=\"https://mathoverflow.net/questions/277284/which-semirings-have-enough-injectives-in-their-category-of-modules\">doesn't have enough injectives</a>; (3) homs into Q/Z does not distinguish points in an AddCommMonoid.</p>\n<p>However, we can still show that it suffices to consider injective linear maps between modules in the same universe as the semiring, using the fact that every module is the direct limit of its f.g. submodules, and that taking tensor products commutes with taking direct limits: of course, f.g. modules fit in the same universe as the semiring. We therefore change the definition of flatness to state preservation of injectivity of inclusion of f.g. submodules into f.g. modules in the same universe as the semiring.</p>",
        "id": 490938456,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1735266832
    },
    {
        "content": "<p>Let me explain the declaration diffs:<br>\n<a href=\"/user_uploads/3121/ChwHiBx7oEBPYE11s6iLLBqv/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/ChwHiBx7oEBPYE11s6iLLBqv/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"785x384\" src=\"/user_uploads/thumbnail/3121/ChwHiBx7oEBPYE11s6iLLBqv/image.png/840x560.webp\"></a></div><ul>\n<li>The first two are auxiliary lemmas which can't go into any existing file without adding too many imports.</li>\n<li><code>dfinsupp</code> is a new instance (defeq to <code>directSum</code>). <code>directSum_iff</code> and <code>dfinsupp_iff</code> are the iff versions.</li>\n<li><code>iff_lift_lsmul_comp_subtype_injective</code> is the equivalence with the original definition being replaced</li>\n<li>Four lemmas with subscript <code>s</code> are semiring versions of the corresponding lemmas without <code>s</code>.</li>\n<li>The second-to-last entry generalizes the last (removed) instance.</li>\n</ul>",
        "id": 493944787,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1736952593
    }
]