[
    {
        "content": "<p>This (<a href=\"https://github.com/leanprover-community/mathlib4/pull/17176\">#17176</a>) is a reviewed PR for integrals/integrability with .re. This is needed for a formalization of the Beta distribution in probability and was recommended by <span class=\"user-mention\" data-user-id=\"703970\">@Etienne Marion</span>  to be submitted in a separate PR first. If a maintainer could take a look at reviewing/merging this, that'd be great!</p>",
        "id": 476630072,
        "sender_full_name": "Alvan Arulandu",
        "timestamp": 1728847095
    },
    {
        "content": "<p>I am looking at this now. (I am not a maintainer, but I am a regular reviewer who has contributed to this part of the code fairly often before, so I'm hoping a review from me will speed up the process.)</p>",
        "id": 476631299,
        "sender_full_name": "David Loeffler",
        "timestamp": 1728848238
    },
    {
        "content": "<p>Just to be clear, non-maintainers are welcome to, and even encouraged to, submit reviews for mathlib PRs!</p>",
        "id": 476639625,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1728855798
    },
    {
        "content": "<p>I'm a bit confused with how the Lean review process works still? My understanding was that after at least one review (not necessarily from a maintainer), it's ready to be looked at by a maintainer for merging. I already have one approved review on this PR, so what's the best course of action typically?</p>",
        "id": 476812101,
        "sender_full_name": "Alvan Arulandu",
        "timestamp": 1728919999
    },
    {
        "content": "<p>A review from a maintainer is better than a review from a reviewer than a review from someone else than no review at all</p>",
        "id": 476813982,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1728920708
    },
    {
        "content": "<p>Are you talking about the <em>mathlib</em> review process? Right now there are over 1000 open PRs so the way it works is very slowly</p>",
        "id": 476825960,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1728925851
    },
    {
        "content": "<p>Yes, I mean the mathlib review process sorry. Got it, will be patient <span aria-label=\"working on it\" class=\"emoji emoji-1f6e0\" role=\"img\" title=\"working on it\">:working_on_it:</span></p>",
        "id": 476827573,
        "sender_full_name": "Alvan Arulandu",
        "timestamp": 1728926706
    }
]