[
    {
        "content": "<p>Although it is still marked as draft and unlabelled, <span class=\"user-mention\" data-user-id=\"481963\">@David Loeffler</span>'s PR about the Riemann-Lebesgue lemma could do with some reviewer attention. (Hopefully he will mark it as \"ready for review\" himself.)</p>",
        "id": 345572791,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1680156963
    },
    {
        "content": "<p>It would be a great result to have in mathlib. Due to a misunderstanding about how PRs are handled this has been waiting a long time.</p>",
        "id": 345572948,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1680157046
    },
    {
        "content": "<p>Could you elaborate a little further on the nature of the \"misunderstanding\" involved? What exactly is the etiquette for PR authors when a maintainer insists upon sweeping changes to a PR, offers assistance in making these changes that never materialises, and then disappears entirely?</p>",
        "id": 345599238,
        "sender_full_name": "David Loeffler",
        "timestamp": 1680165001
    },
    {
        "content": "<p>(<a href=\"https://github.com/leanprover-community/mathlib/pull/17719\">#17719</a> for mobile users)</p>",
        "id": 345600432,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1680165316
    },
    {
        "content": "<blockquote>\n<p>What exactly is the etiquette for PR authors when a maintainer insists upon sweeping changes to a PR, offers assistance in making these changes that never materialises, and then disappears entirely?</p>\n</blockquote>\n<p>Ultimately, since this is a volunteer organization we always have to be mindful of the fact that individuals can drop out at any time for any reason, and work around this. It is not that uncommon for someone to make a remark which implies some imminent action which doesn't actually happen, because the person got dragged away on real life issues, or because it wasn't as easy as originally estimated. You should check back with them to confirm the status, but in the worst case scenario you should just pretend the remark didn't happen.</p>\n<p>In this scenario that would mean \"maintainer insists upon sweeping changes to a PR\" without the second part, in which case you should (1) try to make the changes if possible, (2) have a good reason why the change is not feasible or desirable and explain it on the PR, (3) find other assistance with the change from a maintainer or other contributor.</p>",
        "id": 345615046,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1680168886
    },
    {
        "content": "<p>(since I had to read that multiple times to get the right meaning from it; Mario is suggesting in the worst case scenario to pretend that the offer of assistance didn't happen, not that the request for changes didn't)</p>",
        "id": 345617270,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1680169422
    },
    {
        "content": "<p>I would say that the etiquette whenever you would like a review (anyone disappearing on you or otherwise):</p>\n<ol>\n<li>Make sure your PR is marked <code>awaiting-review</code>, or assume that nothing will ever happen. (Many reviewers only look at what is on the <a href=\"https://bit.ly/3AZk1Qk\">#queue</a>.)</li>\n<li>If your PR is marked as a Draft PR, assume that most reviewers will decide that you are still working on it, and don't want feedback or merging. </li>\n<li>If the PR is correctly labelled on github but you are not getting reviews, feedback, or assistance you need, open a new thread here on the PR reviews stream, asking for other eyes.</li>\n<li>After you've done all that, maybe DM people you know who are interested in the field of your PR.</li>\n<li>If a maintainer comes to your apparently abandoned PR to remind you to label it, be nice when responding to them.</li>\n</ol>\n<p>I understand that these points may not be sufficiently well explained or well known. Be that as it may, not following these points was the misunderstanding I referred to.</p>",
        "id": 345631584,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1680173385
    },
    {
        "content": "<p>Note that I only found your PR today because I was going through all the unlabelled PRs on github to triage them. I at first assumed your PR was abandoned, being marked as a Draft PR and untouched for a long period. Since the material seemed valuable, I thought it might be worthwhile to see if I could get you to finish it --- which may have only been to mark it ready for review.</p>",
        "id": 345631601,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1680173389
    },
    {
        "content": "<blockquote>\n<p>Ultimately, since this is a volunteer organization we always have to be mindful of the fact that individuals can drop out at any time for any reason, and work around this.</p>\n</blockquote>\n<p>Referees for papers published in journals are volunteers too, and journal editors (and the academic community as a whole) still take a pretty dim view of referees going AWOL during the review process.</p>\n<p>Anyway <span class=\"user-mention\" data-user-id=\"110050\">@Sebastien Gouezel</span> has now very generously offered to take a look at generalising the L1 density lemma, so this PR may well be back on track. Many thanks to Scott for getting things moving again!</p>",
        "id": 345632650,
        "sender_full_name": "David Loeffler",
        "timestamp": 1680173696
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"481963\">David Loeffler</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2317719.20Riemann-Lebesgue.20lemma/near/345632650\">said</a>:</p>\n<blockquote>\n<p>Referees for papers published in journals are volunteers too, and journal editors (and the academic community as a whole) still take a pretty dim view of referees going AWOL during the review process.</p>\n</blockquote>\n<p>Still that happens quite often (much too often for my taste as an editor :-).</p>",
        "id": 345633792,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1680174028
    },
    {
        "content": "<p>I promise that our review process is faster than a typical pure maths journal. A four month delay is still an order of magnitude shorter than the review process for many papers I've heard about.</p>\n<p>But more importantly, perhaps you should think of this situation as more analogous to leaving a copy of a draft in the tea room rather than submitting to a journal. It was an unlabelled draft PR...</p>",
        "id": 345633813,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1680174034
    },
    {
        "content": "<p>Or perhaps more directly analogous to uploading a manuscript to a journal, saving your progress on the web form, but forgetting to hit the final \"submit\" button.</p>",
        "id": 345647046,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1680177185
    },
    {
        "content": "<blockquote>\n<p>leaving a copy of a draft in the tea room rather than submitting to a journal</p>\n</blockquote>\n<blockquote>\n<p>saving your progress on the web form, but forgetting to hit the final \"submit\" button</p>\n</blockquote>\n<p>I think these analogies do not quite capture the fact that a mathlib maintainer had already posted many messages on the PR thread, requesting substantial changes and promising a contribution of their own which didn't materialize. But there is little to be gained in arguing about this now that Sebastien has kindly volunteered to fill in the blank.</p>",
        "id": 345654739,
        "sender_full_name": "David Loeffler",
        "timestamp": 1680178946
    }
]