[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/27270\">#27270</a> I turn <code>WithLp</code> into a one field structure, as was suggested many times on Zulip and discussed here: <a href=\"#narrow/channel/287929-mathlib4/topic/defeq.20abuse.20in.20.60WithLp.60/near/526234806\">#mathlib4 &gt; defeq abuse in &#96;WithLp&#96; @ 💬</a>.<br>\nHere is what this PR does:</p>\n<ul>\n<li>The instances on <code>WithLp p α</code> which were defeq to those on <code>α</code> (algebraic instances, topology, uniformity, bornology) are now pulled back from <code>α</code> along <code>WithLp.equiv p α</code>. A few declarations are added to ease the process, such as versions of <code>WithLp.equiv</code> as a homeomorphism or a uniform isomorphism.</li>\n<li>It introduces some definitions to equip <code>α × β</code> with the Lp distance, and similarly for <code>Π i, α i</code>. This is then used to define relevant instances on type synonyms, such as for matrix norms.</li>\n<li>The PR fixes all the defeq abuses (which break obviously).</li>\n</ul>\n<p>I have some questions:</p>\n<ul>\n<li>Given <code>x : PiLp p α</code>, and <code>i : ι</code>, <code>x i</code> is defined as <code>x.ofLp i</code>. I did not put any coercion mechanism so <code>x i</code> shows up at <code>x.ofLp i</code> in the infoview. Should this be changed? In particular the lemma <code>ofLp_eval</code> becomes a syntactic tautology so I had to remove it without a deprecation.</li>\n<li>I came across some isolated declarations about a measurable space structure on <code>WithLp</code>. However this structure was introduced globally in <a href=\"https://github.com/leanprover-community/mathlib4/pull/26249\">#26249</a>, so I took the liberty to remove them. I have a question regarding <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/MeasureTheory/Measure/Haar/OfBasis.html#EuclideanSpace.measurableEquiv\">EuclideanSpace.measurableEquiv</a>: I tend to think that it is not needed and we can just use <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=MeasurableEquiv.toLp#doc\">docs#MeasurableEquiv.toLp</a>. However the measurable space structure on <code>WithLp</code> is not imported in the file where <code>EuclideanSpace.measurableEquiv</code> is defined, so if I want to deprecate <code>EuclideanSpace.measurableEquiv</code> I either have to add a useless import, or deprecate the instances in the file instead of removing them. What do you think is the best way?</li>\n</ul>",
        "id": 530990588,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1753557540
    }
]