[
    {
        "content": "<p>I slightly messed up <a href=\"https://github.com/leanprover-community/mathlib4/pull/21145\">#21145</a> ; its choice of junk values for <code>fundCircuit</code> was bad. This is my mistake - the reason the definition was especially bad just came up in work I'm currently doing elsewhere in the repo. </p>\n<p>This PR slightly modifies the definition of <code>fundCircuit</code> so that the fundamental circuit of a non-element <code>e</code> of the ground set is a singleton <code>{e}</code>, just as if <code>{e}</code> were a loop of <code>M</code>. </p>\n<p>This removes assumptions from a couple of existing lemmas, and crucially makes the useful lemma <code>Matroid.fundCircuit_restrict_univ</code> true, where it wasn't before.</p>",
        "id": 496643962,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1738185138
    },
    {
        "content": "<p>Out of curiosity, is the situation here that <code>fundCircuit</code> was being used in your repo (successfully), but it just turned out in the last couple of days that the choice that was made was suboptimal? Or is it that <code>fundCircuit</code> wasn't being used much, and it turned out when you came to use it that this problem was found?</p>",
        "id": 496648235,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1738187056
    },
    {
        "content": "<p>Out of curiosity, is the situation here that <code>fundCircuit</code> was being used in your repo (successfully), but it just turned out in the last couple of days that the choice that was made was suboptimal? Or is it that <code>fundCircuit</code> wasn't being used much, and it turned out when you came to use it that this problem was found?</p>",
        "id": 496648404,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1738187124
    },
    {
        "content": "<p>It was the first. I have just started to work on representable matroids and their fundamental matrices, in which junk columns really should be zero.</p>",
        "id": 496648723,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1738187274
    },
    {
        "content": "<p>I didn’t realize how annoying it is that fundamental circuits for junk elements are huge meaningless sets, before the linear algebra got involved.</p>",
        "id": 496648863,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1738187325
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"329425\">@Peter Nelson</span> We recently got a little bot to respond to messages that mention a github PR like <a href=\"https://github.com/leanprover-community/mathlib4/pull/21240\">#21240</a> with an emoji indicating that the PR is merged/delegated/closed.<br>\nSo besides writing the number in the title of the zulip thread, I encourage you to also write it in your message.</p>\n<p>Two caveats:</p>\n<ul>\n<li>the bot only responds to messages when something happens on github... so it will not put an emoji on this message, since the PR is already closed</li>\n<li>if a message contains two PR links, then the bot will just respond with emojis for both, and we can't see which emoji belongs to which PR... c'est la vie, I guess</li>\n</ul>",
        "id": 496773381,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1738242773
    }
]