[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/25089\">#25089</a>  we define the concept of a sublocale to a locale. We provide some basic infrastructure and, most importantly, prove that there exists an orderisomorphism between the sublocales of a locale X (ordered by inclusion) and the Dual Order of the nuclei on X.<br>\nWe will use this in following PRs to define more topological concepts in the context of locales (open sublocales, closed sublocales ...). Eventually, we want to bring our main result to mathlib: In our <a href=\"https://github.com/Bergschaf/Localic-Caratheodory-Extensions\">project</a>, we proved that the caratheodory extension of a measure on locales is  additive (and more interesting properties). (edit: correct Pr number)</p>",
        "id": 521156315,
        "sender_full_name": "Christian Krause",
        "timestamp": 1748546505
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/25089\">#25089</a> has now been on the maintainer merge queue for two weeks. Is there something that needs to be changed that it is visible or are the maintaingers just busy with transitioning to the new fork-system? (edit: correct pr number)</p>",
        "id": 525224742,
        "sender_full_name": "Christian Krause",
        "timestamp": 1750613619
    },
    {
        "content": "<p>I personally tend not to merge stuff where I don't have a clue about the maths and perhaps many other maintainers feel the same way?</p>",
        "id": 525224796,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1750613699
    },
    {
        "content": "<p>You're probably right, this is kind of a niche topic <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 525224842,
        "sender_full_name": "Christian Krause",
        "timestamp": 1750613747
    },
    {
        "content": "<p>Is <a href=\"https://github.com/leanprover-community/mathlib4/pull/21560\">#21560</a> the right PR? That one is already merged</p>",
        "id": 525224850,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1750613760
    },
    {
        "content": "<p>Ooops</p>",
        "id": 525224864,
        "sender_full_name": "Christian Krause",
        "timestamp": 1750613773
    },
    {
        "content": "<p>I meant <a href=\"https://github.com/leanprover-community/mathlib4/pull/25089\">#25089</a> (edit: this time its correct)</p>",
        "id": 525224880,
        "sender_full_name": "Christian Krause",
        "timestamp": 1750613798
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/queueboard/maintainers_quick.html#stale-maintainer-merge\">This page</a> lists maintainer-merge'd PRs that have not been tended to recently. It includes <a href=\"https://github.com/leanprover-community/mathlib4/pull/25089\">#25089</a>, so moving to forks did no impact this (<span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span>)</p>",
        "id": 525236502,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1750630637
    },
    {
        "content": "<p>In my experience, maintainer merge'd PRs usually are quickly tended to, but there are exceptions. For these, asking if things get stuck is very useful. (I often do so --- in the private reviewers stream.) So, if you'd like to help, posting about such PRs here is a useful thing to do.</p>",
        "id": 525236540,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1750630712
    },
    {
        "content": "<p>Another option, if you're <em>really</em> into doing this kind of thing: I've been trying to set up a triage team, which would help finding a suitable reviewer for each pull request. This kind of work doesn't require deep lean knowledge, is really useful if done consistently and is almost often understaffed --- so help is very welcome. I'm happy to mentor people, if you want to help but don't know how.</p>\n<p>(PS. I realised you're asking about your own PR, Christian --- which is perfectly fine. I'm writing this message also for anybody else who may be interested.)</p>",
        "id": 525236628,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1750630827
    },
    {
        "content": "<p>Thanks for your response, I hope I'm being not too impolite by \"promoting\" my own PRs here.<br>\nI'd be very happy to help with triaging Pull requests, but my mathematical knowledge is very very limited - I will only start studying maths this winter semester, so I only know a bit of locale theory from reading some books. And I suspect finding the right reviewer requires knowing the reviewers...</p>",
        "id": 525323772,
        "sender_full_name": "Christian Krause",
        "timestamp": 1750682804
    }
]