[
    {
        "content": "<p>I would be grateful if we could move forward with this PR, which has been open for several weeks now. I have quite a lot of code queued up behind it (starting with <a href=\"https://github.com/leanprover-community/mathlib4/pull/21079\">#21079</a> – the open-covers PR was my response to a reviewer suggestion on that PR).</p>",
        "id": 502546536,
        "sender_full_name": "David Loeffler",
        "timestamp": 1740739199
    },
    {
        "content": "<p>(see discussion here: <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Definition.20of.20a.20covering.20of.20a.20topological.20space.3F/with/496724483\">#mathlib4 &gt; Definition of a covering of a topological space?</a> )</p>",
        "id": 502547178,
        "sender_full_name": "David Loeffler",
        "timestamp": 1740739373
    },
    {
        "content": "<p>I don't want to keep up this PR, but I'm wondering if it would make sense to have a predicate <code>IsCover</code> for a family <code>S : I -&gt; Foo</code> where <code>Foo</code> is a SetLike type, such as <code>Opens X</code> or <code>Clopens X</code> (but potentially also <code>Subgroup X</code>).</p>\n<p>And then <code>IsOpenCover</code> could extend that. But the result about refining an open cover of a profinite set by a clopen cover could make use of the readable <code>IsCover</code> terminology.</p>",
        "id": 502550869,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1740740498
    },
    {
        "content": "<p>Hi Johan, </p>\n<p>I also wondered about defining covers by an arbitrary <code>SetLike</code> type. However, the problem is that to make this usable, we need to have typeclasses that encode not only the existence of lattice structures (<code>iSup</code> and <code>\\top</code>) on a SetLike type, but also compatibility of these structures with the usual ones on sets. </p>\n<p>This was precisely the motivation for the <code>LawfulTop</code>, etc, typeclasses that I suggested in a zulip discussion last month (<a href=\"#narrow/channel/287929-mathlib4/topic/proposal.3A.20lattice.20operations.20on.20.60SetLike.60s.3F\">#mathlib4 &gt; proposal: lattice operations on &#96;SetLike&#96;s?</a> ), but nobody seemed keen on the proposal – as was pointed out there, most <code>SetLike</code> types in mathlib are things like subgroups, subrings, etc for which the natural supremum operation is not set-wise union (and the bottom element is not the empty set) – the <code>Opens</code>, <code>Closeds</code>, and <code>Clopens</code> types for a topological space seem to be the only examples in mathlib of set-likes preserved under all the lattice operations.</p>",
        "id": 502560571,
        "sender_full_name": "David Loeffler",
        "timestamp": 1740743663
    },
    {
        "content": "<p>Ok, let's just try this out in practice. I've <code>bors d+</code>d the open covers PR</p>",
        "id": 502566916,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1740745754
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 502572204,
        "sender_full_name": "David Loeffler",
        "timestamp": 1740747437
    }
]