[
    {
        "content": "<p>This PR (<a href=\"https://github.com/leanprover-community/mathlib4/pull/24991\">#24991</a>) adds a typeclass <code>DayConvolution</code> on a pair of functors <code>C ⥤ V</code> between monoidal categories to bundle the data of a day convolution on them, i.e a chosen pointwise left Kan extension of <code>F ⊠ G</code> along <code>tensor C</code>.<br>\nI’d appreciate a feedback on the design decision to make it a typeclass. This decision was motivated by the observation that since <code>C ⥤ V</code> is already a monoidal category via the pointwise tensor product, trying to define a second monoidal structure on it is simply a bad idea.</p>\n<p>Instead, I think we should first \"make all the computations go through\" with chosen Kan extensions at the level of presheaves, and then introduce a typeclass <code>DayConvolutionMonoidalCategory</code> extending <code>MonoidalCategory A</code> that contains a fully faithful functor <code>A ⥤ (C ⥤ V)</code>, as well as all the axioms that would make it strong monoidal if <code>C ⥤ V</code> were endowed with the Day convolution structure. This would come along a constructor that promotes the data of the embedding, the existence of relevant Kan extensions and the fact that they land in the essential image of the embedding to the data of a <code>DayConvolutionMonoidalCategory</code>.</p>",
        "id": 518928114,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1747579438
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/24992\">#24992</a> defines the associators and proves the pentagon identity.</p>",
        "id": 518928175,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1747579475
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/24993\">#24993</a> defines the unitors and proves the triangle identity</p>",
        "id": 518928197,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1747579497
    },
    {
        "content": "<p>Regardless of the design we go with in <a href=\"https://github.com/leanprover-community/mathlib4/pull/24991\">#24991</a>, it should adapt easily enough to <a href=\"https://github.com/leanprover-community/mathlib4/pull/24992\">#24992</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/24993\">#24993</a>, which is why I submitted them already</p>",
        "id": 518928258,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1747579562
    },
    {
        "content": "<p>(Also, everything is blocked behind <a href=\"https://github.com/leanprover-community/mathlib4/pull/24703\">#24703</a>, which is also a blocker for the characterization of sifted categories, so it would be a good target for review)</p>",
        "id": 518928398,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1747579671
    },
    {
        "content": "<p>(Also, to make <span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span> happy, there is no assumption on <code>V</code> being cocomplete nor braided, just that certain diagrams are colimit diagrams ;), and for the tensor product to preserve them).</p>",
        "id": 518928655,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1747579853
    },
    {
        "content": "<p>I'm very confused by making <code>DayConvolution</code> a class. Why is it not just a structure?</p>",
        "id": 518976884,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1747618302
    },
    {
        "content": "<p>You should just use a type synonym for the new monoidal structure.</p>",
        "id": 518976982,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1747618359
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2324991.20Day.20convolution.20of.20functors/near/518976982\">said</a>:</p>\n<blockquote>\n<p>You should just use a type synonym for the new monoidal structure.</p>\n</blockquote>\n<p>I thought about type synonyms, but it seems to me it would also complicate things. E.g for augmented simplicial sets (which are <em>equivalent</em> to functors out of the opposite of <code>WithInitial SimplexCategory</code>), this would introduce yet another synonym for them. We could transport the monoidal structure along the equivalence, but then we would also lose some nice defeqs such that the one for the unit being the representable on the unit. I feel that making a <code>DayConvolutionMonoidalCategory</code> class would allow one to \"bring their own colimits cocones\", a bit like what is happening with <code>CartesianMonoidalCategory</code>.</p>\n<p>This of course doesn't block us from <em>also</em> writing a type synonym for the \"canonical\" structure on presheaves, that was on the list, but we need more than just synonyms IMO.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"110087\">Kim Morrison</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2324991.20Day.20convolution.20of.20functors/near/518976884\">said</a>:</p>\n<blockquote>\n<p>I'm very confused by making <code>DayConvolution</code> a class. Why is it not just a structure?</p>\n</blockquote>\n<p>Regarding class vs structure: have a look at the pentagon in <a href=\"https://github.com/leanprover-community/mathlib4/pull/24992\">#24992</a>: do you really want every parameter to be explicited as a structure here?</p>\n<p>I made it a class on functors to ease notations and proofs of such properties, but this should be a \"don't register it globally\" class. In practice, it will only be registered locally when constructing <code>DayConvolutionMonoidalStructure</code> instances. This is a bit like what happens with <code>CatCommSq</code> I guess (which was made a class over a structure to avoid proliferation of parameters)</p>",
        "id": 518992624,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1747629795
    }
]