[
    {
        "content": "<p>I've been waiting for a period where there were no open PRs against <code>Mathlib.Topology.Algebra.RestrictedProduct</code> so that I can split the file. If I'm not mistaken we're currently in that state (<a href=\"https://github.com/leanprover-community/mathlib4/pull/24915\">#24915</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/25462\">#25462</a> are both in). The file is over 1000 lines long and in <code>FLT.Mathlib.Topology.Algebra.RestrictedProduct</code> we have over 500 lines more, so in <a href=\"https://github.com/leanprover-community/mathlib4/pull/25558\">#25558</a> I've split it into the algebra part and the topology part. Questions on my part: should the topology part be called <code>TopologicalSpace.lean</code>? Should the algebra part still live in a directory whose name mentions <code>Topology</code>? It imports some filter stuff in <code>Order</code> but no topology at all now.</p>\n<p>The PR is a simple split; I've just moved 40% of the file into another file without adding or removing anything.</p>",
        "id": 522884435,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1749288497
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/25538\">#25538</a> to get the emoji reaction that's relevant here</p>",
        "id": 522888038,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1749293391
    },
    {
        "content": "<p>Answering your question: yes, a separate PR for the deprecated_module is preferred</p>",
        "id": 522888073,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1749293434
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/25558\">#25558</a> &lt;- <span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> is this the one you meant?</p>",
        "id": 522899528,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1749307100
    },
    {
        "content": "<p>Oh sorry, I hadn't realised that mentioning multiple PRs in one message messed up emojibot. Which one does it react to? The first one? If I'd known that I would have written the initial message differently</p>",
        "id": 522911828,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1749321628
    },
    {
        "content": "<p>Should the bot react with <span aria-label=\"question\" class=\"emoji emoji-2753\" role=\"img\" title=\"question\">:question:</span>  or <span aria-label=\"twins\" class=\"emoji emoji-1f9d1-200d-1f91d-200d-1f9d1\" role=\"img\" title=\"twins\">:twins:</span> if there are multiple references?</p>",
        "id": 522912148,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1749322085
    },
    {
        "content": "<p>I'd be happy with the current behaviour as long as it's not \"choose a random one and react only to that\" or \"react to the one with the lowest number\" or whatever -- just something I can manipulate.</p>",
        "id": 522912352,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1749322404
    },
    {
        "content": "<p>I think something like the following is the case: whenever the emoji bot is triggered for a specific PR, for each recent message in streams it has access to containing the PR number in question, it first clears its previous reactions, and then adds the appropriate reaction for the current state of the PR. So, basically the reaction you see is the most \"recent\" one among all PRs mentioned. (I could be wrong though because there are like 3~4 workflows involved here and there could be something I'm misremembering).</p>",
        "id": 522916234,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1749327294
    },
    {
        "content": "<p>I agree with Bryan's analysis: I also think that the bot reacts on every message that refers to each PR, by clearing the previous reactions and adding the one appropriate for the current trigger.  So, ultimately, the reaction you see is the one for the PR that triggered a reaction last.</p>",
        "id": 522918869,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1749330378
    },
    {
        "content": "<p>I wish that we could have a bot whose name was the PR to which it reacted, but I don't know if that is feasible.</p>",
        "id": 522918878,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1749330401
    },
    {
        "content": "<p>Ok this is good to know going forward</p>",
        "id": 522921856,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1749334856
    }
]