[
    {
        "content": "<p>Following the discussions in <a href=\"https://github.com/leanprover-community/mathlib4/pull/22281\">#22281</a> and <a href=\"https://github.com/leanprover-community/mathlib4/pull/22278\">#22278</a>, it appears that the API for sums of categories was unsatisfying: the category structure on the sum was only defined for categories in the same universes, and the construction of functors in the API such as <code>Functor.sum</code>, <code>Sum.swap</code>, <code>Sum.associator</code> were performed using explicit match on maps rather than using the universal property of the sums, and as a consequence had to resort to <code>erw</code> in proofs.</p>\n<p>This PR changes the definition of the category structure to allow for different universes, and changes the API so that the univresal property (i.e the construction <code>Functor.sum'</code>, and the construction that builds an isomorphism between two functors out of sums from isomorphisms between the precomposiitions with the inclusions) is the main entry point, and redefines all of the other constructions related to sums in terms of this. As a result, there are no more <code>erw</code>s.</p>",
        "id": 505957588,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1742131841
    },
    {
        "content": "<p>I did not expect it would be as difficult to generalize universes here; thanks for doing this! In general, relying a little bit too much on definitional properties of Hom-types in categories leads to a lot of issues, so that I think this refactor goes in the right direction!</p>",
        "id": 505967792,
        "sender_full_name": "Joël Riou",
        "timestamp": 1742139282
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/22976\">#22976</a>. (It's also good to include a message that contains the PR number. This makes it easier for users on mobile to click through to the PR, and also gives the emojibot somewhere to give status updates.)</p>",
        "id": 506029307,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1742180307
    }
]