[
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/24178\">#24178</a>  I currently have the eigenvalues returned in increasing order, but <span class=\"user-mention\" data-user-id=\"197836\">@Jireh Loreaux</span> suggested that decreasing order might be more convenient (personally I tend to agree).  Is there a consensus here?</p>",
        "id": 513168084,
        "sender_full_name": "William Swartworth",
        "timestamp": 1745067817
    },
    {
        "content": "<p>The reasons I have to prefer decreasing order are threefold:</p>\n<ol>\n<li>it's the natural order for the Schur-Horn theorem (the diagonal of the matrix representation of a selfadjoint linear map is majorized by the eigenvalue sequence listed in <em>decreasing</em> order).</li>\n<li>For positive compact operators on an infinite dimensional space, one can list the nonzero eigenvalues in decreasing order since they converge to zero, even including multiplicity. This sequence is a complete invariant for the norm closure of the unitary orbit of that operator. So it would be preferable to have the direction of the order in the infinite and finite dimensional settings coincide.</li>\n<li>The singular values are <em>always</em> listed in decreasing order, and the first singualr value is the (operator) norm. Choosing decreasing order for the eigenvalues will mean that when the map is nonnegative, the singular value sequence and the eigenvalue sequence will be equal, as opposed to reversals of each other.</li>\n</ol>",
        "id": 513173517,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1745072033
    },
    {
        "content": "<p>I too agree with Jireh here</p>",
        "id": 513173597,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1745072084
    },
    {
        "content": "<p>I have no opinion, but Jireh's arguments seem sensible</p>",
        "id": 513173622,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1745072106
    },
    {
        "content": "<p>For an “argument d'autorité”, see Bourbaki, <em>Théories spectrales</em>, chapter IV, §1, n°3, whose title is “Suite décroissante des valeurs propres”.</p>",
        "id": 513173962,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1745072375
    },
    {
        "content": "<p>If we settle on this direction, these reasons are worth including in a (module) docstring.</p>",
        "id": 513174625,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1745072867
    },
    {
        "content": "<p>This is also the standard order used in spectral graph theory, so I'm also in agreement.</p>",
        "id": 513241830,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1745127721
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"898721\">@William Swartworth</span> seems like decreasing order is the way to go. Please update the PR accordingly and request my review when it's done.</p>",
        "id": 515442130,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1746071930
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197836\">@Jireh Loreaux</span> Done!  This is my first PR to Mathlib, so I'd definitely appreciate any comments about improving the style.</p>",
        "id": 515930069,
        "sender_full_name": "William Swartworth",
        "timestamp": 1746293181
    }
]