[
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/24321\">#24321</a> defines natural transformations <code>H ⟶ F</code> resp. <code>F ⟶ H</code> for adjoint triples <code>F ⊣ G ⊣ H</code> where <code>G</code> resp. <code>F</code> and <code>H</code> are fully faithful, relates them to various other maps constructed from the adjunctions, and shows that they are epic resp. monic iff other related maps are. This PR ended up a bit large, but I hope it shouldn't take too long to review because it is mostly lemmas &amp; comments with only two definitions; let me know if I should split it up further.</p>",
        "id": 516792848,
        "sender_full_name": "Ben Eltschig",
        "timestamp": 1746668013
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/24667\">#24667</a> is a shorter follow-up PR showing that for an adjoint quadruple <code>L ⊣ F ⊣ G ⊣ R</code> where some of the functors are fully faithful, the natural transformation obtained from <code>L ⊣ F ⊣ G</code> is epic iff the natural transformation obtained from <code>F ⊣ G ⊣ R</code> is monic.</p>",
        "id": 516792862,
        "sender_full_name": "Ben Eltschig",
        "timestamp": 1746668024
    },
    {
        "content": "<p>Together, these in particular prove propositon 2.7 from <a href=\"https://ncatlab.org/nlab/show/cohesive+topos\">https://ncatlab.org/nlab/show/cohesive+topos</a>; that is the statement I was originally after. The dual case (i.e. where <code>L</code> and <code>G</code> are fully faithful instead of <code>F</code> and <code>R</code>) is included for completeness.</p>",
        "id": 516793203,
        "sender_full_name": "Ben Eltschig",
        "timestamp": 1746668275
    },
    {
        "content": "<p>(In <a href=\"https://github.com/leanprover-community/mathlib4/pull/24321\">#24321</a> I also ran <code>!bench</code> earlier today after adding some <code>@[simp]</code>-tags that I wasn't sure were a good idea performance-wise, but I don't really understand the output - most numbers in the linked benchmark results are NaN. Sorry if I'm missing something obvious, this is my first time trying to use <code>!bench</code>.)</p>",
        "id": 516794897,
        "sender_full_name": "Ben Eltschig",
        "timestamp": 1746669489
    },
    {
        "content": "<p>Does the material on mates help with any of these proofs?</p>",
        "id": 516800159,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1746673308
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"646363\">Ben Eltschig</span> <a href=\"#narrow/channel/144837-PR-reviews/topic/.2324321.20.2B.20.2324667.3A.20adjoint.20triples.20.26.20quadruples/near/516794897\">said</a>:</p>\n<blockquote>\n<p>[…] most numbers in the linked benchmark results are NaN.</p>\n</blockquote>\n<p>The numbers are N/A (not available), not NaN (not a number). If you hover over the \"N/A\" fields, the hover text tries to explain why they are not available.</p>\n<p>In particular, the Stddev columns are empty because the benchmark script reports a single value for most rows, hence not enough data to compute a stddev for that row. The Change columns are probably empty because the parent commit wasn't benchmarked, so there are no values to compare against (the hover text seems slightly misleading).</p>",
        "id": 517201163,
        "sender_full_name": "Joscha Mennicken",
        "timestamp": 1746833498
    },
    {
        "content": "<p><span aria-label=\"face palm\" class=\"emoji emoji-1f926\" role=\"img\" title=\"face palm\">:face_palm:</span> thanks for the explanation, looks like I can't read</p>",
        "id": 517201244,
        "sender_full_name": "Ben Eltschig",
        "timestamp": 1746833559
    },
    {
        "content": "<p>so the proper way to benchmark some specific changes within a PR would be to run <code>!bench</code>, push the changes, and then run <code>!bench</code> again?</p>",
        "id": 517201310,
        "sender_full_name": "Ben Eltschig",
        "timestamp": 1746833639
    },
    {
        "content": "<p>Yes, that should work as long as you only push one commit in-between <code>!bench</code> calls. Or you can use the <a href=\"https://speed.lean-lang.org/mathlib4/search\">search function</a> (accessible via <code>repo detail &gt; repo information &gt; search and compare runs</code>) to compare your <code>!bench</code>marked commit against another one that was already benchmarked earlier, e.g. one from the <code>master</code> branch.</p>\n<p>The UI is a bit clunky, so the following steps might not work: First search for one commit and then click the scale icon next to it (if a run exists for the commit, the icon will not be greyed out). Make sure you don't fall for all the \"Merge ...\" commits. Then search for the second commit, also click the scale icon, and finally click the \"compare runs\" button at the top.</p>\n<p>I think the \"Merge ...\" commits might be automatically generated by GitHub to check whether a PR can be merged without conflicts, hence there are so many. Also, there seems to be a cap on the number of returned search results, so your actual target commit can get lost in a sea of \"Merge ...\" commits. Searching for the commit message, not the hash, can help here.</p>\n<p>There's another (and arguably easier) way to get a comparison: Editing the URL directly. Replace <code>&lt;hash1&gt;</code> and <code>&lt;hash2&gt;</code> in the following URL with the commit hashes you want to compare, making sure each commit has a corresponding run: <code>https://speed.lean-lang.org/mathlib4/compare/e7b27246-a3e6-496a-b552-ff4b45c7236e/to/e7b27246-a3e6-496a-b552-ff4b45c7236e?hash1=&lt;hash1&gt;&amp;hash2=&lt;hash2&gt;</code>. Don't worry about those long IDs in the front, they're always the same. (They are the ID of the \"mathlib4\" repository and come from the fact that VelCom originally supported multiple repositories per instance.)</p>",
        "id": 517202753,
        "sender_full_name": "Joscha Mennicken",
        "timestamp": 1746834843
    }
]