[
    {
        "content": "<p>Hello,</p>\n<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/27292\">#27292</a>, I define the asymptotic cone of a set in an affine space and prove some basic properties.</p>\n<p>I would like to ask for advice on the naming of the definitions. The problem is that \"asymptotic cone\" is also used for a specific ultralimit of metric spaces, and it seems to be the more common usage. The reason for this could be that the definition used in my PR coincides with the recession cone for closed convex sets. I currently use the name <code>asymptoticCone</code>. Is this name good, or should it be something else?</p>\n<p>Also, I use the name <code>asymptoticNhds</code> for the filter <code>atTop • 𝓝 v</code>. I feel that this may be confused with asympotes or something else. Any suggestions for a better name?</p>",
        "id": 529593195,
        "sender_full_name": "Attila Gáspár",
        "timestamp": 1752945014
    },
    {
        "content": "<p>Indeed this doesn’t seem to be the commonly accepted meaning of asymptotic cones. What you describe sound more like <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=tangentConeAt#doc\">docs#tangentConeAt</a>. Is it something different?</p>",
        "id": 529604776,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1752949384
    },
    {
        "content": "<p>It is basically the tangent cone at infinity in the one-point compactification, but apparently that also has a different meaning. I did find a <a href=\"https://mathoverflow.net/questions/402656/asymptotic-cone\">MathOverflow question</a> that uses this definition, and the <a href=\"https://en.wikipedia.org/wiki/Recession_cone\">Wikipedia page for the recession cone</a> has the same definition.</p>",
        "id": 529605565,
        "sender_full_name": "Attila Gáspár",
        "timestamp": 1752950296
    },
    {
        "content": "<p>When the scalars are real numbers and the affine space is finitely dimensional, doesn't the recession cone coincide with the asymptotic cone in the sense of metric space theory?</p>",
        "id": 529709789,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1753041545
    },
    {
        "content": "<p>Non, maybe not, only for convex subsets, for example. <br>\nIn any case, I would say that the type classes required for one definition or the other are sufficiently orthogonal to warrant two independent definitions, and then “recession cone” (which would apply also for convex subsets).</p>",
        "id": 529709974,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1753041774
    }
]