[
    {
        "content": "<p>Working through Chapter 1 of Rockafellar's <em>Convex Analysis</em> on the way to formalizing Euler's polyhedron formula for convex polyhedra. This PR adds some useful intermediate results on affine independence, dimension, and automorphisms that form a natural stopping point.</p>",
        "id": 546994417,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1761337304
    },
    {
        "content": "<p>I thought homology is the usual way to prove V-E+F=2</p>",
        "id": 546994794,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1761337476
    },
    {
        "content": "<p>Yeah, that's the way to go. I'm working on building up enough of the theory of convex polyhedra to assign a suitable chain complex to them, and then wrap things up with the Euler-Poincaré formula (still in <a href=\"https://github.com/leanprover-community/mathlib4/pull/29713\">review</a>). This PR is just one of many stepping stones to get there. I didn't want to submit a giant PR; this felt like a natural checkpoint (though it's admittedly fairly arbitrary).</p>",
        "id": 546995345,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1761337712
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"950805\">@Martin Winter</span>, you might be interested <span aria-label=\"eyes\" class=\"emoji emoji-1f440\" role=\"img\" title=\"eyes\">:eyes:</span></p>",
        "id": 546996695,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1761338341
    },
    {
        "content": "<p>Olivia (<span class=\"user-mention\" data-user-id=\"768262\">@ooovi</span> ) and me are in the middle of implementing polyhedral cones. This became a bigger project since we are trying to be very general. A lot of theory for polyhedral cones (such as faces and duality) should really be developed for general cones. Some useful things we have so far are Minkowski-Weyl (with substantial contribution by Justus Springer) and that faces form a lattice. We are now working on the structure theory of FG cones, eg that face lattices are graded and all their other usual properties. But again, we try to be general here and assume FG only when needed. The code is currently very chaotic and not ready for upstreaming. But perhaps we should extract and clean up some self-contained parts to not make it too monolithic.</p>",
        "id": 547004753,
        "sender_full_name": "Martin Winter",
        "timestamp": 1761343161
    },
    {
        "content": "<p>And perhaps for clarity: we work on polyhedral cones rather than polyhedra because the latter are an affine notion, and affine spaces are not as advanced in mathlib as modules are. For example, there exists no notion of convex hull in affine spaces yet. The plan is to build polyhedra/polytopes on top of cones once those are sufficiently developed. But of course the combinatorial theory of polyhedra is isomorphic to the one on cones. So the Euler formula can be proven already within the cone theory.</p>",
        "id": 547005289,
        "sender_full_name": "Martin Winter",
        "timestamp": 1761343502
    },
    {
        "content": "<p>Since you raised this PR here I added some basic comments to it, though otherwise it would seem premature to review a PR that's marked draft and doesn't pass CI.</p>\n<p>I'd advise making smaller PRs (one or two lemmas in a single file) and making sure they pass CI before asking for review.</p>",
        "id": 547017316,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1761355360
    },
    {
        "content": "<p>Thanks for taking a look! I forgot to mark the PR as ready for review, and did that now. I'll split up  the PR into a couple smaller ones. It looks like I was zoomed in too far on a couple of theorems, focusing on my special case, and can drop some hypotheses. I'll do that.</p>",
        "id": 547034435,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1761375446
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"950805\">Martin Winter</span> <a href=\"#narrow/channel/144837-PR-reviews/topic/.2330854.20theorems.20on.20affine.20independence.20and.20automorphisms/near/547005289\">said</a>:</p>\n<blockquote>\n<p>And perhaps for clarity: we work on polyhedral cones rather than polyhedra because the latter are an affine notion, and affine spaces are not as advanced in mathlib as modules are. For example, there exists no notion of convex hull in affine spaces yet. The plan is to build polyhedra/polytopes on top of cones once those are sufficiently developed. But of course the combinatorial theory of polyhedra is isomorphic to the one on cones. So the Euler formula can be proven already within the cone theory.</p>\n</blockquote>\n<p>That's great! I'd love to discuss more to see what ways we might want to sync.</p>",
        "id": 547499571,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1761659571
    }
]