[
    {
        "content": "<p>I've just noticed a slightly annoying consequence of <a href=\"https://github.com/leanprover-community/mathlib4/pull/34013\">#34013</a>: now that very basic algebraic lemmas, like <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=mul_pow#doc\">docs#mul_pow</a>, use <code>grind</code>, they <em>all</em> depend on the axiom of choice.</p>\n<p>I understand, and I agree, that mathlib is a classical library, but now basically everything depend on the axiom of choice, even extremely basic results that mathematically obviously don't need choice. I have the impression that we switching from \"we don't try to avoid choice if this complicates thing\" to \"we actively use choice even where it is totally irrelevant\". Note that we already have PRs like <a href=\"https://github.com/leanprover-community/mathlib4/pull/32467\">#32467</a> by <span class=\"user-mention\" data-user-id=\"268315\">@Anatole Dedecker</span>  to avoid choice in places where it is really surprising that it shows up.</p>\n<p>Personally I think it is reasonable to avoid choice in this very basic files, but I don't have a strong opinion. On the other hand we should note that if we keep this trend in a couple of months absolutely everything will depend on choice, and there is no way back.</p>",
        "id": 569492205,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1769089191
    },
    {
        "content": "<p>I already considered these changes to replace very simple proofs with <code>grind</code> to be worth minus epsilon - I guess this issues makes it minus two epsilon</p>",
        "id": 569494165,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1769089731
    },
    {
        "content": "<p>Also, I guess that <code>grind</code> is able to prove maybe 95% of those lemmas. For example it is surely able to prove <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=mul_pow#doc\">docs#mul_pow</a>: do we want all the file to be proved by <code>grind</code>? I don't know.</p>",
        "id": 569495083,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1769089970
    },
    {
        "content": "<p>I vote to revert <a href=\"https://github.com/leanprover-community/mathlib4/pull/34013\">#34013</a> in the interests of keeping as much of the library as possible choice-free</p>",
        "id": 569498413,
        "sender_full_name": "Jeremy Tan",
        "timestamp": 1769090798
    },
    {
        "content": "<p>I don't see the rationale of replacing a one-line simp/rw with grind unless it offers some particular benefit, e.g. elaboration time. Maybe it makes sense to come up with a rule-of-thumb about when this is desirable, otherwise it's also additional churn for reviewers</p>",
        "id": 569546475,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1769101921
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/33825\">#33825</a> one change has a 54ms regression for a 2-line improvement. I suspect there's a one line improvement without grind if we so cared.</p>",
        "id": 569547082,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1769102104
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/33826\">#33826</a> it's a little clearer that there is actual a tangible difference in this change, though with an associated elaboration regression</p>",
        "id": 569547284,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1769102159
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/33912\">#33912</a> seems good, replacing aesop with grind gives us good speed-ups with no real change as to inspectability</p>",
        "id": 569547587,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1769102235
    },
    {
        "content": "<p>Kind of hard to come up with an immediate rule-of-thumb from reviewing a couple golfing PRs. The stated motivation of the original PR was to get rid of the explicit lemma references as that may presumably lead to some refactoring burden, but I think it seems more marginal than the other changes I've looked. It's also a good question whether it's desirable to have elaboration regressions for a shorter proof that goes 20 lines -&gt; 1--I'm not familiar with the associated maintenance burden (and it's not clear if grind may also come with some burden as the underlying implementation changes)</p>\n<p>[I don't care much about reducing choice, but reviewer time seems like a real bottleneck constraint for the project.]</p>",
        "id": 569548635,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1769102538
    },
    {
        "content": "<p>Also, if there is an active push to avoid the axiom of choice somewhere, then it should also be automatically enforced, via something like <code>assert_not_exists</code>.</p>",
        "id": 569672768,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1769161459
    },
    {
        "content": "<p>This makes both the intention clear and the scope precise.</p>",
        "id": 569672826,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1769161477
    },
    {
        "content": "<p>I can't say I care about having the axiom of choice or not in any given theorem. But yes, if people do care, then I'd like that to be enforced rather than just being a thing that gets fixed and unfixed every six months.</p>",
        "id": 569689242,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1769166446
    },
    {
        "content": "<p>My point is that in my opinion there is no way back (the library is too much intertwined). We can decide we don't care, that's fine. But it is worth to realize that are doing so.</p>",
        "id": 569689992,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1769166698
    },
    {
        "content": "<p>I am working on a project where I do care about the axiom of choice, and I was happy to realize that it was possible to use mathlib without it (of course not the advanced part of the library, but it was more or less OK for basic parts). Now this it is <em>very</em> different, for example <code>ring</code> always use it, something that wasn't the case two months ago.</p>",
        "id": 569690401,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1769166821
    },
    {
        "content": "<p>In your application, are you also trying to avoid LEM or just choice? I was wondering if patching mathlib to have an explicit LEM axiom for arguing by contradiction instead of implicitly using choice would be sufficient for you.</p>",
        "id": 569696289,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1769168885
    },
    {
        "content": "<p>No, I don't think that makes sense in lean</p>",
        "id": 569696692,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1769169058
    },
    {
        "content": "<p>I am avoiding choice and so in practice excluded middle.</p>",
        "id": 569697585,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1769169398
    },
    {
        "content": "<p>Anyway my project really doesn't matter, I am happy to do all the proofs by hand or to use an old version. The question is really if we want mathlib to completely forbid any constructive reasoning for a very little gain.</p>",
        "id": 569697828,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1769169495
    },
    {
        "content": "<p>Another reason why we should revert all of the PRs that have replaced proofs with <code>grind</code> is that <code>grind</code> is completely unilluminating</p>",
        "id": 569739361,
        "sender_full_name": "Jeremy Tan",
        "timestamp": 1769181117
    },
    {
        "content": "<p>The proofs that <code>grind</code> replaced are actually something you can read</p>",
        "id": 569739470,
        "sender_full_name": "Jeremy Tan",
        "timestamp": 1769181150
    },
    {
        "content": "<p>To put it shortly: <code>grind</code> is a dragon. It looks extremely impressive but it lays shining, thriving cities to waste. Avoid it unless absolutely necessary</p>",
        "id": 569740539,
        "sender_full_name": "Jeremy Tan",
        "timestamp": 1769181446
    },
    {
        "content": "<p>If <code>grind</code> is a dragon, does that make <code>simp</code> a baby dragon? :)</p>\n<p>More seriously, there is a kernel of truth here, but I would go nowhere near the extreme of saying to \" avoid it unless absolutely necessary\". You could say such a thing about tactics in general, and while there are certainly proofs assistants with this philosophy, Lean is not one of them. </p>\n<p>What I think is true is that <code>grind</code> has a tradeoff in \"proof inspectability\" as phrased above that especially is clear when replacing a short performant proof such that there is not much benefit in the other dimensions <code>grind</code> can be helpful.</p>",
        "id": 569763341,
        "sender_full_name": "Chris Henson",
        "timestamp": 1769187597
    },
    {
        "content": "<p>I personally really like <code>grind</code> and I think it is a fantastic tool to have. But in <code>Mathlib.Algebra.Group.Basic</code> we are setting up the basics of our algebraic hierarchy, and it is weird to use <code>grind</code>, that is about a <em>parallel</em> algebraic hierarchy, here. Especially because it sometimes works and sometimes it doesn't (I honestly don't understand why it's not able to prove <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=mul_pow#doc\">docs#mul_pow</a>, maybe it is a bug) and so we are using it in random declarations, making the file <em>less</em> understandable in my opinion.</p>",
        "id": 569770137,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1769189599
    },
    {
        "content": "<p>I think there is definitely a good argument to be made that roughly as the module is higher in the import graph or is very \"fundamental\" that these sorts of <code>grind</code> replacements should be more carefully considered.</p>",
        "id": 569771597,
        "sender_full_name": "Chris Henson",
        "timestamp": 1769190021
    },
    {
        "content": "<p>I propose to merge <a href=\"https://github.com/leanprover-community/mathlib4/pull/34317\">#34317</a>, that also adds a test to be sure very basic lemmas don't depend on <code>grind</code>.</p>",
        "id": 569857916,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1769253645
    },
    {
        "content": "<p>For my intro to proof course I wrote an exposition of the integers defined as a quotient type, and when checking things about multiplication I ended up having to prove some results about naturals which I proved with nlinarith, and I noted that the lean proof involved coercing everything back into Lean's integers ;-) but I did not mind this circulatity at all.</p>",
        "id": 569891031,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1769277104
    },
    {
        "content": "<p>I think it is clear that it's becoming harder and harder to attempt to do mathematics in a system weaker than ZFC in lean (examples being constructive mathematics and ZF), but I think that this decision is already baked into core lean, it's not really a question about mathlib any more.</p>",
        "id": 569891184,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1769277267
    },
    {
        "content": "<p>Sure, but there is no need to make it harder for no gain at all. Our policy has always been \"we don't make any effort to be intuitionistic\", let's try to not change it to \"we make efforts to be classical\".</p>",
        "id": 569895319,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1769280973
    },
    {
        "content": "<p>Is it possible to have a <code>grind</code> tactic that avoids choice, and a <code>grinder</code> that really doesn't care?</p>",
        "id": 570337011,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1769524679
    },
    {
        "content": "<p>This seems extremely unlike to me. The doc says \"Behind the scenes, all proofs are by contradiction\" so I guess it would be a totally different tactic.</p>",
        "id": 570338593,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1769524998
    },
    {
        "content": "<p>But note that <code>ring</code> works pretty well in avoiding choice.</p>",
        "id": 570338810,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1769525045
    },
    {
        "content": "<p>I don’t care about choice but I like the fact that one possible use of Mathlib is to understand why things are true, even very elementary things. If we prove very basic stuff about groups or rings by calling grind which uses a parallel theory of groups and rings then it’s pretty badly confusing.</p>",
        "id": 570429476,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1769550585
    },
    {
        "content": "<p>Lemmas near <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=LinearOrder#doc\">docs#LinearOrder</a> are also so fundamental that it's probably worth avoiding <code>grind</code> there too? (upd: PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/35841\">#35841</a>)</p>",
        "id": 576171420,
        "sender_full_name": "Yuyang Zhao",
        "timestamp": 1772163838
    }
]