[
    {
        "content": "<p>Could I please request a review on <a href=\"https://github.com/leanprover-community/mathlib4/pull/31294\">#31294</a>? This is a PR defining the ℘ function and some basic properties, and in the end we should get the identity <code>℘' z ^ 2 = 4 * ℘ z ^ 3 - g₂ * ℘ z - g₃</code> (See the WIP PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/25835\">#25835</a> that will be eventually cleaned up). Perhaps this is less interesting to pure analysis people and this is why this PR has gain relatively few traction but they are quite important in the study of elliptic curves and I would love to get these merged sooner rather than later. This would also be needed in the FLT project eventually.</p>",
        "id": 559119441,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1764008173
    },
    {
        "content": "<p>I made a few comments by skimming rapidly on the first section.</p>",
        "id": 559122704,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1764009127
    },
    {
        "content": "<p>I might have been unclear in my post (I have edited since then) but the one you have reviewed <a href=\"https://github.com/leanprover-community/mathlib4/pull/25835\">#25835</a> is the WIP one and is far from mathlib-ready yet. The titular PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/31294\">#31294</a> is the one that is review ready. Sorry if this wasted your time but your comments are still very useful when I eventually clean the file up and thanks for doing this!</p>",
        "id": 559123348,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1764009323
    },
    {
        "content": "<p>No time was wasted, don't worry. And I wrote a few other comments on the other PR.</p>",
        "id": 559141598,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1764014829
    },
    {
        "content": "<p>Thanks a lot for the helpful and responsive reviews from everyone! I guess this means that people are indeed interested in having this in mathlib and I just need to advertise the PRs better. In light of this here is a shameless plug of the next PR in line: <a href=\"https://github.com/leanprover-community/mathlib4/pull/32089\">#32089</a> defines the derivative of the weierstrass p function.</p>",
        "id": 560133719,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1764071657
    }
]