[
    {
        "content": "<p>Hi all! I have opened a PR (<a href=\"https://github.com/leanprover-community/mathlib4/pull/34830\">#34830</a>) adding the definition of <strong>categorical groups</strong> (a.k.a. <strong>coherent 2-groups</strong>). This PR focuses on the definition and follows the style of Category, MonoidalCategory; I plan to add basic properties and lemmas in a follow-up PR. Since this is my first mathlib PR, I would really appreciate any suggestions or feedback on the definitions or style.<br>\nPR: <a href=\"https://github.com/leanprover-community/mathlib4/pull/34830\">https://github.com/leanprover-community/mathlib4/pull/34830</a></p>",
        "id": 571827123,
        "sender_full_name": "Amogh",
        "timestamp": 1770187273
    },
    {
        "content": "<p>Is my understanding of these objects correct if I say that these coherent 2-groups are essentially monoidal groupoids such that every object is dualizable both on the left and on the right and such that the left dual is also the right dual? We do have some material about dualizability in monoidal categories in the directory <code>CategoryTheory/Monoidal/Rigid</code> and your class could e.g leverage <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.ExactPairing#doc\">docs#CategoryTheory.ExactPairing</a>.</p>",
        "id": 571851191,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1770195530
    },
    {
        "content": "<ol>\n<li>You are right, to get coherent 2-groups, you need a dedicated right dual to every object, along with dedicated  evaluation and co-evaluation maps. This data is enough to define the right dual equal to the left dual, since you can just take the inverse of co-evalutaion and evaluation.</li>\n<li>I had a look at ExactPairing file and RigidCategories. Many propositions that I want to have in categorical groups can be easily borrowed (i think) from ExactPairing lemmas. I think I will define the categorical groups as monoidal groupoids such that every object X has a dedicated dual X', and (X, X') form an exact pairing.  I will also get the notation for free from the exact pairing. <br>\n<span class=\"user-mention\" data-user-id=\"286014\">@Robin Carlier</span> thank you for pointing me in this direction. I marked the PR as WIP for now.</li>\n</ol>",
        "id": 572060770,
        "sender_full_name": "Amogh",
        "timestamp": 1770268236
    },
    {
        "content": "<p>We also have (with a confusing name!) <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.HasRightDual#doc\">docs#CategoryTheory.HasRightDual</a> for bundling the data of a chosen right dual object as well as the exact pairing (setting up the <code>Xᘁ</code> notation as well) and <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.RightRigidCategory#doc\">docs#CategoryTheory.RightRigidCategory</a> for bundling a choice of a right dual for every object, so the entire class can probably be stated as <code>(C : Type u) [Groupoid.{v} C] [MonoidalCategory C] [RightRigidCategory C]</code>. Then, the statement that the chosen right dual <code>Xᘁ</code> is also a left dual by taking the inverses of the units/counits would be that of a definition of an  <code>ExactPairing Xᘁ X</code> (and then, when C has a further <code>[LeftRigidCategory C]</code>, this definition would give an isomorphism between <code>Xᘁ</code> and <code>ᘁX</code>, the latter being notation provided by <code>[LeftRigidCategory C]</code>.)<br>\nI also noticed you mention in your PR wanting to promote the duality/negator to a functor from C to itself, you could use <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.rightDualFunctor#doc\">docs#CategoryTheory.rightDualFunctor</a> for this. It has values in the monoidal opposite of the opposite, but you can remove the opposite using <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.Groupoid.invEquivalence#doc\">docs#CategoryTheory.Groupoid.invEquivalence</a> (it would be sensible to promote this equivalence to a monoidal equivalence when the groupoid is monoidal), but you definitely want to keep the monoidal opposite part so that the functor remains monoidal (steps towards monoidality of <code>rightDualFunctor</code> are in a WIP PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/32942\">#32942</a> by <span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span>).</p>",
        "id": 572082158,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1770278866
    },
    {
        "content": "<p>So, I set up the categorical groups exactly as <code>(C : Type u) [Groupoid.{v} C] [MonoidalCategory C] [RightRigidCategory C]</code>. I showed that (co)evaluation morphisms can be upgraded to isomorphisms. I have also shown that <code>Xᘁ</code> can act as a left dual and elevates any Categorical Group to a RigidCategory. Next, I want to get the negator functor from rightDualFunctor, but I thought I should get a review of the current progress first. <br>\nI have removed the WIP label.</p>",
        "id": 572682402,
        "sender_full_name": "Amogh",
        "timestamp": 1770614430
    }
]