[
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/30586\">#30586</a> is a slightly odd PR in that it's in a relatively obscure file, but I came across it while working on something tangentially related and I felt pretty sure I could make some solid improvements to it.</p>",
        "id": 545016435,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1760547073
    },
    {
        "content": "<p>Yes, many things can be probably be improved here (I wrote this quite some time ago now!) I can review this at some point, but please bear in mind that this belongs to a not fully merged (the review process was quite long here) ongoing series of PR that proves that <code>SimplexCategoryGenRel</code> and <code>SimplecCategory</code> are equivalent.</p>\n<p>I can adapt the already open PRs I the series to these change if they are indeed improvement (from a quick look, it might be!), but it would have been nice to have a heads up that you were working on this beforehand as it is relevant to an ongoing series.</p>",
        "id": 545076260,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1760551673
    },
    {
        "content": "<p>Apologies, I didn't know it was particularly owned by someone - I only did it today.</p>",
        "id": 545077655,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1760551732
    },
    {
        "content": "<p>It's certainly not \"owned\"! I'll try to review this quick as I still agree that I did things pretty dirtily here (the main goal was the equivalence, this definition of \"admissibility\" was merely an implementation detail for this!)</p>",
        "id": 545081768,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1760551902
    },
    {
        "content": "<p>Yeah absolutely. Basically my motivation was that I've been improving IsChain recently and I'm also trying to kill Sorted - and I think here basically IsChain is kinda the prototype to use. But then actually the whole thing works nicely as an inductive</p>",
        "id": 545083827,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1760551971
    },
    {
        "content": "<p>Thanks a lot though - it's good to have a subject matter expert here</p>",
        "id": 545084921,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1760552010
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"286014\">@Robin Carlier</span> Thank you for the review. I believe I've addressed all of your comments.</p>",
        "id": 545250834,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1760609076
    },
    {
        "content": "<p>Need to run for now but I should have the time for another look this evening.</p>",
        "id": 545251992,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1760609307
    },
    {
        "content": "<p>Yeah, no dramas :)</p>",
        "id": 545252399,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1760609374
    },
    {
        "content": "<p>I am very pleased that we could remove your use of <code>Sorted</code> and in fact I have a suggestion I've made for how to do so entirely.</p>",
        "id": 545252580,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1760609406
    }
]