[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span>, what would you like to do with <a href=\"https://github.com/leanprover-community/mathlib/pull/15296\">!3#15296</a>? It has perhaps missed the boat at this point, and could just be closed? If you still have plans that use it I would be pretty happy to merge as is so you can forward port.</p>",
        "id": 378343282,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690263509
    },
    {
        "content": "<p>My recollection was that there were different ideas of what would constitute a \"good\" notion of degree.  I still think that this is the case.  I think that it makes sense to have a PR to mathlib4, but maybe with the idea of generating a discussion about what will be more beneficial?</p>",
        "id": 378344911,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1690264139
    },
    {
        "content": "<p>I am happy to port the PR, and maybe the simplest is to merge the mathlib3 PR, open the corresponding mathlib4 PR and then revert the mathlib3 merged one?</p>",
        "id": 378345098,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1690264217
    },
    {
        "content": "<p>It sounds like we would benefit greatly from a web interface to mathport one shot that avoids the setup friction</p>",
        "id": 378382938,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690274322
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span>, I've made a <a href=\"https://github.com/leanprover-community/mathlib4/tree/forward_port_15296\">branch#forward_port_15296</a> with the mathport oneshot output for you. Could you please turn this into a PR? (There are still some errors to fix up, but they look like straightforward things about <code>coe</code>.)</p>",
        "id": 380148594,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690759117
    },
    {
        "content": "<p>Scott, thank you very much for this!</p>\n<p>I just pushed fixes to all the errors and I converted the branch into PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/6260\">#6260</a>.</p>",
        "id": 380181533,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1690774466
    },
    {
        "content": "<p>Do you have a use-case in mind for these definitions? As they're all just shorthands, I think they would be more compelling if there was some existing code they simplifed.</p>",
        "id": 380232837,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690790940
    },
    {
        "content": "<p>When I made the initial PR, I had not yet built a strong case for the change and with the mathport, I stopped thinking about this.  I just updated the \"immediate\" golfs that were available with these definitions: here is the diff between the old <code>mathlib3</code> PR with the maxDegree definitions and the old <code>mathlib3</code> PR with the golf: <a href=\"https://github.com/leanprover-community/mathlib/compare/adomani_ama_degree...adomani_degree_golf?expand=1\">adomani_degree_golf</a>.</p>",
        "id": 380258401,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1690795409
    },
    {
        "content": "<p>This is all there is, since the API with the more general degree only deals with <code>add</code> and <code>mul</code>.</p>",
        "id": 380258570,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1690795442
    },
    {
        "content": "<p>One of the goals that I had in mind was to prove results about degrees in general for AddMonoidAlgebras rather than having to reprove them again for <code>Polynomial</code>s and the various flavours of degrees of <code>MvPolynomial</code>s.</p>",
        "id": 380259304,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1690795571
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/6263\">#6263</a> applies ~one~ a handful of those golfs to  mathlib4 master without the shorthand</p>",
        "id": 380266727,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690796774
    },
    {
        "content": "<p>Honestly, I think that most of the golfs that I have in mind would be of a similar nature.  I think that the biggest value of this PR is to highlight that working with \"degrees\" of AddMonoidAlgebras is often not harder than working with Polynomials and is strictly more general and applicable also to MvPolynomials.</p>\n<p>Since there was not a strong agreement on the \"correct\" definition of <code>degree</code> in the context of AddMonoidAlgebra, I am still ok if the decision is to delay the introduction of these names.  At least until continuing to avoid them become silly!</p>",
        "id": 380268109,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1690797025
    },
    {
        "content": "<p>I suspect that once/if there is some advanced work on monomial orders and Gröbner bases, then it might be useful to see if all the API around <code>leadingCoeff</code> can be generalised to adapt to the multivariable case.</p>",
        "id": 380269748,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1690797347
    }
]