[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"459699\">@Joël Riou</span>  So I’ve been trying to play around a bit with the definition of the walking reflexive pair as a category presented by generators and relations that you suggested, and while I agree that this would be the most morally correct definition, I am under the impression that this definiton makes the proof that the inclusion from the walking parallel pair is final much harder. The proof is very much an explicit case study, and uses that the hom’s in the category are perfectly understood. With the definition as a quotient, it’s not even clear that the hom’s are finite.</p>\n<p>I don’t see much ways other than giving a full description of the hom’s of the quotient. I managed can do it <a href=\"https://gist.github.com/robin-carlier/43f34c877fd5f4785491cec247f88a2f\">like this</a> and although it’s still in ungolfed form, I’m afraid this is going to end up quite ugly, do you still it’s worth to continue this way, or can you think about a slick proof that this inclusion is final that would avoid this?</p>\n<p>I’m also planning to prove at some point thas this walking reflexive pair is sifted (i.e the diagonal functor is final), and I already have a proof with the current explicit definition (which is again a rather painful explicit case study) and I also don’t see any direct way to do it with the universal definition that wouldn’t involve describing explicitly the hom between objects at some point, so this description is maybe unavoidable.</p>",
        "id": 400179396,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1699033101
    },
    {
        "content": "<p>I had a reasonability short draft of proof that the only endomorphism of <code>one</code> was the identity, by induction on the length of paths, and assumed that it was possible to deduce successively what are the morphisms <code>zero ⟶ one</code>, then <code>one  ⟶ zero</code>, and finally <code>zero ⟶ zero</code>. Overall, it seems it would be longer than the \"direct\" construction of the category, so that I feel you may proceed with your original approach (I am sorry for distracting you from this). Anyway, your definition <code>reflexivePair</code> essentially shows that the category you construct satisfies a certain universal property.</p>",
        "id": 400204091,
        "sender_full_name": "Joël Riou",
        "timestamp": 1699045058
    },
    {
        "content": "<p>I tried again a bit and managed to squash down a full description of the homs in a relatively short size, also by inducting on the length of path representing morphisms but for all hom's at once to avoid repetition as much as possible, this is line 59 onwards of <a href=\"https://gist.github.com/robin-carlier/43f34c877fd5f4785491cec247f88a2f\">this gist</a> and so is about 50 lines in reasonably golfed form, but the issue is that I could not manage to phrase the statement in a way <code>Quotient.induction</code> was happy with without an auxiliary statement (<code>EnumeratePredicateAux</code>), which adds a somewhat useless definition. This is probably fixable but I don’t know how to do this in a clean way(using <code>let</code> or <code>letI</code>maybe?)</p>",
        "id": 400286950,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1699095357
    },
    {
        "content": "<p>After a rather long period of inactivity, I opted to simply go with the original definition in the PR rather than using generators and relations. So this one should be ready for a final review.</p>",
        "id": 473989607,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1727773844
    }
]