[
    {
        "content": "<p>Building on <a href=\"https://github.com/leanprover-community/mathlib4/pull/9780\">#9780</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/9791\">#9791</a> redefines <code>predAbove</code> to use the new <code>castPred</code>.</p>\n<p>The current build will probably not build for <code>SimplexCategory.lean</code> as that file is highly sensitive to small definitional changes. However, it is suitable for review as any fixes should be limited to that file, which is high in the dependency tree.</p>\n<p>This is part of the work of splitting up <a href=\"https://github.com/leanprover-community/mathlib4/pull/9145\">#9145</a>.</p>\n<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span></p>",
        "id": 413249433,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1705443731
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/9793\">#9793</a> redefines <code>succAbove</code> slightly so that it has a consistent definition with <code>predAbove</code>. This two patches together align the two definitions, though they are independent of one another.</p>",
        "id": 414844424,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1705444318
    },
    {
        "content": "<p>I have just pushed the fix to <a href=\"https://github.com/leanprover-community/mathlib4/pull/9791\">#9791</a> for <code>SimplexCategory.lean</code>. Note that this makes several proofs longer (essentially it no longer solves them with powerful tactics because that no longer works - but that's also what we want to try and avoid).</p>\n<p>The goal will be, after <a href=\"https://github.com/leanprover-community/mathlib4/pull/9145\">#9145</a> is complete, that actually these will have much shorter proofs - the proofs of these statements or versions of them will be in Data/Fin/Basic, and there are a number of useful lemmas that make them shorter even there that I have not proven here. I am asking whoever reviews this to trust that a temporary increase in proof size (though a decrease in compile time for that one file, I think) merging to master will facilitate the overall merging of an over-large PR that will provide overall value.</p>",
        "id": 415393594,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1705452025
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/9793\">#9793</a>, as anticipated, doesn't appear to break anything, though of course it is possible that this will no longer be true when it merges with <a href=\"https://github.com/leanprover-community/mathlib4/pull/9791\">#9791</a>. I don't think will be the case, however.</p>",
        "id": 415393696,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1705452072
    }
]