[
    {
        "content": "<p>I request a review of the following PR. This is the first in a series leading up to covering space theory for multigraphs enough to prove Nielsen-Schreier. This is already biggish, so I can split off the homotopy part to a separate file if that is better.</p>\n<h2>Multigraphs for Topological methods in Group Theory (a la Serre)</h2>\n<p>This is a start of basic theory for topological methods in group theory bypassing topology by working with graphs defined following Serre and directly developing fundamental group and covering space theory for this. Here we </p>\n<ul>\n<li>Graphs (a la Serre)</li>\n<li>Paths; reduced paths, reduction of paths</li>\n<li>Homotopy of paths in graphs (generated by cancellation); homotopy classes.</li>\n<li>Multiplication and inversion of paths and relations to homotopy. Induced operations on homotopy classes.</li>\n</ul>\n<p>The corresponding covering space theory will follow in succeeding PRs</p>",
        "id": 430780899,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1712061417
    },
    {
        "content": "<p>Can you explain how it relates to the proof we already have of Nielsen-Schreier in <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=subgroupIsFreeOfIsFree#doc\">docs#subgroupIsFreeOfIsFree</a>, which has the same kind of \"topology but avoiding the topological definitions\" flavor (if I understand correctly)?</p>",
        "id": 430782100,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1712061827
    },
    {
        "content": "<p>The proof already there looks more efficient <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> - it also avoid topology but in a different way, observing that graphs are free groupoids. Actually <span class=\"user-mention\" data-user-id=\"303675\">@Anand Rao Tadipatri</span> had used this fact at one stage.</p>\n<p>However my goal is to go beyond Fenchel-Nielsen to stuff requiring two-complexes: at least Stalling's topological proof of Grushko's theorem and ideally small cancellation theory. It seems to me at least that having explicit notions of covering, paths, homotopies etc will be easier to extend rather than the encoding of graphs as categorical objects.</p>",
        "id": 430784136,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1712062488
    },
    {
        "content": "<p>I think there's a lot of overlap between this PR and existing stuff in mathlib that should be sorted out. At a glance, the difference between this and existing stuff seems mostly to come down to choice of terminology and questions about (un)directedness. For example this basic notion of <code>Multigraph</code> is a souped-up version of <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Quiver#doc\">docs#Quiver</a> (which is not a categorical object any more than <code>Multigraph</code> is). The difference is just about (un)directedness. Every <code>Quiver</code> determines a <code>Multigraph</code> via <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Quiver.Symmetrify#doc\">docs#Quiver.Symmetrify</a>. Every <code>Multigraph</code> is (non-canonically) obtained in this way (if you pick an orientation of each edge), and more canonically you can always construct from a given <code>Multigraph</code> an equivalent <code>Quiver</code> by subdividing each edge.</p>\n<p>The stuff on paths and <code>PathClass</code> and <code>homotopyClass</code> seems to be duplicating <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.FreeGroupoid#doc\">docs#CategoryTheory.FreeGroupoid</a> and <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Quiver.Path#doc\">docs#Quiver.Path</a></p>\n<p>The notion of covering space works very nicely in groupoidal language: a covering space of a groupoid is a functor to types, and the total space is the category of elements <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CategoryTheory.Functor.Elements#doc\">docs#CategoryTheory.Functor.Elements</a>. I used this approach in formalising <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=subgroupIsFreeOfIsFree#doc\">docs#subgroupIsFreeOfIsFree</a>, but it's probably not very well-explained or documented, and it would probably be good to develop more theory around this.</p>",
        "id": 430791021,
        "sender_full_name": "David Wärn",
        "timestamp": 1712064653
    },
    {
        "content": "<p>Suppose one wanted to define two-complexes (for instance associated to group presentations)  in such a way that graphs are 1-complexes. I would do this by taking a graph together with a family of loops. Would this be natural with quivers?</p>\n<p>I see that <code>Quiver.hasInvolutiveReverse</code> is almost multi-graphs - we just need the involution to be free (for loops, where it is not automatic).</p>\n<p>If the main difference is terminology, we can simply add documentation and perhaps some abbreviations/definitions. As I said, my goal is to formalize stuff like \"binding ties\" proof of Grushko's theorem and am happy to abandon the current PRs if the approach in Mathlib has all that is needed.</p>",
        "id": 430793210,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1712065335
    },
    {
        "content": "<p>Sure, I guess you could also say a 2-complex is a quiver together with a family of loops (the type of loops is given by the free groupoid on the quiver). You can think of a <code>Quiver</code> as an oriented / directed <code>Multigraph</code></p>",
        "id": 430793973,
        "sender_full_name": "David Wärn",
        "timestamp": 1712065583
    },
    {
        "content": "<p>Let me digest this. When I get to work on more formalization I will probably build on quivers.</p>",
        "id": 430794408,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1712065709
    }
]