[
    {
        "content": "<p>Congrats <span class=\"user-mention\" data-user-id=\"448405\">@Alex Meiburg</span>, <span class=\"user-mention\" data-user-id=\"782442\">@Léo Lessa</span> and <span class=\"user-mention\" data-user-id=\"754848\">@Rodolfo R. Soldati</span> on your <a href=\"https://arxiv.org/abs/2510.08672\">arXiv paper</a> with a formal proof of generalized quantum Stein’s lemma! I didn't realize you were so close to formalizing it (I thought it would take a year or two)!</p>\n<p>We are having a weekly Lean seminar in Amsterdam, so I was thinking that maybe one of you wants to give a talk on this via Zoom? We'll send you an e-mail about it...</p>",
        "id": 544736388,
        "sender_full_name": "Maris Ozols",
        "timestamp": 1760445189
    },
    {
        "content": "<blockquote>\n<p>I thought it would take a year or two</p>\n</blockquote>\n<p>Well, that's about right. I started the general repo in April 2024, and we started working on Stein's Lemma around January. :)</p>",
        "id": 544765373,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1760452226
    },
    {
        "content": "<p>Cool! I was just not aware of how far you guys were when I saw the repo the first time.</p>",
        "id": 544779829,
        "sender_full_name": "Maris Ozols",
        "timestamp": 1760455561
    },
    {
        "content": "<p>Yes, there's a lot of sorries in the repo that <em>aren't</em> needed for the main result. Which can obviously make it look a lot less complete than it is... for instance, we never need the idea of a \"pi-type\" kronecker product (the map from an indexed set of states, to a state on the indexed Hilbert space); a lot of things in there about channels / entropy / etc. that we don't need...</p>\n<p>I'm in the process of trying to clean it up into a separate branch that shows sort of the more clean, minimal stuff needed for the work.</p>",
        "id": 544780345,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1760455695
    }
]