[
    {
        "content": "<p>Hi everyone,</p>\n<p>I’ve been working on the EuclideanSpace-based version of <code>Ket</code> (following the TODO in the current definition),<br>\nand managed to get both versions of the <code>optKet</code> proof working —  <br>\none for the current <code>Ket</code> (<code>vec : d → ℂ</code>), and one for the updated EuclideanSpace-based version (<code>vec : EuclideanSpace ℂ d</code>).</p>\n<p>The two proofs are quite similar, so I’ve placed them in the same file for now.  <br>\nI’d love to prepare a small PR for this, but since it would be my first contribution to QuantumInfo,<br>\nI wanted to ask for a bit of guidance on the process and best practices (e.g. file placement, naming, comments).</p>\n<p>Also, I currently use a few <code>erw</code> steps to handle coercions between <code>LinearMap</code> and <code>ContinuousLinearMap</code>,  <br>\nso if there’s a more idiomatic way to express those using the existing API, I’d be very happy to learn it.</p>\n<p>Would it make sense to open a draft PR and iterate from there?  <br>\nOr would you prefer I wait until the EuclideanSpace refactor starts and contribute it to that branch instead?</p>\n<p>Thanks again for leaving that TODO note — it made the design direction very clear!</p>\n<p>Here is the file <br>\n<a href=\"/user_uploads/3121/Y4KLuSoY3o9xDStS3x4klJf9/new_opt_multi_KET.lean\">new_opt_multi_KET.lean</a></p>",
        "id": 553476509,
        "sender_full_name": "Ruize Chen",
        "timestamp": 1762202464
    },
    {
        "content": "<p>Since it looks like you've already made a good stab, I would say open a PR! This could be the EuclideanSpace definition then. It can be a draft PR, sure. In your PR, I would replace the existing <code>Ket</code> with the EuclideanSpace definition, and add these theorems you have.</p>\n<p>This will definitely break some other theorems, that's ok. Of course fix anything you see how to fix easily, go ahead, but it's okay if it's not everything; then we can look over improving it</p>",
        "id": 553477300,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1762202769
    },
    {
        "content": "<p>Thanks, Alex — I’ll go ahead and start on this then!</p>\n<p>I’ve looked through <code>Braket.lean</code> and did a quick assessment of the changes —  <br>\nmost of the adjustments seem to be type-level issues rather than anything deep mathematically,  <br>\nso I think it’s manageable overall.</p>\n<p>That said, I also prepared an <code>optKet</code> for the current definition (the existing <code>vec : d → ℂ</code> version),  <br>\nso if fixing all the dependent lemmas turns out to be a bit heavy,  <br>\nyou’re very welcome to use that one directly from my file as a fallback —  <br>\nit might help maintain compatibility while still adding the missing definition.</p>\n<p>Thanks again for offering to handle the follow-up fixes — I really appreciate it!</p>",
        "id": 553479222,
        "sender_full_name": "Ruize Chen",
        "timestamp": 1762203551
    },
    {
        "content": "<p>I guess I would: </p>\n<ul>\n<li>rename the old Ket to something like KetOld, and change it everywhere</li>\n<li>Add the new Ket alongside it</li>\n<li>Add a depreciation notice (mathlib has many examples of these) to KetOld. It will be removed eventually</li>\n<li>Change any KetOld theorems to Ket that you can. For now, that might mean keeping both around.</li>\n<li>If you change a KetOld theorem to Ket and nothing else relies on it (no other KetOld theorems need it), then we can just delete it</li>\n</ul>",
        "id": 553485553,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1762205993
    },
    {
        "content": "<p>That way we won't introduce new sorries.</p>\n<p>Then I can take a look at helping get rid of remaining KetOld stuff.</p>",
        "id": 553485631,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1762206021
    },
    {
        "content": "<p>Hi Alex,</p>\n<p>I followed your suggestion about replacing the old Ket references with KetOld and defining a new Ket alongside.<br>\nAfter trying it out, I realised the approach quickly becomes tangled — mainly because MState and a few other modules depend directly on names like Ket.apply and <a href=\"http://Ket.prod\">Ket.prod</a>. Even with the alias in place, Lean still looks for those symbols under the new namespace, so we’d have to maintain a compatibility layer that could get messy over time.</p>\n<p>Based on that, I think it’s cleaner to start a fully isolated file (say NewKet.lean) for the Euclidean-space implementation. This keeps the prototype self-contained, avoids breaking dependencies, and lets us migrate to it cleanly once it’s stable.</p>\n<p>My impression is that this approach fits better with the long-term structure of the repo — and it avoids the half-patched state that a temporary alias would create.</p>\n<p>For now, I don’t plan to add too much inside NewKet.lean; I will start by adding what I have in the file I sent above into the isolated NewKet.lean, and I think similar construction (gonna be the same as Braket.lean, I believe it's gonna be fast because we have the old one as good guidance) can begin in the isolated file.</p>\n<p>Does that sound good to you? I can push the first draft of NewKet.lean once everything compiles cleanly.</p>",
        "id": 553501654,
        "sender_full_name": "Ruize Chen",
        "timestamp": 1762214434
    },
    {
        "content": "<p>Mm, I guess I feel like it's not good to have a second file and stuff. if you feel it's too tough to get all those other changes (like Ket.apply) then let's just skip the deprecation and go straight to the new one.</p>\n<p>You can make the PR, it will have a lot of code not working, that's ok. I'll take a look</p>",
        "id": 553505033,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1762216713
    },
    {
        "content": "<p>Ah got it — just to explain a bit what I was trying to do:<br>\nI mainly wanted to update <code>optKet</code> in a “smarter” way, basically to directly write the Euclidean version that works with both <code>Unitary</code> and <code>Braket</code>.<br>\nThat’s why it really needed its own file — it sits between the two and would easily cause dependency cycles otherwise.</p>\n<p>While doing that, I realized the <code>Braket</code> side itself also needed to be Euclideanized, so I added a minimal <code>KetEuc</code> definition just to make <code>optKet</code> compile cleanly and test the setup.</p>\n<p>The idea was never to maintain two versions permanently — just to isolate the new logic until it’s good enough to replace the old one entirely.</p>\n<p>If you’d prefer doing the replacement directly inside the same file instead, I can take care of that — I’ll just use a regex pass to systematically rename all <code>Ket</code> to <code>KetOld</code> in <code>Braket.lean</code> to the new version.<br>\nI’ll likely do that tomorrow once I’ve confirmed everything still builds properly.</p>",
        "id": 553509092,
        "sender_full_name": "Ruize Chen",
        "timestamp": 1762219289
    },
    {
        "content": "<p>Sure, yeah. Let's just skip the KetOld completely and just remove it right away.</p>",
        "id": 553517447,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1762224276
    }
]