[
    {
        "content": "<p>The comment on <code>lebesgue_differentiation</code> (Lemma 10.2.2) says that it should be an easy consequence of <code>VitaliFamily.ae_tendsto_average</code>, but it doesn't appear to be. That lemma applies to families of closed sets, but we need to prove a statement about averages over open balls. Obviously if we knew that <code>ball x r</code> and <code>closedBall x r</code> always had the same measure, this distinction wouldn't matter, but I don't think we can assume that's the case here.</p>\n<p>For reference, here's my <a href=\"https://github.com/fpvandoorn/carleson/pull/402\">proof</a> of a modified Lemma 10.2.2 using closed balls. This version is indeed an easy consequence of <code>VitaliFamily.ae_tendsto_average</code>, but I don't think it helps with its intended use (proving Lemma 10.2.5). A proof of Lemma 10.2.5 using the original version of Lemma 10.2.2 can be seen <a href=\"https://github.com/fpvandoorn/carleson/pull/395\">here</a>.</p>",
        "id": 525130928,
        "sender_full_name": "James Sundstrom",
        "timestamp": 1750482093
    },
    {
        "content": "<p>I see two ways out here, if I'm not mistaken</p>\n<ul>\n<li>There are only countably many radii where the sphere <code>S (x, r)</code> has positive measure (as the overall measure of the ball is finite and the spheres are disjoint), so you can find a sequence of radii tending to zero where the closed ball and the open ball have the same measure. Since <code>lebesgue_differentiation</code> only asks for some sequence of radii, you're fine.</li>\n<li>But in fact, the Lebesgue differentiation theorem holds along all open balls. It can be deduced from the statement for closed ball: the open ball <code>B = openBall x r</code> is the increasing limit of <code>B_n = closedBall x (r - 1/n)</code>. By the dominated convergence theorem, the integral of <code>f</code> on <code>B_n</code> converges to the integral on <code>B</code>, and same for the measure. So if you know that all the <code>∫ x in B_n, f x / measure (B_n)</code> are close to a number, then so is the same quantity over <code>B</code>.</li>\n</ul>",
        "id": 525134329,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1750483575
    },
    {
        "content": "<p>The second way out is better, because it's more general, but for Carleson I guess you can use whatever version looks easier to formalize to you.</p>",
        "id": 525134362,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1750483614
    },
    {
        "content": "<p>Another argument for the first version is to say that <code>r -&gt; measure (closedBall x r)</code> is monotone, so it is continuous at all but countably many points (see <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Monotone.countable_not_continuousAt#doc\">docs#Monotone.countable_not_continuousAt</a>), and then at the continuity points the open ball and the closed ball have the same measure.</p>",
        "id": 525135038,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1750484704
    }
]