[
    {
        "content": "<p>I don't know how to prove <a href=\"https://florisvandoorn.com/carleson/docs/Carleson/ToMathlib/HardyLittlewood.html#continuous_average_ball\">carleson#continuous_average_ball</a> without additional assumptions on the measure mu, in particular that the measure of spheres vanishes. How would we like to continue with this?</p>",
        "id": 516124879,
        "sender_full_name": "Jim Portegies",
        "timestamp": 1746429851
    },
    {
        "content": "<p>(I believe I have counterexamples to the statement if mu is merely doubling)</p>",
        "id": 516125021,
        "sender_full_name": "Jim Portegies",
        "timestamp": 1746429904
    },
    {
        "content": "<p>There is indeed no reason why continuity should be true, but semicontinuity is true and should be enough for the application, right?</p>",
        "id": 516132879,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1746432308
    },
    {
        "content": "<p>Sorry for my late reply. I do think semicontinuity could be true, but for the lower-semicontinuity of the maximal function, one also needs the semicontinuity in the other direction because one divides by the measure of the ball in the maximal function. An option may be to in the definition of the maximal function divide by the norm of the closed ball instead, but that would be a very big change and I also don't oversee the consequences.</p>\n<p>I am tempted to add the assumption that the measure of spheres is zero.</p>",
        "id": 517474883,
        "sender_full_name": "Jim Portegies",
        "timestamp": 1747040553
    },
    {
        "content": "<p>Isn't the goal in the end just to get measurability? Then everything looks ok.</p>",
        "id": 517481535,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1747042236
    },
    {
        "content": "<p>I think the lower semicontinuity of the maximal function is used in chapter 10</p>",
        "id": 517482249,
        "sender_full_name": "Jim Portegies",
        "timestamp": 1747042422
    },
    {
        "content": "<p>ok, I'm confused. I don't see why <a href=\"https://florisvandoorn.com/carleson/docs/find/?pattern=continuous_average_ball#doc\">carleson#continuous_average_ball</a> should be relevant here. The maximal function in the blueprint (equation (2.0.41)) is a supremum of functions of the form <code>f_i : x ↦ 1_(B_i) (x) * c_i</code>, where <code>c_i</code> is a nonnegative scalar, and <code>B_i</code> is an open ball. Each such function is lower semi-continuous. So their supremum is still lower semicontinuous. Right?</p>",
        "id": 517493533,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1747045090
    },
    {
        "content": "<p>It's interesting to note here that the Carleson authors do <em>not</em> use the standard maximal function (for which the issue you're pointing would be a problem), but another version which is equivalent (up to a multiplicative constant) with the usual one, but which is slightly better behaved.</p>",
        "id": 517573766,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1747061581
    },
    {
        "content": "<p>Yes exactly, it was recommended to follow Folland, and there the maximal function was defined differently</p>",
        "id": 517573958,
        "sender_full_name": "Jim Portegies",
        "timestamp": 1747061619
    },
    {
        "content": "<p>I believe I see what you are saying, thanks!</p>",
        "id": 517574060,
        "sender_full_name": "Jim Portegies",
        "timestamp": 1747061638
    },
    {
        "content": "<p>We indeed use a non-standard maximal function because it was hopefully better behaved. I'm not sure if that was the right decision in the end. And I didn't realize that lower semicontinuity would be easier for our definition. Thanks for pointing that out, Sebastien!</p>",
        "id": 517817395,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1747139421
    }
]