[
    {
        "content": "<p>[separated this out from the new outstanding task thread]<br>\nWe recently reached another (small) milestone: I finished formalizing the statements of all lemmas from the blueprint, including those of chapter 3, so the <a href=\"https://florisvandoorn.com/carleson/blueprint/dep_graph_document.html\">dependency graph</a> contains no more white nodes.</p>\n<p>Some statictics: we've now proven 143/179 lemmas &amp; theorems, so there are 36 results remaining (20 for the main result, 16 for the reduction to the classical result). There are currently 88 (uncommented) <code>sorry</code>'s in the repository. </p>\n<p>The fact that there are more sorry's is explained by:</p>\n<ul>\n<li>some lemmas consist of multiple Lean statements (most extremely, Lemma 10.2.5 is separated into 21 Lean lemmas)</li>\n<li>there are a few partial proofs with multiple steps <code>sorry</code>'d</li>\n<li>there are a few sorry's we can remove after we finish the <code>ENorm</code> refactor (task 117).</li>\n</ul>",
        "id": 520664552,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1748351280
    },
    {
        "content": "<p>Re: \"I finished formalizing the statements of all the lemmas from the blueprint\" -- I would argue that this is a huge and really important milestone. Can you confirm that there is no sorried data in the project at all?</p>",
        "id": 520680280,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1748355477
    },
    {
        "content": "<p>Yes, I just manually checked, and I'm quite confident that all sorry's are proofs. <br>\n(There might be some data defined in the middle of the proof of some individual lemmas that are currently sorry'd, of course.)</p>",
        "id": 520686590,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1748357156
    },
    {
        "content": "<p>And maybe I'm underselling the milestone :-)</p>",
        "id": 520686884,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1748357225
    },
    {
        "content": "<p>You're definitely allowed to have \"future sorried data\"! Congratulations!</p>",
        "id": 520689273,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1748357832
    },
    {
        "content": "<p>We're reaching the endgame of the formalization: all tasks to prove both the general <code>metric_space_carleson</code> and the classical result <code>classical_carleson</code> have been claimed!</p>",
        "id": 527703215,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1751984531
    }
]