[
    {
        "content": "<p>Less than 13 months after launching this formalization project, we have finished the original goal of formalizing both <a href=\"https://florisvandoorn.com/carleson/docs/find/?pattern=classical_carleson#doc\">carleson#classical_carleson</a> and <a href=\"https://florisvandoorn.com/carleson/docs/find/?pattern=metric_carleson#doc\">carleson#metric_carleson</a>. The formalization of these results is now <code>sorry</code>-free.</p>\n<p>Thanks to the following people for their major contributions to this project: María Inés de Frutos Fernández, Leo Diedering, Sébastien Gouëzel, Evgenia Karunus, Edward van de Meent, Pietro Monticone, Jasper Mulder-Sohn, Jim Portegies, Joris Roos, Michael Rothgang, James Sundstrom and Jeremy Tan. I will shortly update the blueprint to add their names as coauthor to the blueprint.</p>\n<p>Thanks to the following people for additional contributions: Michel Alexis, Bolton Bailey, Julian Berman, Joachim Breitner, Martin Dvořák, Georges Gonthier, Aaron Hill, Austin Letson, Bhavik Mehta, Eric Paul, Clara Torres, Dennis Tsar, Andrew Yang and Ruben van de Velde.</p>\n<p>Thanks to Lars Becker, Asgar Jamneshan, Rajula Srivastava and Christoph Thiele for writing the blueprint, and an additional thanks to Lars for answering all the mathematical questions that came up during the formalization!</p>",
        "id": 529450153,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1752840793
    },
    {
        "content": "<p>Looking back at the project, would you say the formalization brought to light relevant holes in the original proof?</p>",
        "id": 529455332,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1752842682
    },
    {
        "content": "<p>The original <em>pre-blueprint</em> proof (which was ~30 pages) had no (major) gaps, and most gaps were introduced when writing the argument in a much more detailed fashion when writing the blueprint.<br>\nIn the details, there were various places where the argument was slightly wrong and had to be modified a bit, but most such mistakes were confined to the proof of a single lemma. There were a few mistakes in the computation of the constants, but besides that, there were only a handful of times that we had to change the statement of one or more lemmas. And only 1-2 of these mistakes have actually affected the short (not yet public) mathematical proof.</p>\n<p>So I don't think the formalization really gave a new mathematical insight into any holes in the proof.</p>",
        "id": 529460948,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1752844550
    },
    {
        "content": "<p>It gave <em>confidence</em> though!</p>",
        "id": 529466749,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1752846559
    }
]