[
    {
        "content": "<p>In Chapter 7 (probably in other chapters too?) there are a lot of <code>lemma</code>s/<code>have</code>s of the following form <code>have size_of_D (h: 100 &lt; D) : (100 + 4 * D ^ -2 + 8⁻¹ * D ^ -3) * D ^ -1 &lt; 2 := by ...</code>.<br>\nThese are purely arithmetical, and they don't rely on any definitions. <br>\nThey are kind of bulky, so the proof itself becomes less readable and takes long to compile.</p>\n<p>Because these lemmas don't rely on any definitions they feel like services/utils in normal programming, so I get a feeling these should be kept in a separate file, say <code>Arithmetics.lean</code>. We already have <code>lemma hundred_lt_realD : 100 &lt; D</code>, <code>lemma twentyfive_le_realD : 25 &lt; D</code>, <code>lemma eight_le_realD: 8 &lt; D</code>, etc. in <code>Defs.lean</code>, so we could use <code>Defs.lean</code> for such lemmas, however we also have real definitions in <code>Defs.lean</code>, so a new arithmetics-specific file would probably be better.</p>\n<p>Is it alright if I create this file and start putting such lemmas there?</p>\n<p>Benefits:</p>\n<ul>\n<li>will make proofs less bulky without adding excessive lemmas to the search space (all theorems in this file can be excluded from in-editor/semantic search)</li>\n<li>will enable reuse of such calculations, pretty sure I'm just not noticing when they are repeated now</li>\n</ul>",
        "id": 496378694,
        "sender_full_name": "Evgenia Karunus",
        "timestamp": 1738082722
    },
    {
        "content": "<p>Yes, putting these in a separate file sounds good. Please do that reorganization.</p>\n<p>It might also be nice to investigate to what extend <code>polyrith</code> can help with such inequalities. I think <code>polyrith</code> is probably unable to deal with negative exponents, but after multiplying both sides of the goal with <code>D ^ 4</code> (and multiplying out parentheses?) then <code>polyrith</code> might work, if the inequality is on the reals?</p>\n<p>(cc <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span>)</p>",
        "id": 496526340,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1738150165
    }
]