[
    {
        "content": "<p>Hi everybody,</p>\n<p>I'm very interested in helping mathematicians organise formalisation projects by building productivity software tools that would allow them to more effectively collaborate on large-scale formal proofs.</p>\n<p>My background is in scientific software development (mostly biology/ bioinformatics/ data science). I've worked at Harvard Medical School on open source software in the field of single cell transcriptomics, specifically on projects called Vitessce and Cellenics. I have a lot of experience designing and building software for researchers.</p>\n<p>I follow the \"lean startup\" software product development methodology. I'm planning to put together a very minimally useful software product very quickly (in a matter of weeks). Before I even write any code I'd like to iterate on a couple of versions of mock-up designs (please see below for v1 wireframes):</p>\n<p><a href=\"https://docs.google.com/presentation/d/1FKz56D_wDMKx8FN_45zIBC-rSLO_UjC79NKF1JcCpRA/edit?usp=sharing\">Lean queue</a></p>\n<p>I'd like to build a tool that fits well and improves on the existing formalisation collaboration workflow, which I understand is built on github, Blueprint/ dependency graph software and of course Zulip chat.</p>\n<p>In the first iteration, I'd like to allow users to perform two actions:</p>\n<ul>\n<li>Submit \"jobs\" -- which I'd like to propose are initially only self-contained lemmas (with Mathlib as the only dependency), together with short informal description of what needs to be formalised.</li>\n<li>Allow users to claim these \"jobs\" and eventually resolve them as \"done\".</li>\n</ul>\n<p>If this works well enough I will then get your feedback on various ideas for improvement and I'll start working on a feature roadmap.</p>\n<p>More immediately, I'd really appreciate it if you could help me understand your workflows. I would really benefit from your personal perspectives on the following topics:</p>\n<p>What are the current issues that you're facing when working on formalisation projects? How do these issues differ between \"lean formaliser\" and \"task splitter\" personas?</p>\n<p>What are the limitations of existing tools that you work with on your formalisation projects (Github, Blueprint, Zulip, Loogle/Moogle, others?)</p>\n<p>What do you think of the proposed wireframes? Am I prioritising the most essential feature set for the minimum viable product (MVP) of such a collaboration tool? Please remember that in the \"lean startup\" methodology the idea is to build a very scrappy MVP and then start adding features once the product gains initial userbase, based on the feedback from initial users.</p>\n<p>Am I focusing on the right problem? Are there more pressing issues that a collaboration software should be addressing?</p>",
        "id": 475390437,
        "sender_full_name": "Iva Babukova",
        "timestamp": 1728333381
    },
    {
        "content": "<p>Welcome! There has been quite some discussion about workflows in the past 2 weeks on the <a class=\"stream\" data-stream-id=\"458659\" href=\"/#narrow/stream/458659-Equational\">#Equational</a> channel.</p>\n<p>I think there are at least two related, but maybe different, workflows:</p>\n<ul>\n<li>working on and maintaining projects like Carleson, Equational, FLT</li>\n<li>working on and maintaining mathlib. See <a href=\"https://jcommelin.github.io/queueboard/\">https://jcommelin.github.io/queueboard/</a> for a recent attempt at a prototype to improve the mathlib review workflow. (Mathlib has &gt; 1000 open prs of which &gt; 200 ready for review.)</li>\n</ul>",
        "id": 475457878,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1728358668
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"764670\">@Iva Babukova</span> I didn't know that you double-posted. If you do that, please explicitly flag the other post.</p>",
        "id": 475466038,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1728361543
    },
    {
        "content": "<p>Hi Johan! Your prototype looks very similar to what I was thinking that the community might find helpful -- it even has a similar name :) Looks really cool! Do you have an idea of its usage at the moment and what people's feedback has been so far?</p>\n<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/442935-Carleson/topic/Software.20tool.20for.20formal.20proof.20collaboration/near/475466038\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"764670\">Iva Babukova</span> I didn't know that you double-posted. If you do that, please explicitly flag the other post.</p>\n</blockquote>\n<p>I will make sure I flag the other post next time -- I am new here and didn't realise that lots of people are part of both channels.</p>",
        "id": 475556812,
        "sender_full_name": "Iva Babukova",
        "timestamp": 1728392492
    }
]