[
    {
        "content": "<p>Recently I've been thinking about some things involving the internal logic of the topos of sheaves on the one point compactification of N (or the stone cech compactification, either have the right logical properties). I'd like to prove some things synthetically, and I'm a lot more comfortable with lean over coq or agda. Does every sheaf topos model lean 4?</p>\n<p>I think I really want to ask something more specific here, maybe whether it's true that in ZFC+\"there exists a (ω+1)-indexed chain of inaccessibles κ0, κ1,...,κω\", for any κ0-small topological space X we can model lean 4 in Fun(Opens(X)^op, Set_κω) where the dependent type formers have their usual topos-theoretic universal properties and Prop is the subobject classifier and for finite n the constant sheaf at V_κn is <code>Type n</code> and so on. Let me know if I've made any mistakes in this statement, I'm very new to this toposy stuff</p>",
        "id": 396684705,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1697325867
    },
    {
        "content": "<p>The standard reference of Lean's type system is <a href=\"https://github.com/digama0/lean-type-theory\">https://github.com/digama0/lean-type-theory</a> , which I believe is valid for Lean4 too. In this paper, an instance of Lean internal to ZFC+κω is constructed. Just glancing the construction, I think the choice function is used only to interpret <code>Classical.choice</code>, and the others make sense in general toposes (recall that the internal logic in any topos admits well-founded recursion and the unique choice). If so, the answer to your question is \"Yes, except <code>Classical.choice</code>\".</p>\n<p>I am not an expert either. Please correct me if wrong.</p>",
        "id": 396696571,
        "sender_full_name": "Jun Yoshida",
        "timestamp": 1697333958
    },
    {
        "content": "<p>Yes, to be clear I meant lean excluding anything in the classical namespace</p>",
        "id": 396696674,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1697334010
    },
    {
        "content": "<p>I was mostly worried about quotient types and judgmental proof irrelevance, since I've heard type theorists grumble about these things. But I don't understand this stuff well enough to know whether those would preclude a model in a sheaf topos. I'll take a look at that paper</p>",
        "id": 396697043,
        "sender_full_name": "Brendan Seamas Murphy",
        "timestamp": 1697334242
    },
    {
        "content": "<p><del>In (sheaf) topos, neither the soundness of quatients nor proof irrelevance causes the problem as long as <code>Prop</code> is properly interpreted; e.g. as the type of subobjects of a fixed terminal object.</del> (This may be problematic with internal universes)</p>",
        "id": 396698014,
        "sender_full_name": "Jun Yoshida",
        "timestamp": 1697334760
    },
    {
        "content": "<p>Can you link a reference that solves the coherence issue for Prop? In the Lumsdaine local universes construction, there only seems to be a retraction between the elements of Prop and the subobject classifier, not an isomorphism.</p>",
        "id": 396700542,
        "sender_full_name": "Trebor Huang",
        "timestamp": 1697336359
    },
    {
        "content": "<p>And Hofmann's coherence construction seems to have difficulties dealing with intensional equality (i.e. without equality reflection).</p>",
        "id": 396700673,
        "sender_full_name": "Trebor Huang",
        "timestamp": 1697336434
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"420917\">@Sina</span> I guess you are one of the canonical people to answer this question (-;</p>",
        "id": 396709481,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1697342618
    },
    {
        "content": "<p>Oops, it turned out that I was a serious stupid thinking Lean as a first-order type system, as it is mostly my use case. I am sorry my half-asleep brain and withdraw my answer; just forget about it.</p>",
        "id": 396709503,
        "sender_full_name": "Jun Yoshida",
        "timestamp": 1697342632
    },
    {
        "content": "<p>My answer \"yes\" is based on the following argument:</p>\n<ol>\n<li>Lean's type theory is a subsystem of extensional type theory (in the sense that any judgment of Lean's type theory is also a valid judgment of extensional type theory).</li>\n<li>Extensional type theory is valid in a topos (as are funext, propext etc.)</li>\n</ol>\n<p>I'm not sure exactly how to justify either claim, especially 1.</p>",
        "id": 397376312,
        "sender_full_name": "Reid Barton",
        "timestamp": 1697659429
    },
    {
        "content": "<p>In particular, the extensionality is used to interpret the large elimination for the proposition <code>Eq</code> (which seems like the main dubious feature).</p>",
        "id": 397380176,
        "sender_full_name": "Reid Barton",
        "timestamp": 1697661299
    }
]