[
    {
        "content": "<p>Disclaimer: I'm aware that this topic doesn't strictly follow this stream's description since it's not specific to Lean, but I think this is the closest stream here.</p>\n<p>I am studying univalence and univalent theorem provers on my own, and I have some questions about it. My biggest one, is as follows: is thinking of a univalent type theory as \"a type theory where two terms are considered equal if there is an invertible coercion between them\" correct (at least to an approximation)? If not, why? If so, are there any caveats?</p>\n<p>Then the equality type is a subset of invertible coercions between terms of a given type. Which subset is type-dependent. Then <code>propext</code> and <code>funext</code> follow naturally, since they are pretty much stated in as of invertible coercions imply equality.</p>",
        "id": 492172981,
        "sender_full_name": "RustyYato",
        "timestamp": 1736193144
    },
    {
        "content": "<p>Note that Lean has no current plans to support univalence. You will certainly have better responses elsewhere.</p>\n<p>You haven't quite understood equality in univalent type theory: equality is a type not a proposition. The type <code>a = b</code> can be quite complex and each element leads to a different \"coercion\" (better called \"transport\").</p>\n<p>If equality is a <code>Prop</code> and <code>propext</code> is true, then univalence leads to a fairly quick contradiction.</p>",
        "id": 492215015,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1736209770
    },
    {
        "content": "<p>I had thought so, but I was having a hard time finding the relevant forums, so I decided to ask here first. I've now found, <a href=\"https://agda.zulipchat.com/#narrow/channel/260790-cubical\">https://agda.zulipchat.com/#narrow/channel/260790-cubical</a> which seems promising. Thanks for your help!</p>",
        "id": 492227265,
        "sender_full_name": "RustyYato",
        "timestamp": 1736216252
    },
    {
        "content": "<p>Agda people seems to be more active on discord channels</p>",
        "id": 492243097,
        "sender_full_name": "Trebor Huang",
        "timestamp": 1736225390
    },
    {
        "content": "<p><a href=\"http://hott.zulipchat.com/\">hott.zulipchat.com/</a> would probably be the best place to ask such questions.</p>",
        "id": 492266416,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1736239873
    },
    {
        "content": "<p>Oh, thanks everyone, that's very helpful!</p>",
        "id": 492346229,
        "sender_full_name": "RustyYato",
        "timestamp": 1736268083
    }
]