[
    {
        "content": "<p>The following has become a pattern on the zulip android app: </p>\n<ol>\n<li>\n<p>I open the app afresh. The app connects online and everything works fine for a few minutes, but then the network connection inside zulip is lost and it cannot reconnect. The only way to get the app working again is to close it, remove the app from my app history deck. And re-open it. </p>\n</li>\n<li>\n<p>I am writing something on the app. I just need to get a reference from the browser. I switch to the browser window and get back to zulip, but now zulip has lost its network connection and is forever trying to reconnect, but never succeeds. Again I have to close the app, remove it from the app history deck and restart. </p>\n</li>\n</ol>\n<p>When either of these two things happen, if I am sending a message on the app, it gets double sent and I see two copies of the message when I reopen the app</p>\n<p>I am very confident that this is not a network issue on my end. It occurs across multiple networks and multiple cities. It doesn't happen in any other app. Only Zulip. Recently the beta app has also started getting this issue. It make the app very frustrating to use.</p>",
        "id": 481571372,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1731252695
    },
    {
        "content": "<p>It also doesn't happen on the mobile web browser</p>",
        "id": 481571537,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1731252825
    },
    {
        "content": "<p>I am using the latest version of the app on Android 13</p>",
        "id": 481571619,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1731252871
    },
    {
        "content": "<p>I am also sure this is not a battery saver issue since every other app has no problem reconnecting to the network when opened again</p>",
        "id": 481571662,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1731252912
    },
    {
        "content": "<p>You've mentioned this before, and I've seen you double-posting occasionally so clearly this is an issue for you, but I'm a regular and avid user of the android app, I'm on Android 13, and I've never experienced this; the only time i ever double-post is when I'm eg on a train with a flaky network. So there must be something different with our setups which is causing this.</p>",
        "id": 481573422,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1731254278
    },
    {
        "content": "<p>PS whilst writing that message I switched to the android settings app to see which version of Android I was on (I don't care at all about these details so didn't know offhand but i knew where to find them) and then switched back no problem.</p>",
        "id": 481573557,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1731254393
    },
    {
        "content": "<p>I don't use the app, I use the webapp, so I can't say whether I get the same behavior or not, but I will say that I've noted I see this kind of behavior on the <em>webapp</em> (on mobile but even on desktop in FF on macOS) before, at least as it relates to \"it loses connectivity and then cannot get it back again without being refreshed, and otherwise all I see is the Zulip logo in the browser tab\". I have never looked closely at Zulip's code, but what I do notice just peripherally from using it is that however it works requires some keepalive-y behavior from the client presumably to continually receive messages. I mention all this to say my uninformed guess would still be somewhere in the realm of battery saver issues, as I think the issue wouldn't be <em>reconnecting</em> per se, it'd have something to do with the server side having given up on your connection or something due to those keepalive messages. Purely a guess of course until someone who knows things shows up -- but I'd be trying to make sure you have allowed it to work in the background in Android's battery settings, even though you say you don't think it's the issue.</p>",
        "id": 481574644,
        "sender_full_name": "Julian Berman",
        "timestamp": 1731255134
    },
    {
        "content": "<p>It might be the server issue you mention, but mattermost, discord, and any number of other apps don't cause similar trouble.</p>",
        "id": 481578887,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1731257964
    },
    {
        "content": "<p>More specifically, if the app cannot restore a lost connection, then why can't it initialise a new connection? Wouldn't that succeed?</p>",
        "id": 481579233,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1731258234
    }
]