[
    {
        "content": "<p>I am using the zulip android app for this server and often when I edit a message it gets posted as a separate and new message leading to unnecessary near-duplicates. This has already happened twice in the last 24 hours to me.</p>",
        "id": 402095712,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1700007111
    },
    {
        "content": "<p>While I am at it about the android app, the app keeps losing its network connection after a short while (or if I come back to the app from  another app, say a browser to find a reference) and the only way to get it working again is, for some mysterious reason, to clear the app from my history deck and re-open it.</p>",
        "id": 402096228,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1700007250
    },
    {
        "content": "<p>I am not sure what the solution to these issues is. I am on Android 13 if it helps. These issues also existed when I was on android 12 a few months ago.</p>",
        "id": 402096313,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1700007277
    },
    {
        "content": "<p>I wonder whether this is a network issue? I have double-posted many times over the years and it's always when I'm on a train or something, with patchy network connectivity. My understanding is that with a bad connection it is an extremely difficult problem to make sure that messages get posted exactly once -- you can basically choose one of \"at least once\" and \"at most once\" and I think Zulip made the right choice!</p>",
        "id": 402098102,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1700008044
    },
    {
        "content": "<p>But  that's the issue. I am certainly on good networks. After a few minutes of usage or switching back from a different app, the Zulip app fails to establish a connection to the server. This after claiming to be <code>connecting</code> for an unreasonable length of time.</p>",
        "id": 402098352,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1700008131
    },
    {
        "content": "<p>I don't have this issue with any other app on the same networks</p>",
        "id": 402098379,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1700008142
    },
    {
        "content": "<p>Oh ok. I've only experienced this on crappy networks (I'm also on Android)</p>",
        "id": 402100813,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1700008994
    },
    {
        "content": "<p>It could be that my phone is configured by default to aggressively shut down background services or threads and save battery life, and that affects zulip which might use one or more of these to manage the network connection with the server (note : this happens even when I am not using the battery saver mode).  But ideally apps should be able to handle anything of this sort.</p>",
        "id": 402103590,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1700009833
    },
    {
        "content": "<p>On the second bit -- there would seem to be only a small chance it's related, but I'd just say I find Zulip on <em>desktop</em> (web) to itself be really \"quick to disconnect\" -- it's certainly the only chat platform I use (Discord, Slack, and Gitter being the other 3 relevant ones) where when I come back after an hour or two to my computer, the page basically has  commonly cleared itself, shows a big zulip logo, and requires a full refresh to get back to messages / load new ones. I've always just assumed there's some very \"aggressive\"-seeming heartbeats that the client and Zulip servers are requiring to stay in sync or something.</p>",
        "id": 402320235,
        "sender_full_name": "Julian Berman",
        "timestamp": 1700079416
    },
    {
        "content": "<p>No that also happens to me. I find myself hitting Ctrl+R every time I open Zulip on the desktop. It is just a lot simpler than what I have to do on android</p>",
        "id": 402320442,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1700079518
    },
    {
        "content": "<p>I never had to do that when using Zulip on a web browser.</p>",
        "id": 402327380,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1700082225
    },
    {
        "content": "<p>What browser are the two of you on out of curiosity (Patrick + Timo) -- and Shreyas I guess as well</p>",
        "id": 402330768,
        "sender_full_name": "Julian Berman",
        "timestamp": 1700083587
    },
    {
        "content": "<p>I'm on FF here</p>",
        "id": 402330786,
        "sender_full_name": "Julian Berman",
        "timestamp": 1700083591
    },
    {
        "content": "<p>I use Firefox on Linux.</p>",
        "id": 402330969,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1700083674
    },
    {
        "content": "<p>And to state the obvious -- you leave Zulip open in a tab all the time in it too?</p>",
        "id": 402331120,
        "sender_full_name": "Julian Berman",
        "timestamp": 1700083724
    },
    {
        "content": "<p>Brave/Firefox. I don't use the browser for zulipchat most of the time. On the rare occasion it has been fine. Functionality-wise, the mobile browser version has some advantages (like being able to link to a thread by copying its URL from the address bar), and the app has some advantages (like a delete option)</p>",
        "id": 402331121,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1700083726
    },
    {
        "content": "<p>I've never seen the behavior I mentioned on mobile web, but that's I think because I don't leave it open there in a tab. I just mentioned it since it sounded vaguely similar.</p>",
        "id": 402331354,
        "sender_full_name": "Julian Berman",
        "timestamp": 1700083823
    },
    {
        "content": "<p>The problems that I started this thread with are in the app</p>",
        "id": 402331460,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1700083879
    },
    {
        "content": "<p>I never use the desktop app. I sometimes use the mobile app.</p>",
        "id": 402332680,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1700084442
    },
    {
        "content": "<p>TIL that there is a Zulip desktop app. Thanks! <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 406455222,
        "sender_full_name": "Mac Malone",
        "timestamp": 1701922760
    }
]