[
    {
        "content": "<p>I'd love to hear feedback on how folks are experiencing folders here. We've iterated on the experience quite a bit just by trying them out in the Zulip development community, but I'm expecting the experience to evolve further as we get broader feedback.</p>",
        "id": 534560085,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1755205587
    },
    {
        "content": "<p>Generally I would say folders are great!</p>",
        "id": 534561462,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1755206224
    },
    {
        "content": "<p>As someone who uses Google Chat in my day job, the behavior is quite different, namely that in google chat:</p>\n<ul>\n<li>Folders are user-managed, not organization managed</li>\n<li>Pinned channels stick to the top of their folder, rather than to their own top-level folder</li>\n</ul>",
        "id": 534561566,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1755206277
    },
    {
        "content": "<p>I think it's too early to say which behavior I prefer!</p>",
        "id": 534562077,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1755206474
    },
    {
        "content": "<p>I also can't say how much I like or dislike the feature overall yet, I'm still retraining my eyes for some new locations of channels, but the one thing I do find slightly odd so far is where muted channels go. The \"point\" to me of having muted channels is I want to randomly click on them every so often but not really see them in my face. But now there's a \"muted\" section at the bottom of every folder where an admin has decided the channel goes in that bin. (So concretely, I'd love it if muted channels could be set to go back to where they were for me, at the bottom in a hidden drawer).</p>",
        "id": 534579761,
        "sender_full_name": "Julian Berman",
        "timestamp": 1755218051
    },
    {
        "content": "<p>Yes, I agree that the muted and inactive channels at the bottom of each folder are noisy.</p>",
        "id": 534601212,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1755236459
    },
    {
        "content": "<p>I would also love to have a \"mark all messages as read\" command at the folder level.</p>",
        "id": 534601243,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1755236486
    },
    {
        "content": "<p>Agreed with both the general experience being amazing and the muted channels being a bit weird. Personally the change has made me reconsider whether I even needed to be in those channels and the answer each time was \"no\"</p>",
        "id": 534601359,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1755236607
    },
    {
        "content": "<p>I'm wary of settings overload, but I guess we could let folks configure whether to put muted channels within their folders or at the bottom, and similarly for pinned channels. (We've also gotten a request for pinned channels to be duplicated at the top and in their folder.)</p>",
        "id": 534603002,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1755237997
    },
    {
        "content": "<p>I think that as the Lean Zulip continues on and continues to create channels for events and such, joining channels is going to become a bit of a pain. There's already 50+ channels that I'm not in. When I browse the list of joinable channels, there are specific math channels (not interested) interspersed with past irl event channels (not interested) interspersed with general and topics channels (very interested). I don't have a great suggestion for changing this UI-wise, but it might be nice to have those be ordered and/or collapsible by folders?</p>",
        "id": 534746982,
        "sender_full_name": "JJ",
        "timestamp": 1755330864
    },
    {
        "content": "<p>Oh, in the subscription UI?</p>",
        "id": 534951496,
        "sender_full_name": "Alex Vandiver",
        "timestamp": 1755523380
    },
    {
        "content": "<p>In the subscription UI, yeah. This is what I see.</p>\n<p><a href=\"/user_uploads/3121/UspfTVnyjJ3tEzhcf8X5TdG1/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/UspfTVnyjJ3tEzhcf8X5TdG1/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1924x1255\" src=\"/user_uploads/thumbnail/3121/UspfTVnyjJ3tEzhcf8X5TdG1/image.png/840x560.webp\"></a></div>",
        "id": 535034026,
        "sender_full_name": "JJ",
        "timestamp": 1755559777
    },
    {
        "content": "<p>Thanks for the suggestion! We're working on adding an option to filter channels by folder in the subscription UI (<a href=\"https://github.com/zulip/zulip/issues/35779\">https://github.com/zulip/zulip/issues/35779</a>).</p>",
        "id": 537375033,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1756853382
    },
    {
        "content": "<p>Not sure if this is the appropriate thread, but I noticed <a class=\"stream\" data-stream-id=\"479953\" href=\"/#narrow/channel/479953-PhysLean\">#PhysLean</a> was in the \"Topics\" folder and not the \"Projects\" folder, where other projects like <a class=\"stream\" data-stream-id=\"513188\" href=\"/#narrow/channel/513188-CSLib\">#CSLib</a> are located and where I would've expected to find <a class=\"stream\" data-stream-id=\"479953\" href=\"/#narrow/channel/479953-PhysLean\">#PhysLean</a>. Am I misunderstanding the folder structure and is this intentional?</p>",
        "id": 541090417,
        "sender_full_name": "Joscha Mennicken",
        "timestamp": 1758657807
    },
    {
        "content": "<p>I agree, this was a miscategorization, which I'll fix now.</p>",
        "id": 541347756,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1758759186
    }
]