[
    {
        "content": "<p>Hi! I am a professor at Rutgers university, and we started a Lean seminar earlier this year. We were thining that it would be useful for us to communicate with each other (and with anyone else who is interested in what we are doing) via zulip. What is the policy of this zulipchat? Can we create a Rutgers stream here?</p>",
        "id": 352919731,
        "sender_full_name": "Ian Jauslin",
        "timestamp": 1682533933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"557226\">@Ian Jauslin</span>, yes, you can! </p>\n<p>If you're happy for it to be a public stream, just let me know and I will create it for you.</p>\n<p>If you would like a private stream  that won't have any of the maintainers as members, then we will need a nominated \"moderator\" for the stream (e.g. you), who will promise to keep an eye on the stream, and in particular contact the code of conduct team and/or maintainers if any issue arises in the stream which they might need to be aware of.</p>\n<p>(Obviously if it is a public stream but with low usage, we would still very much appreciate if members are aware of the <a href=\"https://github.com/leanprover-community/mathlib/blob/master/CODE_OF_CONDUCT.md\">code of conduct</a>.)</p>",
        "id": 352949721,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1682544263
    },
    {
        "content": "<p>Thanks so much! A public stream would be just fine!</p>",
        "id": 352950300,
        "sender_full_name": "Ian Jauslin",
        "timestamp": 1682544537
    },
    {
        "content": "<p>Would \"Rutgers lean seminar\" be a good title?</p>",
        "id": 352950424,
        "sender_full_name": "Ian Jauslin",
        "timestamp": 1682544595
    },
    {
        "content": "<p>I've created it, and added you as a member.</p>",
        "id": 352951639,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1682545138
    },
    {
        "content": "<p>Awesome thank you so much!</p>",
        "id": 352981084,
        "sender_full_name": "Ian Jauslin",
        "timestamp": 1682551600
    }
]