[
    {
        "content": "<p>Is it possible for a group to create a new channel to discuss its day-to-day activities? Apparently as a user I don't have the right to create new channels.</p>",
        "id": 483303480,
        "sender_full_name": "Anthony Bordg",
        "timestamp": 1732033563
    },
    {
        "content": "<p>That sounds like the job of a thread within a channel? The short answer is no, you would have to ask the moderators (the Lean Zulip ones).</p>",
        "id": 483316501,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1732037109
    },
    {
        "content": "<p>Yes, we regularly create small private channels for local groups. I sent you a direct message.</p>",
        "id": 483325655,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1732039950
    },
    {
        "content": "<p>With the caveat that we require that there is a designated moderator of that private channel, known to the mathlib maintainers or leanprover-community admin team, who will ensure that any code of conduct issues occurring in that channel are raised with the CoC team!</p>",
        "id": 483368872,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1732057044
    },
    {
        "content": "<p>Related: am I supposed to announce to other maintainers/admin people when I create a new private channel? I'm currently running a computational algebraic geometry workshop in Durham UK and I just (the other day) created a private channel like we always do with these things; I'm monitoring it and there are 8 PhD students/post-docs enrolled as well as me; we're working on projective =&gt; proper. Is this OK?</p>\n<p>With Anthony's situation, is it necessary to have a Zulip moderator or mathlib maintainer subscribed to the channel, or do we not require this?</p>",
        "id": 483371864,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1732058708
    },
    {
        "content": "<p>In Anthony's situation, it doesn't need to be a zulip moderator or mathlib maintainer --- just someone, perhaps Anthony, whom whoever creates the channel has explicitly discussed this with, and the channel creator trusts that they've understood.</p>",
        "id": 483401894,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1732075231
    },
    {
        "content": "<p>For your projective =&gt; proper channel, yes, that's fine --- you're that person, and if something was going wrong in the private channel you could bring it to the CoC team.</p>",
        "id": 483402033,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1732075298
    }
]