[
    {
        "content": "<p>I am now a moderator on this Zulip and someone just did the canonical newbie thing -- posted a perfectly coherent question but in the middle of an active thread about something totally unrelated. I saw it and was about to move the message elsewhere but then people started responding with messages like \"what does this have to do with the current topic of conversation\". I explained a more appropriate place to post and said I'd clear up so as to not disrupt the ongoing conversation in the thread. But then I discovered that I couldn't figure out how to delete other people's messages (and maybe I can't?). So I randomly created a new private channel called junk which only I have access to, and moved the individual messages there instead! This seems to have the desired effect -- there is no evidence of the disruption now (I didn't even leave a \"a message has been moved\" note), which I quite like (it's nice if Zulip is tidy). But is this behaviour looked down upon -- should I avoid this technique in the future?</p>",
        "id": 443266140,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1717756776
    },
    {
        "content": "<p>Nah, I think it is fine.</p>",
        "id": 443276859,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1717759225
    },
    {
        "content": "<p>I'd usually just move the \"what does this have to do with the current topic of conversation\" messages to the new members thread along with the original message, allow the automatic \"this message was moved from ...\", but disable the \"messages were moved from here to ...\".</p>",
        "id": 443288711,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1717763519
    },
    {
        "content": "<p>OK thanks for the tips! I just thought it was a bit weird to have a new thread starting with a question and then with a known regular saying \"what does this have to do with what we're talking about?\" afterwards, so now that message is in <a class=\"stream\" data-stream-id=\"441057\" href=\"/#narrow/stream/441057-junk\">#junk</a></p>",
        "id": 443313326,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1717771560
    },
    {
        "content": "<p>Moving messages into junk is even better than deletion, as deletion leaves <code>(deleted)</code>.</p>",
        "id": 443313975,
        "sender_full_name": "Utensil Song",
        "timestamp": 1717771782
    },
    {
        "content": "<p>Right! At least if I delete my own messages, that was my experience. However I believe that some people (&gt;= admin) have the ability to completely delete messages; I'm just observing that as a moderator I strictly speaking don't have that ability but in practice moving to <a class=\"stream\" data-stream-id=\"441057\" href=\"/#narrow/stream/441057-junk\">#junk</a> gives me that ability anyway (and I'm wondering if this is OK, but given that I'm a sensible person I guess it's hopefully going to be OK)</p>",
        "id": 443316668,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1717772659
    },
    {
        "content": "<p>Actual deletion of messages indeed require more that permissions. But it is definitely possible.</p>",
        "id": 443317776,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1717773114
    },
    {
        "content": "<p>That's possibly an oversight of Zulip implementation. Maybe in principle, the message should not be able to be moved to a private channel without any notification. And if the #junk channel is a channel that can be seen by all admins it would be even better (admins can mute it if don't care about it). Because these would give the admin actions transparency.</p>\n<p>But at least here, I guess most people would be happy with this being quiet, and admins are trust-worthy.</p>\n<p>Another reference is that admins of a Discord server has the alibity to delete messages without any trace at all. This is particularly useful when there are spam messages (suddenly sent by bots in all channels of a server), and related discussions like \"oh this is happening again\" \"@ admin spam\" etc., so they could be removed altogether without interupting the normal conversations in the channels.</p>",
        "id": 443318907,
        "sender_full_name": "Utensil Song",
        "timestamp": 1717773525
    },
    {
        "content": "<p>Admins can delete messages completely in Zulip as well.</p>",
        "id": 443358672,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1717788176
    }
]