[
    {
        "content": "<p>I've been thinking about the utility of a stream for editor support, especially for non-standard (i.e. non-vscode) editors.<br>\nI know that some of us use nonstandard editors, e.g. <span class=\"user-mention silent\" data-user-id=\"110024\">Sebastian Ullrich</span> uses emacs and I use neovim.<br>\nCoordinating support for these isn't really easy and often has to deal with different subjects, so it might warrant its own stream.</p>\n<p>Each editor could get its own stream, but I think it'd be nice just to have one, with different topics referencing the editor.</p>\n<p>An argument against this would be that users could just discuss editor support off of the Lean zulip, since it's not really supported. i.e. discussions should be done on the editor support plugin's github.</p>",
        "id": 325176021,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1675262450
    },
    {
        "content": "<p>I think questions about editors are fair game in <a class=\"stream\" data-stream-id=\"113488\" href=\"/#narrow/stream/113488-general\">#general</a> or <a class=\"stream\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members\">#new members</a> (depending on whether they're feature requests or installation problems)</p>",
        "id": 325180872,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1675263602
    },
    {
        "content": "<p>right, I think both of these work well for vscode,  since the majority of users know it pretty well (and can help out in <a class=\"stream\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members\">#new members</a>, or give references if they see it in <a class=\"stream\" data-stream-id=\"113488\" href=\"/#narrow/stream/113488-general\">#general</a>)<br>\nbut since <a class=\"stream\" data-stream-id=\"113488\" href=\"/#narrow/stream/113488-general\">#general</a> is high-traffic I don't know if it'd be good for obscure use-cases like this, where only a few members are interested<br>\nand <a class=\"stream\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members\">#new members</a> wouldn't be great for technical questions/new directions</p>",
        "id": 325182563,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1675263943
    },
    {
        "content": "<p>(I have no opinion on the original suggestion, but am happy to be pinged on any neovim threads even though I haven't had any Lean time the past few months.)</p>",
        "id": 327410205,
        "sender_full_name": "Julian Berman",
        "timestamp": 1676220582
    }
]