[
    {
        "content": "<p>Has anyone else experienced issues with message links? For example, <a href=\"#narrow/stream/116395-maths/topic/thoughts.20on.20elliptic.20curves/near/384147037\">https://leanprover.zulipchat.com/#narrow/stream/116395-maths/topic/thoughts.20on.20elliptic.20curves/near/384147037</a> should link to a longish post by <span class=\"user-mention silent\" data-user-id=\"224323\">Junyan Xu</span> , but on desktop when I click on it I am taken instead to the end of the thread, and although the message is highlighted, it's offscreen, and if you scroll the highlight leaves the message and it becomes completely unclear which message was linked to.</p>",
        "id": 473854682,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727730074
    },
    {
        "content": "<p>the link does work if I open it in a new page or refresh while it is in the URL</p>",
        "id": 473855021,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727730168
    },
    {
        "content": "<p>I remember this happening to me a few times before, but clicking on your link works for me at the moment (using Firefox in both macOS and Windows).</p>",
        "id": 473855346,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1727730251
    },
    {
        "content": "<p>it happens reliably for me if the origin view is this thread in single thread mode, channel view or combined feed (on FF + linux)</p>",
        "id": 473855574,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727730307
    },
    {
        "content": "<p>oh wait, I just tried it and it took a bit to load and then showed the message, so maybe it has something to do with whether the messages are loaded or not</p>",
        "id": 473856703,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727730516
    },
    {
        "content": "<p>Oh interesting, this literally happened to me in the other zulip meta thread when I was posting a message link and I was confused as to whether I had somehow copied the wrong link.</p>",
        "id": 473874829,
        "sender_full_name": "Julian Berman",
        "timestamp": 1727735437
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/236604-Zulip-meta/topic/Links.20to.20messages.20don't.20work.3F/near/473854682\">said</a>:</p>\n<blockquote>\n<p>although the message is highlighted, it's offscreen, and if you scroll the highlight leaves the message and it becomes completely unclear which message was linked to.</p>\n</blockquote>\n<p>Another workaround, because the selected message is highlighted while offscreen, is to press up+down after following the link (while taking care not to scroll normally), so that the screen scrolls to put the message in view instead of vice versa</p>",
        "id": 473875462,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727735658
    },
    {
        "content": "<p>Is it possible to get a video recording of this behaviour?</p>",
        "id": 474500004,
        "sender_full_name": "Aman Agrawal",
        "timestamp": 1727938869
    }
]