[
    {
        "content": "<p>There isn't a \"list of all the things that may have just played a notification sound effect\" pane somewhere is there?</p>\n<p>One would I think first expect that to be the @mentions view, but that doesn't seem to be the case. Specifically I just heard what I could have sworn was the Zulip notification sound while I was in front of my machine -- and went looking through a bunch of panes before deciding I was hearing things. But I wasn't, it indeed was the Zulip sound effect -- but it came from someone <em>resolving</em> a thread I was autosubscribed to (with Zulip's \"automatically subscribe me to threads I commented on\" thing). It's odd to me that this resolving plays a notification sound at all, but I'm ignoring that for the minute.</p>\n<p>That's a bit disorienting -- I noticed only because a few minutes later just now I saw that thread at the top of the <a class=\"stream\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members\">#new members</a> stream, and then when I clicked on it saw the resolve message and put 2 and 2 together (to get 3.7 clearly).</p>\n<p>TL;DR: if one hears a sound effect and wants to know where it came from, where can they go to answer that question?</p>",
        "id": 410046726,
        "sender_full_name": "Julian Berman",
        "timestamp": 1703609437
    },
    {
        "content": "<p>This is most likely a notification that a thread to which you are subscribed got a post. For example you will probably hear one when I write this, even though I am not pinging you and you will not see anything special on the sidebar indicating a ping</p>",
        "id": 410049576,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1703611541
    },
    {
        "content": "<p>You are automatically subscribed to (1) topics you started and (2) topics in which you are pinged, which means effectively that every message posted after a ping also sounds like a ping. If you don't like this behavior you can disable auto-subscription in response to pings in the settings, but it is enabled by default and new within the past few weeks</p>",
        "id": 410049811,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1703611686
    }
]