[
    {
        "content": "<p>On my phone I use Zulip in Firefox. One annoyance is that scrolling around in the conversation view, especially with long messages, can be jumpy. It seems that sometimes the drag/scroll movement causes click events (or similar events, like press end or so?) that make Zulip either scroll to the top of the message, or open the message send dialogue at the bottom, both of which are distracting. But so far I can't quite put my finger on it (heh) when exactly this is happening. Do others observe this as well?</p>",
        "id": 444423052,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1718271465
    },
    {
        "content": "<p>Hmm it could be due to the setting that makes Firefox hide the menu bar and makes it appear (at the bottom) when I scroll, maybe the resizing of the viewpoint confuses Zulip. I'll disable that setting for a while and see if it helps.</p>",
        "id": 444423599,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1718271629
    },
    {
        "content": "<p>Nope, even with this setting disabled I still got spurious message entry dialogue popping up when I just wanted to scroll</p>",
        "id": 444437415,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1718276321
    },
    {
        "content": "<p>Is there a reason that you don't use the app? It has slightly less functionality but in general I'd say it was a better experience.</p>",
        "id": 444556545,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1718310885
    },
    {
        "content": "<p>The app has network connectivity issues. After a few minutes of using the app, it seems to forget how to connect to the network. Edit messages get duplicated , new messages don't load and so on.</p>",
        "id": 444559240,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1718311830
    },
    {
        "content": "<p>The new beta app has not given me such trouble yet, but its navigation UI is inconvenient to the extreme.</p>",
        "id": 444559435,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1718311901
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"470149\">Joachim Breitner</span> <a href=\"#narrow/stream/236604-Zulip-meta/topic/scrolling.20on.20Firefox.20mobile/near/444437415\">said</a>:</p>\n<blockquote>\n<p>I still got spurious message entry dialogue popping up when I just wanted to scroll</p>\n</blockquote>\n<p>I get this all the time in Chrome on Android. There's also a feature where Zulip decides to scroll to the top of a message while scrolling, which makes it impossible to read long messages.</p>",
        "id": 444560474,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1718312374
    },
    {
        "content": "<p>It's very jumpy for me too, FWIW <span class=\"user-mention\" data-user-id=\"470149\">@Joachim Breitner</span> .</p>",
        "id": 444622905,
        "sender_full_name": "Julian Berman",
        "timestamp": 1718344395
    },
    {
        "content": "<p>Kevin, I'm sure this doesn't speak for everyone else, but some of us (me) are tin hatted enough to really never use an app for anything on mobile that has network connectivity unless urgently necessary, as your ability to control networking (e.g. your data being shared with third parties, or unnecessary data usage, etc.) is way way lower than in a browser.</p>",
        "id": 444623046,
        "sender_full_name": "Julian Berman",
        "timestamp": 1718344505
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"466334\">@Shreyas Srinivas</span> I never have problems with my Zulip app on Android, the only connectivity issues I have are when I'm on a train and the network genuinely is ropey.</p>",
        "id": 444645855,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1718352972
    }
]