[
    {
        "content": "<p>As a new user to both Zulip and this Lean community, thank you for having this channel!</p>\n<p>I try to be methodical in keeping discussion threads focused on specific topics: specific bug, specific question, specific user scenario, specific enhancement, etc... especially when they can be resolved. I like the idea of <a class=\"stream-topic\" data-stream-id=\"236604\" href=\"/#narrow/channel/236604-Zulip-meta/topic/.E2.9C.94.20Resolving.20topics/with/529715375\">#Zulip meta &gt; ✔ Resolving topics</a> but I see that as optional. What's important is the focus of the topic, whether participants have been heard, and that there is some kind of closure (in our minds).</p>\n<p>I often want to split off \"break-out\" topics from an initial starting topic. In an issue tracking system I'll do this with new \"issues\" (or \"discussions\" in GitHub). These \"break-out\" topics are no longer of broad interest and do not need to be adverstised or grab attension like the initial starting topic.</p>\n<p>So these \"break-out\" topics are somewhere in between <a class=\"stream-topic\" data-stream-id=\"236604\" href=\"/#narrow/channel/236604-Zulip-meta/topic/.E2.9C.94.20Topic.20for.20my.20own.20thoughts.3F/with/394726736\">#Zulip meta &gt; ✔ Topic for my own thoughts?</a> and new topics in the general channel. They are topics for a small audience that was already thinking about some background initial topic.</p>\n<p>In my particular instance, I am thinking about this topic I started:<br>\n<a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general/topic/Editor-decoupled.20file-watching.20proof-state-outputing.20tool/with/570099572\">#general &gt; Editor-decoupled file-watching proof-state-outputing tool</a> <br>\nand I now have multiple related break-out topics.</p>\n<p>Any advice on what is the best way to do \"break-out\" topics in Zulip? or maybe I should be doing \"break-out\" topics somewhere else like in GitHub as issues? or thinking about this differently?</p>",
        "id": 570849300,
        "sender_full_name": "Castedo Ellerman",
        "timestamp": 1769706137
    },
    {
        "content": "<p>Just make new threads and link to the old ones, threads are cheap. I think lots of people are in agreement with you about keeping threads focused on one topic (the one in the subject).</p>",
        "id": 570895436,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1769720995
    }
]