[
    {
        "content": "<p>I'm happy to announce that the <a href=\"https://leaning.in/#program\">program</a> is nearly full. Take a look to see what we're got in store. We still have space for a couple more talks, so if you'd like to show us what you're up to with Lean, please do consider submitting something! (<a href=\"https://leaning.in/#cfp\">Here</a> is the call for presentations.)</p>\n<p>I'm also happy to announce that we've secured a reservation at the nearby <a href=\"https://www.3schwestern.com\">3 Schwestern</a> restaurant. Dinner is optional, of course. But if you'd like to continue the discussion after the workshop, you're welcome to join. (Dinner at the restaurant is to be paid separately and is not included in the registration fee.) I will be in touch with those of you who have already registered to ask whether you'd like to join us at 3 Schwestern.</p>",
        "id": 497150608,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1738404080
    },
    {
        "content": "<p>Just checking if you've sent this out, because I haven't seen it in my inbox and would love to join.</p>",
        "id": 497851956,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1738749421
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"761203\">Vlad Tsyrklevich</span> <a href=\"#narrow/channel/476619-Leaning-In!/topic/Time.20and.20space.20are.20still.20available!/near/497851956\">said</a>:</p>\n<blockquote>\n<p>Just checking if you've sent this out, because I haven't seen it in my inbox and would love to join.</p>\n</blockquote>\n<p>I haven't sent it out yet -- but stay tuned! I'm a bit behind on things because I'm sick, unfortuantely. I can just manually add you to thel list of people who'd like to join us for dinner, though!</p>",
        "id": 497852942,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1738749714
    },
    {
        "content": "<p>We've got just one week to go until Leaning In! 2025!</p>\n<p>There's still space available for people to attend the event in person, so registration for in-person attendance is still open. Our program is set, though, so I'm afraid we don't have any more room for new talks. If you cannot make it in person, a remote registration option is available, too. Whether in-person or remote, just visit <a href=\"https://leaning.in\">the homepage</a> to find out more and register.</p>\n<p>Looking forward to see you all next week!</p>",
        "id": 503691011,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1741235507
    },
    {
        "content": "<p>Hi, I registered (and paid) some time last week but I never got any confirmation email.</p>",
        "id": 505012406,
        "sender_full_name": "Tainnor",
        "timestamp": 1741747818
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"685366\">Tainnor</span> <a href=\"#narrow/channel/476619-Leaning-In!/topic/Time.20and.20space.20are.20still.20available!/near/505012406\">said</a>:</p>\n<blockquote>\n<p>Hi, I registered (and paid) some time last week but I never got any confirmation email.</p>\n</blockquote>\n<p>I've sent you a DM to clarify the situation.</p>",
        "id": 505100515,
        "sender_full_name": "Jesse Alama",
        "timestamp": 1741778325
    }
]