[
    {
        "content": "<p>This question arises from trying to understand a discrepancy between the time that a commit to master happens and the time that the corresponding PR is closed.</p>\n<p>Is it true that for a pair <code>(commit to master, PR on GitHub)</code>, the time of the commit to master is <em>earlier</em> than the time a PR is closed?</p>\n<p>I imagine that the difference is roughly the time it takes to CI to make sure that the batch that contains the PR passes the various tests.</p>",
        "id": 455615733,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1722509602
    },
    {
        "content": "<p>The reason why I am asking for confirmation is that this puzzled me when writing a simple script to help Yaël scrape information about PRs in order to produce the \"Month in Mathlib\" posts.</p>",
        "id": 455615908,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1722509658
    },
    {
        "content": "<p>Presumably what you're seeing is that bors creates the commit, tests it (which takes a relevant amount of time), pushes the passing batch of commits to master, and then closes the PR</p>",
        "id": 455647851,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1722518689
    },
    {
        "content": "<p>Ok, thanks for confirming!  This is the same conclusion that I reached.  It puzzled me for a bit that there were some PRs that \"should have appeared in July\", but were in August and others the other way round.  I suspected that it was that CI had started in one month and finished in the next one.</p>",
        "id": 455648802,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1722518897
    },
    {
        "content": "<p>It had not occurred to me that the time that a PR is closed is different from the time that the commit is created -- this is why it took me so long to debug.</p>",
        "id": 455648976,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1722518943
    },
    {
        "content": "<p>Bors creates commits for the batch, puts them into branch <code>staging</code>, tests it, then resets <code>master</code> to <code>staging</code> and closes PRs.</p>",
        "id": 459688367,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1723292297
    },
    {
        "content": "<p>Great, I was surprised when I first noticed this, but all the confirmation are very comforting!</p>",
        "id": 459692496,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1723294370
    }
]