[
    {
        "content": "<p>I tried to make a textbook using Verso, as described in <a href=\"https://github.com/leanprover/verso/tree/main/examples/textbook\">https://github.com/leanprover/verso/tree/main/examples/textbook</a>. Here's the repo: <a href=\"https://github.com/suhr/Tintro\">https://github.com/suhr/Tintro</a></p>\n<p>However, I have got two problems with it:</p>\n<ol>\n<li>After renaming <code>DemoTextbook</code> to <code>Tintro</code> the book does not compile unless I comment <code>{include 1 Tintro.Nat}</code> in <code>Tintro.lean</code></li>\n<li>Running <code>lake exe textbook --output _out/html --depth 2</code> replaces <code>Tintro.lean</code> with an essentially empty file</li>\n</ol>\n<p>What could cause such a weird behavior and how do I fix this?</p>",
        "id": 524328601,
        "sender_full_name": "suhr",
        "timestamp": 1750105584
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span></p>",
        "id": 524415908,
        "sender_full_name": "suhr",
        "timestamp": 1750154767
    },
    {
        "content": "<p>I'm not sure what causes this specific issue, but if you want to experiment with the manual Genre, you can look at <a href=\"https://github.com/pimotte/analysis-book/tree/ca82569c3e3f9d51579153c9dc940188f7d96395\">this commit</a> for something that worked for me</p>",
        "id": 524428454,
        "sender_full_name": "Pim Otte",
        "timestamp": 1750159194
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"394485\">suhr</span> <a href=\"#narrow/channel/113488-general/topic/Making.20a.20textbook.20with.20verso/near/524328601\">said</a>:</p>\n<blockquote>\n<ol start=\"2\">\n<li>Running <code>lake exe textbook --output _out/html --depth 2</code> replaces <code>Tintro.lean</code> with an essentially empty file</li>\n</ol>\n</blockquote>\n<p>This was caused by a relative internal path to source code having become absolute. <a href=\"https://github.com/leanprover/verso/pull/439\">https://github.com/leanprover/verso/pull/439</a> fixes it - thanks for letting me know!</p>",
        "id": 524435246,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1750161279
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"394485\">suhr</span> <a href=\"#narrow/channel/113488-general/topic/Making.20a.20textbook.20with.20verso/near/524328601\">said</a>:</p>\n<blockquote>\n<ol>\n<li>After renaming <code>DemoTextbook</code> to <code>Tintro</code> the book does not compile unless I comment <code>{include 1 Tintro.Nat}</code> in <code>Tintro.lean</code></li>\n</ol>\n</blockquote>\n<p>The problem here is that the module in question does not contain a Verso document.</p>\n<p>The bug that was emptying files wasn't emptying them _per se_ - that project contains an example of the kinds of things authors can build in Verso, in this case the ability to extract code examples to standalone Lean modules when the book is built (e.g. to offer as a tarball for download). The extracted code examples were supposed to be placed in the output directory, with a filename determined by the filename of the chapter, but due to the bug, they were overwriting the original file. I suspect that you got bit by that without realizing it, and committed the rewritten file. Try reverting it to the original version, and I think the problem will go away.</p>\n<p>I'm very sorry for taking your time up with this bug, and thanks for letting me know!</p>",
        "id": 524435912,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1750161501
    },
    {
        "content": "<p>Now it works, thanks. I'll mark the thread as resolved, but if I get more questions, I'll ask them here.</p>",
        "id": 524439162,
        "sender_full_name": "suhr",
        "timestamp": 1750162626
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"394485\">suhr</span> has marked this topic as resolved.</p>",
        "id": 524439180,
        "sender_full_name": "Notification Bot",
        "timestamp": 1750162632
    },
    {
        "content": "<p>Certainly! Thank you!</p>",
        "id": 524439214,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1750162645
    },
    {
        "content": "<p>I tried to add a new chapter into the book. But using <code>{include 1 Tintro.Ind}</code> results in the following error: <code>unknown constant 'Tintro.Ind.«the canonical document object name»</code>. Even though <code>Ind.lean</code> has the same structure as <code>Nat.lean</code>.</p>",
        "id": 524557348,
        "sender_full_name": "suhr",
        "timestamp": 1750187225
    },
    {
        "content": "<p>Is the module imported at the top of the file?</p>",
        "id": 524582767,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1750188723
    },
    {
        "content": "<p>Oh. That was a silly mistake, thanks.</p>",
        "id": 524585568,
        "sender_full_name": "suhr",
        "timestamp": 1750189835
    },
    {
        "content": "<p>Also a cryptic error message :⁠-⁠)</p>",
        "id": 524587042,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1750190427
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"394485\">suhr</span> <a href=\"#narrow/channel/113488-general/topic/.E2.9C.94.20Making.20a.20textbook.20with.20verso/near/524557348\">zei</a>:</p>\n<blockquote>\n<p>I tried to add a new chapter into the book. But using <code>{include 1 Tintro.Ind}</code> results in the following error: <code>unknown constant 'Tintro.Ind.«the canonical document object name»</code>. Even though <code>Ind.lean</code> has the same structure as <code>Nat.lean</code>.</p>\n</blockquote>\n<p>Did you end up making the textbook? I was also looking into <code>verso</code>  today but I didn't understand very well what it should be used for. Is it a Lean -&gt; HTML converter?</p>",
        "id": 525178805,
        "sender_full_name": "Willem vanhulle",
        "timestamp": 1750540398
    },
    {
        "content": "<blockquote>\n<p>Did you end up making the textbook?</p>\n</blockquote>\n<p>A stub of the textbook. I still need to write the text of the book.</p>\n<blockquote>\n<p>Is it a Lean -&gt; HTML converter?</p>\n</blockquote>\n<p>It is. Think of <a href=\"https://www.sphinx-doc.org/\">https://www.sphinx-doc.org/</a>, but deeply integrated with Lean.</p>",
        "id": 525183355,
        "sender_full_name": "suhr",
        "timestamp": 1750548648
    },
    {
        "content": "<p>I'd describe Verso as really being two things:</p>\n<ol>\n<li>A Lean library for putting together tools for writing about Lean, along with some conventions to make these tools interoperable</li>\n<li>A collection of tools built with the library</li>\n</ol>\n<p>Right now, part 1 consists of:</p>\n<ul>\n<li>A mostly-Markup-compatible concrete markup language, embedded in Lean. This is somewhere between something like <a href=\"https://docs.racket-lang.org/scribble/index.html\">Scribble</a> and Sphinx's ReST. Unlike ReST, Verso documents are just Lean files, and extensions to the Verso markup language are ordinary Lean code.</li>\n<li>A fairly robust library for emitting HTML, and an immature one for emitting LaTeX.</li>\n<li>A library for extracting code and metadata from Lean projects that works with all Lean releases, in order to allow things like a website where different blog posts present example code in different versions of Lean, or a book where a chapter compares and contrasts versions</li>\n<li>A paradigm for arranging documentation tools into \"genres\" such as websites, books/manuals, research papers, interactive tutorials, etc</li>\n<li>A very new tool that corresponds to <a href=\"https://www.sphinx-doc.org/en/master/usage/extensions/intersphinx.html\">InterSphinx</a> for automatically maintaining links between Verso documents. It will be eventually usable in any genre that supports HTML output.</li>\n</ul>\n<p>Part 2 consists of a static site generator for websites/blogs, which is used for the Lean site and the FRO site, and a generator for book-style documents that's used for the Lean language reference. There is space for many more genres in the future, and users can create their own and distribute them independently, what with Verso being just a normal Lean library.</p>",
        "id": 525330399,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1750684826
    },
    {
        "content": "<p>By the way, did you see <a href=\"https://mystmd.org/spec/\">https://mystmd.org/spec/</a>?</p>",
        "id": 525331666,
        "sender_full_name": "suhr",
        "timestamp": 1750685142
    },
    {
        "content": "<p>I think supporting this style of blocks is not a bad idea.</p>",
        "id": 525334470,
        "sender_full_name": "suhr",
        "timestamp": 1750685836
    },
    {
        "content": "<p>Yes, adopting MyST was one of the possibilities I considered, along with Djot and ReST.</p>\n<p>Fundamentally, Markdown has some design decisions that get in the way of using it in Verso:</p>\n<ul>\n<li>There's lots of crufty old syntax that is not widely used, and complicates both the implementation and the user experience, like 4-space-indented code blocks, underlined headers, and the fact that there are no syntax errors (as an author, I want red squigglies in my editor when I forget a closing backtick, not a code entity that extends much further to the right than I'd expected)</li>\n<li>Parsing Markdown needs two passes: one to discover forward-referenced link names, and another that uses that knowledge to make parsing decisions. This doesn't fit well with the general Lean interaction model.</li>\n<li>The semantics of headers and nesting are poorly specified and give inconsistent results, esp. when writing a document in multiple files and assembling them via includes. Verso makes all headers relative to the current file, and does all inclusion structurally rather than textually.</li>\n</ul>\n<p>MyST inherits these, and it's generally just a lot more complicated than Verso. So Verso markup picks the most-used features of Markdown, and is compatible with the way that most people use them, with one exception (two stars for bold, for various reasons that I don't have time to get into at the moment - Verso uses star for bold and underscore for italic, using the quantity of delimiters to allow nesting, just as Markdown does for code). I think MyST makes a lot of sense as an alternative Sphinx frontend, but it wouldn't have worked well here.</p>",
        "id": 525350619,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1750690351
    },
    {
        "content": "<p>In <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a>, command output (for example, output of the <code>#check</code> command) is included in a code block. In contrast, in Verso by default command output is not shown inside a code block (you need to hover over the command to see the output).</p>\n<p>How to include the command output into a code block, like it is done in <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a>?</p>",
        "id": 558391818,
        "sender_full_name": "suhr",
        "timestamp": 1763633416
    }
]