[
    {
        "content": "<p>I am having an issue with running a clone of the Analysis 1 Lean companion by Terrence Tao, it seems that <strong>lake can't install the proofWidgets package</strong>.</p>\n<p>I am running it in VSCode in WSL2 using the Lean4 extension and it seems that whenever I try the command the Lean extension suggests I first need to run the command <code>$ source ~/.profile</code><br>\n then the recommended <code>$ lake exe cache</code> get which then is running without error and the file (after restarting the lean extension) giving the error <code>error: ProofWidgets not up-to-date. Please run </code>lake exe cache get<code> to fetch the latest ProofWidgets. If this does not work, report your issue on the Lean Zulip.</code>.</p>\n<p>any help would be appreciated since I would like to continue working in vsCode with the extension running lake and elan etc. Though if there is no fix I can at least for now also work it in a non WSL2 window of VSCode.</p>",
        "id": 528735362,
        "sender_full_name": "Amarantino",
        "timestamp": 1752525080
    },
    {
        "content": "<p>Have you tried running <code>lake clean</code>, <code>lake update</code>, <code>lake exe cache get</code>, <code>lake build</code>?</p>",
        "id": 528737887,
        "sender_full_name": "Justin Asher",
        "timestamp": 1752526133
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"937873\">Amarantino</span> has marked this topic as resolved.</p>",
        "id": 528738737,
        "sender_full_name": "Notification Bot",
        "timestamp": 1752526477
    },
    {
        "content": "<p>Thank you that resolved the issue. I 'knew' those types of commands exist in something like Node for Javascript package handling but did not know the commands for lake and Lean.</p>",
        "id": 528738905,
        "sender_full_name": "Amarantino",
        "timestamp": 1752526536
    },
    {
        "content": "<p>for anyone else reading this after having the same issue, make sure to cd into the project folder with the lake files as well, some repos appear to have multiple so just make sure you are cd'd into the correct one</p>",
        "id": 528739082,
        "sender_full_name": "Amarantino",
        "timestamp": 1752526611
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"937873\">Amarantino</span> <a href=\"#narrow/channel/113488-general/topic/.E2.9C.94.20Packages.20Help/near/528738905\">said</a>:</p>\n<blockquote>\n<p>Thank you that resolved the issue. I 'knew' those types of commands exist in something like Node for Javascript package handling but did not know the commands for lake and Lean.</p>\n</blockquote>\n<p>Happy to help.</p>",
        "id": 528739335,
        "sender_full_name": "Justin Asher",
        "timestamp": 1752526714
    }
]