[
    {
        "content": "<p>why? If there is an instance of the Ord class, it is possible to create an instance of LE or LT, since they are comparable, and it should be automatic.</p>",
        "id": 482658527,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1731690962
    },
    {
        "content": "<p>I think there is a reason for this - please tell me why you don't want to automatically create instances of LE etc. from instances of the Ord class.</p>",
        "id": 482658664,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1731691001
    },
    {
        "content": "<p>You can do <code>attribute [local instance] leOfOrd</code> if you like.</p>\n<p>Creating instances like this automatically is dangerous. A type like <code>Nat</code> might want to implement <code>LE</code>, <code>LT</code>, <code>Ord</code>, <code>BEq</code>, etc., all separately to provide the most performant implementation for each. But if <code>leOfOrd</code> was a global instance, then there would be two instances of <code>LE Nat</code> which are not definitionally equal. This can lead to problems: if a function somewhere in the library only expects <code>Ord</code> as an argument but uses <code>LE</code> in its definition, then that will always use the <code>leOfOrd</code> instance, so it will use the wrong implementation of <code>LE</code> when called on a natural numbers. Even worse, if you apply a theorem about that function, you might end up with a goal about <code>a ≤ b</code> for natural numbers a and b but this is actuall the wrong ≤ so none of the theorems about inqualities of natural numbers will apply.</p>\n<p>A better way to handle this would be for definitions to expect all of the instances independently and for theorems to expect <code>Prop</code>-valued typeclasses that express compatibilities between these instances. These typeclasses don't exist in Core at the moment, but Batteries has a few, like <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Batteries.LawfulCmp#doc\">docs#Batteries.LawfulCmp</a>. In the future, Core might introduce classes that are similar to these.</p>",
        "id": 482661018,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1731691738
    },
    {
        "content": "<p>thanks!</p>",
        "id": 482662628,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1731692262
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"626349\">Asei Inoue</span> has marked this topic as resolved.</p>",
        "id": 482880283,
        "sender_full_name": "Notification Bot",
        "timestamp": 1731864354
    }
]