[
    {
        "content": "<p>Hi, I was asked to add an instance <code>uniformMeasure.isProbabilityMeasure</code> (actually .isFiniteMeasure) to my PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/10456\">#10456</a>, but both instances produce an error on the last build; I'm not entirely sure how to fix this. I first got the error when I used <code>(hns : ...)</code> instead of <code>{hns : ...}</code>, but that does not seem to fix it..</p>",
        "id": 421418618,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1707907675
    },
    {
        "content": "<p>The idea is as follows: the typeclass system wants to apply your new instance to solve a goal, so it has to figure out which arguments to apply it to. It knows only two way to find arguments: either by typeclass search (for \"instance-implicit\" arguments between <code>[square brackets]</code>) or by unification (the same process that is used normally for \"implicit\" arguments between <code>{curly brackets}</code>). For unification basically we need to check that the argument literally appears in the goal (i.e. the return type of the instance) or in some other argument. The linter checks that it indeed is possible to do so. <code>hns</code> and <code>hnt</code> aren't in <code>[square brackets]</code> and don't occur in the goal, so it rightfully complains.</p>",
        "id": 421435742,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1707914266
    },
    {
        "content": "<p>Looking at your code without too much knowledge of this part of the library, I think it's not possible to declare these instances because <code>hns</code> and <code>hnt</code> are really required. So these <code>instance</code>s should be <code>def</code>/<code>theorem</code>.</p>",
        "id": 421435965,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1707914353
    },
    {
        "content": "<p>Thank you, that clarifies it! If you don’t mind me asking, what is the underlying reason that I don’t get the same problem locally on my own device?</p>",
        "id": 421436287,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1707914487
    },
    {
        "content": "<p>This error comes from the linting command: if you write <code>#lint</code> at the bottom of your file you should see the same error on your machine.</p>",
        "id": 421439381,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1707915557
    },
    {
        "content": "<p>Excellent, thank you!</p>",
        "id": 421439451,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1707915582
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"673728\">Josha Dekker</span> has marked this topic as resolved.</p>",
        "id": 421439562,
        "sender_full_name": "Notification Bot",
        "timestamp": 1707915608
    }
]