[
    {
        "content": "<p>Some colleague asked me something to read about how maths can be built on various kinds of foundations. I think <a href=\"https://arxiv.org/pdf/2009.09541\">https://arxiv.org/pdf/2009.09541</a> is a bit too technical and my colleague wants something a bit more philosophical. Does <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span> or anyone else has something to recommend? Jeremy don’t hesitate to self-recommend another of your writings.</p>",
        "id": 492137348,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1736180729
    },
    {
        "content": "<p>After thinking about it for a few minutes, I am having a hard time coming up with suggestions. From the point of view of mathematics, axiomatic foundations are underground, which is to say, you never see them. If you do mathematics, you need to talk about numbers, sets, functions, relations, and algebraic structures, and the foundations are supposed to give you the rules: they tell you what things exist and how to reason about them. Beyond that, the details are all technical: the only way to explain set theory is to give a list of the axioms and show how to use them, and the only way to explain type theory is to give a list of rules and show how to use them.</p>\n<p>There are lots of introductory books that explain how mathematics is built up from set theory. Halmos' book, <a href=\"https://www.amazon.com/Naive-Theory-Undergraduate-Texts-Mathematics/dp/0387900926\">Naive Set Theory</a>, is almost a classic. For type theory, TPIL and MIL give as friendly an introduction to the rules of type theory and how to use them as any, I think. The first chapter of the <a href=\"https://homotopytypetheory.org/book/\">HoTT book</a> may also be helpful.</p>\n<p>If your colleague is looking for more of a story about where the axioms and rules come from, <a href=\"https://plato.stanford.edu/entries/settheory-early/\">this article</a> by Ferreiros is a good starting point for the history of set theory and <a href=\"https://intuitionistic.wordpress.com/wp-content/uploads/2010/07/martin-lof-tt.pdf\">Martin Löf's early monograph</a> wraps the presentation of the theory is the constructivist story of what the rules mean. Benacerraf and Putnam's <a href=\"https://www.academia.edu/34404710/Philosophy_of_mathematics_Selected_readings_SECOND_EDITION\">classic sourcebook</a> is a good collection of early essays on foundations of mathematics and what they mean.</p>",
        "id": 492158366,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1736187670
    },
    {
        "content": "<p>Thanks. To be honest the question is a bit vague, especially since it went through several layers (a colleague in Orsay asked me because someone else asked him). But I think part of the question is why we still manage to do math without caring about foundations, and what would it change if more people cared?</p>",
        "id": 492158906,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1736187890
    },
    {
        "content": "<p>So I was brought up thinking that set theory was the foundations of mathematics (and I was confident that I really could build up mathematics from scratch within ZFC) and that everything else was esoteric. When Jeremy taught me type theory via <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a> I could then compare and contrast the two ways of doing things. I think that the comparison really helped me a lot. Three examples I can flag:</p>\n<p>In both set theory and type theory, the complexes are the reals adjoin a square root of -1, the reals are the completion of the rationals, the rationals are the field of fractions of the integers, and the integers are the additive-groupification of the naturals. So this must be mathematics. And then what are the naturals? The answers in set theory and type theory couldn't be more different. But if you asked Gauss what the naturals were he would just say that they exist by definition and that's the end of it, and indeed I'm sure that there are plenty of people in my department who would not be able to answer the question \"what are the naturals\" even though they would happily give the above answers for the integers, reals, rationals etc. A foundation for mathematics needs to construct them but it seems to me that this is no longer mathematics, but something else.</p>\n<p>The next example: what is a group? I was told in 1st year that a group was a collection of elements equipped with a multiplication satisfying some axioms (and that was what Galois thought a group was too, before the invention of the set); I was told in 3rd year set theory how to make ordered quadruples and then that a group was a set which was an ordered quadruple (G,*,1,^{-1}), and then in TPIL I was told that a group was a structure, which was a special kind of inductive type (and mathlib tells me that a group is a structure with 16 fields). But all of these constructions are just a model for \"a group is a collection of elements equipped with a multiplication and satisfying some axioms\". It doesn't matter how you model such a thing (ordered quadruples or ordered 16-tuples or inductive types or whatever), all that matters is that it's possible to give a definition of a group which works the way we think it works.</p>\n<p>Finally quotients: I was told in 1st year that a collection of stuff was called a set, and you can quotient out a set by an equivalence relation by making a set of sets (and I was told in 3rd year set theory that not only were sets of sets were allowed, but in fact furthermore all sets are sets of sets, which came as some surprise). I was told in TPIL that a collection of stuff was called a type, and you can quotient out a type by an equivalence relation and you get the same type but with <code>=</code> redefined to mean <code>~</code>. Again it completely doesn't matter what is going on under the hood though, because the only thing you use about the quotient is the universal property (something stressed to me by Patrick a long time ago) so who cares what's going on under the hood.</p>\n<p>These are three examples where you can see where set theory and type theory completely diverge in how they manage the actual <em>construction</em> of various standard concepts (the naturals, a group, quotients) under the hood, but the thing which the set theorists and type theorists agree upon is all the mathematical facts about these things (Peano's axioms for the naturals, the axioms of a group, the universal property of quotients). How these facts are proved (are they theorems? axioms?) or how these objects are defined in whatever foundation is currently fashionable is of no relevance to a working mathematician unless they actively decide to study a foundational system itself.</p>",
        "id": 492166576,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1736190729
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/channel/113488-general/topic/Text.20about.20foundations.20diversity/near/492158906\">said</a>:</p>\n<blockquote>\n<p>and what would it change if more people cared?</p>\n</blockquote>\n<p>Gauss and Euler and Riemann didn't know the first thing about foundations so I'm tempted to say that it would change nothing.</p>",
        "id": 492168867,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1736191578
    },
    {
        "content": "<p>(I wrote most of this before writing Kevin's last message, so it's not reflected in my response.)</p>\n<p>First, a disclaimer: in the philosophy of mathematics in the second half of the 20th century, people were stuck on questions about the proper foundation for mathematics, how we know the axioms are true, etc. I think these questions are played out and uninteresting, and I try to avoid them.</p>\n<p>That said, the history of axiomatic foundations has had an important influence on the history of mathematics. In the early 20th century, informal mathematics and our formal descriptions evolved hand in hand. Through the beginning of the 19th century, mathematics had a very computational flavor: geometry was about geometric constructions, analysis was about calculating the motion of the planets and such, algebra was about solving equations, probability was about calculating odds, and so on. The modern \"conceptual\" view that mathematics isn't about calculation but about a conceptual understanding of mathematical objects first started to gain traction in the second half of the 19th century, and it was controversial. (Here's an <a href=\"https://www.andrew.cmu.edu/user/avigad/Papers/dedekind.pdf\">old paper of mine</a> that tells at least part of that story.) In practical terms, the new \"conceptual\" methods involved reasoning abstractly about infinite sets and structures in ways that were often impossible to interpret in computational terms, such as:</p>\n<ul>\n<li>arguments in analysis, like the Bolzano-Weierstrass theorem, where you make sequences of infinitary choices with no algorithmic interpretation</li>\n<li>similar arguments in algebra, like proofs of the Hilbert basis theorem</li>\n<li>reasoning about quotient structures, e.g. defining a new group whose elements are equivalence classes of elements from another group. (Remember that this is before set theory; how are you supposed to consider a system of objects to be a single object?)</li>\n<li>impredicative definitions, like defining the ideal generated by some elements to be the intersection of all the ideals that contain those elements (including the very ideal you are defining!).</li>\n</ul>\n<p>At the turn of the 20th century, there were serious practical questions about the right way to do mathematics. The set-theoretic paradoxes and the famous <a href=\"https://math.i-learn.unito.it/pluginfile.php/72426/mod_resource/content/0/Cinq_Lettres_trad_inglese.pdf\">five letters</a> between the French analysis about the axiom of choice raised even more issues. The development of axiomatic theories like set theory and type theory at that time was designed to make sense of the new ideas and methods that were making their way into mathematics. When mathematicians argued about whether or not they should use the axiom of choice, it was helpful to have a formal statement of the axiom, so at least, in principle, it was clear what they were arguing about.</p>\n<p>Today, these debates have died down. Most mathematicians are happy to take ZFC (maybe with some inaccessibles) as the official foundation for mathematics, and most mathematical argumentation can be understood in those terms. People who argue for categorical foundations or HoTT or something else are generally <em>not</em> arguing that there are parts of mathematics that can't, one way or another, be defined in terms of set theory, but that other foundations are more faithful to styles of mathematical reasoning that are not well captured by set theory.</p>\n<p>Then, of course, there is the practical question of what foundation to implement in a proof assistant for mathematics. My personal theology takes set theory to be the official foundation for mathematics (it's simple, it's intuitive, it has been around for a while, and it works), but, as I have often argued, there are good reasons to use dependent type theory in a proof assistant. For someone interested in <em>that</em> debate, the only way to get a handle on it is to spend some time understanding how the choice of foundation bears on how things look in a proof assistant, which is what that survey does.</p>\n<p>Sorry to go on for so long. That's what you get when you ask me about axiomatic foundations. A short(er) answer to your question is this:</p>\n<ul>\n<li>\n<p>People cared about foundations in the early 20th century because they were trying to figure out how to do mathematics, and formal axiomatic systems helped people make sense of the issues. For someone interested in that, I recommend looking at the history of foundational debates in the early 20th century.</p>\n</li>\n<li>\n<p>People care about foundations now insofar as they are using proof assistants and the choice of foundation bears on how they interact with the system. For someone interested in that, I recommend learning more about how the choice of foundation influences what the proof assistant looks like (which is what the survey tries to explain).</p>\n</li>\n<li>\n<p>Several people are interested in HoTT because they think it provides a better way of capturing and carrying out reasoning in some branches of mathematics, like higher category theory. Someone interested in that should look into the HoTT literature.</p>\n</li>\n<li>\n<p>There are important questions facing the mathematics community today about how to do mathematics and what is important in mathematics, especially in light of AI and other new technologies. I don't think learning about axiomatic foundations will help with those.</p>\n</li>\n</ul>",
        "id": 492173106,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1736193197
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110865\">Jeremy Avigad</span> <a href=\"#narrow/channel/113488-general/topic/Text.20about.20foundations.20diversity/near/492173106\">said</a>:</p>\n<blockquote>\n<p>My personal theology takes set theory to be the official foundation for mathematics (it's simple, it's intuitive, it has been around for a while, and it works)</p>\n</blockquote>\n<p>This is interesting, because I find the \"it's intuitive\" claim to be false. One of the reasons I much prefer type theory as a mathematical foundation is that the out-of-the-box theory is much closer to mathematics as practiced (e.g., functions are primitives, and defining ordered pairs, tuples, disjoint unions etc. are all simple and natural), whereas the set-theoretic counterpart involves a bunch of \"encodings\" of various sorts.</p>\n<p>Now, that's not to say there isn't value in having the set-theoretic foundations as an alternative. It's nice to have something which has less moving parts (i.e., first-order logic + two primitives).</p>",
        "id": 492177509,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1736194795
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110865\">Jeremy Avigad</span> <a href=\"#narrow/channel/113488-general/topic/Text.20about.20foundations.20diversity/near/492173106\">said</a>:</p>\n<blockquote>\n<p>Sorry to go on for so long</p>\n</blockquote>\n<p>absolutely no need to apologise, this is all very interesting and new to me <span aria-label=\"star struck\" class=\"emoji emoji-1f929\" role=\"img\" title=\"star struck\">:star_struck:</span></p>",
        "id": 492178146,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1736195021
    },
    {
        "content": "<p>Thanks for the interesting links <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span></p>",
        "id": 492184473,
        "sender_full_name": "Artie Khovanov",
        "timestamp": 1736197327
    },
    {
        "content": "<p>Thank you very much Kevin and Jeremy! I wasn’t expecting you to spend all this time writing answers, I was only hoping for urls.</p>",
        "id": 492185439,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1736197694
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197836\">Jireh Loreaux</span> <a href=\"#narrow/channel/113488-general/topic/Text.20about.20foundations.20diversity/near/492177509\">said</a>:</p>\n<blockquote>\n<p>This is interesting, because I find the \"it's intuitive\" claim to be false. One of the reasons I much prefer type theory as a mathematical foundation is that the out-of-the-box theory is much closer to mathematics as practiced</p>\n</blockquote>\n<p>I agree that type theory does a better job of describing the ordinary practice of mathematics, but as an axiomatic system, it's pretty complicated and mysterious. The rules for inductive types and universes are like the legal end-user agreements that nobody has the patience to read. Does the fine print really convince you that there is no devious way of proving 2 + 2 = 5? In contrast, the set-theoretic axioms tell a plausible story about sets. The reason I believe in inductive types is that I can interpret them as inductively defined objects in set theory, and the set-theoretic principles for constructing such objects seem reasonable to me.</p>\n<p>That said, I also believe that there is no reason to argue about foundations. As long as I can understand your foundation in my preferred terms and you can understand my foundation in your preferred terms, we can all get along just fine. That's why I referred to it as \"personal theology.\" I support freedom of religion.</p>",
        "id": 492187821,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1736198616
    },
    {
        "content": "<p>I'd like to submit this foundations of entropy:</p>\n<p><a href=\"https://arxiv.org/abs/2012.02113\">https://arxiv.org/abs/2012.02113</a></p>",
        "id": 492190758,
        "sender_full_name": "Dean Young",
        "timestamp": 1736199682
    },
    {
        "content": "<p>I am mostly in the same camp as Jeremy (set theory is the state religion, but I'd much rather use DTT in an ITP). Even if you aren't interested in using set-theoretic foundations for actually <em>doing</em> mathematics, one thing that they (and related weaker systems) are great at is comparing the strength of different systems. The proof that Lean's type theory is equiconsistent with ZFC + \"there exist <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ω</mi></mrow><annotation encoding=\"application/x-tex\">\\omega</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">ω</span></span></span></span> inaccessibles\" gives more information than any intrinsic analysis could, at least with current techniques.</p>",
        "id": 492344259,
        "sender_full_name": "Cameron Zwarich",
        "timestamp": 1736267488
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"375581\">François Sunatori</span> has marked this topic as resolved.</p>",
        "id": 492510880,
        "sender_full_name": "Notification Bot",
        "timestamp": 1736344905
    }
]