[
    {
        "content": "<p>Hi, everyone.  I'm new to Lean.  I was a novice Coq user but have recently decided to devote myself to lean since it feels more friendly to mathematicians.  Anyways, I'm also new to Zulip so I'm not sure if this is the format for asking questions.  So if it's not, surely an admin can help me make a correction.  </p>\n<p>I'm creating a class that extends classes x_1 and x_2. However,  x_1 and x_2 both extend class z.  Thus, they share a field.  </p>\n<p>I'm receiving an error message saying \"Invalid 'structure' header\" because one of the fields in x_1 was already declared by x_2.</p>\n<p>Does Lean have some kind of mechanism that I can use to avoid this error message?  I feel like Lean should be smart enough to know that<br>\nif I'm extending two classes, and they share a field that it should only be declared once.</p>",
        "id": 268935903,
        "sender_full_name": "Jonathan Whitehead",
        "timestamp": 1642825371
    },
    {
        "content": "<p><code>set_option old_structure_cmd true</code> might do the trick</p>",
        "id": 268941012,
        "sender_full_name": "Thomas Browning",
        "timestamp": 1642833011
    },
    {
        "content": "<p>By George it worked.  Thanks!</p>",
        "id": 268943142,
        "sender_full_name": "Jonathan Whitehead",
        "timestamp": 1642836081
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"472585\">Jonathan Whitehead</span> has marked this topic as resolved.</p>",
        "id": 268943191,
        "sender_full_name": "Notification Bot",
        "timestamp": 1642836128
    },
    {
        "content": "<p>Just to follow up, why is this not the default option?  Is this an indicator that I'm not using Lean the way it was intended?  And will I get into trouble later on down the road for writing classes like this?</p>",
        "id": 268943280,
        "sender_full_name": "Jonathan Whitehead",
        "timestamp": 1642836293
    },
    {
        "content": "<p>It's old style, as indicated by the option name. The idea is now to give a preferred parent, copy all fields from other parents and declare them as low priority instances.</p>",
        "id": 268946700,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1642841637
    },
    {
        "content": "<p>It is hard to say without more information about the classes you're trying to define.</p>",
        "id": 268948288,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642843827
    }
]