[
    {
        "content": "<p>Apologies if this is answered somewhere--my searches didn't turn up anything.  I like the angle bracket syntax for Sigma pairs, but nearly all of the fonts I have installed make them look almost like parentheses unless I make the font size very large.  (The exception among the fonts I have is horribly ugly.)  </p>\n<p>(I'm using lean.nvim with neovim running in a gui front end, Goneovim, but I imagine I would be able to use many fixed-width fonts.)</p>\n<p>Since it appears that readily distinguishable angle brackets is not a priority for many fixed-width fonts, I'd be interested in any suggestions you have.  I'm not using a lot of Unicode, but who knows in the future, so doing well with other math symbols is obviously a plus.  \"Font with easily distinguishable angle brackets\" is not a useful web search string. :-)</p>",
        "id": 425603550,
        "sender_full_name": "mars0i",
        "timestamp": 1709930372
    },
    {
        "content": "<p>Sorry--I found the solution in a <a href=\"#narrow/stream/113488-general/topic/Loogle.3A.20font/near/401336419\">question on a partially related topic</a>: <a href=\"https://www.jetbrains.com/lp/mono/\">JetBrains Mono</a> is perfect.  I had to try it out to realize that.</p>",
        "id": 425615404,
        "sender_full_name": "mars0i",
        "timestamp": 1709935862
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"617444\">mars0i</span> has marked this topic as resolved.</p>",
        "id": 425615421,
        "sender_full_name": "Notification Bot",
        "timestamp": 1709935869
    },
    {
        "content": "<p>I use Iosevka and they look great there</p>",
        "id": 425700626,
        "sender_full_name": "Max Nowak 🐉",
        "timestamp": 1710002350
    },
    {
        "content": "<p>People here have mentioned Julia Mono, which I find to be great for Lean. I only use it for Lean (i.e. I use a different editor for Lean than everything else), so I can't speak to how it looks for anything else.</p>",
        "id": 425709261,
        "sender_full_name": "llllvvuu",
        "timestamp": 1710009027
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"416280\">@Max Nowak 🐉</span>, <span class=\"user-mention\" data-user-id=\"607118\">@llllvvuu</span>.  Good to have additional options--I've installed both now.  I agree about Iosevka's angle brackets.  In my editor at my normal font size, the angle brackets in JuliaMono aren't as distinguishable as I'd like, but I might use it for something else.  I figured out yesterday that I can set a different font for Lean in vim/neovim using e.g. <code>autocmd filetype lean set guifont=JetBrains\\ Mono\\ NL:h13</code>.</p>",
        "id": 425714597,
        "sender_full_name": "mars0i",
        "timestamp": 1710014271
    }
]