[
    {
        "content": "<p>Hi, I just came across <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> 's Ren Phil <a href=\"https://www.renaissancephilanthropy.org/a-dataset-of-modern-formalized-theorem-statements\">proposal</a>. Is this list of statements published anywhere?</p>",
        "id": 562361717,
        "sender_full_name": "Vasily Ilin",
        "timestamp": 1765145703
    },
    {
        "content": "<p>There's nothing public but right now we're working on statements from papers from the Annals of Mathematics published since 2020, although we might expand our horizons later. It seems a bit ridiculous to just publish 10 statements so we're waiting until we have a substantial amount which will maybe take us another year or so?</p>",
        "id": 562366457,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765146997
    },
    {
        "content": "<p>Got it, thank you for the answer!<br>\nIs there just a list of already formalized research papers? Not the statements themselves but just the papers.</p>",
        "id": 562371104,
        "sender_full_name": "Vasily Ilin",
        "timestamp": 1765152652
    },
    {
        "content": "<p>No.</p>",
        "id": 562402991,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765180257
    },
    {
        "content": "<p>How will dependencies between definitions be modeled, or papers that depend on each other? Different packages, one big package or statements in each paper individually?</p>\n<p>One thing I'm really missing from current datasets, is that they take a \"problem and proof\" approach, each one self-contained. Of course, this is too rigid to model research-level mathematics, since the definitions need to be written first.  Of course, you could simply take mathlib, the flt project or any other big lean project as a dataset. However, I'm not sure how well this works. I wonder if the tech companies are doing this and whether there are some important limitations.</p>",
        "id": 562471919,
        "sender_full_name": "Adrian Marti",
        "timestamp": 1765201955
    },
    {
        "content": "<p>When we are ready, which could well take a year, we will announce something, but it is to premature to talk about it now.</p>",
        "id": 562482375,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765204558
    }
]