[
    {
        "content": "<p>Hello everyone,</p>\n<p>I've formalized a logic, let's call it <strong>L</strong>, in Lean. My goal is to translate a portion of Mathlib—specifically, a theory <strong>T</strong>—into <strong>L</strong>.</p>\n<p>This means I want to write a program that can translate both the statements and proofs of theory <strong>T</strong> from Mathlib into the syntax of <strong>L</strong>, which is itself written in Lean.</p>\n<p>First, does this question make sense, especially given that <strong>L</strong> is already defined within Lean's syntax?</p>\n<p>If so, I would appreciate any suggestions on how to approach this. <br>\nDoes this involve metaprogramming?</p>",
        "id": 539534244,
        "sender_full_name": "Farzad Jafarrahmani",
        "timestamp": 1757936838
    },
    {
        "content": "<p>i think this question makes sense: you have (presumably) defined a type of statements in your logic, and would like a way to turn a term in lean into a term or statement (in lean) in your logic.</p>\n<p>indeed, since you (most likely) will need to inspect the lean term, metaprogramming will be necessary</p>",
        "id": 539536432,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1757937447
    },
    {
        "content": "<p>Thanks for your reply!</p>\n<p>I was worried about how to distinguish these two terms—one of L and one of T—since both are ultimately represented using the same underlying type theory of lean.</p>\n<p>Anyway, as you said, I think I need to inspect the Lean terms via metaprogramming to see what can be done.</p>",
        "id": 539539578,
        "sender_full_name": "Farzad Jafarrahmani",
        "timestamp": 1757938292
    },
    {
        "content": "<p>Just for completeness sake: you can of course specify the translation manually without using metaprogramming as Lean functions (but then it will only work for the concrete fragment of Mathlib for which you define the translation.), i. e. if your <strong>T</strong> is fixed, you might get away without metaprogramming</p>",
        "id": 540572219,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1758359682
    },
    {
        "content": "<p>Thanks for your comment! <br>\nActually, my T is a fixed theory, let'say Mathlib.Geometry.Euclidean.<br>\nBut I do not see how I can get away without metaprogramming. <br>\nNevertheless, I need to work with the lean terms for the statements and theorems in this fragment of Mathlib which is accessible via metaprogramming. <br>\nAm I missing something?</p>",
        "id": 544508121,
        "sender_full_name": "Farzad Jafarrahmani",
        "timestamp": 1760349321
    }
]