[
    {
        "content": "<p>Hi. I was wondering if you'd think it's a good idea to add definitions and theorems <strong>book by book</strong> (i.e., write down everything from the famous reference X in the field Y)?</p>\n<p>I think it would help mathematicians in the future use their desired lemmas. For instance, you could open up the book, find the lemma you need, and then look up its Lean equivalent on the database, according to a naming convention, or maybe just by browsing through the library repo.</p>\n<p>(Searched; didn't find similar earlier discussion.)</p>",
        "id": 442075952,
        "sender_full_name": "Ali Hadizadeh Moghadam",
        "timestamp": 1717347915
    },
    {
        "content": "<p>This style is used in metamath, and I am quite fond of it, but I think it is not standard in mathlib. There are lots of people I know asking for better cross references between formal libraries and informal sources, and I think we should try to collect as much of this kind of information as people are willing to contribute</p>",
        "id": 442076397,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1717348084
    },
    {
        "content": "<p>If you search for \"formalize textbook\" you can find a few discussions. I think its a good idea — what I want to see is definitions and theorems written in a way that relies on Mathlib as much as possible. That way it serves as a \"rosetta stone\" between the language of the textbook and the language of Mathlib. Some of these projects could be in the Mathlib/Archive folder.</p>",
        "id": 442076579,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1717348169
    },
    {
        "content": "<p>This has already been discussed at length before</p>",
        "id": 442076602,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1717348177
    },
    {
        "content": "<p>What I meant was something a little different: you put on the mathlib theorem itself, in the doc comment, a reference to the corresponding theorem in famous textbook X. (I'm aware that there is almost never a perfect match here, so you interpret \"corresponding\" in a loose way so as to have something to cite.)</p>",
        "id": 442077125,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1717348387
    },
    {
        "content": "<p>A reason I like the other direction is that there's no need for it to be a loose match. It's giving you the important information about how to glue together the \"textbook API\" to the \"mathlib API\", and someone who's refactoring a theorem doesn't need to read the cited textbook to make sure they're not changing it beyond all recognition — they just have to make sure the textbook formalization still builds.</p>",
        "id": 442077702,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1717348628
    },
    {
        "content": "<p>These approaches aren't mutually exclusive of course.</p>",
        "id": 442077748,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1717348647
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/stream/113488-general/topic/Adding.20books.20to.20the.20library/near/442076579\">said</a>:</p>\n<blockquote>\n<p>If you search for \"formalize textbook\" you can find a few discussions.</p>\n</blockquote>\n<p>Found a good related thread in <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/stream/287929-mathlib4/topic/Project.20idea.3A.20linking.20MathLib.20to.20math.20books\">#mathlib4 &gt; Project idea: linking MathLib to math books</a>. I'll start reading it. We can close this thread if you feel like this is an unnecessary duplicate (or whatever the Zulip practices dictate; I'm a newbie).</p>",
        "id": 442077959,
        "sender_full_name": "Ali Hadizadeh Moghadam",
        "timestamp": 1717348726
    },
    {
        "content": "<p>Having the textbook rosetta approach is useful, but I don't think it's a replacement for citations on theorems, because it's less discoverable than having it on the theorem itself. For example you might notice that you are seeing a lot of theorems with EGA references and think \"maybe I should read EGA\"</p>",
        "id": 442078854,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1717349067
    },
    {
        "content": "<p>Why not both?</p>",
        "id": 442078889,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1717349082
    },
    {
        "content": "<p>Anyway, it seems like this hasn't got further than talk on zulip because people lack time</p>",
        "id": 442078960,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1717349124
    },
    {
        "content": "<p>also the textbook rosetta approach seems more heavyweight, like it would be weird to do that for just one theorem, while adding just one citation to a theorem seems fine</p>",
        "id": 442079080,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1717349168
    },
    {
        "content": "<p>Maybe we should explicitly encourage textbook citations in theorem docstrings somewhere. I've been tempted to do this before, but then ended up putting the citations in the module docstring because it felt out of place on the theorem itself since we basically never do it.</p>",
        "id": 442079547,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1717349405
    },
    {
        "content": "<p>another aspect of the metamath approach that makes this a bit less onerous: there is a short linking style like [EGA II], and then the target of this reference is defined in a bibliography page that has more detail on all the references</p>",
        "id": 442079893,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1717349594
    },
    {
        "content": "<p>(less onerous and also more consistent and easier for automated tools to scrape)</p>",
        "id": 442079955,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1717349630
    },
    {
        "content": "<p>this is also used to power more views in the docgen that <a href=\"https://us.metamath.org/mpeuni/mmbiblio.html\">list all citations in the order they appear in the reference</a>, making it a very low effort version of the textbook rosetta idea</p>",
        "id": 442080228,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1717349752
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/stream/113488-general/topic/Adding.20books.20to.20the.20library/near/442076579\">said</a>:</p>\n<blockquote>\n<p>Some of these projects could be in the Mathlib/Archive folder.</p>\n</blockquote>\n<p>That's great!</p>\n<p>I'm not very sharp in making conclusions, so sorry for asking: is it officially ok to fill the Archive folder with these things? (I know there are routines for contribution)</p>\n<p>I looked up the mentioned thread, and it seems every one was happy, but I didn't find any signs of \"ok whoever does book x theorem y please let us know so that we'll put it in repo folder z\".</p>",
        "id": 442081867,
        "sender_full_name": "Ali Hadizadeh Moghadam",
        "timestamp": 1717350602
    },
    {
        "content": "<p>Just open a PR and we'll see what we think! Personally, I see it as suitable for inclusion in archive</p>",
        "id": 442082148,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1717350725
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/stream/113488-general/topic/Adding.20books.20to.20the.20library/near/442078960\">said</a>:</p>\n<blockquote>\n<p>Anyway, it seems like this hasn't got further than talk on zulip because people lack time</p>\n</blockquote>\n<p>... yep. I might have time this summer to give a good shot at making LeanCamCombi do what it actually set out to do</p>",
        "id": 442082229,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1717350772
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/stream/113488-general/topic/Adding.20books.20to.20the.20library/near/442078960\">said</a>:</p>\n<blockquote>\n<p>Anyway, it seems like this hasn't got further than talk on zulip because people lack time</p>\n</blockquote>\n<p>Well, I've been talking to my prof to host a REU on formal proof. If it goes well, I was precisely planning to feed the victims with a textbook formalizing project. So, maybe that'd help fuel up this discussion again.</p>",
        "id": 442082429,
        "sender_full_name": "Ali Hadizadeh Moghadam",
        "timestamp": 1717350877
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/stream/113488-general/topic/Adding.20books.20to.20the.20library/near/442082148\">said</a>:</p>\n<blockquote>\n<p>Just open a PR</p>\n</blockquote>\n<p>Well that's great! Thanks!</p>\n<p>I'll let my prof know the community has this inclination.</p>",
        "id": 442082659,
        "sender_full_name": "Ali Hadizadeh Moghadam",
        "timestamp": 1717351003
    },
    {
        "content": "<p>BTW, if Lean REU (Research Experience for Undergrads) seems a tasty topic, I can open another thread for it. Personally, I'm really eager to know your suggestions (textbooks to start with, best practices, ...)</p>",
        "id": 442082931,
        "sender_full_name": "Ali Hadizadeh Moghadam",
        "timestamp": 1717351120
    },
    {
        "content": "<p>No new idea under the sun -- we had this in Mathlib3, see docs/tutorial/representation_theory/etingof.lean, which was the beginning of following Etingof's great and free book. </p>\n<p>Unfortunately it was not ported to Mathlib 4. If anyone would like to do that, and/or continue, that would be lovely!</p>",
        "id": 442087059,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1717353262
    },
    {
        "content": "<p>(note that if it had been done as citations in docstrings, it would have been ported!)</p>",
        "id": 442089217,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1717354481
    },
    {
        "content": "<p>(note that these aren't mutually exclusive kinds of artifacts and they each have their benefits!)</p>",
        "id": 442089507,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1717354657
    }
]