[
    {
        "content": "<p>Hi,</p>\n<p>Are there any projects rewriting Lean4 C++ parts in Rust ? [I could not find any on Google].<br>\n  I know about <a href=\"https://github.com/ammkrn/nanoda_lib\">https://github.com/ammkrn/nanoda_lib</a><br>\n  I'm asking about rewriting all the C++ parts in Rust.</p>\n<p>To avoid derailing the conversation, let's please put all the \"Why do a Rust rewrite\" debates into a different thread, and keep the thread focused on \"Links (if any) to attempts doing this\" / projects advancing this direction beyond nanoda_lib.</p>\n<p>Thanks!</p>",
        "id": 568582802,
        "sender_full_name": "TongKe Xue",
        "timestamp": 1768652066
    },
    {
        "content": "<p>No, the point of nanoda is also not to rewrite anything but to have a second implementation of the type theory at hand so we can test against multiple ones.</p>",
        "id": 568582906,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1768652188
    },
    {
        "content": "<p>Let us consider two statements:<br>\nS1: The purpose of nanoda_lib is to rewrite Lean4 C++ in Rust.<br>\nS2: nanoda_lib is useful to efforts trying to rewrite Lean4 C++ in Rust.</p>\n<p>I think you believe I am expressing S1. I actually meant to express S2. (In retrospect, I could have been clearer; but given the current feature state of nanoda_lib, I didn't think anyone would consider S1 as a possibility.)</p>",
        "id": 568664935,
        "sender_full_name": "TongKe Xue",
        "timestamp": 1768744281
    },
    {
        "content": "<p>There's actually this really interesting project: <a href=\"https://fishshell.com/blog/rustport/\">https://fishshell.com/blog/rustport/</a></p>\n<p>where they rewrote the Fish shell from C++ to Rust, basically module by module (with exception of one big part).</p>\n<p>With something like <a href=\"https://github.com/google/autocxx\">https://github.com/google/autocxx</a> , I'm legit wondering if a similar technique can be applied to Lean4. The C++ parts seem to be around 22k loc (according to cloc).</p>\n<p>The replacement would be to keep CMake, to gradually introduce <code>.rs</code> files module by module, (using autocxx to call into C++ for the yet un-rewritten parts) and to setup CMake to call rustc. The trickiest part would probably be to figure out the \"correct order of modules to rewrite\".</p>",
        "id": 568665211,
        "sender_full_name": "TongKe Xue",
        "timestamp": 1768744561
    },
    {
        "content": "<p>You asked “Are there any projects rewriting Lean4 C++ parts in Rust ?” and insisted you were interested only in that question. I think Henrik’s answer was a very clear no.</p>",
        "id": 568669459,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1768748534
    },
    {
        "content": "<p>I don't think we are in disagreement.</p>\n<p>I cited nanoda_lib as evidence I had done my research (finding all Rust projects remotely close to rewriting Lean4 C++ in Rust); it was not, in anyway, meant as a claim that \"nanoda_lib = rewrite Lean4 C++ in Rust\".</p>",
        "id": 568674775,
        "sender_full_name": "TongKe Xue",
        "timestamp": 1768751628
    }
]