[
    {
        "content": "<p>Hi everyone! My name is Tate, and I'm a student at Carnegie Mellon University doing research with Dr. Jeremy Avigad and others. I've recently been <a href=\"https://github.com/taterowney/PythonLeanBridge\">developing an API</a> for sending data back and forth between Lean and Python (originally for <a href=\"https://github.com/riyazahuja/ImProver\">other projects</a> I've helped with). Given Python's large selection of interesting packages, I think this API could support some helpful tools or tactics; for example, I built a tiny proof of concept using Python's SymPy to solve 1d Riemann integrals:<br>\n<a href=\"/user_uploads/3121/PmEWr276tRb2SsOMOBhpI71s/Screenshot-2025-08-14-at-16.42.11.png\">Screenshot 2025-08-14 at 16.42.11.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/PmEWr276tRb2SsOMOBhpI71s/Screenshot-2025-08-14-at-16.42.11.png\" title=\"Screenshot 2025-08-14 at 16.42.11.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"786x204\" src=\"/user_uploads/thumbnail/3121/PmEWr276tRb2SsOMOBhpI71s/Screenshot-2025-08-14-at-16.42.11.png/840x560.webp\"></a></div>",
        "id": 535923530,
        "sender_full_name": "Tate Rowney",
        "timestamp": 1756066032
    },
    {
        "content": "<p>I was wondering whether y'all had any ideas/requests regarding potential use cases. This might entail making automation via computer algebra systems like SymPy, or integrating some simulation libraries from outside of pure math (as unreliable oracles: some applications from <a href=\"https://gitlab.com/pavanello-research-group/dftpy\">physics/chemistry</a> come to mind). Any suggestions are greatly appreciated!</p>",
        "id": 535923540,
        "sender_full_name": "Tate Rowney",
        "timestamp": 1756066037
    },
    {
        "content": "<p><span aria-label=\"open mouth\" class=\"emoji emoji-1f62e\" role=\"img\" title=\"open mouth\">:open_mouth:</span> <br>\nHow does it work? Does the proof use an additional axiom that trusts python result, or does the python side generate a proof using only the standard axiom set?</p>",
        "id": 535928585,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1756072119
    },
    {
        "content": "<p>Right now it still uses a \"trust Python\" axiom: the idea (eventually) is to have it be of the form of \"got a Python instance of X class with Y attributes =&gt; the answer is correct\". Unfortunately it turns out that doing it like <code>bv_decide</code> (where computation occurs externally but a proof is reconstructed afterwards) is rather difficult because of how much weird (and not type-theoretically sound) stuff goes on under the hood, but it could be done for some simpler applications</p>",
        "id": 535928996,
        "sender_full_name": "Tate Rowney",
        "timestamp": 1756072670
    },
    {
        "content": "<p>a bit a different application but I think ot would be cool to have Lean bindings for python's plotting libraries (e.g. matplotlib), probably displaying the resulting plot to the infoview using proofwidgets</p>",
        "id": 535940092,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1756085279
    },
    {
        "content": "<p>When developing the curriculum for Lean for Scientists and Engineers, we found that a whole category of relevant physics/chemistry problems are awkward to set up in Lean. These are “solve for x” kinds of problems - they are for CAS, but don’t seem like such a good fit for Lean. For instance: <a href=\"https://github.com/ATOMSLab/LFSE2024/blob/master/Lean%20Code/Lecture2.lean\">https://github.com/ATOMSLab/LFSE2024/blob/master/Lean%20Code/Lecture2.lean</a></p>\n<p>Basically, a Lean version is “state that, given A, B, and C, prove that x=5” but typically, the scientist’s problem is “given A, B, and C, solve for x.” I think it would be neat to have some kind of framework where sympy solves for x, then slides that into the Lean conjecture to complete the theorem statement. If some form of “autocomplete” (e.g. an appropriate tactic or an LLM like AlphaProof) can generate a proof, then we have more confidence in the answer than we have from sympy alone. I wouldn’t know how to ensure no bugs in the sympy output —&gt; Lean translation, though.</p>",
        "id": 535940241,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1756085447
    },
    {
        "content": "<p>Maybe my specific case isn’t the best situation in Lean for which to build a “solve for x” kind of functionality. Another option might be how #eval can be used for “solving” basic arithmetic but doesn’t work with symbols. I’d like something that can handle this:</p>\n<p><a href=\"https://live.lean-lang.org/#codez=G4QwTgliBGA2CmACAFADwFwDkQBcCUAUAQMTyiyICsA1AOwBUAzPavQExA\">https://live.lean-lang.org/#codez=G4QwTgliBGA2CmACAFADwFwDkQBcCUAUAQMTyiyICsA1AOwBUAzPavQExA</a></p>",
        "id": 535942395,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1756087409
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"385895\">Jon Eugster</span> <a href=\"#narrow/channel/113488-general/topic/Applications.20of.20a.20Python.20.E2.87.84.20Lean.20API.3F/near/535940092\">said</a>:</p>\n<blockquote>\n<p>a bit a different application but I think ot would be cool to have Lean bindings for python's plotting libraries (e.g. matplotlib), probably displaying the resulting plot to the infoview using proofwidgets</p>\n</blockquote>\n<p>I really like this idea. The matplotlib backend should also be pretty trivial once things are set up; I think a <code>#plot</code> will be arriving soon!</p>",
        "id": 535943257,
        "sender_full_name": "Tate Rowney",
        "timestamp": 1756088342
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"424214\">Tyler Josephson ⚛️</span> <a href=\"#narrow/channel/113488-general/topic/Applications.20of.20a.20Python.20.E2.87.84.20Lean.20API.3F/near/535940241\">said</a>:</p>\n<blockquote>\n<p>When developing the curriculum for Lean for Scientists and Engineers, we found that a whole category of relevant physics/chemistry problems are awkward to set up in Lean. These are “solve for x” kinds of problems - they are for CAS, but don’t seem like such a good fit for Lean. For instance: <a href=\"https://github.com/ATOMSLab/LFSE2024/blob/master/Lean%20Code/Lecture2.lean\">https://github.com/ATOMSLab/LFSE2024/blob/master/Lean%20Code/Lecture2.lean</a></p>\n<p>Basically, a Lean version is “state that, given A, B, and C, prove that x=5” but typically, the scientist’s problem is “given A, B, and C, solve for x.” I think it would be neat to have some kind of framework where sympy solves for x, then slides that into the Lean conjecture to complete the theorem statement. If some form of “autocomplete” (e.g. an appropriate tactic or an LLM like AlphaProof) can generate a proof, then we have more confidence in the answer than we have from sympy alone. I wouldn’t know how to ensure no bugs in the sympy output —&gt; Lean translation, though.</p>\n</blockquote>\n<p>I think this is a super helpful use case: I've found quite a few pretty simple (in)equalities are quite annoying to solve even with automation, despite CASs making them trivial. While a \"find solutions\" or \"just trust the CAS\" strategy would be easy, actually reconstructing a working (and easy to read) Lean proof is more difficult because SymPy and family use a bunch of crazy Grobner basis stuff behind the scenes: however, it is definitely possible. <br>\nI do have a friend who was working a bit on integrating <a href=\"https://www.macaulay2.com/\">Macaulay 2</a> into Lean for something similar: continuing this could be a promising route if folks were interested.</p>",
        "id": 535943677,
        "sender_full_name": "Tate Rowney",
        "timestamp": 1756088751
    },
    {
        "content": "<p>Here's another thought: if you connect to a Python package that does interval arithmetic or some other sort of validated computation, you can get fairly reliable numerical estimates. These would not be formally verified (there is an industry for formally verified numeric computation, but it's hard), but it could nonetheless be a helpful trusted oracle for lots of scientific and engineering applications. Google turned up <a href=\"https://coogan.ece.gatech.edu/papers/pdf/harapanahalli2023npinterval.pdf\">this paper</a>, which might be a nice target. </p>\n<p>Here is another <a href=\"https://dreal.github.io/\">numeric package</a> that might be helpful. Sicun Gao and <span class=\"user-mention\" data-user-id=\"627965\">@Soonho Kong</span>  started working on this at CMU; Soonho was Lean's first developer with Leo, and a couple of years ago he told me that dReal was getting a lot of use at AWS. It's not a Python program, but there are Python bindings.</p>\n<p>Plotting in widgets would also be great, as well as symbolic computation of integrals or <a href=\"https://docs.sympy.org/latest/tutorials/intro-tutorial/simplification.html\">factorization of polynomials</a>. Finding integer or rational solutions to equations that can be verified automatically would also be great.</p>",
        "id": 536023850,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1756127897
    },
    {
        "content": "<p>Thanks Dr. Avigad! I love the idea of integrating numerical simulations: interval arithmetic would be a great place to start, and could also help to eventually integrate complex simulation software (I think we discussed this before briefly?). Reliable work by the devs of these packages will be helpful to create reasonable axioms about the error bars of the outputs. </p>\n<p>Also polynomial factoring would be a cool place to start as well, since once we've computed a witness creating the proof is just a matter of spamming a small collection of ring identities (quite a bit easier than full systems of equations).</p>",
        "id": 536027430,
        "sender_full_name": "Tate Rowney",
        "timestamp": 1756129154
    },
    {
        "content": "<p>I would be excited to be able to use JAX within lean. Would this be possible in your setup?</p>",
        "id": 544613261,
        "sender_full_name": "samuela",
        "timestamp": 1760385041
    },
    {
        "content": "<p>This is a very interesting application! It's most definitely possible (just point it at a Python installation with Jax installed), but with what I have now, it will be difficult to do any verification, etc. of the underlying computations since Jax is implemented informally for obvious reasons. <br>\nAs a sidenote, Tomas Skrivan's <a href=\"https://github.com/lecopivo/SciLean\">SciLean</a> project is (among many, many things) trying to formalize properties of neural networks in Lean. It's still under development, but could potentially be useful depending on what you're trying to achieve...</p>",
        "id": 544616618,
        "sender_full_name": "Tate Rowney",
        "timestamp": 1760386637
    }
]