[
    {
        "content": "<p>Hi, can you suggest me tools to assist the process of formalizing proofs? For example, I've seen people like Terence Tao use Github copilot. Any more suggestions?  Is there any blog I can read more about assistants for lean automated proving.  I've read that there have been many attempts at automated proving. I am just curious what people have actually been using with their formalization projects.   I am starting with the article <a href=\"https://arxiv.org/abs/1303.5113\">https://arxiv.org/abs/1303.5113</a>.  Thank you.</p>",
        "id": 530895642,
        "sender_full_name": "Thomas Kojar",
        "timestamp": 1753507816
    },
    {
        "content": "<p>I use GPT o3.<br>\nI use cline in vscode.</p>",
        "id": 530917804,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1753520622
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"941244\">@Thomas Kojar</span> Please don’t double post questions like this.  (This is also on PA.SX.)  The answer changes fairly quickly.  If you browse <a class=\"stream\" data-stream-id=\"219941\" href=\"/#narrow/channel/219941-Machine-Learning-for-Theorem-Proving\">#Machine Learning for Theorem Proving</a> you can find a lot of stuff.  Much of it is research-level, but there are also practical tools.  Most practical tools are like <span class=\"user-mention\" data-user-id=\"626349\">@Asei Inoue</span>‘s answer, a general LLM and a plugin for VSCode.  Everyone has a different favorite combination.  Also, recently there have been a number of Lean-specific models, and some have been playing with those but that is more work.  Finally, there are also agentic systems people are making, but again much harder to make work.</p>",
        "id": 530930361,
        "sender_full_name": "Jason Rute",
        "timestamp": 1753527860
    },
    {
        "content": "<p>And there are also symbolic Lean tools which you can run as tactics including Grind, Aesop, Lean Hammer, Duper, Canonical.  Some are easier to use than others.</p>",
        "id": 530930369,
        "sender_full_name": "Jason Rute",
        "timestamp": 1753527866
    },
    {
        "content": "<p>We should move this thread to <a class=\"stream\" data-stream-id=\"219941\" href=\"/#narrow/channel/219941-Machine-Learning-for-Theorem-Proving\">#Machine Learning for Theorem Proving</a></p>",
        "id": 530930558,
        "sender_full_name": "Jason Rute",
        "timestamp": 1753527931
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"626349\">@Asei Inoue</span> what kinds of problems do you fine o3 good for?</p>",
        "id": 530930734,
        "sender_full_name": "Jason Rute",
        "timestamp": 1753528014
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"115715\">@Jason Rute</span> </p>\n<p>GPT-o3 is particularly good at general programming. I solve programming puzzles in Lean, and I use o3 to help fill in the parts I don't understand. While o3 can write proofs to some extent, it doesn't seem to be very good at it.</p>",
        "id": 530935152,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1753530273
    },
    {
        "content": "<p>When it comes to writing proofs, cline might be better. That's because it rewrites the parts that cause errors repeatedly.</p>",
        "id": 530935238,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1753530316
    }
]