[
    {
        "content": "<p>can use lean to automatically find solutions to very basic mathematical questions like probability ?</p>",
        "id": 496615140,
        "sender_full_name": "Sovan Sahoo",
        "timestamp": 1738174343
    },
    {
        "content": "<p>Probably not. Lean is not an automated theorem prover, it is an <em>interactive</em> theorem prover. But it depends precisely on what you mean by <em>very basic</em>.</p>",
        "id": 496617063,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1738174937
    },
    {
        "content": "<p>\"A sum of money amounts to <strong>$8,820</strong> in 2 years at simple interest. If the principal had been <strong>$500</strong> more, the amount would have been <strong>$9,450</strong> in the same period. What is the rate of interest per annum?\" </p>\n<p>if questions like these are formalized into leancode ,what assitance can lean provide me to solve it?</p>",
        "id": 496619284,
        "sender_full_name": "Sovan Sahoo",
        "timestamp": 1738175733
    },
    {
        "content": "<p>Are you able to turn this into Lean code yourself? But my impression is that you have very much the wrong idea about what Lean is. This looks like the kind of question a language model might be quite good at.</p>",
        "id": 496619573,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738175813
    },
    {
        "content": "<p>Ya,i can understand that llms can be used ,but for slightly complex mathematical questions where llms fail ,can lean chip in to provide some assistance to solve the question or is it simply a validation platform for proofs?</p>",
        "id": 496620334,
        "sender_full_name": "Sovan Sahoo",
        "timestamp": 1738176079
    },
    {
        "content": "<p>It's simply a validation platform for proofs.</p>",
        "id": 496620500,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738176128
    },
    {
        "content": "<p>There is work on getting LLMs to write Lean code (e.g. by DeepMind), but that's not Lean's problem, that's the LLM's problem.</p>",
        "id": 496620613,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738176169
    },
    {
        "content": "<p>ya i have read about few data sets  with parallel pairs of informal and formal component that can be used to fine tune llms.<br>\nBut if lean is an interactive platform ,does it auto suggest the tactics that should be used to solve a theorem?</p>",
        "id": 496621136,
        "sender_full_name": "Sovan Sahoo",
        "timestamp": 1738176347
    },
    {
        "content": "<p>No.</p>",
        "id": 496621297,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738176406
    }
]