[
    {
        "content": "<p>My current workflow when I rename a theorem in Mathlib is:</p>\n<ul>\n<li>write <code>deprecate to newName</code> before theorems;</li>\n<li>run code action to rename the theorem and generate a deprecated alias (works most of the time, with some bugs around namespace handling);</li>\n<li>push to Github, wait for CI (should compile with warnings);</li>\n<li>get cache;</li>\n<li>run <code>lake build</code> locally (should print a bunch of warnings without recompiling anything);</li>\n<li>go over the warnings in the reverse order and manually replace old names with new names.</li>\n</ul>\n<p>For lemmas with sufficiently long names, I can use text search&amp;replace to apply renames, but for short names (e.g., <code>prod_mk</code> -&gt; <code>prodMk</code>) it fails. Is there a better way to replace all usages of a name, including dot notation?</p>",
        "id": 513289473,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1745167703
    },
    {
        "content": "<p>For steps (1) and (2), you can also just rename the theorem, and use <code>scripts/add_deprecations.sh</code>, right? (Not saying this is better: is this worse in practice? If we can centralise maintenance efforts on one instead of N ways of doing the same, that's generally good.)</p>",
        "id": 513547680,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745310249
    },
    {
        "content": "<p>For steps (5) and (6): I believe <span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span>'s bump_deprecations tool did this. What would maintainers think about adding this to mathlib or batteries?</p>",
        "id": 513547809,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745310300
    },
    {
        "content": "<p><code>scripts/add_deprecations.sh</code> does me very well, I must say</p>",
        "id": 513548357,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1745310474
    },
    {
        "content": "<p>Currently, it is a separate repository - so others can use it. That makes sense in principle --- but raises the bar for using it in mathlib a lot: I have to</p>\n<ul>\n<li>realise that using the tool would actually help me here. (For just 10 deprecations, it's faster to do them by hand.)</li>\n<li>remember the path of the project and the correct incantation to put into my lakefile. (Yes, it was on zulip. But so I'd need to find that comment --- if I'd bookmark that, just find the bookmark. Still, one minute of searching and a context switch.)</li>\n<li>modify my lakefile accordingly, by hand</li>\n<li>push to CI and wait for mathlib to recompile</li>\n</ul>",
        "id": 513548396,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745310483
    },
    {
        "content": "<p>Pressing F2 on a declaration name is the supposedly canonical way to perform renames, but it is basically useless due to its lack of namespace-awareness</p>",
        "id": 513548598,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1745310537
    },
    {
        "content": "<p>The first steps may only take me 5 minutes overall (in the best case)... but force me to context-switch out of what I'm doing right now. The last step in the best case (remembered before pushing to CI first) may only increase mathlib build times (to \"build all of mathlib\" as opposed to incrementality). In the worst case, I only remember after pushing, and then it's 40 extra minutes of waiting. That's why I never use the tool.</p>",
        "id": 513548705,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745310572
    },
    {
        "content": "<p>What would help me use <code>bump_deprecations</code> is</p>\n<ul>\n<li>(in lake) have some <code>lake add bump_deprecations</code> command, which would find the project on reservoir, find the right version for my project (if existing) and adds it to my lakefile. (Basically, the equivalent of Rust's <code>cargo add</code>.) This would speed up the first three steps above a lot, and do away with all the context-switching.</li>\n<li>(in lake?) Have a notion of dev-dependency, which don't require rebuilding all of mathlib for adding it. Basically, adding a new executable does not effect any changes on mathlib, hence should not require a full rebuild.</li>\n<li>(in mathlib) integrate the tool into mathlib or batteries. Or at least add it as a dependency to mathlib, so it's always available.</li>\n</ul>",
        "id": 513549289,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745310733
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/channel/113488-general/topic/Auto-replace.20deprecated.20aliases.3F/near/513548598\">said</a>:</p>\n<blockquote>\n<p>Pressing F2 on a declaration name is the supposedly canonical way to perform renames, but it is basically useless due to its lack of namespace-awareness</p>\n</blockquote>\n<p>There's another reason: I cannot use this for more than one rename reliably due to olean invalidation.<br>\nIf I rename to a new identifier of different length and want to do another rename which touches the same line, F2 will still use the old syntax positions --- which means changing the middle of the line, and actually not the identifier. In other words, renaming more than one declaration can become a gamble.</p>",
        "id": 513549602,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745310835
    },
    {
        "content": "<p>(The tool is at <a href=\"https://github.com/adomani/UpdateDeprecations\">https://github.com/adomani/UpdateDeprecations</a>, for the record --- and not on reservoir.)</p>",
        "id": 513550109,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745310983
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> It seems the UpdateDeprecations tool does not have a license --- which is presumably why it's not on reservoir. A no-bikeshed option could be to copy mathlib's license, <a href=\"https://github.com/leanprover-community/mathlib4/blob/master/LICENSE\">the Apache 2.0 license</a>.</p>",
        "id": 513550508,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1745311110
    },
    {
        "content": "<p>UpdateDeprecation was still somewhat experimental and I have not looked at it in quite some time.</p>",
        "id": 513550915,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1745311218
    },
    {
        "content": "<p>In theory, it should attempt to replace names, being aware of namespaces and somewhat of dot notation, but I have not tried testing it too much.</p>",
        "id": 513551031,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1745311263
    },
    {
        "content": "<p>Part of the reason that I did not develop it further is that I was hoping that it would latch onto <code>refactor</code>, but that is on hold.</p>",
        "id": 513551155,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1745311306
    }
]