[
    {
        "content": "<p>Hey everyone!</p>\n<p>I was trying to see if there's any way to \"upgrade\" the repl's <code>usedConstants</code> feature, where tactics also contain info on constants from the current or imported modules.  Afaik, the repl does this by just extracting an <code>Expr</code> from the metavar context that is stored in the <code>TacticInfo</code> node of the <code>InfoTree</code>. </p>\n<p>This is different from how <a href=\"https://github.com/cmu-l3/ntp-toolkit\">ntp-toolkit</a> and <a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general/topic/Extracting.20proof.20dependencies\">#general &gt; Extracting proof dependencies</a> did it, where we instead had to import+compile all the modules we're interested in through some <code>CoreM</code> instance, and then could just get the constants map via <code>(← getEnv).constants.map₁</code>. On one hand, the repl method is super efficient since I'm already trying to extract out the theorems anyways, and I don't like the idea of having to have a seperate lean script that compiles the module, and then having to filter through the potentially giant constants map. However, the repl method only lists the <code>Name</code>s of the constants, whereas with the constants map, you can get a lot more information such as the source file/text of the dependency and the kind of constant (theorem, def, etc.).</p>\n<p>My question is whether it's possible/how to modify the repl to also extract out the source file/text/kind of the constants extracted from the metavar context that it's already parsing through. I don't want to have to recompile the whole module to do this, but I'm still a bit of a novice in figuring out how to extract the current <code>Environment</code> and constant map in the repl.</p>\n<p>Any help or advice on this would be super appreciated!</p>",
        "id": 495195271,
        "sender_full_name": "Riyaz Ahuja",
        "timestamp": 1737519628
    },
    {
        "content": "<p>Update: It seems that we can extract the environment (and therefore the constants map) via <code>CmdState.env.constants</code>, where <code>CmdState : Command.State</code> is half of a <code>CommandSnapshot</code>. That's enough to figure out the source module and kind (def, theorem, etc). Now I'm interested in figuring out if we can also get a syntax range from the source module, so that we can do a quick substring to get the actual contents of the definition/theorem/whatever constant we're looking at. </p>\n<p>Obviously, you could just <code>(&lt;- CompileModule m).flatMap .trees</code> to get a bunch of subsequent infotrees, figure out which one added the constant you're interested in, and extract the contents from that. But that's horribly inefficient. I'll play around and see if there's a faster way to do this extraction.</p>",
        "id": 495200472,
        "sender_full_name": "Riyaz Ahuja",
        "timestamp": 1737522999
    },
    {
        "content": "<p>That's <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Lean.findDeclarationRanges%3F#doc\">docs#Lean.findDeclarationRanges?</a></p>",
        "id": 495285347,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1737553305
    }
]