[
    {
        "content": "<p>I just had a conversation with <span class=\"user-mention\" data-user-id=\"110064\">@Kenny Lau</span>, and we were talking about the practicalities of setting up a cache for PhysLean (and therefore by extension projects downstream  of Mathlib), and what that would involve. </p>\n<p>This led to two questions: </p>\n<ul>\n<li>Is it possible to set up a cache without a server, using e.g. github artifacts? </li>\n<li>Are there any examples of projects downsteam of Mathlib that have done this?</li>\n</ul>\n<p>The aim is just to make a cache of the master branch of the project, to speed up local builds, and github workflows.</p>",
        "id": 528824695,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1752574375
    },
    {
        "content": "<p>I'm not aware of anyone having done it, but it does sound useful. I'm not sure if the FRO has ideas on integrating things into reservoir that could replace the cache</p>",
        "id": 528827065,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1752575118
    },
    {
        "content": "<p>I believe the recent switch to contributions from forks was made possible by the (exact?) same advances one would need to set cache up for a downstream project</p>",
        "id": 528830328,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1752576309
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315577\">@Mac Malone</span>, perhaps you could field this one, and summarize the state of your plans?</p>",
        "id": 530270036,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1753252111
    },
    {
        "content": "<p>Lake itself has plans to have a builtin Mathlib-style cache. However, that is planned to support Mathlib-style server setups and Reservoir version-based integration. It sounds like you would like a Mathlib-style setup without the server, which is not a use case we are currently focused on. </p>\n<p>Lake also currently supports a serverless full-package cache that makes use of GitHub releases. ProofWidgets uses this. However, that would not cover your master branch aim.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span> <a href=\"#narrow/channel/113488-general/topic/Cache.20for.20PhysLean.20and.20projects.20downstream.20of.20Mathlib/near/528824695\">said</a>:</p>\n<blockquote>\n<ul>\n<li>Is it possible to set up a cache without a server, using e.g. github artifacts? </li>\n</ul>\n</blockquote>\n<p>GitHub artifacts are temporary (they last for at most 90 days iirc), so they are often not a good fit for cache. However, if you are only trying to reuse recent builds, that may work well. You can store the <code>.lake</code> directory in an artifact and retrieve it in GitHub Actions or locally with GitHub CLI. If the users are expected to be comfortable with a bit of manual command-line work in this regard, this may be the best option.</p>",
        "id": 530490242,
        "sender_full_name": "Mac Malone",
        "timestamp": 1753341411
    },
    {
        "content": "<p>Ok, many thanks for the info <span class=\"user-mention\" data-user-id=\"315577\">@Mac Malone</span> ! I will see if I can get the artifacts to work, I don't think the 90 days limit will be an issue.</p>",
        "id": 530523717,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1753352633
    },
    {
        "content": "<p>You can also copy Mathlib's <code>Cache</code> and adapt it to your needs (i.e. changing some hardcoded parts and the request logic)</p>",
        "id": 530551957,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1753360380
    },
    {
        "content": "<p>I think the right approach here is to plan to have a server, and use the upcoming lake replacement of Mathlib's <code>cache</code>.</p>",
        "id": 530661272,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1753398479
    },
    {
        "content": "<p>Presumably we'll provide simple instructions for the hosting (which doesn't require a real server, just cloud storage). Ideally you could then do it yourself, and we can discuss solutions to the costs if you're not able to cover that elsewhere.</p>",
        "id": 530661401,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1753398543
    },
    {
        "content": "<p>Artifact based solutions are likely going to remain a hacky distraction: Mac is building the right solution for you.</p>",
        "id": 530661479,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1753398582
    },
    {
        "content": "<p>Ok, thanks Kim, I'll sit tight and wait then.</p>",
        "id": 530748082,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1753441044
    },
    {
        "content": "<p>Given that the <code>lake</code> remote cache feature was already part of Lean 4.25, the remaining question is how much is the monthly cost to rent the Azure blob storage and Cloudflare R2, at least for Mathlib.</p>",
        "id": 565716785,
        "sender_full_name": "Rein Zustand",
        "timestamp": 1767039279
    },
    {
        "content": "<p>You usually pay for the amount of stuff stored or the amount of traffic caused on the bucket. I would expect that neither are even close to mathlib for PhysLean. But you can look up the Azure pricing here <a href=\"https://azure.microsoft.com/en-us/pricing/details/storage/blobs/\">https://azure.microsoft.com/en-us/pricing/details/storage/blobs/</a></p>",
        "id": 565718804,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1767040809
    },
    {
        "content": "<p>While <code>lake cache</code> landed in <code>v4.25</code>, it is still unusable slow. Mac is working on improving it this quarter.</p>",
        "id": 566260754,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1767573610
    }
]