[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"451983\">Arthur Paulino</span> <a href=\"#narrow/channel/113488-general/topic/new.20.28mac.29.20laptop.20for.20Lean/near/492414538\">said</a>:</p>\n<blockquote>\n<p>About mathlib cache, I will suggest something I suggested a while ago, hoping someone might pick up the task.</p>\n<p><code>cache</code> could run a counting routine to warn the user whenever more than X% of the cached files are orphan. This routine could be triggered after every call to the <code>get</code> command. This warn could</p>\n<ul>\n<li>Just suggest calling <code>cache clean</code> (which only gets rid of orphan files) or</li>\n<li>Prompt the user asking whether <code>cache clean</code> should run, as an y/n question</li>\n</ul>\n<p>Sorry for the tangent!</p>\n</blockquote>\n<p>Your plan worked, I had some time and was bored enough: <a href=\"https://github.com/leanprover-community/mathlib4/pull/20567\">#20567</a>.<br>\n(It doesn't prompt the user, as I don't know how to do so in Lean, and didn't feel like diving into that rabbit hole.)</p>",
        "id": 492503671,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1736342547
    },
    {
        "content": "<p>I've never used <code>cache clean</code> (sometimes, I just wipe by hand the content of the cache directory), so I've just tried it after your message. I've done <code>lake exe cache clean</code> maybe 5 minutes ago, and since then there is absolutely no output, I don't know if something is happening or if the command has crashed. If you're still bored, do you think adding a progress report or something to <code>cache clean</code> would be feasible?</p>",
        "id": 492505276,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1736343116
    },
    {
        "content": "<p>5 minutes to wait on a command that removes files would probably worry me (enough to kill it and make sure my operating system still exists)?</p>",
        "id": 492505612,
        "sender_full_name": "Julian Berman",
        "timestamp": 1736343215
    },
    {
        "content": "<p>Yes, it worried me, so I went to the cache directory to check what is going on. The number of files is slowly decreasing.</p>",
        "id": 492505843,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1736343277
    },
    {
        "content": "<p>And now it's done. Probably some bad interaction with the integrated antivirus (which I've disabled on mathlib, but I should probably also disable on the cache directory).</p>",
        "id": 492506008,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1736343337
    },
    {
        "content": "<p>5 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general/topic/new.20.28mac.29.20laptop.20for.20Lean\">#general &gt; new (mac) laptop for Lean</a> by <span class=\"user-mention silent\" data-user-id=\"451983\">Arthur Paulino</span>.</p>",
        "id": 492514189,
        "sender_full_name": "Notification Bot",
        "timestamp": 1736345968
    },
    {
        "content": "<p>I took the liberty to factor out the discussion around <code>cache clean</code>.</p>\n<p>First, I'm glad the feature worked!</p>\n<p>Now, if it's a common practice for people to keep multiple mathlib folders, that's an use case I didn't envision when I first thought of how <code>clean</code> should work. So let's talk about that.</p>\n<p>Note that <code>clean</code> will remove files that are orphan in the current mathlib directory but won't care about whether those files are orphan on different mathlib directories or not. For the same reason, the counting heuristic proposed in <a href=\"https://github.com/leanprover-community/mathlib4/pull/20567\">#20567</a> will overestimate the number of orphan files.</p>\n<p>In order for the multiple-mathlib-folders use case to work properly, there's no way around keeping a centralized file in the <code>.cache</code> directory pointing back to the mathlib folders that are using it. Then knowing whether a cache file is orphan or not has to be done w.r.t. every mathlib folder. That will fix the <code>cache clean</code> behavior as well as the orphan count.</p>\n<p>A word of caution: beware of cases where different mathlib folders have different versions of <code>cache</code> such that the hashing scheme changes among them. I know the hashing scheme has been stable for <em>months</em>, but it's still worth being aware of this invariant</p>",
        "id": 492516178,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1736346571
    }
]