[
    {
        "content": "<p>Hello! Right now I am trying to install Lean onto my laptop. My laptop is M1. I typed in the code \"softwareupdate --install-rosetta\" into the terminal but it outputs \"Installing Rosetta 2 on this system is not supported.\" How to solve this problem?</p>",
        "id": 339147040,
        "sender_full_name": "FMLJohn",
        "timestamp": 1677774514
    },
    {
        "content": "<p>I don't think this is a lean specific question, you'll have better luck googling the message or asking on <a href=\"https://apple.stackexchange.com/\">https://apple.stackexchange.com/</a> or apple support I think.</p>",
        "id": 339150313,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1677775283
    },
    {
        "content": "<p>2 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/stream/113488-general/topic/How.20do.20you.20pronounce.20.22elan.22.3F\">#general &gt; How do you pronounce \"elan\"?</a> by <span class=\"user-mention silent\" data-user-id=\"127136\">Alex J. Best</span>.</p>",
        "id": 339150579,
        "sender_full_name": "Notification Bot",
        "timestamp": 1677775345
    },
    {
        "content": "<p>OK! Thanks. I'll try to figure it out!</p>",
        "id": 339152679,
        "sender_full_name": "FMLJohn",
        "timestamp": 1677775824
    },
    {
        "content": "<p>I was able to resolve this issue for them. \"Installing Rosetta 2 on this system is not supported\" is an error message that also comes up when Rosetta is already installed on the mac, which happens automatically when some apps that are meant to run on intel processors are downloaded.  If you run <code>arch -x86_64 zsh</code> at that point, it should repurpose your terminal, and then you should <em>not</em> have to install a 2nd version of homebrew and can install <code>elan</code> as normal.<br>\nAnother issue we ran into is that some of the default read/write permissions for the directory paths were messed up, but that's fixable through changing directory ownership to the current user <code>chown -R $[username]:[username] [directorypath]</code></p>",
        "id": 339198454,
        "sender_full_name": "Deepro Choudhury",
        "timestamp": 1677788784
    },
    {
        "content": "<p>Deepro has managed to resolve this issue for two Xena students in the last few weeks -- many thanks!</p>",
        "id": 339221332,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1677798133
    },
    {
        "content": "<p>Nice, are there some updates we can add to the instructions if these are going to be common problems?</p>",
        "id": 339240229,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1677808466
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"127136\">Alex J. Best</span> <a href=\"#narrow/stream/113488-general/topic/can't.20install.20rosetta/near/339240229\">said</a>:</p>\n<blockquote>\n<p>Nice, are there some updates we can add to the instructions if these are going to be common problems?</p>\n</blockquote>\n<p>I think it might be worth adding that if the error message \"Installing Rosetta 2 on this system is not supported\" comes up, then it is likely that they have already installed Rosetta without knowing it. A good course of action would then be to run <code>arch -x86_64 zsh</code> on their current terminal, observe whether their terminal title looks something like <code>zsh 80x24</code> and then skip directly to step 4 of the instructions. They should also make sure their permissions are set correctly. If this doesn't work then there might be deeper problem.</p>",
        "id": 339429190,
        "sender_full_name": "Deepro Choudhury",
        "timestamp": 1677872040
    }
]