[
    {
        "content": "<p>First, this post in thread of Combinatorial game theory repository:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"761203\">Vlad Tsyrklevich</span> <a href=\"#narrow/channel/113488-general/topic/Combinatorial.20game.20theory.20repository/near/505147783\">said</a>:</p>\n<blockquote>\n<p>I ran across <a href=\"https://github.com/dwrensha/Chess.lean\">https://github.com/dwrensha/Chess.lean</a> for chess a while ago but haven't really looked at it much. I think there are a couple of cool things that could be done for chess: building a theory that is useful for proving things about game play would require an algorithm for move generation which would allow proving things about chess algorithms, e.g. that an optimized bitboard move generator is correct by equivalence</p>\n</blockquote>\n<p>Also, there's this wonderful wiki website: <a href=\"https://www.chessprogramming.org\">https://www.chessprogramming.org</a></p>\n<p>Anyway, just making this thread for discussion. :)</p>",
        "id": 505766596,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1741986195
    },
    {
        "content": "<p>What makes a game \"chess-like\"? How do we distinguish between the scope of this hypothetical repository and the existing CGT repository?</p>",
        "id": 505798208,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1742004805
    },
    {
        "content": "<p>I do agree that there are (unfortunately) some classes of games that Conway's game theory isn't well-equipped to analyze. But what's the precise line to be drawn here?</p>",
        "id": 505798240,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1742004831
    },
    {
        "content": "<p>My attempt to formulate what makes game chess-like (necessary, but probably not sufficient conditions)</p>\n<p>1) Chess game has two players, which has different possible moves in position... (Chess is partisan/partial game, if i got the terminology right.)<br>\n2) There're three possible outcomes to game (win by white, draw/tie, win by black). (No normal play convention.)<br>\n3) Chess position remains as single entity during the game, afaict.<br>\n4) Chess position becomes more simple slowly (because captures happen), and chess has endgames that can be analysed completely as shown by endgame tablebases for all 7-or-less piece endgames.</p>",
        "id": 505805852,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1742011210
    },
    {
        "content": "<p>Probably the title chosen by me for this thread is not good.  <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> <br>\nChanged it from \"Mathematical theory of chess-like games?\" to \"Chess-like games and Lean?\"</p>",
        "id": 505806584,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1742011724
    },
    {
        "content": "<p>If the \"draw\" outcome is problematic from a mathematical point of view, they are several ways to remove it from chess.<br>\nFor instance, in the \"Top Chess Engine Championship\", they use r-mobility as a tie-break:</p>\n<p><a href=\"https://wiki.chessdom.org/R-Mobility\">https://wiki.chessdom.org/R-Mobility</a></p>",
        "id": 505821964,
        "sender_full_name": "Niels Feld",
        "timestamp": 1742024958
    }
]