[
    {
        "content": "<p>if anyone has experience compiling lean artefacts with clang, lmk! I'm passing <code>-I/path/to/lean/include</code> to clang and getting <code>clang: error while loading shared libraries: libtinfo.so.6: cannot open shared object file: No such file or directory</code></p>",
        "id": 425989638,
        "sender_full_name": "Quinn",
        "timestamp": 1710183542
    },
    {
        "content": "<p>asked another way: is there any progress on baremetal runtime?</p>",
        "id": 425992673,
        "sender_full_name": "Quinn",
        "timestamp": 1710184643
    },
    {
        "content": "<p>I do not meet the first part of this sentence, but that error means you're missing <code>ncurses</code>, and missing it on your shared library path rather than include path.</p>",
        "id": 425998708,
        "sender_full_name": "Julian Berman",
        "timestamp": 1710187041
    },
    {
        "content": "<p>(possibly <code>sudo apt install -y libncurses-dev</code> or whatever it's called in Ubuntu or your OS is what you want, or else futzing with <code>-L</code> / <code>LIBRARY_PATH</code> / <code>LD_LIBRARY_PATH</code> / <code>DYLD_LIBRARY_PATH</code> etc.)</p>",
        "id": 425998882,
        "sender_full_name": "Julian Berman",
        "timestamp": 1710187119
    },
    {
        "content": "<p>Ah interesting. I tried installing ncurses but didn't try the <code>-L</code> stuff</p>",
        "id": 426012579,
        "sender_full_name": "Quinn",
        "timestamp": 1710192920
    },
    {
        "content": "<p>I am no C programmer but I believe the slightly more mature way to handle most of this is instead by messing with your <code>PKG_CONFIG_PATH</code> -- and that if you have a reasonable package manager that it should be handling most of this for you already, but <code>&lt;redacted&gt;</code> is what I use for package management and will not handle this so if you too are perhaps on <code>mac&lt;redacted&gt;</code> you might be on the right path.</p>",
        "id": 426013049,
        "sender_full_name": "Julian Berman",
        "timestamp": 1710193111
    },
    {
        "content": "<p>I'm mixing Ubuntu and nixos for this project</p>",
        "id": 426013478,
        "sender_full_name": "Quinn",
        "timestamp": 1710193314
    },
    {
        "content": "<p>So I'll try these things for sure</p>",
        "id": 426013504,
        "sender_full_name": "Quinn",
        "timestamp": 1710193323
    },
    {
        "content": "<p>I would be very surprised if <code>apt</code> didn't set you up correctly there. And <em>certainly</em> nix, though in order to get things right with nix you presumably have to follow how nix wants you to compile things, probably by writing some nixexpr rather than running commands.</p>",
        "id": 426013953,
        "sender_full_name": "Julian Berman",
        "timestamp": 1710193519
    },
    {
        "content": "<p>Yeah it's not an apt install clang it's a custom fork of llvm. So I've got a bit of effort cut out for me</p>",
        "id": 426014554,
        "sender_full_name": "Quinn",
        "timestamp": 1710193810
    },
    {
        "content": "<p>Oh then I'm way way less surprised :) -- but still shouldn't be difficult if you get the envvars right.</p>",
        "id": 426015106,
        "sender_full_name": "Julian Berman",
        "timestamp": 1710194125
    }
]