[
    {
        "content": "<p>Also, as <a href=\"#narrow/stream/113488-general/topic/where.20does.20lean.20really.20stand.3F/near/265863490\">Kevin said</a>, Lean allows the implementation of tactics in Lean itself. So it doesn't seem to be the case that <em>Lean</em> lacks behind. It's just that we haven't implemented such a tactic yet. Does it make sense?</p>",
        "id": 265950684,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640291292
    },
    {
        "content": "<p>Lean's kernel is very small. Thus, depending on what you call \"Lean\", it may lack a lot of things!</p>",
        "id": 265950884,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640291471
    },
    {
        "content": "<p>By that logic Lean can do anything though, implementing a decent sledgehammer is a huge amount of work, and the Isabelle people have been working on it for over 10 years. The sledgehammer isn't in the kernel of isabelle either so I don't think saying we lack behind is unfair, they really do have a tool we all wish we had</p>",
        "id": 265952049,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1640292422
    },
    {
        "content": "<p>To make it correct, I better say that the Lean's tooling lacks behind Isabelle's tooling, ok?</p>",
        "id": 265952220,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1640292602
    },
    {
        "content": "<p>In this sense, regarding sledgehammer, yes. I might be wrong in my way of thinking, but I do believe that Lean's tooling also has some cards that Isabelle doesn't? It's a bit hard to weigh everything fairly.</p>",
        "id": 265952463,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640292792
    },
    {
        "content": "<p>Maybe just for the sake of safety and compromise with generalizations, be more specific and direct about this particular tool (or other tools) that we don't have yet.</p>",
        "id": 265952834,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640293112
    }
]