[
    {
        "content": "<p>I'm interested in contributing to the lake tool - in particular, I think it would be very useful if there was a <code>lake add</code> command analogous to <code>cargo add</code>, and also better documentation about the lakefile.toml syntax (as well as documentation about the old-style? lakefile.lean DSL, when you should use one or the other, etc.) I can probably do some of the legwork on this myself, and I'm happy to try to upstream commits to github, but I'm curious if there's anyone I should talk to about how to bootstrap myself into contributing to lake specifically</p>",
        "id": 493703313,
        "sender_full_name": "Greg Shuflin",
        "timestamp": 1736906243
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315577\">@Mac Malone</span> ?</p>",
        "id": 493792691,
        "sender_full_name": "Alok Singh",
        "timestamp": 1736923336
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"785542\">@Greg Shuflin</span> Thanks for your interest! </p>\n<p>We are currently working on richer documentation for Lake as part of the <a href=\"https://lean-lang.org/doc/reference/latest/\">Lean reference manual</a>, so improvements there may be best delayed until an initial version of that section comes out. CC <span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span>, who is the author of the manual.</p>\n<p>As for <code>lake add</code>,  this is something we have considered before. Unfortunately, I don't think there is an RFC issue for it yet -- making one would be much appreciated! One major complication is that the configuration code is currently undergoing a major refactor, so this may not be the best time to try to add a feature.  On the other hand, this refactor may take a few months, so if you are eager to try something, feel free, just be aware that major merge conflicts may be enivitable.</p>\n<p>Also, if you want to ensure that your contributions have the best chance of getting merged, please make sure to read (and follow) the <a href=\"https://github.com/leanprover/lean4/blob/master/CONTRIBUTING.md\">contribution guidelines</a> carefully.</p>",
        "id": 494171469,
        "sender_full_name": "Mac Malone",
        "timestamp": 1737040562
    },
    {
        "content": "<p>A draft Lake chapter should be ready very soon :)</p>",
        "id": 494171669,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1737040611
    },
    {
        "content": "<p>solid, I've made an issue for this: <a href=\"https://github.com/leanprover/lean4/issues/6676\">https://github.com/leanprover/lean4/issues/6676</a></p>",
        "id": 494323446,
        "sender_full_name": "Greg Shuflin",
        "timestamp": 1737108052
    }
]