[
    {
        "content": "<p>Hey, not a regular user here. I created an account a long while ago.<br>\nI just got a email from Maxime Michel from <a href=\"http://kili-technology.com\">kili-technology.com</a> claiming that \"my interest in the Lean project\" is why they wanted to reach out and pitch their LLM/AI crap.</p>\n<p>Just wanted to let you know that this is how data from this community is used. I do not appreciate that spammy email.</p>\n<p>(Apparently my email was visible here on my account, that's on me. Changed that by now).</p>",
        "id": 484671349,
        "sender_full_name": "jan-erik",
        "timestamp": 1732698708
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"434420\">@jan-erik</span> Thanks for notifying us. I am sorry to hear that email addresses are being harvested and used for spammy purposes.</p>",
        "id": 484673354,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1732699309
    },
    {
        "content": "<p>(We're going to take action, too, I think. Coordinating now.)</p>",
        "id": 484673772,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1732699436
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/GqEeZIdlWLryHi4hokh--qsA/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/GqEeZIdlWLryHi4hokh--qsA/image.png\" title=\"image.png\"><img data-original-dimensions=\"1317x1181\" src=\"/user_uploads/thumbnail/3121/GqEeZIdlWLryHi4hokh--qsA/image.png/840x560.webp\"></a></div>",
        "id": 484678538,
        "sender_full_name": "Leo",
        "timestamp": 1732700820
    },
    {
        "content": "<p>So rude. You can report their Google Form for spam (at the bottom): <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdD6-87Q3jiE5pFqnBuC8G9cIiyb8DPMQuHvAlXJFIVrpaiDA/viewform\">https://docs.google.com/forms/d/e/1FAIpQLSdD6-87Q3jiE5pFqnBuC8G9cIiyb8DPMQuHvAlXJFIVrpaiDA/viewform</a></p>",
        "id": 484678581,
        "sender_full_name": "Leo",
        "timestamp": 1732700829
    },
    {
        "content": "<p>Assuming that this is actually what they're working on, this doesn't really look all that spammy</p>",
        "id": 484717941,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1732713224
    },
    {
        "content": "<p>It's still not OK to harvest a few thousand email addresses from zulip and send out unsollicited email.</p>",
        "id": 484718352,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1732713351
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> <a href=\"#narrow/channel/113488-general/topic/Contact.20spam.20from.20kili-technology.2Ecom/near/484717941\">said</a>:</p>\n<blockquote>\n<p>Assuming that this is actually what they're working on, this doesn't really look all that spammy</p>\n</blockquote>\n<p>I also felt this is not really spammy (I also got an email from them) but agree that it is in the sense of being \"unsolicited commercial email\" (the definition of spam). Maybe there should be instructions that the correct way to do this if you are legitimate is to post in the \"job postings\" channel.</p>",
        "id": 484884467,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1732788901
    },
    {
        "content": "<p>Hi everyone,<br>\nI’m the one who sent you the email, and I want to sincerely apologize if it was perceived as spam—that was never my intention. My only goal was to invite you to join a recent open-source project we’re working on. I chose email as the format to enable more direct conversations and in-depth discussions, as I tend to be more responsive over email.<br>\nThat said, I completely understand your concerns. Based on your feedback, I’ll stop using this approach immediately and will instead share the opportunity directly in the <code>job_recruiting</code> channel as suggested.</p>\n<p>I hope you can see that no harm was intended, and I truly appreciate your understanding.</p>",
        "id": 484919025,
        "sender_full_name": "MaxK",
        "timestamp": 1732799822
    },
    {
        "content": "<p>Also, be careful with other sites <span class=\"user-mention\" data-user-id=\"783615\">@MaxK</span> .  I was nice on PA.SE and marked your post as off-topic instead of flagging it as spam.  (And this was after we warned you here about this behavior.). In general, I don’t think spam is going to help you.  Instead, I would encourage you to share your vision (maybe in <a class=\"stream\" data-stream-id=\"219941\" href=\"/#narrow/channel/219941-Machine-Learning-for-Theorem-Proving\">#Machine Learning for Theorem Proving</a>) and what differentiates you.  Other orgs like Numina and Harmonic are doing the same thing and have made similar announcements asking for paid volunteers.  Others are also working in this space (some of which are open and some secretive about it).  It’s a crowded field right now.</p>",
        "id": 484951805,
        "sender_full_name": "Jason Rute",
        "timestamp": 1732810062
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 485694899,
        "sender_full_name": "Rongmin Lu",
        "timestamp": 1733167706
    },
    {
        "content": "<p>I've received an email today containing a link to a <a href=\"https://kilitechnology.retool.com/form/89d91c53-40de-4a6c-afbc-52695d63c56d\">kilitechnology</a> form even though I haven't contributed to lean in over a year.... Is the spam from this company potentially coming back?</p>",
        "id": 515091237,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1745939081
    },
    {
        "content": "<p>Aahrg! I'm really sorry about this. We (mathlib maintainers) just received another notification as well.</p>",
        "id": 515091468,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1745939138
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"783615\">@MaxK</span> What is going on? Why are you spamming people that didn't sign up spam? Please stop this immediately! We've been in contact about this before. You made promises. This is unacceptable.</p>",
        "id": 515091726,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1745939197
    },
    {
        "content": "<p>I was hesitant to post here (even though it seems most relevant) because I did <em>not</em> receive an email from Maxime. The email came from a certain \"David Martin\" from a non-kili email (I will not share the email in public, because I don't think it'd be fair) so it could be unaffiliated with this organization</p>",
        "id": 515092091,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1745939283
    },
    {
        "content": "<p>Indeed the other report we got was also from a David Martin (and a gmail address)</p>",
        "id": 515093618,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1745939699
    },
    {
        "content": "<p>It may be a different spammer, but I received a spam email recently from someone purporting to be \"Soumi De\", \"Head of Sourcing @ Mercor\" and claiming \"We are currently running a project with one of the top AI Labs where we would love to have elite LEAN Engineers working with us.\". This spammer is definitely a liar (the message refers to \"Your LinkedIn profile\", I've never had one) so could well also be misrepresenting who they are and who they are working for, and I don't know where they're getting details of people to send spam to.</p>",
        "id": 515167672,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1745965500
    },
    {
        "content": "<p>yes some maintainers also got one or two emails from Mercor, and apparently all of us have incredible LinkedIn pages</p>",
        "id": 515172018,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1745967834
    },
    {
        "content": "<p>Just wanted to pop in here and say that I've been contacted again via email regarding lean4, even though i haven't contributed to any lean repository for a long time. This time by a startup named \"alignerr\" asking me to \"[Use my] Lean 4 expertise to train AI\"</p>",
        "id": 566630222,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1767737734
    },
    {
        "content": "<p>I have asked them to respond about this at <a class=\"message-link\" href=\"/#narrow/channel/284757-job-postings/topic/Lean.204.20Mathematical.20Formalization.20Expert.20.24170-200/near/566631339\">#job postings &gt; Lean 4 Mathematical Formalization Expert $170-200 @ 💬</a>.</p>",
        "id": 566631418,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1767738425
    }
]