[
    {
        "content": "<p>The latest round of CORE rankings has been released here : <a href=\"https://portal.core.edu.au/conf-ranks/?search=4613&amp;by=all&amp;source=ICORE2026&amp;sort=arank&amp;page=1\">https://portal.core.edu.au/conf-ranks/?search=4613&amp;by=all&amp;source=ICORE2026&amp;sort=arank&amp;page=1</a></p>\n<p>For non-CS researchers, these rankings play an important role in the careers of young researchers, travel funding we get from our universities/institutions, as well as grant applications. This year two things have happened of relevance to the broader formalisation community and the Lean community:</p>\n<ol>\n<li>CPP appears for the first time</li>\n<li>ITP has been downgraded from A to B. This is significant</li>\n<li>CPP also gets a rating of B</li>\n</ol>\n<p>This is not good news. These are the only two conferences for formalisation research specifically, and therefore the leading venues. A ranking of B is (in algorithms) typical for conferences where submissions with extremely incremental submissions are accepted (thus they don't even fall in the radar of hiring committees).</p>\n<p>A big factor (but not the only  one) that influences these rankings is the acceptance rate of papers, which is a rather poor metric imho if there is a culture of self-selection for paper submissions. Ideally the solution involves some sort of discussion between the steering committees of both conferences and the CORE rankings committees.</p>",
        "id": 569303516,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769013984
    },
    {
        "content": "<p>I understand that several prominent members of this Zulip serve on the committees of both conferences. I believe these ratings are not justified given the quality of our papers. Further, typically each area of CS gets one or two A/A* conferences barring issues with research quality. I'm hoping to get a discussion rolling here so that perhaps our community can do what is necessary to address what I think is blatantly nonsensical  rankings that sadly has an impact in hiring decisions.</p>",
        "id": 569304218,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769014117
    },
    {
        "content": "<p>CC : <span class=\"user-mention\" data-user-id=\"417654\">@Martin Dvořák</span></p>",
        "id": 569304252,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769014122
    },
    {
        "content": "<p>Does CAV not do a line in formal methods stuff? Or is that less specific?</p>",
        "id": 569324448,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1769019454
    },
    {
        "content": "<p>Proof automation people for Lean have published at CAV yes</p>",
        "id": 569325109,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1769019659
    },
    {
        "content": "<p>Yes but it is not primarily an ITP venue</p>",
        "id": 569325312,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769019723
    },
    {
        "content": "<p>Here is the <a href=\"https://portal.core.edu.au/core/media/2025/justification/1245_ITP.pdf\">feedback</a> provided by CORE, explaining the downgrading of ITP. As you can see, what matters to them is not the perceived quality of the papers, but the h-index of the authors and PC members.</p>",
        "id": 569459433,
        "sender_full_name": "Assia Mahboubi",
        "timestamp": 1769079456
    },
    {
        "content": "<p>Here is the the <a href=\"https://portal.core.edu.au/core/media/2025/justification/2341_CPP.pdf\">analogue</a>  for CPP.</p>",
        "id": 569459651,
        "sender_full_name": "Assia Mahboubi",
        "timestamp": 1769079522
    },
    {
        "content": "<p>Can someone actually check this?</p>",
        "id": 569459888,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769079591
    },
    {
        "content": "<p>I mean what’s the baseline here for A that we are missing?</p>",
        "id": 569460072,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769079644
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110172\">Assia Mahboubi</span> <a href=\"#narrow/channel/113488-general/topic/Core.20Rankings.202026.20.3A.20CPP.20and.20ITP/near/569459433\">said</a>:</p>\n<blockquote>\n<p>Here is the <a href=\"https://portal.core.edu.au/core/media/2025/justification/1245_ITP.pdf\">feedback</a> provided by CORE, explaining the downgrading of ITP. As you can see, what matters to them is not the perceived quality of the papers, but the h-index of the authors and PC members.</p>\n</blockquote>\n<p>They mentioned similar points for FoSSaCS (<a href=\"https://portal.core.edu.au/core/media/2025/justification/547_FOSSACS.pdf\">https://portal.core.edu.au/core/media/2025/justification/547_FOSSACS.pdf</a>), where they mentioned the magic number of 25 (for h-indices) to indicate a top profile of PC members.</p>",
        "id": 569460079,
        "sender_full_name": "Niels van der Weide",
        "timestamp": 1769079647
    },
    {
        "content": "<p>“The area of ITP is somewhat closed,<br>\nwhich explains why even top people in this area have lower h-indices compared to other subareas” -&gt; this sounds extremely false</p>",
        "id": 569460277,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769079702
    },
    {
        "content": "<p>Our community members often come from PL, automated verification, and these days mathematics. We are the exact opposite of closed. </p>\n<p>EDIT: we also have papers on HCI topics</p>",
        "id": 569460409,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769079733
    },
    {
        "content": "<p>Mathematicians can have ridiculously low h-indices compared to other subjects. So we aren't helping <span aria-label=\"see no evil\" class=\"emoji emoji-1f648\" role=\"img\" title=\"see no evil\">:see_no_evil:</span> <br>\n(Of course, the real solution is to abolish these stupid metrics. But I understand that's not realistically helpful right now.)</p>",
        "id": 569460767,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1769079837
    },
    {
        "content": "<p>I also noticed that 3 out of 6 members on this committee (4613 computing theory committee) are from the algorithms and complexity area. <br>\n1.Is ITP being classified  correctly?</p>\n<ol start=\"2\">\n<li>Is this composition   representative/proportionate to the conferences consider by this committee</li>\n</ol>",
        "id": 569460960,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769079896
    },
    {
        "content": "<p>At the very least the false statements and explanations must be contested</p>",
        "id": 569461368,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769080008
    },
    {
        "content": "<p>It appears we have a committee that is overly loaded on one area of theory of computing and might have no insight into ours due to lack of representation (<span class=\"user-mention\" data-user-id=\"755399\">@Niels van der Weide</span> : it seems to be the same committee evaluating FoSSaCs)</p>",
        "id": 569461835,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769080147
    },
    {
        "content": "<p>And I think independent of this year’s specific ranking  reasons, the fact that the composition of the committee is so lopsided towards one area (in fact 2 come from a very very  small sub area called parametrised algorithms) should be a concern, because of the lack of representation and perspectives it denotes.</p>",
        "id": 569463781,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769080775
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/channel/113488-general/topic/Core.20Rankings.202026.20.3A.20CPP.20and.20ITP/near/569460767\">said</a>:</p>\n<blockquote>\n<p>Mathematicians can have ridiculously low h-indices compared to other subjects. So we aren't helping <span aria-label=\"see no evil\" class=\"emoji emoji-1f648\" role=\"img\" title=\"see no evil\">:see_no_evil:</span> <br>\n(Of course, the real solution is to abolish these stupid metrics. But I understand that's not realistically helpful right now.)</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> : I agree but the consequences of these rankings are more immediate (for example travel funding and job applications for young researchers).  I hope the steering committees take this up and make a strong protest.</p>",
        "id": 569469933,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769082858
    },
    {
        "content": "<p>I second <span class=\"user-mention\" data-user-id=\"466334\">@Shreyas Srinivas</span> on both the unfortunate importance of core ranking (e.g., in Poland it directly translates to points in evaluation of institutions that happen  every few years, which directly translates to money) and the fact that the committee has 4 people working between algorithmic and structural graph theory.</p>",
        "id": 569473081,
        "sender_full_name": "Marcin Pilipczuk",
        "timestamp": 1769083791
    },
    {
        "content": "<p>I have heard similar complaints from automata and logic people that are unhappy with MFCS becoming B. (MFCS is very wide and has historically better papers from logic than from algorithms. )</p>",
        "id": 569473448,
        "sender_full_name": "Marcin Pilipczuk",
        "timestamp": 1769083912
    },
    {
        "content": "<p>Then it seems like a wider issue that needs to be addressed. It’s important for the health of our research area (sadly).</p>",
        "id": 569477288,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769085108
    },
    {
        "content": "<p>I have a relevant data point I am willing to share with any steering committee member of ITP and CPP in DM if they are interested in taking this issue of representation up.</p>",
        "id": 569502163,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769091703
    },
    {
        "content": "<p>Sorry for bringing this up, but I want to add that a number of algorithms conferences, aligned with the research directions of the majority of the committee have received upgrades, while a number of verification related venues have received B which were either A or unrated and on-par with A conferences. So far this list is : ITP, CPP, MFCS, FoSSaCs, CONCUR.</p>",
        "id": 569740168,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769181346
    },
    {
        "content": "<p>This is not to insinuate anything but highlight the lack of representation.</p>",
        "id": 569740266,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769181367
    },
    {
        "content": "<p>There's something strange about this. My impression was that many (most/all?) leading (Western?) institutions, such as universities, funding bodies, publishers, academic societies endorsed the <a href=\"https://sfdora.org/resource/practical-guide/\">Dora Declaration (San Francisco Declaration on Research Assessment)</a>, which states precisely that research/researchers should <em>not</em> be judged by citations, h-indices, and that crap. At the same time, many (most/all) of the same institutions take things like CORE into account, which is based on exactly those metrices. Is this just ridiculous and inconsistent, or am I missing something here?</p>\n<p>(At the very least, if one is at an institution that has endorsed DORA, and I would assume that most of us are, this might be usable as an objective argument at the institution leadership level that connecting travel funding with CORE isn't compatible with the declaration.)</p>",
        "id": 569740436,
        "sender_full_name": "Nicolai Kraus",
        "timestamp": 1769181422
    },
    {
        "content": "<p>Indirection.  They don’t directly look at the h-index.  They just look at CORE which looks at h-index</p>",
        "id": 569740756,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769181499
    },
    {
        "content": "<p>I don't see how that is a counter-argument that any reasonable person would believe <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 569741251,
        "sender_full_name": "Nicolai Kraus",
        "timestamp": 1769181613
    },
    {
        "content": "<p>Further algorithms theory area has generally enjoyed a larger number of A* venues (defined as flagship venues which are the top 7% of their area). Every major subfield of algorithms has an A* (full disclosure : I have published at one of them).  </p>\n<p>Conversely PL and verification each get two A* venues. Maybe 3 for verification if one includes ICALP track B.</p>",
        "id": 569741639,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769181710
    },
    {
        "content": "<p>This suggests a bad application of uniform metrics in determining these ratings, with thresholds without much input from the communities involved.</p>",
        "id": 569741724,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769181732
    },
    {
        "content": "<p>I am writing all this with the hope that senior members of the community take this up.</p>",
        "id": 569741832,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769181758
    },
    {
        "content": "<p>Here's a list of all ranking changes from committee 4613:</p>\n<p>Briefly :</p>\n<ol>\n<li>Two algorithms conferences went from A to A* (questionable why the top 7% of conferences has to include so many of them). Also ICALP is definitely not a flagship conference(there are already many others, how many flagships can one have before they are just ... ships?)  thought it is a very good one. Two minor algorithms conferences were downgraded from A to B.</li>\n<li>All verification/logic/ITP conferences (of which there at least 7) have been downgraded from A to B. None have been upgraded.</li>\n</ol>\n<div class=\"spoiler-block\"><div class=\"spoiler-header\">\n<p>Ranking changes</p>\n</div><div class=\"spoiler-content\" aria-hidden=\"true\">\n<p>CONCUR : A -&gt; B<br>\nCPP : unranked -&gt; B<br>\nFM : A -&gt; B<br>\nFOIS : B -&gt; C<br>\nFOSSACS : A -&gt; B<br>\nICALP : A -&gt; A*<br>\nICLP : A -&gt; B<br>\nIPCO : A -&gt; B<br>\nISAAC : A -&gt; B<br>\nISSAC : A -&gt; B<br>\nITP : A -&gt; B<br>\nJELIA : A -&gt; B<br>\nMFCS : A -&gt; B<br>\nNeSy : unranked -&gt; C<br>\nSoCG : A -&gt; A*<br>\nTARK : A -&gt; B<br>\nTCC : A -&gt; B</p>\n</div></div>",
        "id": 569751366,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1769184249
    }
]