[
    {
        "content": "<p>I had thought that we were now at the stage where you could install Lean and create a new maths project without ever typing something into the terminal. The instructions to install Lean in the Lean 4 manual <a href=\"https://lean-lang.org/lean4/doc/quickstart.html\">here</a> don't use a terminal, and I thought there was some kind of panel which you can somehow open in order to make a new project depending on mathlib but I don't know how to make this panel appear. The Lean 4 manual refers to the mathlib4 readme, which doesn't seem to explain this new tool (did I just dream it?)</p>\n<p>Looking at the community pages we are still telling mac users to install on command line <a href=\"https://leanprover-community.github.io/install/macos.html\">here</a> and then the link to make a project on the community website <a href=\"https://leanprover-community.github.io/install/project.html#creating-a-lean-project\">here</a> is also command line. </p>\n<p>Is there documentation somewhere for \"basic usage for mathematicians who don't want to use command line at all?\" Am I wrong in thinking that we recently attained the nirvana of being able to install Lean and make a new maths project with 0 command line?</p>",
        "id": 406786215,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1702050771
    },
    {
        "content": "<p>The updated instructions are coming at <a href=\"https://github.com/leanprover/lean4/pull/2968\">lean4#2968</a></p>",
        "id": 406798032,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1702053541
    },
    {
        "content": "<p>Looking at it, I wonder whether <span class=\"user-mention\" data-user-id=\"221921\">@Marc Huisinga</span> is waiting for me to do something there.</p>",
        "id": 406798122,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1702053571
    },
    {
        "content": "<p>I got distracted by other things but will merge it on monday. </p>\n<p>If you'd like to read the new instructions, you can click the forall symbol in the top right in VS code while a file is open and select Documentation &gt; Show Setup Guide.<br>\nThe button to create new projects using Mathlib is in the same forall button menu.</p>",
        "id": 406812508,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1702058570
    }
]