[
    {
        "content": "<p>I am using lean4 as a host language for my own embedded language. As such there are libraries I've made which I essentially have to import in every single file in every codebase. </p>\n<p>Is there any way for me to add my own libraries to the prelude that gets automatically inserted to every file, such that I never have to manually import my stuff and can have them globally available in my projects?</p>",
        "id": 572083490,
        "sender_full_name": "Lhr",
        "timestamp": 1770279326
    },
    {
        "content": "<p>No, there is no such mechanism at present.</p>",
        "id": 572271307,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1770336414
    },
    {
        "content": "<p>As a workaround, you can create 1 file that <code>public import</code>s them all, then <code>import</code> this file.</p>",
        "id": 572288401,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1770348984
    },
    {
        "content": "<p>I saw talk about such a feature as a future possibility before on other forum; what technical obstacles stand in the way for this?</p>",
        "id": 572337973,
        "sender_full_name": "Lhr",
        "timestamp": 1770372801
    },
    {
        "content": "<p>Let me guess (disclaimer: it's a guess, not some insider knowledge): someone has to convince FRO that this feature is worth the extra maintainance costs it brings.</p>",
        "id": 572401725,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1770390811
    },
    {
        "content": "<p>One place where such a feature would be nice is ensuring that syntax linters are always available, as opposed to what Mathlib and CSLib currently do with ensuring their <code>Init</code> file is transitively imported everywhere. The error messages downstream can be pretty confusing if linting is set in the lakefile but you're missing the import.</p>",
        "id": 572406323,
        "sender_full_name": "Chris Henson",
        "timestamp": 1770392018
    },
    {
        "content": "<p>I'm considering whether this could be best implemented as a shake feature, in the sense that shake will ensure a given set of modules is imported everywhere they can (without creating cycles) in the project</p>",
        "id": 572409028,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1770392749
    },
    {
        "content": "<p>Apologies for my ignorance, I'm new around here. Why couldn't it be as simple as specifying some line in a lake file?</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">auto_imports</span><span class=\"w\"> </span><span class=\"bp\">=</span><span class=\"w\"> </span><span class=\"o\">[</span><span class=\"s2\">\"MyLib\"</span><span class=\"o\">,</span><span class=\"w\">  </span><span class=\"s2\">\"MyOtherLib\"</span><span class=\"o\">]</span>\n</code></pre></div>\n<p>And then every file in the codebase could be imagined as having an invisible 1st line containing the imports. Right before sending the file contents to the compiler, we would inject these import lines at the top as if the user had written them, without modifying their actual file contents. So, just a string prepending operation, <code>file_contents' = auto_imports ++ file_contents</code>. Is it much harder than this?</p>",
        "id": 572745899,
        "sender_full_name": "Lhr",
        "timestamp": 1770635809
    },
    {
        "content": "<p>Yes, it is harder than this, in multiple directions. :-) Consider, for example, the <code>module</code> keyword, the <code>processHeader</code> function, python scripts reading imports, people copying and pasting for an <a href=\"https://leanprover-community.github.io/mwe.html\">#mwe</a>, etc.</p>",
        "id": 572754954,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1770638087
    }
]