[
    {
        "content": "<p><del>I am in the last year of university at Imperial, and for my final year project (as a maths and CS student) I thought it would be fun to implement a theorem prover using Rust (also, to rethink and finish what I started 3 years ago). I have outlined my current design in the slides; does my reasoning sounds OK, and does it look like something that would work? <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></del> this seems so uninformed please ignore it</p>",
        "id": 476543381,
        "sender_full_name": "Zhanrong Qiao",
        "timestamp": 1728757673
    },
    {
        "content": "<ol>\n<li>Why do you want to implement DTT if you want ZFC?</li>\n<li>Have you looked at epigram?</li>\n</ol>",
        "id": 476543738,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1728757994
    },
    {
        "content": "<ol>\n<li>Finitely axiomatising ZFC requires a second-order logic. Here the basic DTT substitutes that second-order logic, so that I am able to use typed variables (instead of plain sets) in my proofs, with benefits from type inference, operator overloading, etc.</li>\n<li>Not yet, I will have a look...</li>\n</ol>",
        "id": 476545929,
        "sender_full_name": "Zhanrong Qiao",
        "timestamp": 1728760161
    },
    {
        "content": "<p>On a second thought, much of this might be implemented as Lean tactics. Are there any attempts or experiments in Lean on maintaining an reusable index of all currently imported definitions (i.e. not restricted to the local context) based on their types in β-normal forms or something?</p>",
        "id": 478179515,
        "sender_full_name": "Zhanrong Qiao",
        "timestamp": 1729558249
    },
    {
        "content": "<p>Are you aware of loogle and <code>exact?</code>?</p>",
        "id": 478235705,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1729587093
    },
    {
        "content": "<p>Of course, but iirc <code>exact?</code> has to perform a new search each time it is invoked, so you cannot really use it 100+ times in another proof automation procedure and still expect reasonable speed...? Indeed Loogle seems to have an index...</p>",
        "id": 478250883,
        "sender_full_name": "Zhanrong Qiao",
        "timestamp": 1729592152
    },
    {
        "content": "<p>I recall that the exact?'s predecessor had an index, so it would be surprising if exact? doesn't</p>",
        "id": 478252677,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729592876
    },
    {
        "content": "<p>Since you ask for normal forms, there is of course <code>simp?</code></p>",
        "id": 478252777,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729592900
    },
    {
        "content": "<p>Which also indexes all <code>simp</code> lemmas in normal forms</p>",
        "id": 478252809,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729592912
    },
    {
        "content": "<p>I thought <code>exact?</code> used a discrimination tree for lookup.</p>",
        "id": 478252842,
        "sender_full_name": "Jason Rute",
        "timestamp": 1729592923
    },
    {
        "content": "<p>Thank you, I will have a look...</p>",
        "id": 478254056,
        "sender_full_name": "Zhanrong Qiao",
        "timestamp": 1729593439
    },
    {
        "content": "<p><code>exact?</code> dynamically builds the discrimination tree on the first call within a given file, but repeated calls should be much faster.</p>",
        "id": 478450027,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1729675328
    },
    {
        "content": "<p>Btw I don't know how Imperial CS does undergrad projects, but the right person to ask these questions is usually your potential advisor(s). Building a toy ITP with some nifty feature demos might be doable. Making a whole ITP that is usable from scratch can take years. I think lean4 took 3 years and they already had some basic issues sorted out in previous iterations.</p>",
        "id": 478452935,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729676266
    },
    {
        "content": "<p>Imperial definitely has a strong PL group</p>",
        "id": 478453579,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729676434
    },
    {
        "content": "<p>They should be able to guide you</p>",
        "id": 478453623,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729676449
    }
]