[
    {
        "content": "<p>As my Ph.D. comes to a close, I attempted to reflect on what makes me want formal proofs and what I think makes other people want them. I identified two kinds of people who want proofs written in Lean (or formal proofs in general). Do you agree? Is there something important I missed? Would you add a third category?</p>\n<ol>\n<li>Believers in the central dogma: Mathematicians generally hold the opinion that a mathematical proof is valid if and only if it could be rewritten into a formal proof (at least in principle — most mathematicians have absolutely no interest in actually doing it). In this light, a mathematical proof becomes trustworthy in one of the following two ways; either a human expert carefully reads the proof and affirms that she believes that the proof is valid (in the sense that she believes that a formal proof could be written in principle by following the mathematical proof), or a formal proof is written and verified by a computer (which is generally considered to be the hard way to convince the sceptics). Therefore, given that the notion of formal proofs has been defined (and the computer programs that check them have been implemented) so that they formalize what is considered to be the validity of mathematical proofs, the Lean proof is useful because the Lean proof convinces the mathematical community that the mathematical proof is valid, which is what they are ultimately interested in (i.e., the mathematical proof is what satisfies them; the formal proof is just a replacement for a human reviewer of the mathematical proof (or, more accurately, formalization is the vehicle that allows human reviewers to be replaced by computer checkers)). For believers in the central dogma, a formal proof can be a substitute witness but not the objective.</li>\n<li>Formalists: I get satisfaction from Lean proofs. Mathematical proofs don't do it for me. I view mathematical proofs as something that is useful precisely because they provide guidance on how to write a formal proof. However, it is the proof written in Lean that ultimately satisfies me. For me, personally, writing a mathematical proof without formalizing it feels like putting a piece of delicious food into my mouth but spitting it out instead of chewing and swallowing it — it teases me but doesn't provide any satisfaction in the end.</li>\n</ol>",
        "id": 565509220,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1766839420
    },
    {
        "content": "<p>There is <span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span>'s <a href=\"https://www.imo.universite-paris-saclay.fr/~patrick.massot/files/exposition/why_formalize.pdf\">*Why Formalize Mathematics*</a> on this subject.</p>",
        "id": 565509425,
        "sender_full_name": "Julian Berman",
        "timestamp": 1766839708
    },
    {
        "content": "<p>How embarrassing that I missed it! I thought I had read all the important essays on this topic. Obviously not!</p>",
        "id": 565509637,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1766839940
    },
    {
        "content": "<ul>\n<li>I believe fine details deserve to be preserved, and formal proofs allow to preserve them</li>\n<li>I believe that having a real notion of a proof being complete is valuable</li>\n<li>I believe that having a library of mathematics where every result can be inspected as deeply as you need to is valuable</li>\n<li>I like interactivity</li>\n</ul>\n<p>I wonder which category this should go to.</p>",
        "id": 565510678,
        "sender_full_name": "suhr",
        "timestamp": 1766841281
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/channel/113488-general/topic/Desire.20for.20Lean.20proofs/near/565509220\">said</a>:</p>\n<blockquote>\n<p>I identified two kinds of people who want proofs written in Lean (or formal proofs in general). Do you agree? Is there something important I missed? Would you add a third category?</p>\n</blockquote>\n<p>If your goal is to describe all kinds, I'll mention that I don't see myself in either category, but leaning towards the first one. Here's how I'd describe why I want formal proofs:</p>\n<ul>\n<li>I like the promise of correctness</li>\n<li>I like the idea of software watching my back</li>\n<li>I really really like the goal of cataloguing most maths (a la ProofWiki) and getting rid of the messy unindexed pile of PDFs</li>\n<li>I wish for the future where ITPs <em>are</em> maths, where writing a paper proof doesn't count as properly doing math research</li>\n<li>I also see Mathlib as the next logical step from a computer-algebra-system (e.g. Sympy, Mathematica, GAP), even though it isn't close to subsuming them</li>\n</ul>",
        "id": 565511690,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1766842712
    },
    {
        "content": "<p>I also remember there being a series of blog posts somewhere, one of which was about this?</p>",
        "id": 565511720,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1766842750
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"394485\">suhr</span> <a href=\"#narrow/channel/113488-general/topic/Desire.20for.20Lean.20proofs/near/565510678\">said</a>:</p>\n<blockquote>\n<p>I wonder which category this should go to.</p>\n</blockquote>\n<p>I might have given a slightly false impression that my post elaborates on why I want to <em>work</em> on Lean proofs. However, I elaborated on why I want to <em>have</em> Lean proofs — it could be also framed as why I want to download a Lean repository rather than downloading a PDF from arXiv.</p>\n<p>I talk a lot about why I want to <em>work</em> on Lean proofs in my thesis, but the post above is about why I want to <em>have</em> Lean proofs.</p>",
        "id": 565511898,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1766842949
    },
    {
        "content": "<p>Oh there was also this message recently <a class=\"message-link\" href=\"/#narrow/channel/187764-Lean-for-teaching/topic/Teaching.20with.20Verbose.20Lean/near/564728978\">#Lean for teaching &gt; Teaching with Verbose Lean @ 💬</a> which I love, about ITPs being the future rather than an appendix for correctness</p>",
        "id": 565512170,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1766843388
    },
    {
        "content": "<p>OMG, the comments made me find two absolutely amazing pieces of writing! I'll save them to reread in the future.</p>",
        "id": 565512907,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1766844183
    },
    {
        "content": "<p>I've been learning about surreal numbers as I've been formalizing them, and I've discovered a lot of subtleties within its arguments which the literature seems to have largely ignored. And in that process I feel like I've gained a much deeper understanding on the subject.</p>",
        "id": 565529932,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1766868535
    },
    {
        "content": "<p>In Patrick Massot's section on \"Creating,\" he says that creating new theorems is mostly science fiction with current day technology. I agree, but I think that the day may not be too far off when the combination of ITPs with various types of artificial intelligence leads to computers creating genuinely new mathematics. There is a lot of discussion of this topic in the \"Machine Learning for Theorem Proving\" channel.</p>\n<p>I also like to point to the Holmes-Wilshaw formal proof of the consistency of NF as an example where the Lean proof broke a sociological logjam. No referee could be found to invest the time required to validate Holmes's proof when there was still significant doubt about whether the argument was fundamentally correct. The ITP provided a clear goalpost that Holmes needed to meet and that would persuade others if met. This was a case where informal standards of mathematical rigor were not sufficient to lead to a resolution.</p>",
        "id": 565539474,
        "sender_full_name": "Timothy Chow",
        "timestamp": 1766883667
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/channel/113488-general/topic/Desire.20for.20Lean.20proofs/near/565509220\">said</a>:</p>\n<blockquote>\n<p>Is there something important I missed? Would you add a third category?</p>\n</blockquote>\n<p>The whole verified software thing? I think that was a big motivation for the creators of Lean.</p>\n<p>For certain types of software one might find oneself proving theorems qualitatively similar to those we see in Mathlib but too niche to be of general interest.</p>",
        "id": 565554792,
        "sender_full_name": "A.",
        "timestamp": 1766909441
    },
    {
        "content": "<p>The proof of the consistency of NF is also an example of a proof where management of details is essential. Without a proof assistant it was hell to write and verify, but Lean made it quite manageable.</p>",
        "id": 565556434,
        "sender_full_name": "suhr",
        "timestamp": 1766911820
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/channel/113488-general/topic/Desire.20for.20Lean.20proofs/near/565509637\">said</a>:</p>\n<blockquote>\n<p>How embarrassing that I missed it! I thought I had read all the important essays on this topic. Obviously not!</p>\n</blockquote>\n<p>If you're not already aware of it, Donald Mackenzie's book <em>Mechanizing Proof</em> is well worth reading.</p>",
        "id": 565570390,
        "sender_full_name": "Timothy Chow",
        "timestamp": 1766930036
    },
    {
        "content": "<p>The reason I (a non-mathematician) became interested in Lean is because of its potential for AI safety. As AIs become smarter, and able to produce sophisticated outputs (software code, and soon enough, research), I see ITPs like Lean as an essential tool that allows the possibility that humans can trust the outputs of (superintelligent) AIs, without having to understand and check every detail of the output. There's an <a href=\"https://gasstationmanager.github.io/ai/2024/11/04/a-proposal.html\">essay</a> I wrote a year ago; the technical details may have become slightly outdated, but the motivation remains.</p>",
        "id": 565585564,
        "sender_full_name": "GasStationManager",
        "timestamp": 1766949929
    }
]