[
    {
        "content": "<p>I will soon need to work with differential equations. I have heard about a few Lean 4 libraries that formalize differential equations. I would like to start reading one of them, but I am clueless about the differences between them. Hence I would like to get a recommendation for which library is best for me. I have the following needs.</p>\n<ul>\n<li>I want a beginner-friendly library because I have never studied differential equations. I am willing to put a lot of time and effort into studying it, but I need it to be accessible for a person without a strong math background.</li>\n<li>I want a self-contained library because I want to learn about differential equations from the library alone. I don't want to end up having to read a textbook or wikipedia (or any other information source that uses any other than Lean notation) in order to make sense of it.</li>\n<li>I want to learn the theory rather than to develop practical skills in solving differential equations.</li>\n</ul>\n<p>Based on my preferences, can you recommend which Lean 4 library for differential equations will be the best study material for me?</p>",
        "id": 571999226,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770235558
    },
    {
        "content": "<p>Are you mainly interested in ODEs or PDEs? For PDEs, it is often the case that the 'theory' mostly consists of tools and techniques which can be applied in a variety of different settings.</p>",
        "id": 572001469,
        "sender_full_name": "Joris van Winden",
        "timestamp": 1770236325
    },
    {
        "content": "<p>I guess I should start with ODEs.</p>",
        "id": 572002380,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770236672
    },
    {
        "content": "<p>I definitely prefer a library that will allow me to move to PDEs with as little changes in notation as possible.</p>",
        "id": 572003300,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770236981
    },
    {
        "content": "<p>The area is huge and you might need to specify exactly what you're interested in. It's a bit like me saying \"I will soon need to work with programming languages and I've heard that there are several. I would like a recommendation for which programming language is best for me. I will give you no further information.\"</p>",
        "id": 572005425,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1770237761
    },
    {
        "content": "<p>Differential equations are used by everyone from differential geometers to analysts to applied mathematicians to statisticians to physicists, chemists etc. These people are all using different techniques to think about vastly different questions all of which have some kind of a D operator.</p>",
        "id": 572005813,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1770237888
    },
    {
        "content": "<p>Even the beginner differential equation course we teach in pure maths is different to the beginner course in applied maths which is different to the one in physics etc</p>",
        "id": 572005978,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1770237945
    },
    {
        "content": "<p>The problem is that I know so little that I don't even know what I don't know. So let me start simple. Is there at least one area of differential equations for which there is a self-contained Lean library I could study?</p>",
        "id": 572006092,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770237996
    },
    {
        "content": "<p>How come you know that you'll soon need to work with differential equations? </p>\n<p>If you've never seen anything before then my instinct is that you should be steering well clear of lean at this point and just reading the basic texts which high schoolers read, things like how to solve linear ODEs and so on. My instinct is that lean will make things far more difficult than they need to be because everything is written in such huge generality. </p>\n<p>Here is a concrete example. I wanted to be able to solve basic differential equations like d^2y/dx^2=-y in lean in 2017 because this is what we teach the first years. The solutions are linear combinations of sin and cos. So I was arguing in 2017 that we needed sin and cos and the proof that the derivative of sin was cos. But I was told in no uncertain terms that we did not want to set up the theory of one-variable calculus (which is where literally everyone starts learning about differential equations) because one-variable calculus is a special case of multivariable calculus which needs integration of functions taking values in topological vector spaces which needs theories of integration which I had never heard of in my life and I'm a professional mathematician who took all the undergraduate analysis courses on offer in Cambridge. And indeed this is what came to pass in mathlib. So I'm not even sure that I would understand how to solve that simple differential equation using mathlib (and I still don't know what the Bochner integral is), but I can certainly solve it on paper because I learnt how to when I was in high school.</p>",
        "id": 572007186,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1770238421
    },
    {
        "content": "<p>When I say \"a beginner-friendly library\" I imagine a repository that contains important corollaries explicitly and not just \"the minimum that allows me to do everything somehow\".</p>",
        "id": 572007982,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770238697
    },
    {
        "content": "<p>What those \"important corollaries\" are, I don't know, because I don't know anything.</p>",
        "id": 572008096,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770238743
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113488-general/topic/Differential.20equations.20recommendation/near/572007186\">said</a>:</p>\n<blockquote>\n<p>My instinct is that lean will make things far more difficult than they need to be because everything is written in such huge generality. </p>\n</blockquote>\n<p>My main point is that I want to learn differential equations through Lean notation, not necessarily through Mathlib conventions.</p>",
        "id": 572008276,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770238811
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113488-general/topic/Differential.20equations.20recommendation/near/572007186\">said</a>:</p>\n<blockquote>\n<p>I learnt how to when I was in high school.</p>\n</blockquote>\n<p>Did you mean to imply that you already learnt solving differential equations in high school?</p>\n<p>If it is the case, I am really impressed. When I was in high school, all I could do was to eat glue.</p>",
        "id": 572012224,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770240222
    },
    {
        "content": "<blockquote>\n<p>Based on my preferences, can you recommend which Lean 4 library for differential equations</p>\n</blockquote>\n<p>I'd be positively surprised if the collection of such libraries were non-empty. If you find one, please share it here (and let's discuss if the contents can be raised to mathlib-level and PRed)!</p>",
        "id": 572014280,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1770240912
    },
    {
        "content": "<p>To elaborate, I'm not aware of many self-contained Lean libraries <em>on any topic</em> at all. (I guess the NNG counts, perhaps the Real Analysis game also, and probably a few siblings. Your thesis tries to do that with some research-level mathematics. Is that an exception or are there other projects?)<br>\nMost formalisation projects I have seen do reference an external source.</p>",
        "id": 572014803,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1770241074
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"634338\">Michael Rothgang</span> <a href=\"#narrow/channel/113488-general/topic/Differential.20equations.20recommendation/near/572014803\">said</a>:</p>\n<blockquote>\n<p>To elaborate, I'm not aware of many self-contained Lean libraries <em>on any topic</em> at all.<br>\n(...)<br>\nMost formalisation projects I have seen do reference an external source.</p>\n</blockquote>\n<p>Sorry for my vagueness. I didn't mean \"self-contained\" as \"doesn't depend on Mathlib\". I meant \"self-contained\" in the same sense that my Ph.D. thesis is self-contained.<br>\n<a href=\"https://madvorak.github.io/2026_Dvorak_Martin_Thesis_draft.pdf\">https://madvorak.github.io/2026_Dvorak_Martin_Thesis_draft.pdf</a><br>\nSee Section 3.1 for example.</p>",
        "id": 572015446,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770241297
    },
    {
        "content": "<p>PS: I apologize I wasn't reading your message carefully enough. Indeed, we seem to agree on what we mean by \"self-contained\".</p>",
        "id": 572016335,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770241630
    },
    {
        "content": "<p>TBH, I was hoping that one of the developers of one of the libraries would step in and advertise why their repository is worth reading, even if it wasn't perfect. Right now, I am as clueless as I was when I created this thread.</p>",
        "id": 572101553,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770284903
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/channel/113488-general/topic/Differential.20equations.20recommendation/near/572003300\">said</a>:</p>\n<blockquote>\n<p>I definitely prefer a library that will allow me to move to PDEs with as little changes in notation as possible.</p>\n</blockquote>\n<p>Are you aware how much variety there is in the study of PDEs? Notation is very much the least of your problems.<br>\nAlso I would not recommend learning differential equations through Lean, that sounds like a very bad idea (for basically the reason Kevin said).</p>",
        "id": 572106058,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1770286210
    },
    {
        "content": "<p>I thought it pertinent to quote Iserles here:</p>\n<blockquote>\n<p>The opening line of Anna Karenina, ‘All happy families resemble one another, but each unhappy family is unhappy in its own way’, is a useful metaphor for the computation of ordinary differential equations (ODEs) as compared with that of partial differential equations (PDEs). Ordinary differential equations are a happy family; perhaps they do not resemble each other but, at the very least, we can write them in a single overarching form y′ = f(t, y) and treat them by a relatively small compendium of computational techniques. (True, upon closer examination, even ODEs are not all the same: their classification into stiff and non-stiff is the most obvious example. How many happy families will survive the deconstructing attentions of a mathematician?)</p>\n<p>Partial differential equations, however, are a huge and motley collection of problems, each unhappy in its own way. Most students of mathematics will be aware of the classification into elliptic, parabolic and hyperbolic equations, but this is only the first step in a long journey. As soon as nonlinear – or even quasilinear – PDEs are admitted for consideration, the subject is replete with an enormous number of different problems and each problem clamours for its own brand of numerics. No textbook can (or should) cover this enormous menagerie. Fortunately, however, it is possible to distil a small number of tools that allow for a well-informed numerical treatment of several important equations and form a sound basis for the understanding of the subject as a whole.</p>\n</blockquote>",
        "id": 572107971,
        "sender_full_name": "Dominic Steinitz",
        "timestamp": 1770286752
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"412682\">Moritz Doll</span> <a href=\"#narrow/channel/113488-general/topic/Differential.20equations.20recommendation/near/572106058\">said</a>:</p>\n<blockquote>\n<p>Are you aware how much variety there is in the study of PDEs? </p>\n</blockquote>\n<p>No, I don't. The only thing I know about PDEs is that they are extremely difficult.</p>",
        "id": 572111367,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770287736
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"412682\">Moritz Doll</span> <a href=\"#narrow/channel/113488-general/topic/Differential.20equations.20recommendation/near/572106058\">said</a>:</p>\n<blockquote>\n<p>Also I would not recommend learning differential equations through Lean, that sounds like a very bad idea (for basically the reason Kevin said).</p>\n</blockquote>\n<p>The dealbreaker for me is that the Lean syntax is the only math notation I like.</p>",
        "id": 572111578,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770287802
    },
    {
        "content": "<p>I don't know anything about PDEs, but I know that other mathematical areas can be explained through Lean. So I hope it will be possible here as well.</p>\n<p>Many people say that in places where a formal statement is hard to read, it should be replaced or complemented by an informal statement to ease the reading.</p>\n<p>I disagree. Instead, I say that in places where a formal statement is hard to read, the Lean notation should be improved so that reading the code is as easy as reading its informal counterpart (for a person that knows both syntaxes). There is no good excuse for making Lean definitions and theorem statements unnecessarily hard to read.</p>",
        "id": 572113982,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770288446
    },
    {
        "content": "<p>That Iserles quote maybe also gives a hint as to why there is so little about PDEs in Lean atm.</p>",
        "id": 572719505,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1770629315
    },
    {
        "content": "<p>... besides the usual reason \"nobody did it before\" and analysis in mathlib being less developed than some algebraic areas. (There is work underway to define Sobolev spaces; this shows that we are still missing basic prerequisites. This area can be worked on now, but it needs more people interested in doing so.)</p>",
        "id": 572726490,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1770630831
    },
    {
        "content": "<p>There have been some workshops dedicated to formalizing differential equations in Lean, haven't they?</p>",
        "id": 572728866,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770631440
    },
    {
        "content": "<p>There was one at SLMath last October. <span class=\"user-mention\" data-user-id=\"350992\">@Rémy Degenne</span> and I went and taught Lean to the attendees. We met a few people doing Lean, had good conversations about good next targets, and left with a better understanding of that (and hopefully a small contribution to evangelising Lean), but no particular group project aiming for mathlib-level code.</p>",
        "id": 572730609,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1770631890
    },
    {
        "content": "<p>(The Sobolev space work was already planned before, so I'm not counting that.)</p>",
        "id": 572730707,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1770631916
    }
]