[
    {
        "content": "<p>I assume if you were willing to share your proof, you'd have done it right away, right? Can you at least indicate how long the informal proof is? And maybe let us know if your proof is resolving some long standing open conjecture or question, or if it is something more niche?</p>",
        "id": 493683328,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1736894451
    },
    {
        "content": "<p>i dont know how to answer your question. I don't know what \"right away\" means. I am an recreational math person. I came up with a conjecture. i checked it numerically using a million randomly generated points and A(s) and B(s) matched up to 10 places after the decimal.  that gave me confidence to attempt a proof.  that took me about a month.  its not a long standing, or even short standing, open conjecture.   one of the functions, lets call it A(s), is well known.  i've typed the proof into <a href=\"http://overleaf.com\">overleaf.com</a> and the resulting pdf for the proof part is 6 pages.</p>",
        "id": 493686781,
        "sender_full_name": "Paul Stahura",
        "timestamp": 1736896437
    },
    {
        "content": "<p>I'm new to Lean, too.  I only learned about what Lean can do (was already familiar with the proof assistant concept beforehand) last week after attending the JMM conference which happened to take place in Seattle near where I live.</p>",
        "id": 493687246,
        "sender_full_name": "Paul Stahura",
        "timestamp": 1736896705
    },
    {
        "content": "<p>6 pages of informal proof can be rather intense to formalize, depending on the level of detail and the amount of theory it uses that may still be missing from mathlib – but if you find someone who is interested and they can look at it they will tell you more.</p>\n<p>Also, your deal should also say what happens (compensation wise) when during the formal verification it turns out that the the proof was not correct.</p>",
        "id": 493796866,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1736925685
    },
    {
        "content": "<p>Paul, since the function <code>A(s)</code> is well-known, do you mind sharing what that is? This could give someone a (small) hint about how much work it would be to do what you're asking. (e.g., if it's a well-known function for which we have some API in Mathlib, that's more doable. If we haven't even formalized the definiton of <code>A(s)</code> yet, then you're really asking for two separate things to some extent.)</p>",
        "id": 494001537,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1736969575
    },
    {
        "content": "<p>i didnt realize these messages were public I thought they were DMs so i deleted the last 2</p>",
        "id": 494018954,
        "sender_full_name": "Paul Stahura",
        "timestamp": 1736976014
    },
    {
        "content": "<p>Joachim Breitner to answer your question, I will pay for the person's time up to the point that they find out the formal verification turned out that my proof was not correct (and explain to me why that is the case).  Also, as i said in my first post I'll pay 1/2 the estimate up front.</p>",
        "id": 494026751,
        "sender_full_name": "Paul Stahura",
        "timestamp": 1736979266
    },
    {
        "content": "<p>Discussion thread for <a class=\"stream-topic\" data-stream-id=\"284757\" href=\"/#narrow/channel/284757-job-postings/topic/Lean.20gig.20available\">#job postings &gt; Lean gig available</a></p>",
        "id": 494081316,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1737012679
    },
    {
        "content": "<p>Maybe this should be moved to a \"discussion\" thread? (I've always interpreted this <a class=\"stream\" data-stream-id=\"284757\" href=\"/#narrow/channel/284757-job-postings\">#job postings</a> stream to be similar to announce). I wanted to do it myself (<a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general/topic/Discussion.20.22lean.20gig.20available.22\">#general &gt; Discussion \"lean gig available\"</a> ) but it turns out I don't have permisions to move messages (somehow I thought everyone had)</p>",
        "id": 494081639,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1737012805
    },
    {
        "content": "<p>8 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"284757\" href=\"/#narrow/channel/284757-job-postings/topic/Lean.20gig.20available\">#job postings &gt; Lean gig available</a> by <span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span>.</p>",
        "id": 494081785,
        "sender_full_name": "Notification Bot",
        "timestamp": 1737012855
    }
]