[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"479731\">Lenny Taelman</span> <a href=\"#narrow/channel/113486-announce/topic/Video.20recordings.20*Math.20in.20the.20age.20of.20automated.20proofs*/near/542937448\">said</a>:</p>\n<blockquote>\n<p>Video recordings for the public symposium <em>Mathematics in the age of automated proofs</em> in Leiden are now  <a href=\"https://www.youtube.com/@mechanicalmath\">available on YouTube</a>. The lectures are:</p>\n<ol>\n<li>Thomas Hubert (Google DeepMind): <em>AlphaProof:  From the lab into your hands</em></li>\n<li>Stephanie Dick (Simon Fraser U): <em>After Math: historical perspectives on automated intelligence</em></li>\n<li>Akshay Venkatesh (Institute for Advanced Study): <em>What do we tell our students about AI?</em></li>\n</ol>\n<p>This symposium concluded the workshop <a href=\"#narrow/channel/113486-announce/topic/Mechanization.20and.20Mathematical.20Research/with/519628650\">Mechanization and Mathematical Research</a>, in which quite a few people active here participated.</p>\n</blockquote>\n<p>These are excellent talks finally got an idea of what Deepmind's AlfaProof is doing.<br>\nI just wish all these videos were in a higher resolution (at least 1080p), it's extremely difficult to see the text on the presentation slides. <span class=\"user-mention\" data-user-id=\"479731\">@Lenny Taelman</span>  Are the original slide decks published or available somewhere so we can see what we couldn't in the video (say pdf or pptx or something)?</p>",
        "id": 542988252,
        "sender_full_name": "Somo S.",
        "timestamp": 1759510600
    },
    {
        "content": "<p>Not all speakers have shared their slide decks, but I can put the ones available on the website. And I'll try to upload a higher resolution version (the raw files certainly have a higher resolution, I don't know why it was down sampled).</p>",
        "id": 543073202,
        "sender_full_name": "Lenny Taelman",
        "timestamp": 1759569711
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 543073281,
        "sender_full_name": "Somo S.",
        "timestamp": 1759569792
    },
    {
        "content": "<p>It was a great event, thanks for organizing it and making it public</p>",
        "id": 543982055,
        "sender_full_name": "Marcello Seri",
        "timestamp": 1760021529
    }
]