[
    {
        "content": "<p>This is the discussion thread of DocNextGen.</p>",
        "id": 547801703,
        "sender_full_name": "Tony Beta Lambda",
        "timestamp": 1761767996
    },
    {
        "content": "<p>Great! A few questions to start:</p>\n<p>(1) How often will you be updating the index? Will it be static? Or will it be updated periodically, say, nightly?</p>\n<p>(2) Is it just for Mathlib? I noticed that you just have Mathlib and Init indexed right now, but other packages such as Batteries, Lean4, and Std would be good. Will this be runable for any repository?</p>\n<p>(3) Is there any reason to use jixia over, say, parsing the doc-gen4 output? I am curious what useful data jixia can provide me.</p>\n<p>(4) Will there be any Python package or MCP tooling support?</p>\n<p>Thanks again for putting this together—I am looking forward to playing around with it more. The UI is fun, and I think it would be cool if at some point the main documentation website supported semantic search and informalizations similarly!</p>",
        "id": 547803025,
        "sender_full_name": "Justin Asher",
        "timestamp": 1761768530
    },
    {
        "content": "<p>I had a quick look, and since I'm on a laptop with a not-so-large screen I might be missing a lot.</p>\n<p>(1) I'm a bit surprised that the (theorem/definition/whatever) statements don't contain links, only the \"full source\" does. On this, I prefer the way the current documentation works.</p>\n<p>(2) I like the single click to see the source of just the current statement (instead of the full file, like the current doc does), but also having a link to the full file text would be nice</p>\n<p>(3) (might be screen-size dependent, but this is what I get on my laptop) clicking to see the source of a statement changes the layout significantly: the first column (with the statement itself) becomes larger, to the point that the second column (with the informal statement) becomes almost useless. Maybe instead of a two-column panel one could have the source code above the informal statement? (I can see the need for longer lines when displaying source code)</p>\n<p>(4) Again, when asking for the full source, the width of the panel changes to a different width for each statement (I assume the goal is to match the line lengths in the code). This is a bit unsettling, as having several \"source code\"s displayed and opening/closing one of them sometimes results in unpredictable width changes</p>\n<p>But overall, it seems pretty nice as an option!</p>",
        "id": 547815420,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1761773264
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"780541\">Justin Asher</span> <a href=\"#narrow/channel/113488-general/topic/DocNextGen.20discussion.20thread/near/547803025\">said</a>:</p>\n<blockquote>\n<p>(1) How often will you be updating the index? <br>\n(2) Is it just for Mathlib?<br>\n(3) Is there any reason to use jixia<br>\n(4) Will there be any Python package or MCP tooling support?</p>\n</blockquote>\n<p>(1) Every three month, since mathlib-informal and LeanSearch updates for each Lean v4.x where x == 2 (mod 3)<br>\n(2) It can be run on other packages, but the prompts used in the informalization process is specialized on math; it might or might not work as well for other packages<br>\n(3) I'm using jixia since it has a nice, structured output format and can be tweaked to my need; haven't really tried parsing doc-gen4 output.<br>\n(4) I didn't quite understand this one; do you mean MCP support for DocNextGen or LeanSearch?</p>",
        "id": 547918871,
        "sender_full_name": "Tony Beta Lambda",
        "timestamp": 1761826431
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"726077\">Philippe Duchon</span> <a href=\"#narrow/channel/113488-general/topic/DocNextGen.20discussion.20thread/near/547815420\">said</a>:</p>\n<blockquote>\n<p>I had a quick look, and since I'm on a laptop with a not-so-large screen I might be missing a lot.</p>\n<p>(1) I'm a bit surprised that the (theorem/definition/whatever) statements don't contain links, only the \"full source\" does. On this, I prefer the way the current documentation works.</p>\n<p>(2) I like the single click to see the source of just the current statement (instead of the full file, like the current doc does), but also having a link to the full file text would be nice</p>\n<p>(3) (might be screen-size dependent, but this is what I get on my laptop) clicking to see the source of a statement changes the layout significantly: the first column (with the statement itself) becomes larger, to the point that the second column (with the informal statement) becomes almost useless. Maybe instead of a two-column panel one could have the source code above the informal statement? (I can see the need for longer lines when displaying source code)</p>\n<p>(4) Again, when asking for the full source, the width of the panel changes to a different width for each statement (I assume the goal is to match the line lengths in the code). This is a bit unsettling, as having several \"source code\"s displayed and opening/closing one of them sometimes results in unpredictable width changes</p>\n<p>But overall, it seems pretty nice as an option!</p>\n</blockquote>\n<p>Thanks for the feedback!</p>\n<p>(1) Links in statements will be added<br>\n(2) Links to github source will be added<br>\n(3) &amp; (4) This is bothering me too, and I haven't really found a nice solution; the layout change is quite disruptive, but I want to avoid breaking lines arbitrarily. Right now I'm thinking of adding options to hide the sidebars, which is not a perfect solution but can be helpful. If you have some suggestions please let me know.</p>",
        "id": 547919976,
        "sender_full_name": "Tony Beta Lambda",
        "timestamp": 1761826764
    },
    {
        "content": "<p>For (2) could it be set up to allow the maintainer of a repo to plug in their own model/prompt for the informalization?</p>",
        "id": 548030604,
        "sender_full_name": "Alexander Hicks",
        "timestamp": 1761857221
    },
    {
        "content": "<p>I think every page should include a big warning saying the informalized statements are not reliable because they are AI generated.</p>",
        "id": 548047865,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1761866099
    },
    {
        "content": "<p>In fact, I think it is safe to say: please do not run this on Mathlib and publish the results <em>without</em> such a warning, because the AI generated results, if not labelled as such, could incorrectly reflect poorly on the original authors of the pages.</p>\n<p>(The Apache license of course allows you to do this without such a warning; this is a request for courtesy to the authors.)</p>",
        "id": 548067114,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1761878944
    },
    {
        "content": "<p>Relatedly, it would be good if there was a way to report incorrect informal descriptions!</p>",
        "id": 548160467,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1761918246
    },
    {
        "content": "<p>Agreed, will add a warning and a button to flag inaccurate informal descriptions</p>",
        "id": 558366218,
        "sender_full_name": "Tony Beta Lambda",
        "timestamp": 1763624950
    }
]