[
    {
        "content": "<p>We're in VU talking about documentation. Here's a gist containing a preliminary documentation attempt for <code>group_theory/quotient_group</code>.</p>\n<p><a href=\"https://gist.github.com/kbuzzard/0b5a31f5a362cb32d787bc5059ed4b9d\" target=\"_blank\" title=\"https://gist.github.com/kbuzzard/0b5a31f5a362cb32d787bc5059ed4b9d\">https://gist.github.com/kbuzzard/0b5a31f5a362cb32d787bc5059ed4b9d</a></p>",
        "id": 170636494,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1562854391
    },
    {
        "content": "<p>I think the summaries at the top are useful. On the other hand, I feel like many of the docstrings don't add too much value. Their content can usually be inferred from the name of the declaration, can't it?</p>",
        "id": 170644897,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1562859499
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> mostly formatting nitpicks, in the summary at the top there is some expressions not wrapped in e.g. φ : G → H, where in the docstrings below the same expression wrapped in <code>φ : G → H</code>.  The main thing of note is that in the first case G and H are going to possibly end up using different fonts for G and H.</p>\n<p>The only other thought deals with the References section in the summary, I don't believe i have implemented it yet, but in lumpy it shouldn't be too difficult to enable the <a href=\"https://github.com/raphlinus/pulldown-cmark/blob/master/specs/footnotes.txt\" target=\"_blank\" title=\"https://github.com/raphlinus/pulldown-cmark/blob/master/specs/footnotes.txt\">footnotes</a> extension, I'd probably do so by changing the comment_format field to comment_format = \"cmark+footnotes\" or comment_format=[\"cmark\", \"footnotes\"].  It is a simple addition to implement.  The main issue being deciding on whether we should accept the format, and diverse tooling issues e.g. would vscode tooltip's handle it gracefully?</p>",
        "id": 170840748,
        "sender_full_name": "matt rice",
        "timestamp": 1563123799
    },
    {
        "content": "<p>I would like to make a pitch for more and better documentation. As we begin a new semester and have brand new people joining our Lean group, I'm reminded of just how difficult it still is (in my humble opinion) to get started. Yes, zulip exists and is great, but people are shy and don't really know where to go to get started or how to phrase their questions correctly, etc etc. Even once you have a bit of experience with Lean/mathlib, if you start interacting with a new library, it can be again rather difficult to figure out the \"right\" way to do things without having someone explicitly guide you through it. Perhaps this is just my experience; I'm too lazy to read lots and lots of instructions, and with something like this, I just want to watch like 5 mins of a video of someone actually coding up a proof of something in real time, to see how they do it, what they try that fails, when they look at docs vs <code>exact?</code> vs some other tactic, etc. That way, I can jump right in and start trying to get the hang of it myself.</p>\n<p>This rant is the result of finally getting around to watching Oliver Nash's great lecture at the ICERM meeting about how the manifolds library works, what decisions were made along the way and why, what the key ideas are, etc etc. I think we should have lots more of that, perhaps as youtube videos, or blog posts (or a journal, ahem); something where, without asking on here, someone can go and find out not just what's there and the names of theorems, but how people actually write the code, what they're thinking as they do it, what issues they overcome, etc. Again, perhaps this all exists already and I'm just ignorant? Would be happy to hear some thoughts...</p>",
        "id": 389450563,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1694013155
    },
    {
        "content": "<p>I definitely like the idea of creating video tutorials. That said, the lack of a good documentation is a symptom of having recently moved to a new Lean version. Things change very fast these days.</p>",
        "id": 389452124,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1694013494
    },
    {
        "content": "<p>I totally understand where this is coming from, but the problem with videos is there is no way to update them. We very often see people on Zulip completely confused by an ancient video, where ancient typically means more than one month old.</p>",
        "id": 389453063,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1694013690
    },
    {
        "content": "<p>Latest instance <a href=\"#narrow/stream/270676-lean4/topic/can't.20import.20.22data.2Enat.2Emodeq.22/near/389367689\">here</a>.</p>",
        "id": 389453448,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1694013781
    },
    {
        "content": "<p>We definitely need to update all the documentation (for example we are missing the mathlib4 version of <a href=\"https://leanprover-community.github.io/mathlib_docs/tactics.html\">this</a> I think).</p>",
        "id": 389455126,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1694014110
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/113488-general/topic/documentation/near/389453063\">said</a>:</p>\n<blockquote>\n<p>I totally understand where this is coming from, but the problem with videos is there is no way to update them. We very often see people on Zulip completely confused by an ancient video, where ancient typically means more than one month old.</p>\n</blockquote>\n<p>Yes that's a good point. I suppose one way to update old videos is to get into the habit of regularly making new ones? Then older ones can point in their \"description\"s to the newer ones. This would create a chain, the end of which could be the most recent version...? And maybe there can be a website that documents where to jump to the \"latest\" video (but also have backwards pointers to the historical ones, in case one is interested in how a topic got developed to the state it has)?... I'm just thinking out loud...</p>",
        "id": 389457102,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1694014563
    },
    {
        "content": "<p>my impression is that you need more than that: you actually have to go around deleting old versions, because people just find links on reddit or whatever</p>",
        "id": 389463161,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1694015449
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"130384\">Riccardo Brasca</span> <a href=\"#narrow/stream/113488-general/topic/documentation/near/389455126\">said</a>:</p>\n<blockquote>\n<p>We definitely need to update all the documentation (for example we are missing the mathlib4 version of <a href=\"https://leanprover-community.github.io/mathlib_docs/tactics.html\">this</a> I think).</p>\n</blockquote>\n<p>Haruhisa Enomoto compiled this:<br>\n<a href=\"https://github.com/haruhisa-enomoto/mathlib4-all-tactics/blob/main/all-tactics.md\">https://github.com/haruhisa-enomoto/mathlib4-all-tactics/blob/main/all-tactics.md</a></p>",
        "id": 389908250,
        "sender_full_name": "Ioannis Konstantoulas",
        "timestamp": 1694188445
    },
    {
        "content": "<p>On this topic, we kept having new people come to the Rutgers Lean seminar and needing to start them from scratch. So in an attempt to save us all some time, I recorded a mini \"speed run\" of some parts of the Natural Numbers Game. In case it may be of use to others, it's available here: <a href=\"https://youtu.be/5GkisJ0OImg\">https://youtu.be/5GkisJ0OImg</a><br>\n(Comments/criticisms/suggestions welcome!... I'm sure I'm doing many things suboptimally...)</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"5GkisJ0OImg\" href=\"https://youtu.be/5GkisJ0OImg\"><img src=\"https://uploads.zulipusercontent.net/7f52fab08a18c78402f02f13b9edd93f902cd7bd/68747470733a2f2f692e7974696d672e636f6d2f76692f35476b69734a304f496d672f64656661756c742e6a7067\"></a></div>",
        "id": 392365251,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1695316979
    },
    {
        "content": "<p>I'd call it \"let's play\" rather than \"speed run\".</p>\n<p>That said, I haven't watched your video yet.</p>",
        "id": 392365630,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1695317137
    },
    {
        "content": "<p>Ok so obviously I don't know this gamer terminology... (I thought I was rushing through it quickly while trying to explain to people what I was doing...) [Meme removed, as requested...]</p>",
        "id": 392367262,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1695317826
    },
    {
        "content": "<p>Discussing natural number game speedruns: Yet another great application for a Lean Discord.</p>",
        "id": 392367427,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1695317895
    },
    {
        "content": "<p>I'll let you know when the new version drops and you can have a competition :-)</p>",
        "id": 392444754,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1695362087
    }
]