[
    {
        "content": "<p>Maybe I just missed a thread with the answer, but is there an approximate timeline as to when (if?) it will be possible to use duper in mathlib contributions?</p>",
        "id": 453400676,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1721737191
    },
    {
        "content": "<p>Not as far as I'm aware</p>",
        "id": 453406179,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1721738703
    },
    {
        "content": "<p>I forgot to tag <span class=\"user-mention\" data-user-id=\"436568\">@Josh Clune</span></p>",
        "id": 453414468,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1721740733
    },
    {
        "content": "<p>We do very much intend/hope to add a Mathlib dependency on Duper so that it will be possible to use Duper in Mathlib contributions. Currently, there is a technical challenge pertaining to how olean files are compiled that makes supporting Mathlib's <code>lake exe cache get</code> difficult with a Duper dependency. Our current plan is to work towards a full sledgehammer-like pipeline first (that work is actively underway) and then discuss these technical challenges with the maintainers once there is greater demand. We've been operating under the assumption that most users would find Duper somewhat difficult to regularly use before it's integrated in a full sledgehammer-like pipeline, but I'm open to reconsidering the order in which these problems are tackled if that assumption is off-base. Out of curiosity <span class=\"user-mention\" data-user-id=\"466290\">@Luigi Massacci</span>, are you asking because you're currently wanting to use Duper in Mathlib contributions, or was this just a more general question?</p>",
        "id": 453493117,
        "sender_full_name": "Josh Clune",
        "timestamp": 1721760267
    },
    {
        "content": "<p>There's a chicken and egg problem adding large dependencies to Mathlib. We need to have sufficient confidence in the maintainability of the project (through whatever combination of long term external maintainers and Mathlib maintainers is available). But until it is usable in Mathlib it's harder to get enough usage to polish the project, and recruit the team who will support it!</p>\n<p>Being associated or run out of the Hoskinson Centre certainly helps for credible sustainability externally.</p>",
        "id": 453566259,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1721784398
    },
    {
        "content": "<p>I'm really excited about sledgehammers coming to Lean!</p>",
        "id": 453566317,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1721784436
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"436568\">Josh Clune</span> <a href=\"#narrow/stream/113488-general/topic/Duper.20.26.20Mathlib/near/453493117\">said</a>:</p>\n<blockquote>\n<p>Out of curiosity <span class=\"user-mention silent\" data-user-id=\"466290\">Luigi Massacci</span>, are you asking because you're currently wanting to use Duper in Mathlib contributions, or was this just a more general question?</p>\n</blockquote>\n<p>I asked because I've been playing around with it on toy examples and found it quite cool, but of course I would like to be able to use on non-toy stuff, which is fairly synonymous with Mathlib in my mind</p>",
        "id": 453606445,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1721802300
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"436568\">Josh Clune</span> <a href=\"#narrow/stream/113488-general/topic/Duper.20.26.20Mathlib/near/453493117\">said</a>:</p>\n<blockquote>\n<p>Our current plan is to work towards a full sledgehammer-like pipeline first (that work is actively underway)</p>\n</blockquote>\n<p>Is that work public somewhere?</p>",
        "id": 453652925,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1721815921
    },
    {
        "content": "<p>I believe it is this repo: <a href=\"https://github.com/leanprover-community/lean-auto\">https://github.com/leanprover-community/lean-auto</a></p>",
        "id": 453671668,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1721821877
    },
    {
        "content": "<p>The lean-auto repository that Floris linked is the repository being used to manage the connection between Lean and external provers. It also is used to manage Duper's preprocessing, so Duper has a dependency on it.</p>\n<p>Ultimately, I expect that the repository that actually has the full sledgehammer-like pipeline won't be the lean-auto repository itself, but instead, a separate repository that depends on Duper, on the lean-auto repository, and on a repository that implements premise selection.</p>",
        "id": 453673164,
        "sender_full_name": "Josh Clune",
        "timestamp": 1721822231
    }
]