[
    {
        "content": "<p>I got some encouragement at the ICERM meeting on this prototype:</p>\n<p><a href=\"https://sites.math.rutgers.edu/~alexk/TestRealAnalysis.html\">https://sites.math.rutgers.edu/~alexk/TestRealAnalysis.html</a></p>\n<p>and wanted to stress test it / get some more feedback from the experts on here. The idea is to allow people to hop right on (no installation, no papercuts, just web app) and experiment with nonzero (but easy) math content, in an environment where they have the full freedom to type whatever they want (unlike Natural Number Game which carefully controls what's allowed).</p>\n<p>The user is meant to read each exercise, and click on the \"Open Lean Editor\" button, which pops up a bottom frame preloaded with the desired content for that exercise, running <a href=\"http://live.lean-lang.org\">live.lean-lang.org</a>. When they're satisfied with playing with that exercise, they click the same button to \"Close Lean Editor\", then move on to the next exercise. [This might be interesting to implement also with Mathematics in Lean...]</p>\n<p>Any comments/suggestions would be very welcome! (Perhaps it's better for such to be sent by DM to me, so as not to clog the <code>general</code> discussion?) Thanks!</p>",
        "id": 514475002,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1745622894
    },
    {
        "content": "<p>A couple of minor suggestions:</p>\n<ul>\n<li>Clicking one of the 'Open Lean Editor' buttons currently changes all of the buttons to 'Close Lean Editor', instead of just the one you opened</li>\n<li>In Exercise 1, there's no <code>by</code> in the sorried theorem and example</li>\n</ul>",
        "id": 514475481,
        "sender_full_name": "Aaron Hill",
        "timestamp": 1745623298
    },
    {
        "content": "<p>I think this might overlap with <a href=\"https://github.com/leanprover/verso\">verso</a>. Mb there could be an excercise mode for verso</p>",
        "id": 514475559,
        "sender_full_name": "Frederick Pu",
        "timestamp": 1745623349
    },
    {
        "content": "<p>Minor style issue: the sidebar doesn’t resize / can’t be minimized, so it takes up almost the whole screen on mobile</p>",
        "id": 514477721,
        "sender_full_name": "Quang Dao",
        "timestamp": 1745624690
    },
    {
        "content": "<p>mb we could have notebook style format with a bunch of code blocks and single infoview on the side</p>",
        "id": 514480292,
        "sender_full_name": "Frederick Pu",
        "timestamp": 1745626666
    },
    {
        "content": "<p>that way you can also be able to export a single lean file at the end too</p>",
        "id": 514480301,
        "sender_full_name": "Frederick Pu",
        "timestamp": 1745626681
    }
]