[
    {
        "content": "<p>Hi, I want to ask a question on a project I have in my mind. I found that most (all?) of the theorems in mathlib have a single proof, and I definitely think that it worths to formalize other proofs of the same theorem somewhere, but I don't know if there's a place in mathlib repository for such a purpose (maybe Archive, but I'm not sure about it). For example, I think the quadratic reciprocity is a perfect example of a theorem which is important and with at least 20 different proofs in Oswald Baumgart's book (for a moment, let's not discuss about when two proofs are the same or different). There's one proof <a href=\"https://github.com/leanprover-community/mathlib4/blob/a4c5ecf11c62609afc9440d23079c3a952a22610/Mathlib/NumberTheory/LegendreSymbol/QuadraticReciprocity.lean#L101-L115\">in mathlib</a>, but only one (with slightly different versions, not different proofs). I can definitely make a repository and ask people to contribute, but I want to ask your opinions first. It doesn't need to be the quadratic reciprocity - any theorem with many proofs would also count (e.g. infinitude of primes, Pythagoras theorem, ...).</p>",
        "id": 494469872,
        "sender_full_name": "Seewoo Lee",
        "timestamp": 1737165830
    },
    {
        "content": "<p>I can see the value of this in several ways. It allows certain theorems to be proven through a different file dependency. Maybe this has performance benefits. It also serves as a test of the existing library to see if anything is missing. It can also be pedagogical to present different approaches. However, I worry that it has the opportunity cost of labour that could be used to prove new theorems that do all of the above while expanding mathlib.</p>",
        "id": 494475795,
        "sender_full_name": "Winston Yin (尹維晨)",
        "timestamp": 1737171212
    },
    {
        "content": "<p>I think for quadratric reciprocity or infinitude of primes or pythagoras, there is an easy answer: write a beautiful file for <code>Archive</code> showcasing all the different proofs!</p>\n<p>Once you get past some short list of famous statements with famously many proofs, I think the value of having alternate proofs drops rapidly.</p>",
        "id": 494481708,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1737176604
    },
    {
        "content": "<p>As an example, LeanCamCombi contains <a href=\"https://github.com/YaelDillies/LeanCamCombi/blob/master/LeanCamCombi/Archive/CauchyDavenportFromKneser.lean\">a proof of the Cauchy-Davenport theorem from Kneser's theorem</a></p>",
        "id": 494490398,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1737185010
    },
    {
        "content": "<p>I also agree with Winston: this can be useful.<br>\nIt's an interesting question if formalising the n-th proof of Pythagoras/infinitude of primes/quadratic reciprocity/... is worth it --- but that shouldn't stop you from doing it. (It might only mean not many people join your project.)</p>",
        "id": 494506896,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1737197833
    },
    {
        "content": "<p>Thanks! At least it looks worth to do, and also I can put things under <code>Archive</code> as suggested without making new repo. This is mainly for my own practice, but feel free to join if you are also interested. I may look up infinitude of primes first (easier than quadratic reciprocity?).</p>",
        "id": 494545187,
        "sender_full_name": "Seewoo Lee",
        "timestamp": 1737226896
    },
    {
        "content": "<p>Note that the proof of quadratic reciprocity in mathlib was recently changed by <span class=\"user-mention silent\" data-user-id=\"479359\">Michael Stoll</span>. It previously was the combinatorial proof</p>",
        "id": 494545363,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1737227031
    },
    {
        "content": "<p>Oh that's interesting to know, may I ask why? Also, does it mean that the proof is completely replaced, or the old one remains somewhere in the master branch?</p>",
        "id": 494545481,
        "sender_full_name": "Seewoo Lee",
        "timestamp": 1737227116
    },
    {
        "content": "<p>The point was that the new proof is more general (don't quote me on this). I <em>think</em> the old proof was completely removed, but you will need to check</p>",
        "id": 494545614,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1737227217
    },
    {
        "content": "<p>The ingredients of the combinatorial proof are still there: <a href=\"https://tqft.net/mathlib4files/Mathlib/NumberTheory/LegendreSymbol/GaussEisensteinLemmas\">file#Mathlib/NumberTheory/LegendreSymbol/GaussEisensteinLemmas</a></p>",
        "id": 494552955,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1737233185
    }
]