[
    {
        "content": "<p>Apologies if this has been asked before.  I didn't succeed in finding anything like it.</p>\n<p>One of the nice things about Lean is that there are good, freely available books for learning Lean.  <em>Functional Programming in Lean</em> has been very helpful to me, and I've started reading <em>Theorem Proving in Lean</em> as well.</p>\n<p>I find it helpful to annotate books I read--highlighting or commenting on parts.  I see that there are tools for annotating web pages, but I'm not sure I trust them.  On the other hand, I'm very used to annotating PDFs (in iAnnotate, but there are probably better tools), and it's easy for me to create PDFs of the books using the Print icon.</p>\n<p>The problem for me is that the table of contents for these books is in a part of the web UI that's not included in what gets printed, so I end up with a PDF with no table of contents--not in the text, and not in the separate table of contents information that some PDFs include.  Hundreds of pages with no table of contents is not very useful.</p>\n<p><strong>I'm wondering how easy it would be to at least add a table of contents page within the text of <em>FPIL</em> and <em>TPIL</em>.</strong>  (This seems simpler than generating an extra table of contents structure that appears in a PDF's separate contents window.)  Ideally, the table of contents would provide links to the chapters or sections listed, but even a dead table of contents would be useful.  (<em>TPIL</em> at least, contains a few crosslinks within some paragraphs, to other parts of the book. However, in the PDF, they are links to the web version rather than to other places in the PDF.)</p>\n<p>I know that an intended use of these books is with a Lean-enabled editor handy, and I use the books that way, too.  But I like reading a on tablets and I don't need to try out every code sample.  (There must be others like me.)</p>\n<p>(<em>Mathematics in Lean</em> does generate PDFs with a table of contents page, including links to the chapters and sections.)</p>",
        "id": 426401167,
        "sender_full_name": "mars0i",
        "timestamp": 1710353848
    },
    {
        "content": "<p>The whole pipeline generating Lean documentation is being completely reworked by <span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span> so nothing will change very soon but I’m sure he will note this request and this will be fixed in a couple of months.</p>",
        "id": 426401867,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1710354076
    },
    {
        "content": "<p>Ah--excellent.  Thanks <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span>, and <span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span>.</p>",
        "id": 426407746,
        "sender_full_name": "mars0i",
        "timestamp": 1710356378
    },
    {
        "content": "<p>Glad you are getting value from FPiL! PDF (via TeX) and epub output are planned as important components of the new docs tool. Once we port the content, I'd appreciate feedback - supporting your use case and e-readers is important.</p>",
        "id": 426430973,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1710365919
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 428381989,
        "sender_full_name": "mars0i",
        "timestamp": 1711129726
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/vyteL_qoB9lpe_DLtssGpbYU/tpil4.pdf\">tpil4.pdf</a></p>\n<p><a href=\"/user_uploads/3121/4qx2oTp4Mmxwg9NIzSAPTP7V/tpil4.epub\">tpil4.epub</a></p>\n<p><a href=\"/user_uploads/3121/xEQduVJbP4Z4flGSzw_UcYox/fpil.epub\">fpil.epub</a></p>\n<p><a href=\"/user_uploads/3121/S7J-_kGmiZJMW-s2lvTNq1j1/fpil.pdf\">fpil.pdf</a></p>",
        "id": 429783225,
        "sender_full_name": "Shanghe Chen",
        "timestamp": 1711515772
    },
    {
        "content": "<p>Hi I converted tpil4 and fpil to pdf and epub for temporary usage, using <a href=\"https://github.com/LegNeato/mdbook-typst\">https://github.com/LegNeato/mdbook-typst</a> and <a href=\"https://github.com/Michael-F-Bryan/mdbook-epub\">https://github.com/Michael-F-Bryan/mdbook-epub</a>. It does not work 100 percent right but does contain some internal outlines<span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 429783415,
        "sender_full_name": "Shanghe Chen",
        "timestamp": 1711515870
    },
    {
        "content": "<p>Btw the lean version in the source repo for fpil seems 4.1.0 and a little old?</p>",
        "id": 429783514,
        "sender_full_name": "Shanghe Chen",
        "timestamp": 1711515935
    }
]