[
    {
        "content": "<p>Hello everyone.  I am trying to get leanprojects running on my Mac m2 and I am stuck on a point.</p>\n<p>I seem to have successfully completed steps 1 through 5 on <a href=\"https://leanprover-community.github.io/install/macos.html\">https://leanprover-community.github.io/install/macos.html</a> as I got \"successfully installed\" messages for in the form of </p>\n<ol>\n<li>“visual-studio-code was successfully installed!”</li>\n<li>“Extension 'leanprover.lean4' v0.0.108 was successfully installed.\"</li>\n</ol>\n<p>My goal is to run the code “leanproject get ImperialCollegeLondon/formalising-mathematics-2022”</p>\n<p>On the standard Terminal of Mac.  I am not sure if I need to add some symbol before that code, or if I need to download a new terminal that recognizes that code., but it doesn’t seem to work.</p>\n<p>I am following Lecture 1 on Professor Buzzard’s course on Formalizing mathematics via this YouTube video:<br>\n<a href=\"https://www.youtube.com/watch?v=3XaL0tjnWSk&amp;list=PLVZep5wTamMmRPvCLO4WVpCwkTi1F6OyF&amp;index=1\">https://www.youtube.com/watch?v=3XaL0tjnWSk&amp;list=PLVZep5wTamMmRPvCLO4WVpCwkTi1F6OyF&amp;index=1</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"3XaL0tjnWSk\" href=\"https://www.youtube.com/watch?v=3XaL0tjnWSk&amp;list=PLVZep5wTamMmRPvCLO4WVpCwkTi1F6OyF&amp;index=1\"><img src=\"https://uploads.zulipusercontent.net/e495cf7e635965e0d3cdc9ac37312da66a8b71f7/68747470733a2f2f692e7974696d672e636f6d2f76692f3358614c30746a6e57536b2f64656661756c742e6a7067\"></a></div><p>At minute 2:00 in the video above, Professor Buzzard types “cd lean-projects/“ and then he types in the code of interest “leanproject get ImperialCollegeLondon/formalising-mathematics-2022”.</p>\n<p>Can anyone please advise me on what to do in order to get started in this course?  I would like to familiarize myself with Lean so that I can contribute to mathlib as well as understand how mathlib is organized in hopes of designing a Centralized Education Platform  that I am building that I hope can stimulate mass contributions to digitizing mathematics </p>\n<p>Note: a follow up post regarding the Centralized Education Platform will be made shortly, I should finish an interactive prototype design for the platform mid August, and though I would prefer to make the post about the platform after the prototype is made so that I can include the prototype in the post to gather feedback and hopefully find collaborators, it might be best to make an initial post before the prototype is made in case there are relevant inputs that might shape the design of the platform to include features that will facilitate such contributions.</p>",
        "id": 380988495,
        "sender_full_name": "Jony Vale",
        "timestamp": 1690973146
    },
    {
        "content": "<p>Oops! <code>leanproject</code> is only relevant for Lean 3, but the instructions you are following from <a href=\"https://leanprover-community.github.io/install/macos.html\">https://leanprover-community.github.io/install/macos.html</a> are for Lean 4!</p>",
        "id": 380988776,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690973197
    },
    {
        "content": "<p>I would suggest you stick with Lean 4 (Lean3 is end-of-life and not taking further contributions).</p>",
        "id": 380989067,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690973259
    },
    {
        "content": "<p>Instead of following the instructions from Kevin's video, instead continue on to the instructions in <a href=\"https://leanprover-community.github.io/install/project.html\">https://leanprover-community.github.io/install/project.html</a></p>",
        "id": 380989163,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690973279
    },
    {
        "content": "<p>That will get you set up with the \"mathematics in lean\" project, which is a good learning resource!</p>",
        "id": 380989290,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690973298
    },
    {
        "content": "<p>Awesome, thanks a lot!  I'll try to get started with the link you provided for now, much appreciated!</p>",
        "id": 380989827,
        "sender_full_name": "Jony Vale",
        "timestamp": 1690973400
    },
    {
        "content": "<p>As a general rule, following a one year old video about Lean is very unlikely to do you any good. We are moving way faster than that.</p>",
        "id": 381010528,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1690977504
    },
    {
        "content": "<p>Particularly at the moment the transition to Lean 4, while a huge step forward, is quite disruptive, and has made lots of learning materials obsolete. We're getting there --- please rely on zulip to ask questions when you get stuck!</p>",
        "id": 381010869,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690977574
    },
    {
        "content": "<p>Could we maybe get some banners on the material going if it is still editable by us? Like on github projects a warning in the Readme and on websites one of these top of the page banners that inform people about this?</p>",
        "id": 381011416,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1690977661
    },
    {
        "content": "<p>Thanks a lot guys!  I appreciate the advice.  I'm much more of a pure math guy than a computer guy, but I am making progress.  It seems I am now in the process of cloning clone <a href=\"https://github.com/leanprover-community/mathematics_in_lean.git\">https://github.com/leanprover-community/mathematics_in_lean.git</a>.  This might not be exactly what I am looking for, but ChatGPT is pretty much guiding me the whole way through.  I will post if I get stuck I appreciate the support!</p>",
        "id": 381011788,
        "sender_full_name": "Jony Vale",
        "timestamp": 1690977734
    },
    {
        "content": "<p>ChatGPT was trained up to 2021 when Lean 4 didn't really exist, so this is a dangerous approach. But the mathematics in Lean repo which you're cloning is a perfect place to start in 2023.</p>",
        "id": 381012991,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1690977972
    },
    {
        "content": "<p>Thanks for the warning Professor Buzzard!  I did not think about this.  However, what I did was I copied the relevant text that Scott Morrison referred me to (<a href=\"https://leanprover-community.github.io/install/project.html\">https://leanprover-community.github.io/install/project.html</a>) and pasted it into ChatGPT.  It spat out the following instructions which seems to have been working so far.  I have successfully completed step 4 “clone the project” and now see that this might be exactly what I need as it is a PDF book that is using Lean4.  Now I am in step 6 of the instructions (it just finished actually, and there are no error messages so I am tempted to move to step 7). Below and it seems to be going well.  Please advise me if this will get me into trouble!  I definitely dont want to ruin my computer!</p>\n<p>Here is ChatGPT’s instructions:</p>\n<p>Sure, let's break down the instructions step-by-step, and I'll guide you through each one.</p>\n<p>First, ensure you have all the prerequisites installed on your Mac M2:</p>\n<ol>\n<li><strong>Git:</strong> If you don't have it, you can download and install it from <a href=\"https://git-scm.com/download/mac\">here</a>.</li>\n<li><strong>VS Code:</strong> Download and install it from <a href=\"https://code.visualstudio.com/Download\">here</a>.</li>\n<li><strong>Lake:</strong> This tool manages Lean projects. Instructions to install it should be in the full lake documentation. Refer to that or let me know if you need help finding those details.</li>\n</ol>\n<p>Now, let's follow the instructions to work on an existing project, like the Mathematics in Lean book:</p>\n<ol>\n<li>\n<p><strong>Open Terminal:</strong> It can be found in the Applications folder or by searching in Spotlight.</p>\n</li>\n<li>\n<p><strong>Type the Command:</strong> If you haven't logged in since installing Lean and mathlib, type:</p>\n<p>source ~/.profile</p>\n<p>or </p>\n<p>source ~/.bash_profile</p>\n</li>\n<li>\n<p><strong>Navigate to Directory:</strong> Choose the directory where you'd like the project to live (e.g., your home directory) by using:</p>\n<p>cd path/to/your/directory</p>\n</li>\n<li>\n<p><strong>Clone the Project:</strong> Run:</p>\n<p>git clone <a href=\"https://github.com/leanprover-community/mathematics_in_lean.git\">https://github.com/leanprover-community/mathematics_in_lean.git</a></p>\n</li>\n<li>\n<p><strong>Enter the Project Directory:</strong> Run:</p>\n<p>cd mathematics_in_lean</p>\n</li>\n<li>\n<p><strong>Get Cache:</strong> Run:</p>\n<p>lake exe cache get</p>\n</li>\n<li>\n<p><strong>Launch VS Code:</strong> If you've set up VS Code to launch from the command line, you can type:</p>\n<p>code .</p>\n</li>\n<li>\n<p><strong>Open the Project in VS Code:</strong> If you launched VS Code from a menu, click \"Open\" and choose the folder <code>mathematics_in_lean</code>.</p>\n</li>\n<li>\n<p><strong>Explore:</strong> Follow the MIL instructions to explore the book and exercises.</p>\n</li>\n</ol>\n<p>For creating a new Lean project, you can follow the second part of the instructions provided. If you have any issues or uncertainties with any of the steps, please let me know, and I'll help you through it! It looks like you've got a very comprehensive guide, so you should be well on your way to getting everything set up.</p>",
        "id": 381014624,
        "sender_full_name": "Jony Vale",
        "timestamp": 1690978323
    },
    {
        "content": "<p>I don't understand: why you are using ChatGPT instead of following reliable instructions?</p>",
        "id": 381029992,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1690981101
    },
    {
        "content": "<p>Lol,  I can't remember the error I got, but something went wrong.  In any case, it is all good now.    I think it might have been a silly error, as ChatGPT gave me essentially the same advice as the reliable instructions.  I believe that I was trying to follow Creating a Lean Project rather than follow Working on a Lean Project.  Like I said though, I am now officially have everything set up. <br>\nI have the book opened inside Visual Studios along with the repository.</p>",
        "id": 381034424,
        "sender_full_name": "Jony Vale",
        "timestamp": 1690981847
    },
    {
        "content": "<p>I actually find the \"setting up process\" very cumbersome, and look forward to the day that an OS or terminal is an AI that can handle all of that kind of stuff for you by you just asking for it using plain English</p>",
        "id": 381035081,
        "sender_full_name": "Jony Vale",
        "timestamp": 1690981970
    },
    {
        "content": "<p>I hope I am not in the wrong stream for asking questions about problems I encounter while running code for Mathematics in Lean.  I can change to a different stream or create a new one.  In section 1.2 Overview, I get errors while running the first lines of code (and yes, ChatGPT is definitely not with this stuff).  In particular, when I type in the code </p>\n<p>#check 2 + 2</p>\n<p>def f (x : N) :=<br>\n     x + 3<br>\n#check f</p>\n<p>the first check is underlined in blue.  the x + 3 is underlined in red, and the f is underlined in red.  Hovering over the line \"x + 3\", I see: </p>\n<p>\"failed to synthesize instance<br>\n  HAdd ℕ Nat (?m.112 x)Lean 4<br>\n?m.112 x<br>\na + b computes the sum of a and b. The meaning of this notation is type-dependent.</p>\n<p>No quick fixes available\"</p>\n<p>Can anyone give some advice or point me to a relevant thread for basic questions on running Lean, please?  </p>\n<p>Note: I think that book said to copy the Mathematics in Lean folder so I can update it later, and I did this and named the new folder Jony-Lean.  I can open it just as before and it has the book along with the side bar (repository?) which includes MIL folder with the files that have some code built into it.</p>\n<p>Again, sorry for the basic question!!</p>",
        "id": 381054543,
        "sender_full_name": "Jony Vale",
        "timestamp": 1690985405
    },
    {
        "content": "<p>Never mind, I think I got it.  needed to import a few things....my bad....</p>",
        "id": 381058843,
        "sender_full_name": "Jony Vale",
        "timestamp": 1690986020
    },
    {
        "content": "<p>Can you edit your post to use <a href=\"https://github.com/leanprover-community/mathlib/wiki/Code-in-backticks\">#backticks</a>?</p>",
        "id": 381059308,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690986088
    },
    {
        "content": "<p>I'll try now!  I was working inside the file S01_Getting_Started.lean which did not import anything…when I switched to the file of the section I am on S02_Overview.lean, I saw that I was missing 3 imports and an <code>open Nat</code> line.  This eliminated the red underlined squiggly line and brought some peace.  I think all is well now….I hope I am using the backticks properly, but this is the code:</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"kn\">import</span> <span class=\"n\">Mathlib.Data.Nat.Basic</span>\n<span class=\"kn\">import</span> <span class=\"n\">Mathlib.Data.Nat.Parity</span>\n<span class=\"kn\">import</span> <span class=\"n\">Mathlib.Tactic</span>\n\n<span class=\"kn\">open</span> <span class=\"n\">Nat</span>\n\n<span class=\"k\">#check</span> <span class=\"mi\">2</span> <span class=\"bp\">+</span> <span class=\"mi\">2</span>\n\n<span class=\"kd\">def</span> <span class=\"n\">f</span> <span class=\"o\">(</span><span class=\"n\">x</span> <span class=\"o\">:</span> <span class=\"n\">ℕ</span><span class=\"o\">)</span> <span class=\"o\">:=</span>\n  <span class=\"n\">x</span> <span class=\"bp\">+</span> <span class=\"mi\">3</span>\n\n<span class=\"k\">#check</span> <span class=\"n\">f</span>\n</code></pre></div>\n<p>I think all is well now!</p>",
        "id": 381062712,
        "sender_full_name": "Jony Vale",
        "timestamp": 1690986679
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/113488-general/topic/Getting.20Started.20With.20Lean.20Theorem.20Provers/near/381029992\">said</a>:</p>\n<blockquote>\n<p>I don't understand: why you are using ChatGPT instead of following reliable instructions?</p>\n</blockquote>\n<p>I don't understand why the \"reliable instructions\" are still telling M1/M2 owners to run the x86 version of Lean using Rosetta.</p>",
        "id": 381208118,
        "sender_full_name": "Alistair Tucker",
        "timestamp": 1690991162
    },
    {
        "content": "<p>Could someone with an M1/M2 machine please PR better instructions? I'll get there when I have one, otherwise. :-)</p>",
        "id": 381308872,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1691017156
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"637425\">@Jony Vale</span> Would you like to make your first contribution sooner rather than later? If so, and if you are not using it for anything else, I suggest deleting the x86 installation of Homebrew and starting again. To that end, quit VS Code, download the <a href=\"https://raw.githubusercontent.com/Homebrew/install/HEAD/uninstall.sh\">Homebrew uninstall script</a> into your home directory and run it with <code>/bin/bash uninstall.sh -p /usr/local</code>. Now you can go back to the <a href=\"https://leanprover-community.github.io/install/macos.html\">Mathlib install page</a> and follow the instructions as written for Intel Mac. Tell us what happens! I have just performed the latter step on my own M1 machine and it was successful modulo a failure to detect that VS Code was already installed. If you too end up with a working installation of Apple silicon-native Lean, please make a PR to change the install webpage <a href=\"https://github.com/leanprover-community/leanprover-community.github.io/blob/lean4/templates/install/macos.md\">here</a>. Just strip out the <em>M1 Macs</em> instructions and also remove the qualifying subtitle <em>Intel Macs</em>. I will delete my own equivalent PR which is clearly going nowhere.</p>",
        "id": 381497666,
        "sender_full_name": "Alistair Tucker",
        "timestamp": 1691071723
    }
]