[
    {
        "content": "<p>What is \"google site search\" even supposed to do? If I type <code>mul_add</code> into the mathlib API docs and hit \"google site search\" it sends me to <code>Init.Data.Nat.Basic</code> which is probably not what I want. I'm attempting to try and write a document explaining how to use various search facilities and I'm struggling to explain what this button does!</p>",
        "id": 447850192,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1719601418
    },
    {
        "content": "<p>The button acts as a link to &lt;<a href=\"https://google.com/search?sitesearch=https%3A%2F%2Fleanprover-community.github.io%2Fmathlib4_docs&amp;q=mul_add\">https://google.com/search?sitesearch=https%3A%2F%2Fleanprover-community.github.io%2Fmathlib4_docs&amp;q=mul_add</a>&gt;. What happens after that is Google's secret, but <code>Init.Data.Nat.Basic</code> is the page that has <code>mul_add</code> on it.</p>",
        "id": 447852998,
        "sender_full_name": "Richard Copley",
        "timestamp": 1719602277
    },
    {
        "content": "<p>Tbh we can also just remove that button I think, the vast majority of people is probably not using it</p>",
        "id": 447854732,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1719602824
    },
    {
        "content": "<p>I would say that <code>mul_add</code> was a theorem about semirings and I'm surprised I'm not being directed to the \"correct\" <code>mul_add</code> but rather to far more specific <code>Nat.mul_add</code>. I wonder why it's not giving me the more general theorem?</p>",
        "id": 447864362,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1719605740
    },
    {
        "content": "<p>Google doesn't have any semantic information about what's going on on the docs page. It is literally just asking google's algorithm \"if i were to look for this keyword and limit my results to this domain,what would I get\" What happens is entirely up to Google.</p>",
        "id": 447864664,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1719605843
    },
    {
        "content": "<p>I’m surprised no one has added a “search with Moogle” option.  I find Moogle pretty good for Lean.  (Of course it may go away at any time, but for now it is nice.)</p>",
        "id": 447893312,
        "sender_full_name": "Jason Rute",
        "timestamp": 1719618507
    },
    {
        "content": "<p>I don't think moogle offers any API to do that. When I asked them about one to integrate into my loogle extension, the lack of response was not encouraging</p>",
        "id": 447894009,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719619010
    },
    {
        "content": "<p>Wait, can’t you just prepend <code>https://www.moogle.ai/search/raw?q=</code>.  I assume the search with Google is basically the same sort of thing.</p>",
        "id": 447920181,
        "sender_full_name": "Jason Rute",
        "timestamp": 1719634929
    }
]