[
    {
        "content": "<p>Hi, I am very new to Lean . While  I am learning and trying a few methods to prove equalities for example . I find myself mechanically iterating over different ways to prove something ( more like a brute force) and if I try different and multiple ways, sometimes I reach a point that I completely forget what I tried. Also, it seems the info view only displays steps to reach a goal in a linear  manner; some proofs are not linear . So I was thinking to add another infoview ( maybe call it graphview) to record/log everything that have been tried and display step that led to accomplishing  a goal and dead ends as a graph .  Do you think such a feature is useful?  is this already implemented ? Is someone currently implementing something similar, so I can tag along ? ( I got inspired from the MLops tools people use such as n8n and MLflow)</p>",
        "id": 532905197,
        "sender_full_name": "Nadim Farhat",
        "timestamp": 1754396630
    },
    {
        "content": "<p>I think instead of writing a 100 line proof you can make a new lemma every time you reach a new step instead</p>",
        "id": 532907807,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1754397584
    },
    {
        "content": "<p>and then the log you want will be the lemmas you separate out</p>",
        "id": 532907842,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1754397592
    },
    {
        "content": "<p>The PaperProof VS Code extension may be relevant: <a href=\"https://github.com/Paper-Proof/paperproof\">https://github.com/Paper-Proof/paperproof</a>.</p>",
        "id": 532909346,
        "sender_full_name": "Anand Rao Tadipatri",
        "timestamp": 1754398123
    },
    {
        "content": "<p>This sounds a lot like what <span class=\"user-mention\" data-user-id=\"479299\">@Jovan Gerbscheid</span> and others have developed with their <code>boxproof</code> thing</p>",
        "id": 532929029,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1754404035
    },
    {
        "content": "<p>Hmm, it's not quite what <code>boxproof</code> is doing. But it's not clear to me exactly what you'd want to see in the graphview.</p>\n<p>You say the info view displays steps to get to a goal in a linear manner. I think this is not quite right. The infoview only shows one step. And you can see the linear structure by moving the cursor through the proof script.</p>",
        "id": 532937388,
        "sender_full_name": "Jovan Gerbscheid",
        "timestamp": 1754406715
    },
    {
        "content": "<p>now i have a clearer idea on what to do , maybe something like that <a href=\"https://askra.de/software/prooftree/\">https://askra.de/software/prooftree/</a> , is there a widget for that?</p>",
        "id": 542981654,
        "sender_full_name": "Nadim Farhat",
        "timestamp": 1759508458
    }
]