[
    {
        "content": "<p>I've noticed that <code>grind</code> seems unable to solve non <code>Prop</code> goals, so something like <code>example (x : Nat) : Nat := by grind</code> fails. Is this expected to be a permanent limitation?</p>\n<p>This is a curiosity which isn't well motivated by a real use case, but it came up in the context of prodding <code>grind</code>'s behaviour around <code>Exists</code>, where it seems unable to produce even trivial witnesses. I'm primarily just asking because I find <code>grind</code> interesting, but I'm also curious what the ambition is in terms of how <code>grind</code> will deal with existential quantifiers; it seems to hit dead ends in even trivial cases at the moment, but perhaps this is largely down to lack of annotations.</p>",
        "id": 558793574,
        "sender_full_name": "Sam",
        "timestamp": 1763796376
    },
    {
        "content": "<p>As a tangential generalisation of this question, is the goal of grind that, if hypothetically supplied with the right satellite solvers (which can be done by users?), it should be able to solve any goal? Up to reasonable complexity/time/resource limits of course.</p>",
        "id": 558794432,
        "sender_full_name": "Sam",
        "timestamp": 1763797300
    },
    {
        "content": "<p>My guess is that <code>grind</code> is using <code>false_or_by_contra</code> somewhere internally so if you give it a non-prop goal then it basically forgets the goal and just tries to prove a contradiction.</p>",
        "id": 558800906,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1763803678
    },
    {
        "content": "<p>Ah that does sound consistent with what I've observed. I suppose that means this is a hard limitation then.</p>",
        "id": 558813958,
        "sender_full_name": "Sam",
        "timestamp": 1763816881
    },
    {
        "content": "<p>If you look at the error that <code>grind</code> reports, you can even see that the goal is <code>False</code>.</p>",
        "id": 558814253,
        "sender_full_name": "Chris Henson",
        "timestamp": 1763817178
    },
    {
        "content": "<p>Yeah true. I did partially make that connection, but I suppose I'm asking whether it could/should be smarter about not trying to prove non prop goals by contradiction, or whether this is simply completely out of scope. For goals or subgoals which would normally use witnesses, is the assumption that there will always be some other theorem which can be used without manually supplying the witness?</p>\n<p>These might be stupid questions. I'm not much of a lean user or that well mathematically educated, and am mostly interested in <code>grind</code> from the sidelines for its potential applicability to other domains around program verification.</p>",
        "id": 558814662,
        "sender_full_name": "Sam",
        "timestamp": 1763817689
    },
    {
        "content": "<p>I wonder whether you are looking for <code>canonical</code> if you want to fill in data.</p>",
        "id": 558818346,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1763821410
    },
    {
        "content": "<p>So the first question really is what you'd want <code>grind</code> to do in this case. If the goal is a <code>Prop</code>, that's easy, because any value (proof) is as good as the next - this is proof irrelevance. But if you need a natural number, it tends to matter whether you get 0 or 37</p>",
        "id": 558818806,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1763821891
    },
    {
        "content": "<p>I came across this while playing with whether <code>grind</code> could handle <code>example : ∃ _ : Nat, True := by grind</code> which is a case where we do reasonably want to synthesise a value. However, I suppose the more sensible way is a grind annotation on something like <code>exists_const</code>?</p>",
        "id": 558819183,
        "sender_full_name": "Sam",
        "timestamp": 1763822249
    },
    {
        "content": "<p>My example is obviously so contrived as to perhaps be completely unrepresentative of almost any real use case.</p>",
        "id": 558819261,
        "sender_full_name": "Sam",
        "timestamp": 1763822334
    },
    {
        "content": "<p>Don't hold your breath on <code>grind</code> providing existential witnesses. We don't know of any sensible way to do this that doesn't introduce surprising behaviour and/or performance problems. Our intention is to deal with all the low hanging fruit of <code>grind</code> features that are predictable, fast, and helpful, and to have a think about existential witnesses again further down the track.</p>",
        "id": 558856531,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1763862427
    }
]