[
    {
        "content": "<p>Tomorrow I will be meeting with my combinatorics professor, for the purpose of telling him about lean.</p>\n<p>I would really appreciate it if you could give me ideas to present to him tomorrow in order to convince him of the importance of formalization in general, and with lean in particular.</p>\n<p>I'm aware this has been discussed before, I read some arguments on the Xena project blog for example, but my hope here is to find arguments that would convince a combinatorialist specifically, although more general advice is appreciated too.</p>",
        "id": 435349544,
        "sender_full_name": "Rida Hamadani",
        "timestamp": 1714037693
    },
    {
        "content": "<p>I think it really depends on the goal of your presentation, that is, what you'd expect as an \"adoption success\".<br>\nSome professors in this community have been using Lean to teach undergrads, giving them assignments etc. I'm sure Patrick and others can tell you plenty about that.<br>\nThere are also formalization projects led by some professors (and maybe some projects led by students?). Heck, if I were studying mathematics, I would <em>love</em> to be involved in some project like this. Not necessarily to develop cutting edge mathematics... just to be less of a loner and to improve my coordination skills.</p>\n<p>There are of course adoption barriers. Some professors may not want to change their ways of teaching, maybe for good reasons (they might have perfected it through decades) or maybe for bad reasons (they might just dislike changing even when things are going sideways). Also, some students may dislike the experience of doing the setup, sometimes talking to a computer terminal, or simply learning the tactics DSL</p>",
        "id": 435371548,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1714045930
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span> is giving a talk about combinatorics in lean tomorrow in Singapore (in just over 12 hours' time); ask them for their talk slides and borrow from them! Also check out his Xena Project blog post about formalising combinatorics, it's one of the most recent posts there. Also check out Tao's AMS talk from January on YouTube, the one on formalisation. Or get your combinatorics professor to watch it! Sorry no links, on mobile right now :-(</p>",
        "id": 435384214,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1714050123
    },
    {
        "content": "<p>Thank you very much, I'll check out these resources!</p>",
        "id": 435387118,
        "sender_full_name": "Rida Hamadani",
        "timestamp": 1714050982
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"451983\">Arthur Paulino</span> <a href=\"#narrow/stream/113488-general/topic/Help.20me.20sell.20Lean.20to.20my.20professor/near/435371548\">said</a>:</p>\n<blockquote>\n<p>I think it really depends on the goal of your presentation, that is, what you'd expect as an \"adoption success\".</p>\n</blockquote>\n<p>Any progress towards making \"formalizing mathematics\" a thing in my university would be a good step. In a perfect world, I would be able to convince my professor to formalize some paper he finds particularly important, maybe as the thesis of some masters student, or perhaps have a talk about lean in the next conference that occurs at the university.</p>",
        "id": 435387145,
        "sender_full_name": "Rida Hamadani",
        "timestamp": 1714050991
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"210574\">Patrick Massot</span>'s <a href=\"https://www.google.com/url?sa=t&amp;source=web&amp;rct=j&amp;opi=89978449&amp;url=https://www.imo.universite-paris-saclay.fr/~patrick.massot/files/exposition/why_formalize.pdf&amp;ved=2ahUKEwi1xYfWud2FAxXLv4kEHTWnCMwQFnoECBMQAQ&amp;usg=AOvVaw34js2L2fWWGdFRCq2vJSee\">why formalize mathematics</a> is excellent.</p>",
        "id": 435387693,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1714051145
    },
    {
        "content": "<p>Thank you, I will check it too.</p>",
        "id": 435387786,
        "sender_full_name": "Rida Hamadani",
        "timestamp": 1714051179
    },
    {
        "content": "<p>One link from me: <a href=\"https://www.youtube.com/watch?v=WimtCW8Qn2U\">https://www.youtube.com/watch?v=WimtCW8Qn2U</a> was to the additive combinatorics webinar, on an older project. Some specific examples aren't covered by anything so far but I think are interesting:<br>\n1) The snark conjecture is a big conjecture (which implies the four colour theorem) but its proof has been announced by well-known researchers in the area, but the proof is mostly unpublished and its status is <a href=\"https://math.stackexchange.com/questions/3692582/what-is-the-current-status-of-the-snark-theorem\">therefore wildly unclear</a>. Formalisation of something like this would be difficult but if organised possibly together with the authors, would be cool. Provided the authors are interested and there's enough community momentum (come formalise a different proof of the four colour theorem that's stronger!), I'd argue this is also feasible given the rate combinatorics can be formalised (cf ramsey project, PFR) and the success in formalising a \"moving target\" with authors' help (cf ConNF)<br>\n2) Formalisation of a theorem can help understanding / fixing it, both for students and for the authors! In unit-fractions, some of the constants inside theorem statements were changed for formalisation (in a way which doesn't affect the main result, but were technically incorrect as written) but would be subtle to notice unless you were looking <em>very</em> closely. I understand Scholze commented during LTE that seeing the formalisation procedure helped him view the proof in a conceptually different way (don't quote me on this one, but I'm sure someone else can find the quote). For Ramsey, I wanted to formalise it mostly because I thought it was a cool proof that I wanted to understand (which I now do).</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"WimtCW8Qn2U\" href=\"https://www.youtube.com/watch?v=WimtCW8Qn2U\"><img src=\"https://uploads.zulipusercontent.net/833485ecdb720350927e32445bf209ee509bedd6/68747470733a2f2f692e7974696d672e636f6d2f76692f57696d74435738516e32552f64656661756c742e6a7067\"></a></div>",
        "id": 435389818,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1714051757
    },
    {
        "content": "<p>Awesome! Thank you for mentioning the snark conjecture, this sounds like a great project to work on even if I didn't find success in convincing my professor.</p>",
        "id": 435391148,
        "sender_full_name": "Rida Hamadani",
        "timestamp": 1714052089
    },
    {
        "content": "<p>Also: <a href=\"https://youtu.be/ywJF4as9ocA?t=3250\">https://youtu.be/ywJF4as9ocA?t=3250</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"ywJF4as9ocA\" href=\"https://youtu.be/ywJF4as9ocA?t=3250\"><img src=\"https://uploads.zulipusercontent.net/8ec8a9e066590a5071f0c4659b3d9000aed23aea/68747470733a2f2f692e7974696d672e636f6d2f76692f79774a46346173396f63412f64656661756c742e6a7067\"></a></div>",
        "id": 435391847,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1714052274
    },
    {
        "content": "<p>This special issue of the Bulletin of the AMS may help:<br>\n<a href=\"https://www.ams.org/journals/bull/2024-61-02/?active=current\">https://www.ams.org/journals/bull/2024-61-02/?active=current</a></p>",
        "id": 435396931,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1714053596
    },
    {
        "content": "<p>All the above resources are a good idea, but the key to the <em>selling</em> part is to make the fruits of formalisation relatable to your prof and show them that formalisation addresses something they care about or a meta-problem they face at their work. If you emphasise the \"checking the correctness\" part heavily, then you risk giving them the impression that formalisation is essentially concerned with working out minor details of proofs and checking them.</p>",
        "id": 435413248,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1714058289
    },
    {
        "content": "<p>Shreyas this is one reason my text that have been cited is <em>not</em> emphasizing this “checking correctness” aspect.</p>",
        "id": 435413532,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1714058399
    }
]