[
    {
        "content": "<p>I really enjoyed Will's talk and got helpful ideas about how to approach using VSCode/Lean more effectively.  I just returned to reading Mathematics in Lean. I suggest here a UI interface feature where we could type in the rw tactic, highlight a sub-expression in the goal (shown in Infoview), then specify a theorem, and the system will supply or suggest the arguments to apply the theorem for rewriting the highlighted sub-expression.  This might be better than the current behavior in which the system highlights the sub-expression it chooses.  Similar features for other tactics would be good too.</p>",
        "id": 464870128,
        "sender_full_name": "Seth Chaiken",
        "timestamp": 1724516748
    },
    {
        "content": "<p>Perhaps such a feature could work by first inserting a <code>conv</code> and the appropriate navigation commands, then using <code>rw?</code>. In that case it would be necessary first to implement <code>rw?</code>as a conv tactic.</p>",
        "id": 464879584,
        "sender_full_name": "Richard Copley",
        "timestamp": 1724521641
    },
    {
        "content": "<p>A prototype of such a tactic can be seen here (CC: <span class=\"user-mention\" data-user-id=\"479299\">@Jovan Gerbscheid</span> ): <a href=\"#narrow/stream/287929-mathlib4/topic/Point.26Click.20library.20rewrite.20tactic/near/427677844\">https://leanprover.zulipchat.com/#narrow/stream/287929-mathlib4/topic/Point.26Click.20library.20rewrite.20tactic/near/427677844</a></p>",
        "id": 464900851,
        "sender_full_name": "Anand Rao Tadipatri",
        "timestamp": 1724532707
    },
    {
        "content": "<p>That thread is really long, but essentially I've made a tactic which does what you ask, called <code>rw??</code> (I still need to make it work without a pre-computed cache of the library). The tactic lets you click on a subexpression, and then suggests all possible rewrites to do in that position. You can then select one of these, and the relevant <code>rw</code> tactic will be pasted into the editor</p>",
        "id": 465037281,
        "sender_full_name": "Jovan Gerbscheid",
        "timestamp": 1724614055
    }
]