[
    {
        "content": "<p>Are there any community recommended books about the history of proof assistants? Or indeed, any books at all. <br>\nI have vague notions of things like the Logic Theorist and Automath, the controversies surrounding the Four Color Theorem and Hale's work on Euler's Conjecture, but never really read something more comprehensive, so I'm looking for book /article recommendations!</p>",
        "id": 406951239,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1702137625
    },
    {
        "content": "<p>This is a great question. </p>\n<p>There's a wonderful book, \"Handbook of Practical Logic and Automated Reasoning\", by John Harrison. It's a \"literate program\", in some sense, of the various algorithms useful for proof assistants based on first-order logic, but generalizes to higher-order logic in the obvious ways. Each chapter ends with a review of the literature, for you to look further in whatever topics interest you.</p>\n<p>As far as a more direct history of proof assistants, there are a couple of good papers. Hermann Geuvers' \"Proof assistants: History, ideas and future\" (<a href=\"https://www.ias.ac.in/article/fulltext/sadh/034/01/0003-0025\">https://www.ias.ac.in/article/fulltext/sadh/034/01/0003-0025</a>) is a good read.</p>\n<p>The only other paper which discusses the <em>history</em> of interactive theorem proving is John Harrison, Josef Urban and Freek Wiedijk's \"History of interactive theorem proving\" (<a href=\"https://www.cl.cam.ac.uk/~jrh13/papers/joerg.pdf\">https://www.cl.cam.ac.uk/~jrh13/papers/joerg.pdf</a>)</p>",
        "id": 406953599,
        "sender_full_name": "Alex Nelson",
        "timestamp": 1702139553
    },
    {
        "content": "<p>The Handbook was thrown at me (not literally fortunately) by one of the logic professors in our CS department, but that is really a reference textbook, I was looking for something  like the other two papers, thank you!</p>",
        "id": 406954226,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1702140211
    },
    {
        "content": "<p>For a short read, Formal Proof by Thomas Hales is nice: <a href=\"https://cmartinez.web.wesleyan.edu/documents/FP.pdf\">https://cmartinez.web.wesleyan.edu/documents/FP.pdf</a></p>",
        "id": 407129266,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1702258665
    }
]