[
    {
        "content": "<p>Hi, I want to use lean to formalize some theorems and do some metaprogramming as well. I have recently read some documentation about Lean 4, such as Theorem Proving in Lean, Functional Programming in Lean and Metaprogramming in Lean 4. There's still quite a long way before I can use Lean for development. Could you give me some suggestions about what to do next to ultimately become a developer of Lean 4, like learning from the source code of Lean 4 and mathlib?</p>",
        "id": 449311967,
        "sender_full_name": "fra guu",
        "timestamp": 1720185429
    },
    {
        "content": "<p>I think the best way is to work on a project. Do you have an idea you want to work on? I think you should just start working on it and ask on Zulip whenever you get stuck.</p>",
        "id": 449313246,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1720185962
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"346070\">Tomas Skrivan</span> <a href=\"#narrow/stream/113488-general/topic/How.20to.20be.20a.20developer.20of.20Lean.204.20and.20what.20to.20do.20next.3F/near/449313246\">said</a>:</p>\n<blockquote>\n<p>I think the best way is to work on a project. Do you have an idea you want to work on? I think you should just start working on it and ask on Zulip whenever you get stuck.</p>\n</blockquote>\n<p>Thank you for your suggestion, I will start trying it out.</p>",
        "id": 449317477,
        "sender_full_name": "fra guu",
        "timestamp": 1720187316
    },
    {
        "content": "<p>Do you have any concrete idea right now? I'm curious and people here might be able to point you in the right direction on where to start.</p>",
        "id": 449318147,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1720187533
    },
    {
        "content": "<p>This discussion might be interesting to find an interesting project: <a href=\"#narrow/stream/113488-general/topic/.22Missing.20Tactics.22.20list\">https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/.22Missing.20Tactics.22.20list</a></p>",
        "id": 449322797,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1720189007
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"346070\">Tomas Skrivan</span> <a href=\"#narrow/stream/113488-general/topic/How.20to.20be.20a.20developer.20of.20Lean.204.20and.20what.20to.20do.20next.3F/near/449318147\">said</a>:</p>\n<blockquote>\n<p>Do you have any concrete idea right now? I'm curious and people here might be able to point you in the right direction on where to start.</p>\n</blockquote>\n<p>I want to use Lean's metaprogramming capabilities to implement a programming language, which is mainly used to describe algorithms for a special domain. In other words, algorithms and programs can be written using the defined syntax within Lean files, and the correctness of the algorithms and the proving of related theorems can be achieved through Lean's type system. Perhaps it goes like this: the first step is to define the syntax by 'syntax' and 'macro', and the second step is to define the semantics.</p>",
        "id": 449334150,
        "sender_full_name": "fra guu",
        "timestamp": 1720192502
    },
    {
        "content": "<p>Never start with the syntax. Start with your desired semantics</p>",
        "id": 449387711,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1720209408
    },
    {
        "content": "<p>Also, what's your end goal for this? Who are your anticipated end users? Are you familiar with their working style and the kind of language design that will be of use to them?</p>",
        "id": 449387792,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1720209469
    },
    {
        "content": "<p>Also, when you say algorithms, what sort of a model are you talking about? There are a gazillion of them</p>",
        "id": 449388175,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1720209629
    },
    {
        "content": "<p>The language is designed for quantum programming to formally verify quantum algorithms and quantum programs. The mathematics used in quantum computation mainly involves linear algebra. </p>\n<p>The syntax and some semantics have already been designed preliminarily, and while there are existing quantum programming languages used to run real quantum programs, they are not convenient for formal verification. </p>\n<p>The next step is to consider the semantics in detail and how to implement them in Lean. Therefore, I want to learn more about the mechanics of Lean and find some relevant projects.</p>",
        "id": 449427360,
        "sender_full_name": "fra guu",
        "timestamp": 1720234244
    },
    {
        "content": "<p>The basics of lean can be learnt from the functional programming in lean, and metaprogramming in lean books. As for the rest you'd have to ask an expert on at least one of PL design or quantum algorithms.</p>",
        "id": 449467890,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1720258986
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"725842\">@fra guu</span> If you've not seen it already, <a href=\"https://github.com/inQWIRE\">inQWIRE</a> is a pretty mature collection of Coq libraries for quantum computing. Verification of circuits, optimizations, IR, etc.</p>",
        "id": 449494184,
        "sender_full_name": "Chris Henson",
        "timestamp": 1720271901
    }
]