[
    {
        "content": "<p>Thank you for augmenting your book with this great Lean plotline! I am not sure if I would gone through exercises on paper, but with a modern tool, it is much more fun!</p>\n<p><strong>Exercise_3_6_6b</strong> was a challenging one. First, it differs a little bit from the one in the book and does not have <em>Like_</em> prefix to indicate this (the book version is formulated in terms of powersets). </p>\n<p>Also, as I suppose, the answer here is the Universal set of U. But it is hard to find documentation on the universal set in Lean 4. Are there any neat examples of how universal sets are manipulated? Because I suspect that my proof is a dirty one <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 393423517,
        "sender_full_name": "Mykhailo Kilianovski",
        "timestamp": 1695803399
    },
    {
        "content": "<p><a href=\"#narrow/stream/113488-general/topic/How.20To.20Prove.20It.20with.20Lean/near/393423517\">A message</a> was moved here from <a class=\"stream-topic\" data-stream-id=\"113486\" href=\"/#narrow/stream/113486-announce/topic/How.20To.20Prove.20It.20with.20Lean\">#announce &gt; How To Prove It with Lean</a> by <span class=\"user-mention silent\" data-user-id=\"110087\">Scott Morrison</span>.</p>",
        "id": 393423813,
        "sender_full_name": "Notification Bot",
        "timestamp": 1695803475
    },
    {
        "content": "<p>Yes, the solution is to use the universal set of U.  One way to define it would be <code>{ x : U | x = x }</code>.  (Another possibility, using an idea that is not introduced until later in <em>How To Prove It With Lean</em>, would be <code>{ x : U | True }</code>.)  You don't need any special facts about universal sets to solve the exercise--just use the definition of this set theory notation.</p>",
        "id": 393485584,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1695820735
    },
    {
        "content": "<p>You're right that the problem statement is slightly different from the statement in the print version of <em>How To Prove It</em>.  The type <code>Set U</code> in this problem plays the same role as the power set of U in the print version.  But they both mean essentially the same thing: the collection of all sets whose elements come from U.</p>",
        "id": 393486998,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1695821197
    }
]