[
    {
        "content": "<p>Those who frequent the Natural Sciences channel may know that I’m working on a project <a href=\"https://github.com/HEPLean/HepLean\">HepLean</a> to formalise high energy physics into Lean. </p>\n<p>There are three sets of people who may be interested in getting involved in such a project:</p>\n<ol>\n<li>High energy physicists. </li>\n<li>Mathematicians with a general interest in Lean and physics. </li>\n<li>Computer scientists with a general interest in Lean and physics.  </li>\n</ol>\n<p>I’m working with people from the high energy physicists community with the aim of getting more people from set 1 involved, using e.g. physics-focused  Lean blueprints. </p>\n<p>Here I would like input from the community on how I can get more people from sets 2 and 3 involved in this, or similar science-orientated projects? </p>\n<p>In other words, what would make you, dear reader, more likely to, and want to, contribute to this, or similar science-orientated projects? </p>\n<p>Some ideas I’ve had:</p>\n<ol>\n<li>A TODO list of things that need doing in the project. (this can be found <a href=\"https://heplean.github.io/HepLean/TODOList\">here</a>)</li>\n<li>A list of mathematical-orientated physics papers which would be nice to formalise. (including for example: <a href=\"https://inis.iaea.org/collection/NCLCollectionStore/_Public/16/082/16082062.pdf\">this paper</a>)</li>\n</ol>",
        "id": 469122790,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1725980608
    },
    {
        "content": "<p>Given the preponderance of mathematicians in the existing user base, I think it would be helpful to have one or more roadmaps where the content \"is clearly maths\" but the destination is physics.</p>\n<p>It's an honest mathematical theorem to describe the electron states in a hydrogen atom. What would we need to get there? etc</p>",
        "id": 469231932,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1726010542
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span>! This is a nice suggestion :), and I will see what I can do in that direction.</p>",
        "id": 469368361,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726053606
    },
    {
        "content": "<p>I’m planning on making a similar blueprint for a chemical engineering thermodynamics class of problems. In this, we want more than just proofs, but executable programs, as well, so certain data-science-oriented tools in Lean will be on our To Do list, too.</p>",
        "id": 469487487,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1726082056
    },
    {
        "content": "<p>Consider advertising this in the <a href=\"#narrow/stream/445230-Lean-for-Scientists-and-Engineers-2024\">https://leanprover.zulipchat.com/#narrow/stream/445230-Lean-for-Scientists-and-Engineers-2024</a> channel, too! Some who took the course might appreciate ideas on how they can contribute to projects like HepLean.</p>",
        "id": 469487645,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1726082127
    },
    {
        "content": "<p>Thermodynamics worries me a bit, as it is very hard to connect to foundations, so it's unclear whether you're doing physics or just \"manipulating symbols\". :-)</p>",
        "id": 469535176,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1726106954
    },
    {
        "content": "<p>Why do you say that? Isn’t thermodynamics all about differential forms?</p>",
        "id": 469602785,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1726130749
    },
    {
        "content": "<p>Hmm, maybe, I guess I only ever learnt thermodynamics before I learnt maths, and never went back to see how you're meant to do it. :-)</p>",
        "id": 469609563,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1726132264
    },
    {
        "content": "<p>I have been thinking about how to implement something along the lines of Kim’s suggestion above in a project like HepLean.</p>\n<p>Here is one plan:<br>\nIn addition to <code>lemma</code> and <code>definition</code> etc, the commands <code>informal_lemma</code> and <code>informal_definition</code>. With, for example,<code>informal_lemma</code> containing the information of a physics statement of the lemma as a LaTeX string, a self-contained math statement of the lemma as a  LaTeX string, and a list of informal and formalized dependencies. This is similar to \"proof_wanted\" except even more informal.</p>\n<p>Such <code>informal_lemma</code>'s and <code>informal_definition</code>'s would be placed in Lean code at the expected place the formal versions would be expected to appear. A script similar to the script which makes blueprints could be used to nicely display the informal definitions and lemmas (perhaps alongside formal versions).</p>\n<p>I'm sure something like this has been proposed before. My hope is that it could provide something like the roadmaps Kim mentioned above, in a way that is more integrated with the Lean code.</p>\n<p>Do people think such an idea would work and be useful, with regard to my initial comment above?</p>",
        "id": 469610458,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726132439
    },
    {
        "content": "<p>(To be clear, I wasn't suggesting anything informal. I wanted to define <code>-∇^2 - 1/r</code> as unbounded operator on L^2(R^3), etc. There's plenty of room in just a doc-string to say \"This is the Schrodinger operator for hydrogen.\")</p>",
        "id": 469617384,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1726134059
    },
    {
        "content": "<p>My comment is referring to the roadmaps, i.e. before formalisation has taken place. So e.g. initially there would be something like:</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">informal_definition</span><span class=\"w\"> </span><span class=\"n\">hydrogen_schrodinger_operator</span><span class=\"w\"> </span><span class=\"o\">:=</span><span class=\"w\"> </span><span class=\"s2\">\"The Schrodinger operator for hydrogen defined as an unbounded operator on L^2(R^3).\"</span>\n</code></pre></div>\n<p>Then later someone can come along and make this a formal definition </p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"sd\">/-- The is the Schrodinger operator for hydrogen. -/</span>\n<span class=\"kn\">def</span><span class=\"w\"> </span><span class=\"n\">hydrogen_schrodinger_operator</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">L</span><span class=\"bp\">^</span><span class=\"mi\">2</span><span class=\"o\">(</span><span class=\"n\">R</span><span class=\"bp\">^</span><span class=\"mi\">3</span><span class=\"o\">)</span><span class=\"w\"> </span><span class=\"o\">:=</span><span class=\"w\"> </span><span class=\"bp\">...</span>\n</code></pre></div>\n<p>I.e. the <code>informal_definition</code>s etc would form the roadmap.</p>",
        "id": 469620234,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726134676
    },
    {
        "content": "<p>Or more in line what I'm thinking the informal definition could be something like:</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">informal_definition</span><span class=\"w\"> </span><span class=\"n\">hydrogen_schrodinger_operator</span><span class=\"w\"> </span><span class=\"kn\">where</span>\n<span class=\"w\">   </span><span class=\"n\">physics</span><span class=\"w\"> </span><span class=\"o\">:=</span><span class=\"w\"> </span><span class=\"s2\">\"The Schrodinger operator for hydrogen\"</span>\n<span class=\"w\">   </span><span class=\"n\">math</span><span class=\"w\"> </span><span class=\"o\">:=</span><span class=\"w\"> </span><span class=\"s2\">\"The unbounded operator on L^2(R^3), defined as  -∇^2 - 1/r\"</span>\n<span class=\"w\">   </span><span class=\"n\">dependencies</span><span class=\"w\"> </span><span class=\"o\">:=</span><span class=\"w\"> </span><span class=\"o\">[</span><span class=\"n\">wavefunction</span><span class=\"o\">]</span>\n</code></pre></div>",
        "id": 469620592,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726134765
    },
    {
        "content": "<p>I think I belong to 2 (I would call myself a mathematical physicist but surely not a high-energy physicist). I find the general idea of your project interesting, and to attract more people, it is somewhat similar to Kim's suggestion but I think it would be nice to have a clear documentation, rather than codes, of what  results you would like to have in Lean and what math you need to formalise them.</p>\n<p>For example, I see an entry called <code>StandardModel</code>, but what are the actual mathematical contents? Do you want to write down the (classical) action? Do you want to define the scattering amplitudes in QED as formal series? It would be helpful to have (human-language) statements first.</p>",
        "id": 469650842,
        "sender_full_name": "Yoh Tanimoto",
        "timestamp": 1726142298
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"382902\">@Yoh Tanimoto</span> Would my suggestion above provide sufficient such documentation? I'm imagining the informal definitions and lemmas to be turned into a blueprint type human-language webpage. (Just the documentation source code itself would form part of the Lean code).</p>\n<p>Actually I don't think there is a command called <code>StandardModel</code> yet in HepLean, though there is a namespace which contains some properties of the standard model, like the Higgs field. But I understand your point.</p>",
        "id": 469655346,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726143315
    },
    {
        "content": "<p>well, the format is ok. What I would like to see is more of a general line like what are the main definitions/results of the whole project.</p>",
        "id": 469658852,
        "sender_full_name": "Yoh Tanimoto",
        "timestamp": 1726144141
    },
    {
        "content": "<p>Ok, thanks this makes sense. </p>\n<p>The project is meant to mirror Mathlib, rather than, for example the Fermat Last Theorem project. I.e. there is not a single target, but a more broad aim of generalising (any) results from high energy physics, and having a place to put foundational definitions and results. </p>\n<p>For example, if someone wants to formalise the classical action of the Standard Model, or define scattering amplitudes for QED, or show that certain beyond-the-standard-model models are bounded etc, HepLean would be a good place to put them. There are no preset targets. </p>\n<p>At least this is the aim of the project. However, I have thought about creating a list of possible targets people could aim for if they are interested in contributing to HepLean.</p>",
        "id": 469661978,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726144886
    },
    {
        "content": "<p>(In other words HepLean is meant to be a monolithic project for formalising high energy physics, allowing one to connect different parts of the field together, and removing the need to reproduce results in different places.)</p>",
        "id": 469662799,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726145067
    },
    {
        "content": "<p>I see. Still, I think it's good to show what the standard model should look like and how practical calculations work in Lean (it's \"standard\"!).</p>",
        "id": 469679176,
        "sender_full_name": "Yoh Tanimoto",
        "timestamp": 1726148361
    },
    {
        "content": "<p>This is something I am interested in doing. But we are still a long way from that point. Namely, we still need good definitions of fermions, good definitions of a gauge group, of a feynman diagram etc, before we can write down the correct formulation of, for example, the classical action of the standard model. (I note things like the Higgs potential are already in HepLean). I.e. there is lots to do, and any help is appreciated!</p>\n<p>I'm hoping  something like Kim or my suggestion above will increase progress in this direction. (I note though, there is a lot more to High energy physics than the standard model which may be worth formalising, for example TFTs, CFTs etc. HepLean is by no means restricted to standard-model physics or phenomenology.)</p>",
        "id": 469682050,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726148980
    },
    {
        "content": "<p>Absolutely, and exactly for this, I thought writing some important stuff in the human language would be quicker and helpful</p>",
        "id": 469687231,
        "sender_full_name": "Yoh Tanimoto",
        "timestamp": 1726150236
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"653351\">@Joseph Tooby-Smith</span> Thank you for sharing your proposal. I'm trying to fully understand your idea. Could you please clarify the benefits of incorporating <code>informal_definition</code>s and <code>informal_lemma</code>s into the Lean code of a blueprint-driven project, especially considering how the blueprint currently works?</p>",
        "id": 469788360,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1726178787
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"556875\">@Pietro Monticone</span> I'm not proposing <code>informal_definition</code>s and <code>informal_lemma</code>, I'm proposing them for Mathlib style projects, where one wants to indicate theorems and definitions to be formalized and their interdependencies. </p>\n<p>Here are the benefits I see: </p>\n<ol>\n<li>Everything is in one place: The informal commands will appear right next to the formal ones. One does not need to open a separate repo, or even file, to edit and see the informal commands. </li>\n<li>Varies backends for displaying the informal commands: The informal commands could be displayed using something like the current blueprint infrastructure, or some other infrastructure which can display them. The user writing these informal commands would not have to worry about what back-end code is being applied to them.</li>\n<li>Location information: The informal commands will appear where their formalized versions are to appear. They can be moved around and refactored in the same way as formalized commands. </li>\n</ol>\n<p>I see the informalized commands being deleted once the corresponding formal command has been made. The content of the informal command could be placed in the doc-string of the formal commands.</p>",
        "id": 469910902,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726219862
    },
    {
        "content": "<p>Oh, now I see what you mean. Thanks for the clarification.</p>",
        "id": 469914274,
        "sender_full_name": "Pietro Monticone",
        "timestamp": 1726220654
    },
    {
        "content": "<p>I am a pure math researcher and don't know much about theoretical physics. A huge benefit of formalization for mathematicians is that one can be sure that all math are consistent (we don't say x=+1 here and x=-1 there). The idea of having a single consistent theory with solid mathematical ground may attract more math oriented people, especially after making them 'uncomfortable' by showing some inconsistent calculations from research level physics and potential issues arised from that - are there any?</p>",
        "id": 469931729,
        "sender_full_name": "Jineon Baek",
        "timestamp": 1726225117
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"242240\">@Jineon Baek</span> Given that papers in high energy physics are rarely, if ever, reviewed for mathematical correctness - the answer to this is yes. Even some of my own papers, I've - post publication - discovered that I've overlooked a mathematical caveat and had to go back and prove a bunch of things to make sure what I was doing was correct.</p>\n<p>I also expect there are examples which have cost a lot of money and a lot of research hours. B-anomalies in particle phenomenology are somewhat an example of this.</p>\n<p>There are often debates in high energy physics about missing minus signs or factors of two etc, some of which make it into <code>comments</code> on the arXiv. At some point I would like to do a project which sorts out such a debate or finds an inconsistency using Lean. Anyone in helping with such a project should let me know :).</p>",
        "id": 469968237,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726234595
    },
    {
        "content": "<p>For this <code>informal_definition</code> and <code>informal_lemma</code> thing. An example of such an implementation is here:</p>\n<p><a href=\"https://github.com/HEPLean/HepLean/pull/152/files\">https://github.com/HEPLean/HepLean/pull/152/files</a></p>",
        "id": 469968924,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726234718
    },
    {
        "content": "<p>(I should also note that I'm hoping that these <code>informal_definition</code> and <code>informal_lemma</code> will allow physicists who aren't so interested in learning Lean get more involved).</p>",
        "id": 469991250,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726239666
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"653351\">@Joseph Tooby-Smith</span>,  for whatever it's worth, I think that there may be some philosophers of physics who might be very interested in this project and its goals.  Not necessarily to help with proofs, but maybe that too.  They might just be interested in paying attention to what's being done in this project.  My area is philosophy of biology, but if you think it might be worthwhile, I would ask around with philosophers of physics.</p>",
        "id": 470012990,
        "sender_full_name": "mars0i",
        "timestamp": 1726246104
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"617444\">@mars0i</span> ! I think this is a great idea! I personally don't have any philosophers of physics in my network, if you happen to know any letting them know about this project would be great!</p>",
        "id": 470063026,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726269489
    },
    {
        "content": "<p>OK--reaching out to friends ....</p>",
        "id": 470098700,
        "sender_full_name": "mars0i",
        "timestamp": 1726289652
    },
    {
        "content": "<p>do you think the project could incorporate </p>\n<ul>\n<li>Principal bundle theory</li>\n<li>Connections</li>\n<li>The De Rham homomorphism</li>\n</ul>",
        "id": 470233788,
        "sender_full_name": "Dean Young",
        "timestamp": 1726351551
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"739358\">@Dean Young</span> !</p>\n<p>Yes I do. With the caveat that Mathlib seems a better place for the general theory behind these things. However, all or part of the general theory can also sit in HepLean until ready to go into Mathlib.</p>\n<p>We will certainly want specific manifestations of these in HepLean, and properties of these specific manifestations. Principal bundles and connections would be useful now, and there are certain directions people could go in which will make De Rham cohomology etc useful. (Topological terms is an example).</p>",
        "id": 470323449,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726399401
    },
    {
        "content": "<p>I have the first implementation of informal definitions and informal lemmas and their display here: <a href=\"https://heplean.github.io/HepLean/Informal.html\">https://heplean.github.io/HepLean/Informal.html</a>. Going forward I plan to: </p>\n<ol>\n<li>Make them more detailed, giving a 'roadmap' style thing. </li>\n<li>Display them as a dependency graph. (update: Now done <a href=\"https://heplean.github.io/HepLean/graph.svg\">here</a>)</li>\n</ol>",
        "id": 470654965,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1726502143
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"617444\">mars0i</span> <a href=\"#narrow/stream/113488-general/topic/How.20to.20get.20the.20Lean.20community.20involved.20formalising.20physics.3F/near/470012990\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"653351\">Joseph Tooby-Smith</span>,  for whatever it's worth, I think that there may be some philosophers of physics who might be very interested in this project and its goals.  Not necessarily to help with proofs, but maybe that too.  They might just be interested in paying attention to what's being done in this project.  My area is philosophy of biology, but if you think it might be worthwhile, I would ask around with philosophers of physics.</p>\n</blockquote>\n<p>If you or any of your colleagues are curious about my work in formalizing chemistry, let me know, I'd love to chat!</p>",
        "id": 470706905,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1726512092
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"424214\">@Tyler Josephson ⚛️</span>.  Cool.  There are many philosophers of physics, but few philosophers of chemistry--and odd fact about philosophy of science.  However, I think some of the philosophers of physics may be interested, so I'll try to pass it on.  (Personally, I am curious but given my fairly shallow knowledge of chemistry, I don't think I'll pursue it further at present.)</p>",
        "id": 471029462,
        "sender_full_name": "mars0i",
        "timestamp": 1726589649
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"617444\">@mars0i</span> I found this <a href=\"https://link.springer.com/journal/10698\">journal</a> just this week - looks like an interesting community. I'm an amateur philosopher, myself, but a professional chemical engineer; I've certainly never had formal philosophical training (nor do I write humanities-style articles), but I think bringing formal logic into chemistry requires a philosophical perspective that most engineers don't have.</p>",
        "id": 471030878,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1726590073
    },
    {
        "content": "<p>Ah, very nice <span class=\"user-mention\" data-user-id=\"424214\">@Tyler Josephson ⚛️</span>.  I didn't know about that journal.  Maybe there's a lot more work in philosophy of chemistry than I knew about.</p>",
        "id": 471341106,
        "sender_full_name": "mars0i",
        "timestamp": 1726690632
    }
]