[
    {
        "content": "<p>I'm trying to use the Lean Parser to parse some custom syntax. I need to support different tokens from the builtin ones (think of a different syntax for number literals or identifiers).<br>\nI believe this requires to define some <code>Lean.Parser.Parser</code>s and <code>Lean.Parser.ParserFn</code>s, but after spending a whole day on it, I'm still completely lost. Providing those objects doesn't seem to be enough, as other parts of the language come to byte me (I'm getting \"don't know how to generate formatter for non-definition '{ ... }'\" errors... wat?)</p>\n<p>Is it possible to extend Lean's parser with some custom tokens? How can I do that?<br>\nYesterday Frédéric Dupuis suggested using a different parser, <code>lean4-parser</code>, which could be a good alternative. Unfortunately it comes with no expression parsing capabilities and no elaborators to improve the experience.<br>\nEither approach seem to require a huge amount of work.</p>",
        "id": 491640394,
        "sender_full_name": "Spanky",
        "timestamp": 1735838238
    },
    {
        "content": "<p>Are you trying to parse a superset of Lean syntax, or your own language that only partially overlaps with Lean?</p>",
        "id": 491643081,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1735839566
    },
    {
        "content": "<p>My own language. It should be possible to use the <code>syntax</code> command to define grammar, but the grammar terms are not compatible with e.g. <code>ident</code>.</p>",
        "id": 491648608,
        "sender_full_name": "Spanky",
        "timestamp": 1735842438
    },
    {
        "content": "<p>I noticed that:</p>\n<ul>\n<li><code>Lean.Data.Json.Parser</code> and <code>Lean.Data.Xml.Parser</code> don't use <code>Lean.Parser</code>, but rather <code>Std.Internal.Parsec</code>.</li>\n<li>There's a project named <a href=\"https://github.com/opencompl/C-parsing-for-Lean4/\">C-parsing-for-Lean4</a> which uses the Lean4's parser to parse C code. However they use a special version of Lean4, with a modified parser: <a href=\"https://github.com/Kha/lean4/tree/vcustom-tokens\">Kha/lean4:vcustom-tokens</a>.</li>\n</ul>\n<p>This suggests to me that it's currently not possible (or at least not practical) to extend the standard Parser of the official Lean releases to parse arbitrary tokens.</p>\n<p>I'm new here and I don't know how things work, but I'd be really interested in help improve the parser. What should I do, if I wanted to try?<br>\nAlso, why was <code>Kha/lean4:vcustom-tokens</code> never merged? Should I try to get in touch with Kha (would it be polite to ping Sebastian Ullrich here?) to understand what went wrong and if it would make sense to continue working on that effort?</p>",
        "id": 491700059,
        "sender_full_name": "Spanky",
        "timestamp": 1735875894
    },
    {
        "content": "<p>Here's the draft PR for the <code>custom-tokens</code> branch: <a href=\"https://github.com/leanprover/lean4/pull/2293\">lean4#2293</a>. (I guess <code>vcustom-tokens</code> is a tag for some older version of it?)</p>\n<p><a class=\"message-link\" href=\"/#narrow/channel/270676-lean4/topic/Haskell-like.20custom.20parsers.20in.20quasiquotations.3F/near/393935893\">#lean4 &gt; Haskell-like custom parsers in quasiquotations? @ 💬</a>  is the last mention of the tag here. (<span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> has been busy with other features in the meantime, but I'm sure it's still true that hearing people are looking forward to it increases its priority!)</p>",
        "id": 491703748,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1735879458
    },
    {
        "content": "<p>Thanks a lot for finding that PR and those Zulip messages!</p>\n<p>Through those links I learned about Alloy, which is doing exactly what I need.<br>\nAt this point I'm going to copy/fork its parser and roll with it to keep prototyping.</p>\n<p>I see that Sebastian Ullrich and Mac Malone are both working on cool features that might make parsing much nicer in the future (the <code>custom-tokens</code> API and the <code>μdo</code> notation). Really excited about how nice parsing is going to be soon!</p>",
        "id": 491706349,
        "sender_full_name": "Spanky",
        "timestamp": 1735881583
    },
    {
        "content": "<p>Here's a relatively self-contained example of a custom token in the wild: <a href=\"https://github.com/leanprover/verso/blob/bc3e242d81700fbe82ecf5a27d492c0869260c37/src/verso/Verso/Output/Html.lean#L125-L164\">Verso's embedded HTML templates</a></p>",
        "id": 491949141,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1736066458
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"815997\">@Spanky</span> What is <code>μdo</code> notation?</p>",
        "id": 496547294,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1738157019
    }
]