[
    {
        "content": "<p>Hi all,</p>\n<p>I'm a high school student who's recently taken up quite an interest in Lean (sorry if I'm not supposed to be making posts like these; I'm new to the Lean Zulip channel). I learned enough to get a part time job over the summer formalizing olympiad problems in Lean4, which wasn't too tricky, and I'm now interested in contributing something larger.</p>\n<p>I looked at the list of 100 theorems to formalize in Lean4 and an unformalized result that seemed really interesting was the fact that pi is transcendental. So my friend and I decided to create a blueprint project on what we should do. Earlier today, we found a proof that builds everything from the ground up in a book called Making Transcendence Transparent by Burger and Tubbs and finished formalizing a proof for the irrationality of e; we are currently in the process of proving that e^k, where k is an integer, is irrational. </p>\n<p>But I have two concerns with this: one is that we're reinventing the wheel, since it's difficult to see how much has actually been completed here already, and two is that this is too difficult of a project for two high schoolers to actually make progress on. I was really inspired by the proof and research paper about proving Aprey's theorem (i.e. irrationality of zeta(3)) but I'm not really sure what interesting and nontrivial result would be novel to prove in Lean4. </p>\n<p>So I'm considering dropping the project before we sink too much time into it – if this is the best course of action to take, please let me know. But I'm still interested in doing something unique with Lean4, so please suggest anything I could help with.</p>",
        "id": 553539341,
        "sender_full_name": "Cameron Rampell",
        "timestamp": 1762239780
    },
    {
        "content": "<p>There's an open pull request that covers that already, I'm afraid. I should probably add a link to it</p>",
        "id": 553539615,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1762239934
    },
    {
        "content": "<p>The theorems on that list that are accessible to new lean users are all done, I'm afraid</p>",
        "id": 553539694,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1762239970
    },
    {
        "content": "<p>That is, if you want to contribute to mathlib. If you just want to do a project as a learning experience, that doesn't matter. But in that case, you might want to pick something where you already have a pretty good grasp of the mathematics</p>",
        "id": 553539892,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1762240091
    },
    {
        "content": "<p>That's a bummer. Stuff like the four color theorem or Green's theorem seemed way out of reach, so I avoided them; I was also considering formalizing the isoperimetric inequality, but then I realized that also required Green's theorem...</p>\n<p>Is there anything about the same difficult as formalizing Aprey's theorem that relatively new lean users could try out? It'd be cool to have a big project like that to work on.</p>",
        "id": 553540348,
        "sender_full_name": "Cameron Rampell",
        "timestamp": 1762240311
    },
    {
        "content": "<p>I don't know where you interests lie, but there are also some projects with more applied math/physics/CS flavor. These might be easier to jump in with something more greenfield as you seem to want. Some examples (each of these have channels here) are <a href=\"https://github.com/leanprover/cslib\">CSlib</a>, <a href=\"https://github.com/Timeroot/Lean-QuantumInfo\">QuantumInfo</a>, and <a href=\"https://github.com/HEPLean/PhysLean\">PhysLean</a>. (Not to discourage you at all from contributing to Mathlib, just giving a sampling of what is out there)</p>",
        "id": 553543998,
        "sender_full_name": "Chris Henson",
        "timestamp": 1762242100
    },
    {
        "content": "<p>Also, most formalisation projects uncover missing lemmas and library improvements, besides being one of the best ways to learn Lean.</p>",
        "id": 553544387,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1762242267
    },
    {
        "content": "<p>In general, I'd recommend becoming clear about what area you want to contribute in (formalisation can be extremely fun, but is also difficult - I highly recommend starting with a piece of mathematics you know really well), and then asking a focused thread about that area. If you'd like, I can try to help you by pinging some relevant people on such a thread.</p>",
        "id": 553547932,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762243787
    },
    {
        "content": "<p>I strongly believe there are good projects in every area, also for your level - but the list of these sometimes sits in the heads of people (and changes over time).</p>",
        "id": 553548026,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762243814
    },
    {
        "content": "<p>Your message sounds like you like elementary number theory. I remember the existence of infinitely many Carmichael numbers being a proposed project a year ago. IIRC <span class=\"user-mention\" data-user-id=\"406490\">@María Inés de Frutos Fernández</span> proposed that: can you update us on the status of that? Do you think this would be an appropriate project here/ can you suggest others? (Thanks a lot. You're a lot closer to number theory than I am!)</p>",
        "id": 553548280,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762243905
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> Yes, I'd say I'm a fan of elementary number theory. Another option may be to formalize some results in Euclidean geometry – my friend and I are both olympiad type people, and I have a bit of experience with that already since I've formalized some (albeit very basic) geometry problems in Lean. But I've been told by people who know far more higher math than I do that Euclidean geometry isn't exactly relevant, and it's also a bit annoying to formalize.</p>",
        "id": 553628931,
        "sender_full_name": "Cameron Rampell",
        "timestamp": 1762266536
    },
    {
        "content": "<p>Would something like working on formalizing Brun’s Theorem be a way to contribute?</p>",
        "id": 553633292,
        "sender_full_name": "Cameron Rampell",
        "timestamp": 1762267444
    },
    {
        "content": "<p>I think you're asking the wrong question, in some sense. It's quite difficult nowadays for someone who's pre-university to contribute to Lean's mathematics library, because pretty much all of the stuff which was accessible to people at undergrad level or below was picked off several years ago. In the 2010s I spent a lot of my time trying to attract mathematics undergraduates into this area, but now I don't do this at all, I focus far more on PhD students, because I ran out of ideas of interesting projects for undergraduates a few years ago, and I'm assuming that you know less than a typical undergraduate at this point. I need people to help me prove Fermat's Last Theorem, and undergraduates are unfortunately typically of no use here because the material is too complex. </p>\n<p>I think that the way for someone like you contribute in general, or prepare for mathlib contributions in the future, is to learn more about how the software and the mathematics library works, and the way to do that is to find a theorem (perhaps at a more challenging level than anything you've tried before) for which you understand the underlying mathematics, and just go ahead and try to prove it, and ask here when you get stuck. You'll almost certainly learn something. This way you'll be learning more about the software and will be preparing yourself for meaningful contributions later. </p>\n<p>So, for example, I would say: if you understand the proof of Brun's theorem, go right ahead and formalize Brun's theorem! Don't worry about \"contributing\", concentrate right now on learning.</p>",
        "id": 553642080,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1762269394
    },
    {
        "content": "<p>I should add that many people here (including myself) would be very happy to guide you through your first formalisation project so long as the topic bears some relevance to research mathematics</p>",
        "id": 553647967,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1762270836
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"634338\">Michael Rothgang</span> <a href=\"#narrow/channel/113488-general/topic/How.20can.20I.20make.20meaningful.20contributions.20with.20Lean.3F/near/553548280\">said</a>:</p>\n<blockquote>\n<p>I remember the existence of infinitely many Carmichael numbers being a proposed project a year ago. IIRC @María Inés de Frutos Fernández proposed that: can you update us on the status of that? Do you think this would be an appropriate project here/ can you suggest others?</p>\n</blockquote>\n<p>I proposed a project about Carmichael numbers for last year's formalization course in Bonn (define Carmichael numbers, prove some basic results including Korselt's criterion, and prove that 561 is the smallest Carmichael number).<br>\nSome students did this, but as far as I know they never PR'd it to Mathlib.<br>\nThat being said, I agree with Kevin's point above, I would recommend to start with a project that is interesting to you without worrying about whether it is in the library.</p>",
        "id": 553659464,
        "sender_full_name": "María Inés de Frutos Fernández",
        "timestamp": 1762273516
    },
    {
        "content": "<p>(Just to chime in on Carmichael numbers: I think formalizing the proof that there are infinitely many is quite hard. IIRC, this involves some heavy asymptotic analysis.)</p>",
        "id": 553660391,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1762273735
    },
    {
        "content": "<p>(This was not part of the project).</p>",
        "id": 553660946,
        "sender_full_name": "María Inés de Frutos Fernández",
        "timestamp": 1762273873
    },
    {
        "content": "<p>Now that we have quadratic algebras we can compute the ring of integers and the discriminant (someone already mentioned the ring of integers today)</p>",
        "id": 553661377,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1762273974
    },
    {
        "content": "<p>Oh that is a good point! It would be cool to establish the isomorphism between the integers of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"double-struck\">Q</mi><mo stretchy=\"false\">(</mo><msqrt><mi>d</mi></msqrt><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">\\mathbb{Q}(\\sqrt{d})</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1.1822em;vertical-align:-0.25em;\"></span><span class=\"mord mathbb\">Q</span><span class=\"mopen\">(</span><span class=\"mord sqrt\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.9322em;\"><span class=\"svg-align\" style=\"top:-3em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"mord\" style=\"padding-left:0.833em;\"><span class=\"mord mathnormal\">d</span></span></span><span style=\"top:-2.8922em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"hide-tail\" style=\"min-width:0.853em;height:1.08em;\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"400em\" height=\"1.08em\" viewBox=\"0 0 400000 1080\" preserveAspectRatio=\"xMinYMin slice\"><path d=\"M95,702\nc-2.7,0,-7.17,-2.7,-13.5,-8c-5.8,-5.3,-9.5,-10,-9.5,-14\nc0,-2,0.3,-3.3,1,-4c1.3,-2.7,23.83,-20.7,67.5,-54\nc44.2,-33.3,65.8,-50.3,66.5,-51c1.3,-1.3,3,-2,5,-2c4.7,0,8.7,3.3,12,10\ns173,378,173,378c0.7,0,35.3,-71,104,-213c68.7,-142,137.5,-285,206.5,-429\nc69,-144,104.5,-217.7,106.5,-221\nl0 -0\nc5.3,-9.3,12,-14,20,-14\nH400000v40H845.2724\ns-225.272,467,-225.272,467s-235,486,-235,486c-2.7,4.7,-9,7,-19,7\nc-6,0,-10,-1,-12,-3s-194,-422,-194,-422s-65,47,-65,47z\nM834 80h400000v40h-400000z\"/></svg></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.1078em;\"><span></span></span></span></span></span><span class=\"mclose\">)</span></span></span></span> and the appropriate <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=QuadraticAlgebra#doc\">docs#QuadraticAlgebra</a> , that might well be accessible to Cameron and I could imagine finding a place for it in mathlib. QuadraticAlgebra is new so there's some low-hanging fruit here.</p>",
        "id": 553675554,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1762277680
    },
    {
        "content": "<p>Is Lindemann-Weierstrass done? I seem to remember that it's in mathlib, but only partially proved. Normally I would consider that to be beyond what high-school students can do, but if Cameron is already working through Burger and Tubbs then maybe it's not out of reach. (By the way, <em>Irrationality and Transcendence in Number Theory</em> by David Angell is another excellent resource for someone trying to teach themselves this topic.)</p>",
        "id": 553690108,
        "sender_full_name": "Timothy Chow",
        "timestamp": 1762281929
    },
    {
        "content": "<p>It's an open PR</p>\n<blockquote>\n<p>feat: Lindemann-Weierstrass Theorem <a href=\"https://github.com/leanprover-community/mathlib4/pull/28013\">#28013</a></p>\n</blockquote>",
        "id": 553691106,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1762282334
    },
    {
        "content": "<p>Review of <a href=\"https://github.com/leanprover-community/mathlib4/pull/29121\">#29121</a> is welcome</p>",
        "id": 553691547,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1762282510
    },
    {
        "content": "<p>Reviewing PRs containing interesting stuff is definitely making a meaningful contribution :-)</p>",
        "id": 553692775,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1762283002
    },
    {
        "content": "<p>Reviewing PRs is also a great way to get to know a new repo, especially in a repo like mathlib with a dynamic chat like this Zulip server. I wouldn't recommend asking beginner questions in the PR itself, but questions are definitely welcome here on Zulip.</p>\n<p>\"On PR such and such, why did _ do _? What does _ mean?\"</p>",
        "id": 553694493,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1762283598
    },
    {
        "content": "<p>Some PRs are merged with TODOs. If you spot something you believe you can tackle, why not?</p>",
        "id": 553694831,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1762283730
    },
    {
        "content": "<p>Here's a list of issues tagged as <code>good first issue</code>: <a href=\"https://github.com/leanprover-community/mathlib4/issues?q=is%3Aissue%20state%3Aopen%20label%3A%22good%20first%20issue%22\">https://github.com/leanprover-community/mathlib4/issues?q=is%3Aissue%20state%3Aopen%20label%3A%22good%20first%20issue%22</a></p>\n<p>Here's the result of searching \"TODO\" on the mathlib4 repo: <a href=\"https://github.com/search?q=repo%3Aleanprover-community%2Fmathlib4%20TODO&amp;type=code\">https://github.com/search?q=repo%3Aleanprover-community%2Fmathlib4%20TODO&amp;type=code</a></p>",
        "id": 553695506,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1762284011
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"985790\">Cameron Rampell</span> <a href=\"#narrow/channel/113488-general/topic/How.20can.20I.20make.20meaningful.20contributions.20with.20Lean.3F/near/553539341\">said</a>:</p>\n<blockquote>\n<p>I'm a high school student who's recently taken up quite an interest in Lean (sorry if I'm not supposed to be making posts like these; I'm new to the Lean Zulip channel). I learned enough to get a part time job over the summer formalizing olympiad problems in Lean4, which wasn't too tricky, and I'm now interested in contributing something larger.</p>\n</blockquote>\n<p>So what's the part time job? <span class=\"user-mention\" data-user-id=\"985790\">@Cameron Rampell</span></p>",
        "id": 568204289,
        "sender_full_name": "cwrv",
        "timestamp": 1768482070
    }
]