[
    {
        "content": "<p>The \"main\" part of mathlib(3) is in <code>/src</code> but there are a few files in <code>/archive</code>, e.g. <code>archive/100-theorems-list/16_abel_ruffini.lean</code> . Is it possible to import one of these files (e.g. that one), just as a one-off, in some test file in a Lean 3 repo which has mathlib as a dependency? I just wanted to show off Thomas Browning's Abel-Ruffini in the same file as some other Galois-related stuff (in a file which won't be imported by anything else). It would be slightly nicer than just switching over to the file itself (which I will do if nobody tells me how to do this in the next 8 hours or so...). I am slightly worried about the numerals at the beginning of the directory/file names as well as the fact that it's not in <code>src</code>...</p>",
        "id": 343557934,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1679448143
    },
    {
        "content": "<p>Maybe you could copy <code>16_abel_ruffini.lean</code> into your project with an importable name? That seems better than working inside that file, and it's not so bad since you (hopefully) only need to copy a single file.</p>",
        "id": 343558829,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1679448563
    },
    {
        "content": "<p>You can edit your <code>leanpkg.path</code> file to include a reference to where the archive folder is</p>",
        "id": 343591141,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1679469088
    },
    {
        "content": "<p>It might be possible to do that more permanently from the leanpkg.toml</p>",
        "id": 343591320,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1679469157
    },
    {
        "content": "<p>But whatever you do it's going to be a hack</p>",
        "id": 343591343,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1679469167
    },
    {
        "content": "<p>leanpkg' dependency handling isn't set up to deal with git repos containing multiple lean projects</p>",
        "id": 343591593,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1679469255
    },
    {
        "content": "<p>Thanks for the ideas!</p>",
        "id": 343602215,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1679473059
    }
]