[
    {
        "content": "<p>The search feature seems to not take into account theorem descriptions (compared to the mathlib 3 version of the documentation which did).</p>\n<p>Example:</p>\n<p>Searching for \"pigeonhole principle\" gives <a href=\"https://leanprover-community.github.io/mathlib4_docs/search.html?sitesearch=https%3A%2F%2Fleanprover-community.github.io%2Fmathlib4_docs&amp;q=pigeonhole+principle\">this</a>, a bunch of completely irrelevant results, but used to give the correct result (<code>fintype.exists_ne_map_eq_of_card_lt</code>) as the 5th search result (the other results were all reasonable -- two measure theory versions of the pigeonhole principle, two infinite versions).</p>\n<p>The new search also seems to freeze/lag more frequently when typing. Perhaps the UI experience could be improved using webworkers or something if available (or simply improving the search speed)?</p>\n<p>Finally, a request: it would be really wonderful to have a fuzzy type-based search. Given these assumptions and this result, can you find a theorem that uses most of the assumptions and gives something close to the result? This could be a tactic or part of the web-based documentation search. It would be similar to <code>library_search</code> but I don't want to have to specify the requirements exactly, and the resulting expression does not necessarily have to typecheck.</p>",
        "id": 386139957,
        "sender_full_name": "Praneeth Kolichala",
        "timestamp": 1692474578
    },
    {
        "content": "<p>Seconded. For fuzzy search you might try LLM-based <a href=\"#narrow/stream/113488-general/topic/Mathlib.20semantic.20search\">Mathlib semantic search</a> or <a href=\"https://wolfia.com/?projectId=bf92ba10-e8c4-4a23-800d-d12afaa98e5e\">Wolfia</a> (generic repo search, <a href=\"#narrow/stream/219941-Machine-Learning-for-Theorem-Proving/topic/Semantic.20Search.20for.20Mathematics/near/371908249\">discussion thread</a>)</p>",
        "id": 386140503,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1692475006
    }
]