[
    {
        "content": "<p>Has anyone set up a way to render the info view in an external web browser (i.e., outside of VSCode)? I see that editors without web rendering (like neovim and zed) roll their own alternatives to the info view, but it seems like it should be pretty straightforward to just set up a local server that serves the info view so you can connect to it in a separate browser.</p>\n<p>To be clear, I'm not asking anyone here to support this, and I do think it's probably easiest for the Lean community to just rally around a small subset of editors instead of trying to support everything. I'm just curious if that code is already out there somewhere, because I haven't been able to find it if it is.</p>",
        "id": 539918689,
        "sender_full_name": "Harry Goldstein",
        "timestamp": 1758076087
    },
    {
        "content": "<p>Perhaps <a href=\"#narrow/channel/270676-lean4/topic/need.20help.20setting.20up.20lean4-infoview\">here</a>?</p>",
        "id": 539930861,
        "sender_full_name": "ğš ğš˜ğš“ğšŒğš’ğšğšŒğš‘ ğš—ğšŠğš ğš›ğš˜ğšŒğš”ğš’",
        "timestamp": 1758086282
    },
    {
        "content": "<p>IIRC that implementation launches the infoview through Emacs. One could also consider a generic, editor-independent wrapper around the Lean server that launches an infoview browser.</p>",
        "id": 539930960,
        "sender_full_name": "ğš ğš˜ğš“ğšŒğš’ğšğšŒğš‘ ğš—ğšŠğš ğš›ğš˜ğšŒğš”ğš’",
        "timestamp": 1758086373
    },
    {
        "content": "<p>The version we are currently using for our browser based projects has been extracted as a NPM package:</p>\n<p><a href=\"http://github.com/hhu-adam/lean4monaco\">github.com/hhu-adam/lean4monaco</a><br>\n<a href=\"http://npmjs.com/package/lean4monaco\">npmjs.com/package/lean4monaco</a></p>\n<p>It's a bit a hack, mainly because the Infoview/the Lean4-VSCode extension don't really have the capacity to improve usability in this use case, but I'd hope you'd find it instructive :)</p>",
        "id": 539965203,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1758100400
    },
    {
        "content": "<p>For anybody attempting to render infoview in an external web browser, I've coded an extremely minimal example static web app rendering/hosting infoview: <a href=\"https://gitlab.com/castedo/sideinfoview\">https://gitlab.com/castedo/sideinfoview</a> I did this learning from the lean4monaco (and lean4web) respositories.</p>\n<p>However, in its current form, it is <em>too</em> minimal to be useful (apart from being instructive). The API interfaces into infoview need to be hooked up to something real that does not exist in any minimal form (that I know of). But one can imagine hooking these interfaces up to a localhost websocket and then having a separate local application connecting the websocket to a locally running editor and Lean LSP server.</p>\n<p>This does not seem straightforward to me, but I'm new to the Lean codebase. The details are much messier and trickier than they initially sounded to me. I currently do not have any concrete plans to tackle these messy tricky details any time soon.</p>",
        "id": 573381411,
        "sender_full_name": "Castedo Ellerman",
        "timestamp": 1770841888
    }
]