[
    {
        "content": "<p>I was wondering if anyone knows of a list of papers which have accompanying code in some proof assistant language (Lean or otherwise)? I am currently applying for PhD programs and am interested in integrating proof assistants into my future work. I'd like to find some potential supervisors with some proof assistant experience. To be clear, I'm not looking really for a list of Lean developers or papers about Lean, type theory, or construction. Instead I'm looking for examples of people using proof assistants for math research such as in representation theory or algebra.</p>\n<p>Ideally we'd have an \"verified by proof assistant\" arXiv subject that could be added to any paper, but I don't think this currently exists.</p>\n<p>Thanks for your help!</p>",
        "id": 394705464,
        "sender_full_name": "Justin Desrochers",
        "timestamp": 1696365439
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"656131\">Justin Desrochers</span> has marked this topic as resolved.</p>",
        "id": 394705553,
        "sender_full_name": "Notification Bot",
        "timestamp": 1696365482
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"656131\">Justin Desrochers</span> has marked this topic as unresolved.</p>",
        "id": 394705598,
        "sender_full_name": "Notification Bot",
        "timestamp": 1696365488
    },
    {
        "content": "<p>Look at the last section on <a href=\"https://leanprover-community.github.io/papers.html\">this page</a>.</p>",
        "id": 394705644,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1696365519
    },
    {
        "content": "<p>Most papers here are formalisation papers, taking a standard result from the mathematical literature and formalising it, but some are papers which both introduce and formalise a result, or formalise the result of a companion paper.</p>",
        "id": 394706001,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1696365655
    },
    {
        "content": "<p>Justin, what you're looking for is vanishingly rare. People are not doing research and using Lean at the same time. People like Yael are taking modern pieces of mathematical research and formalising them in \"real time\" but my impression is that this is not what you're looking for.</p>",
        "id": 394716375,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1696370159
    },
    {
        "content": "<p>It is rare indeed, but it does exist. Here is one of my examples: <a href=\"https://raw.githubusercontent.com/adamtopaz/CoeffAltPairs/main/main.pdf\">https://raw.githubusercontent.com/adamtopaz/CoeffAltPairs/main/main.pdf</a> (using lean3, sorry <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span> )</p>",
        "id": 394718055,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1696371169
    },
    {
        "content": "<p>Although this does fit more in the category of “formalizing research in real time” as opposed to “doing research with lean”</p>",
        "id": 394718193,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1696371254
    },
    {
        "content": "<p>For non-Lean references, <a href=\"https://www.isa-afp.org/\">https://www.isa-afp.org/</a> contains a fair number of mechanized proof of various mathematical results.</p>",
        "id": 394786206,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1696408094
    }
]