[
    {
        "content": "<p>I'm curious if there is a bounty system for Lean proofs. Something like \"I'll pay $x to whoever sends me a Lean 'translation' of this paper,\" \"I would like to have an optimal solution to this problem for my software,\" or \"I'm working on a complicated proof and would like for someone else to handle this lemma.\" I feel like mathematics would really benefit from a way that would allow customers to \"buy\" proofs without having to understand them. Mathematicians would be directed to questions that are in-demand and could make more money.</p>",
        "id": 453839141,
        "sender_full_name": "Matthew Khoriaty",
        "timestamp": 1721878488
    },
    {
        "content": "<p>I don't think most people are here because of monetary incentives. \"I'm working on a complicated proof and would like for someone else to handle this lemma.\" is already happening here organically in the form of collaborations.</p>",
        "id": 453853837,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1721883505
    },
    {
        "content": "<p>Academia has some sort of bounty system: the grant system. But it isn't very fine-grained, in the sense that a grant for a postdoc or phd should typically pay the bills for 1 - 3 years.</p>",
        "id": 453854173,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1721883718
    },
    {
        "content": "<p>But industry players regularly have contracts with universities in which they formally agree to fund a phd project and the university agrees to devote the phd project on research for the industry player</p>",
        "id": 453854303,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1721883809
    },
    {
        "content": "<p>I don't know about dollars, but I have paid out <a href=\"https://manifold.markets/BoltonBailey/adopt-my-pull-requests-1000-mana-pe\">2000 fake internet points</a> on a prediction market site for people who adopted my pull requests.</p>",
        "id": 454343466,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1722015001
    },
    {
        "content": "<p>i was <em>this</em> <span aria-label=\"small amount\" class=\"emoji emoji-1f90f\" role=\"img\" title=\"small amount\">:small_amount:</span> close to thinking you were talking about crypto <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 454344068,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1722015272
    },
    {
        "content": "<p>If anyone wanted to make crypto bounties, they're too late: They should have done so before <a href=\"https://manifold.markets/BoltonBailey/will-there-be-smart-contract-bounti\">this prediction market</a> expired so they could make an insider trade!</p>",
        "id": 454344420,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1722015405
    },
    {
        "content": "<p>On that note: Is there a rust-based Lean checker? I wonder how hard it would be to make a blockchain bounty for FLT with some of the rust-based blockchain proof interfaces.</p>",
        "id": 454346693,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1722016278
    },
    {
        "content": "<p>Thanks for the information! I wrote up some ideas for how a Math Market system could work <a href=\"https://matthewkhoriaty.substack.com/p/revolutionizing-mathematics-funding?r=2akg2p\">here</a>. I would love to hear your thoughts.</p>\n<p><span class=\"user-mention\" data-user-id=\"282271\">@Bolton Bailey</span> I didn't see your response in time to include it in my essay. Some of the ideas referenced in the Manifold Market were similar to mine, but I went at it from a slightly different direction (I don't trust crypto, and a crypto-based market is less likely to catch on than a non-crypto market) and explored some implications of a Math Market.</p>",
        "id": 454350963,
        "sender_full_name": "Matthew Khoriaty",
        "timestamp": 1722018022
    },
    {
        "content": "<p>There was one of these for Coq a few years ago, and every time a proof of false was discovered all the bounties were immediately claimed; my impression was that eventually the people running it just gave up because of this.</p>",
        "id": 454351679,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1722018383
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"735727\">@Matthew Khoriaty</span> I think there are a lot of other dangers / exploits that exist in the market you describe. For instance, you take it for granted that a proof accepted by the proof assistant will be accepted by the person who offers the bounty. But there would be both legitimate and illegitimate reasons to deny the bounty. At the point, you need actual arbiters.</p>\n<p>Moreover, you downplay the possibilities of malicious actors executing arbitrary code, but this is a very real concern.</p>",
        "id": 454351801,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1722018430
    },
    {
        "content": "<p>I'm not saying something like this couldn't ever exist, but it's certainly not as simple as you seem to describe.</p>",
        "id": 454351875,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1722018474
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/Is.20there.20a.20bounty.20system.3F/near/454351679\">said</a>:</p>\n<blockquote>\n<p>There was one of these for Coq a few years ago, and every time a proof of false was discovered all the bounties were immediately claimed; my impression was that eventually the people running it just gave up because of this.</p>\n</blockquote>\n<p>I'd be interested in hearing more about this and what the problems were that caused false to be provable. Do you have a link? Edit: Is <a href=\"https://slawekk.wordpress.com/2014/01/11/proof-market/\">this</a> what you are referring to?</p>",
        "id": 454351937,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1722018485
    },
    {
        "content": "<p>There was short-lived proof market for Coq proofs long ago, which paid in bitcoins. I remember that I got 5 euros worth of bitcoins that I sent to friend.</p>",
        "id": 454351946,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1722018490
    },
    {
        "content": "<p>Ah, I see Kevin Buzzard posted about it. Sorry, too slow.</p>",
        "id": 454351979,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1722018511
    },
    {
        "content": "<p>11 years ago, wow. See <a href=\"https://www.reddit.com/r/Bitcoin/comments/1u6oza/proof_market_submit_proof_get_paid_with_bitcoin/\">this post on Reddit</a>, for example.</p>",
        "id": 454352327,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1722018680
    },
    {
        "content": "<p><a href=\"https://web.archive.org/web/20140110015857/https://proofmarket.org/problem\">Wayback machine snapshot</a> and <a href=\"https://x.com/proofmarket\">associated Twitter account</a></p>",
        "id": 454354982,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1722020197
    },
    {
        "content": "<p>Asking for a friend, what's good size of bounty today?<br>\n(If I wasn't so poor I would be generous bounty giver. Always getting stuck when proving something. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> )</p>",
        "id": 454359740,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1722022910
    },
    {
        "content": "<p>More seriously, I wish such bounty system existed. I would probably chip in for formal proof of FLT or something.</p>",
        "id": 454359878,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1722022995
    },
    {
        "content": "<p>Bounty system with option to crowd-fund.</p>",
        "id": 454359913,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1722023023
    },
    {
        "content": "<p>The idea of bounties comes up often, but something I'm wondering is why use a system that leaves so much uncertainty to the people doing the work? If multiple people work on the same problem, only the first to submit a working solution wins, right? Is the whole idea to protect the buyers from needing to do any due diligence of actually understanding what they want to buy and to not have to evaluate potential contract workers?</p>",
        "id": 454360107,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1722023126
    },
    {
        "content": "<p>Johan mentioned grants already for academia, which is open-ended and funds moving in a general direction, but in lots of other sorts of creative work in industry you set up a contractual relationship with the artist/designer/etc. for specific work products. You don't set up a bounty for \"create all the illustrations for my book\" and then get to pick and choose who will get paid for example (though doubtless people have tried).</p>",
        "id": 454360435,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1722023297
    },
    {
        "content": "<p>The second one seems like the answer to me. If the details of a contract-to-prove-theorems and a bounty-to-prove-theorems are the same in terms the amount of money and the specification, then the only difference left is the advantage to the buyer that they don't need to negotiate with a specific counterparty, they can just let any counterparty who finds the terms acceptable take it up.</p>",
        "id": 454362626,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1722024313
    },
    {
        "content": "<p>If uncertainty about a race to claim the bounty or being first is the issue, I imagine that could be solved by auctioning off the exclusive right to claim the bounty for period of time as long as the contract lasted, though maybe that has other downsides I'm not seeing.</p>",
        "id": 454363098,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1722024466
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/stream/113488-general/topic/Is.20there.20a.20bounty.20system.3F/near/454360435\">said</a>:</p>\n<blockquote>\n<p>in lots of other sorts of creative work in industry you set up a contractual relationship with the artist/designer/etc. for specific work products. You don't set up a bounty for \"create all the illustrations for my book\" and then get to pick and choose who will get paid for example (though doubtless people have tried).</p>\n</blockquote>\n<p>This is generally true for small indiviudal commisions. However, for larger / bulk contracts it is very common to feel out a number of designers and request samples (e.g., for a small fee) before seleciting one to actuall do primary request. It is a lot like the \"exclusive right\" auciton Bolton suggested. Similar auctions also occur with governemnt contracts.</p>",
        "id": 454400405,
        "sender_full_name": "Mac Malone",
        "timestamp": 1722042656
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> As for the motivation behind a bounty system, itself, I can think of three major reasons:</p>\n<ul>\n<li>\n<p><strong>Speed</strong>. A first come,-first-paid model creates a fear of missing out, which can help motivate potential claimaints to solve the bounty quickly. However, this is, as you noted, this is one-sided advantage for the buyer.</p>\n</li>\n<li>\n<p><strong>Security</strong>. A verified bounty system can help the buyer acquire goods from a domain they may not have the expertise to properly vet and thus help reduce the chance of being scammed (as you also suggested). For highly technical problem like verification, I do not find it suprising that indiviudals or small firms would feel (and be!) unable to vet sellers.</p>\n</li>\n<li>\n<p><strong>Accesibility</strong>. Many potential buyers may not know many sellers or communities of sellers and/or may not have the ability or desire to build a contractural relationship with such individuals. An standardized, widely-knonw, automatic bounty system can remove these barriers to entry. StackOverflow is a great example of how a centralized system and bounties can open make much easier for broad audience to obtain code help than indiviual tutors or IT support could achive.</p>\n</li>\n</ul>",
        "id": 454402946,
        "sender_full_name": "Mac Malone",
        "timestamp": 1722043774
    },
    {
        "content": "<p>A closely related question here, with the apparent imminent arrival of AI provers, is how much compute people will be willing to pay for to get theorems (presumably software verification theorems more than mathematical theorems?) proved. One guesses that the compute budget for AlphaMath was ... profligate, but at some point in the near future this may become a live question.</p>",
        "id": 454420210,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1722053500
    },
    {
        "content": "<p>I think this is a very good point, because the value of a formal mathematical theorem can be hard to quantify, whereas for bugs in a software system, it seems easier to price what exactly is at risk if the theorem is found to be false. Even better could be provably-correct optimizing compilers, since it is clear there exactly what you are buying (namely an explicit number of saved compute cycles).</p>",
        "id": 454514963,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1722107402
    },
    {
        "content": "<p>To add to the discussion about proof markets/bounties: You could enable automated payouts for Lean proofs via smart contracts that verify SNARKs produced with <a href=\"https://github.com/lurk-lab/yatima\">https://github.com/lurk-lab/yatima</a> (cc <span class=\"user-mention\" data-user-id=\"432681\">@John Burnham</span> )</p>",
        "id": 454929809,
        "sender_full_name": "Alexander Hicks",
        "timestamp": 1722281829
    }
]