[
    {
        "content": "<p>Hi all, I raised this issue in the Aesop repo at the end of last year: <a href=\"https://github.com/leanprover-community/aesop/issues/186\">https://github.com/leanprover-community/aesop/issues/186</a></p>\n<p>At the time, it was just a curiosity, but now it's blocking a project that I'm working on. Does anyone have any immediate impressions about what could be going wrong?</p>",
        "id": 525981492,
        "sender_full_name": "Harry Goldstein",
        "timestamp": 1750972349
    },
    {
        "content": "<p>I don’t think this is a kernel error. This seems to be a case of Aesop unhygienically adding declarations into the environment. See : <a href=\"#narrow/channel/270676-lean4/topic/aesop.20and.20bv_decide/near/514775125\">https://leanprover.zulipchat.com/#narrow/channel/270676-lean4/topic/aesop.20and.20bv_decide/near/514775125</a></p>",
        "id": 525985698,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750975062
    },
    {
        "content": "<p>It’s best that we CC <span class=\"user-mention\" data-user-id=\"256311\">@Jannis Limperg</span> to be sure.</p>",
        "id": 525985794,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750975144
    },
    {
        "content": "<p>Does not reproduce on <a href=\"http://live.lean-lang.org\">live.lean-lang.org</a> (anymore)</p>",
        "id": 526026473,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1751009187
    },
    {
        "content": "<p>Yeah, this seems to have been solved by recent improvements to Aesop's handling of auxiliary lemmas. Please lmk if it doesn't work for you.</p>",
        "id": 526141793,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1751052364
    },
    {
        "content": "<p>In all cases I had where aesop gave kernel errors, the recent improvements mentioned above fixed it</p>",
        "id": 526159721,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1751064535
    },
    {
        "content": "<p>OK, thanks for the help folks. My project was pinned to v4.20.0, but updating to v4.21.0-rc3 fixed my issue. Is it generally expected that folks just pin production code to the latest RC no matter what? In other language communities I've been a part of, there was a culture of back-porting bug fixes to the latest stable version, but it seems like that's not the case for Lean?</p>",
        "id": 526302846,
        "sender_full_name": "Harry Goldstein",
        "timestamp": 1751241781
    },
    {
        "content": "<p>Right now nothing is back ported and no backwards compatibility is promised. In my project to prove FLT we are constantly bumping to current lean and mathlib (basically weekly). This might change as the software stabilises, I guess.</p>",
        "id": 526320945,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1751260480
    },
    {
        "content": "<p>We're not yet ready to backport non-show-stopper bug fixes to previous stables. It's certainly fine to stay on stable releases, but do expect to have to move on to the next stable (approximately one month after the release candidate) to get further language changes.</p>",
        "id": 526328286,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1751265302
    },
    {
        "content": "<p>It wasn't even so much of a bugfix in this case as a new Lean API that then enabled Aesop to make its own implementation more robust</p>",
        "id": 526334238,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1751268038
    },
    {
        "content": "<p>OK, that's what I thought, and I think that makes sense for a language like Lean that's still in flux and with constrained developer resources.</p>\n<p>I had been following the update cadence that Kim recommended, updating once a month, but this Aesop issue was seriously derailing our development. (Almost every file in my project with multiple definitions was crashing — my student was resorting to just moving everything into its own file.) In this case updating right away to the RC was fine, but if I'd had any external dependencies I could see that being a really tricky situation.</p>",
        "id": 526393980,
        "sender_full_name": "Harry Goldstein",
        "timestamp": 1751287874
    }
]