[
    {
        "content": "<p>Sorry for cross-posting, but I think not much people is following the Lean Together 2024 stream now. <br>\nIs it possible to run leaff on a mathlib PR? I remember seeing some instructions but cannot find it now.</p>",
        "id": 435468229,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1714079276
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"127136\">@Alex J. Best</span></p>",
        "id": 435476260,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1714083563
    },
    {
        "content": "<p>It used to be possible to just merge <a href=\"https://github.com/leanprover-community/mathlib4/pull/8479\">#8479</a> into (a new copy of) your branch, to get a diff in the github actions output. However I have not had time recently to update leaff so until the lean version is bumped to the version mathlib uses that wont work. I'll see if the update builds but if it doesnt im not sure when I'll get round to fixing it sadly</p>",
        "id": 435481653,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1714087177
    },
    {
        "content": "<p>It is a great tool but if manual labour is needed everytime lean updates, I'm worried if this will rot quickly. Is there not a better solution or it is unavoidable as lean is still in rapid development?</p>",
        "id": 435564808,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1714129718
    },
    {
        "content": "<p>Some aspects of this are unavoidable, Leaff makes heavy use of lean<br>\ninternals and meta stuff which can change with less backwards compatibility<br>\nthan e.g. some parts of mathlib for example right now.<br>\nThere is the more general issue, that there is (as far as I know) no ready<br>\nto go analogue of <a href=\"https://github.com/leanprover-contrib/lean-upgrade-action\">https://github.com/leanprover-contrib/lean-upgrade-action</a><br>\nthat handles clean updates automatically, and notifies the developer of the<br>\nlibrary only when something manual needs to be done. Writing such an action<br>\nprobably would only take the right person a day or something and I think at<br>\nthis point would benefit the community a lot (though maybe something<br>\nanalogous is on the reservoir roadmap anyway).<br>\nBtw I did the upgrade yesterday so that Leaff should now work with new<br>\nmathlib.</p>",
        "id": 435575356,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1714134174
    }
]