[
    {
        "content": "<p>This is the discussion thread for <strong><a href=\"https://github.com/pandaman64/lean-regex\">lean-regex</a></strong>, a formally verified regular expression engine in Lean 4.</p>\n<p>I'm looking for contributors interested in pushing it forward! Areas for contribution include:</p>\n<ul>\n<li><strong>Feature support</strong>: case-insensitive matching, Unicode classes, word boundaries, etc</li>\n<li><strong>Optimization</strong>: DFA compilation, <a href=\"https://leanprover-community.github.io/mathlib4_docs/Batteries/Data/String/Matcher.html\">KMP-based search</a>, benchmarking, and so on</li>\n<li><strong>Formal verification</strong> of these optimizations</li>\n<li><strong>Optimized <code>re!</code> macro</strong> to generate an efficient Lean search function from a regular expression</li>\n<li><strong>Ecosystem integration</strong> to make it easy to use in parsers, scripts, and other tools, including better error messages</li>\n</ul>\n<p>If you are interested in any of these ideas or just curious about regular expressions, please let me know!</p>",
        "id": 518784284,
        "sender_full_name": "pandaman",
        "timestamp": 1747457600
    },
    {
        "content": "<p>First of all congrats! That looks great.</p>\n<p>This is extremely petty but given it's the first impression someone gets perhaps you might consider not showing email address matching as your first example in the readme. The world will be a very slightly better place when no one even thinks of using regular expressions to validate email addresses (especially with a pattern there that will fail on my own typically used email addresses.) Happy to send a PR as well of course.</p>",
        "id": 518816842,
        "sender_full_name": "Julian Berman",
        "timestamp": 1747486720
    },
    {
        "content": "<p>Thank you for the suggestion! That's an oversight on my part. Fixed in <code>main</code>.</p>",
        "id": 518882636,
        "sender_full_name": "pandaman",
        "timestamp": 1747540906
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"395416\">@pandaman</span> I'd like to contribute, it would give me chance to improve my Lean skills. <a href=\"https://github.com/pandaman64/lean-regex/issues/93\">Issue 93</a> seems like something I could take a shot at.</p>",
        "id": 524053303,
        "sender_full_name": "Krishna Padmasola",
        "timestamp": 1749894088
    }
]