[
    {
        "content": "<h2><strong>Alignerr – Labelbox | Remote (Global)</strong></h2>\n<p>Alignerr–Labelbox is hiring Lean 4 experts to support frontier AI training projects focused on mathematical reasoning, formal verification, and logic.</p>\n<p>You are invited to consider applying if you are interested in working on one or more of the following areas, or closely related topics:</p>\n<ul>\n<li>Mathematical formalization in Lean 4  </li>\n<li>Translating informal mathematics (textbooks, articles, exercises) into formally verified Lean 4 code  </li>\n<li>Formal logic, verification, and automated reasoning  </li>\n<li>Proof assistants and formal methods  </li>\n<li>AI and machine learning for theorem proving and mathematical reasoning</li>\n</ul>\n<hr>\n<h2>What you’ll do</h2>\n<ul>\n<li>Formalize mathematical content written in natural language into valid, compilable Lean 4 code  </li>\n<li>Translate theorems, lemmas, propositions, and proofs into precise formal representations  </li>\n<li>Ensure formal code accurately reflects the mathematical meaning and logical structure of the original statements  </li>\n<li>Review and validate Lean 4 formalizations for correctness, consistency, and logical soundness  </li>\n<li>Identify ambiguities, missing assumptions, or logical gaps in informal mathematical descriptions  </li>\n<li>Contribute to high-quality datasets pairing human-written mathematics with formal Lean 4 equivalents for AI training</li>\n</ul>\n<hr>\n<h2>You’re a great fit if</h2>\n<ul>\n<li>You have strong hands-on experience with <strong>Lean 4</strong>  </li>\n<li>You have a solid background in <strong>mathematics, formal logic, or formal verification</strong>  </li>\n<li>You are comfortable reading advanced mathematical texts and formalizing them accurately  </li>\n<li>You write precise, correct, and maintainable Lean 4 code  </li>\n<li>You have exceptional attention to detail and logical rigor  </li>\n<li>You are interested in AI, automated reasoning, and mathematical verification  </li>\n</ul>\n<p>Bonus (not required):</p>\n<ul>\n<li>Experience with other theorem provers or formal systems  </li>\n<li>Prior involvement in AI training, expert annotation, or reasoning-focused datasets  </li>\n<li>Familiarity with research in proof assistants or formal methods</li>\n</ul>\n<hr>\n<h2>About the role</h2>\n<ul>\n<li>Engagement: Contract (hourly)  </li>\n<li><strong>Hourly rate: $170-200 per hour</strong> based on performance and efficiency  </li>\n<li>Location: Fully remote, work from anywhere  </li>\n<li>Flexible workload: Set your own schedule  </li>\n<li>High impact: Your work directly improves AI systems that reason about mathematics  </li>\n<li>Growth potential: Top performers are selected for 3-month contracts and invited to advanced or leadership tracks</li>\n</ul>\n<hr>\n<h2>Getting Started: Step-by-Step (6 Minutes Total)</h2>\n<ul>\n<li><a href=\"https://app.alignerr.com/signin?targeted-outreach=true\">Sign up here</a>  </li>\n<li>Enter your LinkedIn profile link (1 min)  </li>\n<li>Verify your identity with Persona (a third-party verifier) (3 min)  </li>\n<li>Access your dashboard and accept the paperwork (1 min)  </li>\n<li>Link your Alignerr account to Hubstaff (1 min) [By clicking on \"Create Hubstaff account\"]</li>\n<li>\n<p><strong>Once you have completed the steps above, please send an email to </strong>alex@alignerr.com<strong> with the subject line </strong>“Lean 4”<strong> to help expedite the onboarding process.</strong></p>\n<p><em>For more information, you can review these resources:</em></p>\n</li>\n<li>\n<p><a href=\"https://www.alignerr.com/en/process\">Process Guide</a>.  </p>\n</li>\n<li>\n<p><a href=\"https://www.alignerr.com/faqs\">FAQ page</a>.</p>\n<hr>\n</li>\n</ul>\n<h2>About Labelbox</h2>\n<p>Labelbox builds the data engine that accelerates breakthrough AI. Through its platform, expert services, and talent network (Alignerr), Labelbox enables leading research labs and enterprises to build safer, smarter models by iterating on data as effectively as they do on code.</p>",
        "id": 566442762,
        "sender_full_name": "Alexander Pimentel Gomez",
        "timestamp": 1767649154
    },
    {
        "content": "<p>I can't find any $200/hr Lean jobs searching on the platform:<br>\n<a href=\"/user_uploads/3121/NKlyxXKfy-A2JWH7LksVrObJ/image.png\">image.png</a><br>\n(there are 124 jobs of the range $70-150/hr and look like a lot of duplicates (raises red flags))</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/NKlyxXKfy-A2JWH7LksVrObJ/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1859x964\" src=\"/user_uploads/thumbnail/3121/NKlyxXKfy-A2JWH7LksVrObJ/image.png/840x560.webp\"></a></div><p>The <a href=\"https://www.reddit.com/r/alignerr/\">subreddit</a> is quite active, but there's also a <a href=\"https://www.reddit.com/r/WFHJobs/comments/1mabebg/alignerr_scam/\">post</a> claiming that the platform is a scam:</p>\n<blockquote>\n<p>The majority of applicants will not receive actual job assignments. The company is utilizing candidates to train their AI interview system while collecting and monetizing personal data in the process.</p>\n</blockquote>",
        "id": 566510462,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1767693145
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"224323\">@Junyan Xu</span> , the pay rate update was made last night. I’ve already requested the change to $170-200 USD, and it should be updated within a couple of hours. </p>\n<p>About the post claiming that the platform is a scam, that information is not correct. All candidates who are accepted and complete work are paid for their contributions. Compensation is clearly defined before a project begins, and payments are processed exclusively through official platforms.</p>\n<p>Candidates are removed from the platform only if they violate project or platform guidelines. In such cases, any approved work is always paid out before the account is closed.</p>\n<p>Please keep in mind that, as with many companies operating at scale, online comments can vary and don’t always reflect internal processes or the day-to-day experience of contributors. What I can assure you is that the company follows clear guidelines, provides support to freelancers, and maintains structured channels to address questions or concerns promptly.</p>",
        "id": 566618433,
        "sender_full_name": "Alexander Pimentel Gomez",
        "timestamp": 1767731942
    },
    {
        "content": "<p>If you or other folks in the community have questions or if you want more information, please book a Zoom call directly with me [<a href=\"https://calendly.com/agomez-labelbox/15min\">here</a>]</p>",
        "id": 566619825,
        "sender_full_name": "Alexander Pimentel Gomez",
        "timestamp": 1767732540
    },
    {
        "content": "<p>I just got an email from \"Alignerr\" this morning advertising an \"exclusive onboarding process\" for this. Not sure how you got my email (it's technically in my CV on my website, but it's more likely you scraped it from somewhere if you're doing this at scale), but worse is that every link in the email was a tracking link, including the embedded images! Gross!</p>\n<p>If you want my attention, send me an email I don't feel I have to sanitize</p>",
        "id": 566629720,
        "sender_full_name": "Jack McKoen",
        "timestamp": 1767737409
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1011165\">@Alexander Pimentel Gomez</span> (this is with my Mathlib maintainer hat on): please respond promptly about these questions about spam emails. In particular, if you have in any way extracted emails from this Zulip, I would hope that you will apologise, and assure us that you have deleted them again.</p>",
        "id": 566631339,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1767738375
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span> I want to reassure you that we have not extracted email addresses from this Zulip, nor do we have the ability or intention to do so. This is simply not something we do, and we take data privacy and community trust very seriously.</p>",
        "id": 566631974,
        "sender_full_name": "Alexander Pimentel Gomez",
        "timestamp": 1767738770
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"488744\">@Jack McKoen</span> , indeed, your email is publicly available on your website. Sorry if this caused any inconvenience. I’d just like to clarify that we do not scrape email addresses.</p>",
        "id": 566635271,
        "sender_full_name": "Alexander Pimentel Gomez",
        "timestamp": 1767741153
    },
    {
        "content": "<p>Are you saying you're manually identifying people you're interested in and then trying to find their email addresses?</p>",
        "id": 566635356,
        "sender_full_name": "Julian Berman",
        "timestamp": 1767741215
    },
    {
        "content": "<p>As a recruiter, I have to look for candidates who might be interested in an opportunity, and if they decide to move forward, they do need to verify their email address, as all companies do. <span class=\"user-mention\" data-user-id=\"321696\">@Julian Berman</span></p>",
        "id": 566635695,
        "sender_full_name": "Alexander Pimentel Gomez",
        "timestamp": 1767741435
    },
    {
        "content": "<p>If you go to all that effort of finding people and their emails (mine is not immediately visible, so you seem to be implying you were interested enough to dig around my website), why send such a generic (spammy) email?</p>",
        "id": 566636219,
        "sender_full_name": "Jack McKoen",
        "timestamp": 1767741803
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1011165\">@Alexander Pimentel Gomez</span>  Sure, but I'm trying to understand what you mean by saying you're not scraping emails --  Jack (and myself, so I bet others) received emails from you, though we didn't share them with you -- just trying to make sure I understand the nuance in you saying you're not scraping them, is the differentiation you're making that you're not systematically automatically downloading emails but are doing so manually instead?</p>",
        "id": 566636255,
        "sender_full_name": "Julian Berman",
        "timestamp": 1767741840
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321696\">@Julian Berman</span> Correct. Personally, I’ve been looking for people proficient in Lean 4 since early December. This is a very small and specialized community, and qualified candidates are genuinely hard to find. As part of that process, I sometimes reach out individually using publicly available contact information, without any automated or bulk collection.</p>",
        "id": 566636597,
        "sender_full_name": "Alexander Pimentel Gomez",
        "timestamp": 1767742070
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"488744\">@Jack McKoen</span> That’s a fair point. The initial message was kept generic to avoid assumptions when reaching out cold, but I understand how it can come across as spammy given the context. That feedback is helpful, and I’ll take it into account going forward.</p>",
        "id": 566636704,
        "sender_full_name": "Alexander Pimentel Gomez",
        "timestamp": 1767742147
    },
    {
        "content": "<p>Got it, thanks for clarifying. If it's done in the way you say, I don't personally have an issue then with the way you went about reaching out (though others still may clearly if they feel it's not welcome to do so without explicitly opting in).<br>\nEDIT: turns out that was a lie.</p>",
        "id": 566636976,
        "sender_full_name": "Julian Berman",
        "timestamp": 1767742317
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"1011165\">Alexander Pimentel Gomez</span> <a href=\"#narrow/channel/284757-job-postings/topic/Lean.204.20Mathematical.20Formalization.20Expert.20.24170-200/near/566636704\">said</a>:</p>\n<blockquote>\n<p>The initial message was kept generic to avoid assumptions when reaching out cold</p>\n</blockquote>\n<p>And yet you assume I'm okay with all the tracking links! Can you comment on these? I think they completely destroy any good will</p>",
        "id": 566637203,
        "sender_full_name": "Jack McKoen",
        "timestamp": 1767742478
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"488744\">@Jack McKoen</span> &gt; The tracking links are part of our standard email tooling and are not intended to track individuals or behavior in a detailed way. I understand how they can feel intrusive, especially in a cold outreach context, and I appreciate you raising it. I’ll take this feedback back to the team and we can avoid using them in similar outreach going forward.</p>",
        "id": 566637504,
        "sender_full_name": "Alexander Pimentel Gomez",
        "timestamp": 1767742714
    },
    {
        "content": "<p>This seems pretty shady to me , you seemingly mass emailed , I don’t see the criteria of it being some “targeted lean experts “ . You emailed me who is a complete beginner at lean , for example?  And I saw on another thread someone was emailed who hadn't even used in Lean in a long time. What is the criteria you used to email?</p>",
        "id": 566637785,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1767742915
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"773147\">@Yan Yablonovskiy 🇺🇦</span>, I think that's a bit disingenuous. You've been active on the Lean zulip for over a year, I don't think you get to say \"complete beginner\" anymore. :-)</p>",
        "id": 566638537,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1767743466
    },
    {
        "content": "<p>I am very active on Zulip thats true, of note is that the email was sent to my email that exists only as my Zulip registration / github and is not used anywhere else ( the recruitment email is the only non-github / zulip email in the entire inbox ). </p>\n<p>But <span class=\"user-mention\" data-user-id=\"488744\">@Jack McKoen</span>  says his email was a bit more effort to get, so perhaps it is true that it was not entirely scraping and this \"recruiter\" just really wants some leads.</p>",
        "id": 566639231,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1767743929
    },
    {
        "content": "<p>To my surprise, my spam email was sent to my gmail account (which is not the email address I use here or indeed in most mathematical communications).</p>",
        "id": 566640251,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1767744599
    },
    {
        "content": "<p>Oh, there's a discussion about the email. (I got it too.)</p>\n<p>I'm definitely underqualified for the 170-200$ per hour.</p>",
        "id": 566642607,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1767746301
    },
    {
        "content": "<p>I see no explanation here other than that <span class=\"user-mention\" data-user-id=\"1011165\">@Alexander Pimentel Gomez</span> is scraping GitHub commits, since I received the email on an address that was coined for exactly one commit in a lean GitHub repo published by my employer</p>",
        "id": 566648198,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1767750681
    },
    {
        "content": "<p>I can confirm that I also got this email at a custom address used a couple of time to make a mathlib commit, and for absolutely nothing else.</p>",
        "id": 566666316,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1767764672
    },
    {
        "content": "<p>The email I got was sent to a different address from the one I list on my website, github, etc. I don't see how you could find this address of mine without some kind of scraping (and if you truly are that interested in contacting me specifically, why send me an email where you don't even address me by name).</p>",
        "id": 566677711,
        "sender_full_name": "Oliver Soeser",
        "timestamp": 1767772521
    },
    {
        "content": "<p>Scraping commits from github for these \"job offers\" also violates their <a href=\"https://docs.github.com/en/site-policy/acceptable-use-policies/github-acceptable-use-policies#7-information-usage-restrictions\">acceptable use policy</a></p>",
        "id": 566714977,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1767785805
    },
    {
        "content": "<p>The labelbox company appears to have a github which you can report for abuse here: <a href=\"https://github.com/labelbox\">https://github.com/labelbox</a></p>",
        "id": 566716328,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1767786349
    },
    {
        "content": "<p>Just as another datapoint: I also received an email on my email that i use for github and zulip, although my last mathlib commit is quite long ago.</p>",
        "id": 566744248,
        "sender_full_name": "Christian Krause",
        "timestamp": 1767795634
    },
    {
        "content": "<p>I got an email, but I've never made a commit to mathlib. I have not forked it either.</p>",
        "id": 566778724,
        "sender_full_name": "Andrew Peterson",
        "timestamp": 1767804864
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"284757\" href=\"/#narrow/channel/284757-job-postings/topic/Lean.204.20Mathematical.20Formalization.20Expert.20.24170-200\">#job postings &gt; Lean 4 Mathematical Formalization Expert $170-200</a> by <span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span>.</p>",
        "id": 566786867,
        "sender_full_name": "Notification Bot",
        "timestamp": 1767807233
    },
    {
        "content": "<p>I have moved this message out of <a class=\"stream\" data-stream-id=\"284757\" href=\"/#narrow/channel/284757-job-postings\">#job postings</a>.<br>\nI would have deleted this message, but I think it is useful to preserve the discussion that follows it.<br>\nWith my Zulip admin hat on: We don't condone email scraping, and I'm sorry that this has happened.</p>",
        "id": 566787163,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1767807329
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"658873\">Ilmārs Cīrulis</span> <a href=\"#narrow/channel/113488-general/topic/Lean.204.20Mathematical.20Formalization.20Expert.20.24170-200/near/566642607\">said</a>:</p>\n<blockquote>\n<p>Oh, there's a discussion about the email. (I got it too.)</p>\n<p>I'm definitely underqualified for the 170-200$ per hour.</p>\n</blockquote>\n<p>You might be surprised :)</p>",
        "id": 566791770,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767808809
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/channel/113488-general/topic/Lean.204.20Mathematical.20Formalization.20Expert.20.24170-200/near/566791770\">said</a>:</p>\n<blockquote>\n<p>You might be surprised :)</p>\n</blockquote>\n<p>I doubt it. :) The best I can offer is formalizing human proofs of some math olympiad problems (using Mathlib) or something of similar difficulty that doesn't require contributing to Mathlib. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>\n<p>(I probably didn't get the joke. My apologies <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>)</p>",
        "id": 566850031,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1767834044
    },
    {
        "content": "<p>I also was contacted by email. My only mathlib contribution was fixing the spelling of \"Weierstraß\" in some comments.</p>\n<p>Have to admit that it sounded tempting (would be amazing to get paid to write Lean, even though I suck at it), but it just seemed overall incredibly scammy, especially the whole application process.</p>",
        "id": 566866499,
        "sender_full_name": "Tainnor",
        "timestamp": 1767847976
    },
    {
        "content": "<p>I also have received this spam.</p>\n<p><span class=\"user-mention\" data-user-id=\"685366\">@Tainnor</span> since you found it tempting, I want to note that there are many other companies (who don't resort to spamming) that hire freelancers to do just that, I suggest going through the job posting channel.</p>",
        "id": 566868147,
        "sender_full_name": "Rida Hamadani",
        "timestamp": 1767849190
    },
    {
        "content": "<p>I got the email too and I know  at most epsilon (for some epsilon &lt;&lt; 1) about writing Lean 4. I have zero online that would indicate I have done anything with Lean myself, <del>so it's presumably just someone who scraped this forum for email addresses.</del></p>",
        "id": 566886767,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1767860125
    },
    {
        "content": "<p>I haven't even made comments in here that would indicate I know anything about Lean, I'm just here for mathematical discussion.<br>\nOn a pseudonymous social media account I reported on trying to vibe-code some lean and it failing badly, I hardly think that qualifies me to be approached. I am suspicious that whoever emailed me wasn't actually looking that hard to check if I actually fit the bill, so it sounds like some level of non-conscious action went into the process.</p>",
        "id": 566887724,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1767860527
    },
    {
        "content": "<p>Just to add one more data point that this is not carefully manually sent special invitations but mass mailing spam: I received the mail twice, to slightly different email addresses and my working assumption is that they were obtained from git repo histories.</p>\n<p>If you are so eager to get Lean experts and willing to pay for it, next time please already pay us for reading your emails. Should be easy to automate with all those tracking links ;-)</p>",
        "id": 567008557,
        "sender_full_name": "Malvin Gattinger",
        "timestamp": 1767897503
    },
    {
        "content": "<p>I feel left out, I didn't get an email. :(</p>",
        "id": 567013195,
        "sender_full_name": "Fabian Odermatt",
        "timestamp": 1767899162
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"685366\">Tainnor</span> <a href=\"#narrow/stream/113488-general/topic/Lean.204.20Mathematical.20Formalization.20Expert.20.24170-200/near/566866499\">said</a>:</p>\n<blockquote>\n<p>I also was contacted by email. My only mathlib contribution was fixing the spelling of \"Weierstraß\" in some comments.</p>\n<p>Have to admit that it sounded tempting (would be amazing to get paid to write Lean, even though I suck at it), but it just seemed overall incredibly scammy, especially the whole application process.</p>\n</blockquote>\n<p>Oh, I've known how to get paid to write Lean</p>",
        "id": 567365468,
        "sender_full_name": "Nick Adfor",
        "timestamp": 1768106102
    },
    {
        "content": "<p><a href=\"https://arxiv.org/abs/2511.02872\">https://arxiv.org/abs/2511.02872</a><br>\nAs you can see this FATE benchmark, the FATE-M benchmark (Textbook-level basic exercises) is generated by hiring first year student student and providing them accomodation (<a href=\"https://mp.weixin.qq.com/s/SZm4ikZGyOQteBr65ML2uw\">https://mp.weixin.qq.com/s/SZm4ikZGyOQteBr65ML2uw</a>)</p>",
        "id": 567365739,
        "sender_full_name": "Nick Adfor",
        "timestamp": 1768106513
    },
    {
        "content": "<p>FATE-H benchmark (Problems at the level of honors course exams or graduate-level difficulty) is generated by Ubiquant (a quantitative firm) paying money for every exercise code and choosing 100 exercises from the code it gained. As you can see here Ubiquant is one of the writers <a href=\"https://www.selectdataset.com/dataset/fd2cdc49de9bf40ab7ca2db704fc189b\">https://www.selectdataset.com/dataset/fd2cdc49de9bf40ab7ca2db704fc189b</a></p>",
        "id": 567366062,
        "sender_full_name": "Nick Adfor",
        "timestamp": 1768106957
    },
    {
        "content": "<p>And FATE-X (Problems at the level of PhD qualifying exams or beyond) is generated by workshop at university, providing accomodation for the PhD student and Professors.</p>",
        "id": 567366215,
        "sender_full_name": "Nick Adfor",
        "timestamp": 1768107184
    },
    {
        "content": "<p>It can be seen as academic cooperation or company-university integration (here the company has endorsement from university), and can also be seen as blood diamond. In any case, it remains a way to make one's work stand out. Anyway, to send or not to send—both the sender and the recipient must be willing to engage.</p>",
        "id": 567366527,
        "sender_full_name": "Nick Adfor",
        "timestamp": 1768107620
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"877182\">@Nick Adfor</span> I am deeply confused by that message. I read it through three times and I still don't know what you're talking about. Do you mean payment when you say accommodation? I didn't follow the links apart from the arXiv one, they seem a bit shady.</p>",
        "id": 567387360,
        "sender_full_name": "Scott Buckley",
        "timestamp": 1768134406
    },
    {
        "content": "<p>Anyway, I also got this spam message on LinkedIn. I reported it as spam.</p>",
        "id": 567387383,
        "sender_full_name": "Scott Buckley",
        "timestamp": 1768134425
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"115259\">Scott Buckley</span> <a href=\"#narrow/stream/113488-general/topic/Lean.204.20Mathematical.20Formalization.20Expert.20.24170-200/near/567387360\">said</a>:</p>\n<blockquote>\n<p>I didn't follow the links apart from the arXiv one, they seem a bit shady.</p>\n</blockquote>\n<p>These are Chinese websites so they seem a bit shady for you. But if you want to understand more about how the arxiv article generated (how to find enough personnel to practically implement the dataset, rather than just theoretically completing it mathematically), you can just translate it using Google.</p>",
        "id": 567391332,
        "sender_full_name": "Nick Adfor",
        "timestamp": 1768139277
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"115259\">Scott Buckley</span> <a href=\"#narrow/stream/113488-general/topic/Lean.204.20Mathematical.20Formalization.20Expert.20.24170-200/near/567387360\">said</a>:</p>\n<blockquote>\n<p>Do you mean payment when you say accommodation?</p>\n</blockquote>\n<p>It offers both payment and accommodation. The payment will be transferred directly to your bank account, while the accommodation provides free room and board on campus so that all participants can live, study, and work together. These two benefits are provided as part of hiring and training coders to write the benchmark code.</p>",
        "id": 567391523,
        "sender_full_name": "Nick Adfor",
        "timestamp": 1768139508
    },
    {
        "content": "<p>The job(s) advertised in this topic is fully remote though; and if it's in China $170-200/h is even more unlikely ...</p>",
        "id": 567393616,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1768142017
    }
]