[
    {
        "content": "<p>I want to change the branch protection rules for lean-update, but it seems I don’t have the necessary permissions.<br>\nCould you grant me the required permissions?</p>\n<p><a href=\"https://github.com/leanprover-community/lean-update\">https://github.com/leanprover-community/lean-update</a></p>",
        "id": 536148130,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1756179997
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"626349\">@Asei Inoue</span>, you already have \"maintain\" access there, so you should be able to change branch protection rules.</p>",
        "id": 536150906,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756182227
    },
    {
        "content": "<p>It looks like only people with the \"Admin\" role can change branch protection rules, <a href=\"https://docs.github.com/en/organizations/managing-user-access-to-your-organizations-repositories/managing-repository-roles/repository-roles-for-an-organization#permissions-for-each-role\">according to GitHub</a>.</p>",
        "id": 536159846,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1756186040
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"626349\">@Asei Inoue</span>, could you let us know how you'd like the rules changed?</p>",
        "id": 536162258,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756187535
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span> Thank you.</p>\n<p>I would like the following protection rules to be removed:</p>\n<ul>\n<li>\n<p>The protection rule that prevents deletion of the <code>develop</code> branch</p>\n</li>\n<li>\n<p>The protection rule that prevents direct pushes to the <code>main</code> branch</p>\n</li>\n</ul>",
        "id": 536213007,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1756207037
    },
    {
        "content": "<p>Preventing direct pushes to the <code>main</code> branch seems like a very bad idea?</p>",
        "id": 536234691,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756214248
    },
    {
        "content": "<p>I've deleted the ruleset for <code>develop</code>.</p>",
        "id": 536235076,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1756214352
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span> Thank you!!</p>",
        "id": 536377670,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1756285726
    },
    {
        "content": "<p>I am the sole maintainer of the lean-update action, but over the past few months I’ve lost focus and ended up neglecting it. I feel sorry for <span class=\"user-mention\" data-user-id=\"613177\">@Oliver Butterley</span>  and for those who were counting on it. I'm sorry.</p>",
        "id": 537396589,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1756872346
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"626349\">@Asei Inoue</span>, you are thoughtful. Personally I no longer use this action because there are other ways I can achieve the same thing now. Anyway, you don't need to feel any obligation, you have to prioritize your time, all of us must do so.</p>",
        "id": 538160386,
        "sender_full_name": "Oliver Butterley",
        "timestamp": 1757319885
    },
    {
        "content": "<p>I regularly use the lean-update action, but I feel it would become unnecessary if a more general version of the mathlib-update-action were developed.<br>\nIs there any plan to develop a generalized version of the mathlib-update-action?</p>",
        "id": 538161962,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1757320296
    },
    {
        "content": "<p>who is the maintainer of <a href=\"https://github.com/leanprover-community/mathlib-update-action\">https://github.com/leanprover-community/mathlib-update-action</a>?</p>",
        "id": 538162868,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1757320540
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span> I believe?</p>",
        "id": 538164158,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1757320894
    },
    {
        "content": "<p>I am indeed currently the maintainer of <code>mathlib-update-action</code> :)</p>\n<p><span class=\"user-mention silent\" data-user-id=\"626349\">Asei Inoue</span> <a href=\"#narrow/channel/113488-general/topic/lean-update.20action/near/538161962\">said</a>:</p>\n<blockquote>\n<p>Is there any plan to develop a generalized version of the mathlib-update-action?</p>\n</blockquote>\n<p>If we can make a concrete feature list, then sure! Right now there are a few ideas for how to keep in sync between Lean releases and dependency updates, but I do not believe the community agrees that one is indeed the best.</p>",
        "id": 538195274,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1757329804
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span> </p>\n<p>I see, I didn’t know there was a debate about this. The current behavior of the lean-update action is to “always update to the latest release (including RCs),” but are there people who want something different?</p>",
        "id": 538314175,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1757365165
    },
    {
        "content": "<p>I am not sure if it's so much a debate, we're still in the brainstorming phase I'd say :) Releases are good to follow, but the issue is more that updating to a release only happens once per month, and projects want to update more frequently than that, while still keeping versions consistent across Mathlib dependencies.</p>",
        "id": 538314794,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1757365447
    },
    {
        "content": "<p>Do you mean that you want to run lake update at any frequency, and check whether there are updates and, if so, whether the build/tests still pass? If that’s the case, that’s exactly what lean-update is currently doing.</p>",
        "id": 538315547,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1757365787
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span></p>",
        "id": 538394786,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1757411189
    },
    {
        "content": "<p>That works well for individual projects! But it's not a solution for the ecosystem. For example, if two projects run <code>lake update</code> weekly but on different days, then their Mathlib versions will mismatch and it will be hard to import both projects simultaneously without errors.</p>",
        "id": 538427545,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1757421554
    },
    {
        "content": "<p>Oh I was thinking about this recently. In the unlikely event that someone wants to depend on FLT, we will run into this issue too. I had wondered whether the correct thing to do would be to bump FLT weekly (which we are doing already) but also to ensure that we bump FLT each time mathlib has a new commit which changes the version of Lean they're doing (whether it be an RC or official release), and then make sure we have a tag indicating each such bump. Does mathlib have a new tag each time it bumps to a new version of Lean? I have no time right now to think about this sort of thing, I am only just learning about github actions.</p>",
        "id": 538428644,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1757421884
    },
    {
        "content": "<p>I think we want to support</p>\n<ol>\n<li>Projects that depend on other non-mathlib projects</li>\n<li>Projects that update more than once a month</li>\n</ol>\n<p>but it's much lower priority to support</p>\n<ol start=\"3\">\n<li>Projects that depend on other projects <em>and</em> want to update more than once a month</li>\n</ol>",
        "id": 538438353,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1757424662
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113488-general/topic/lean-update.20action/near/538428644\">said</a>:</p>\n<blockquote>\n<p>Does mathlib have a new tag each time it bumps to a new version of Lean?</p>\n</blockquote>\n<p>Yes, Batteries/Mathlib/Cslib all create <code>v4.X.0</code> and <code>v4.X.0-rcK</code> tags the first time they move to a new toolchain.</p>\n<p>(Mathlib is a bit exceptional, but all the <a href=\"https://github.com/leanprover/lean4/blob/master/script/release_repos.yml\">other repos</a> in the \"toolchain release process\" actually make sure that these tagged releases depend on the corresponding tagged release of each upstream dependency.)</p>",
        "id": 538559430,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1757472281
    },
    {
        "content": "<p>I am thinking about the features that the lean-update action should have.<br>\nOne feature I personally want is: “When the <code>lean-toolchain</code> file is changed, create a PR, and once the PR is merged, issue a release tag and create a release.”<br>\nI have a question regarding implementing this.<br>\nWhat should the tag name be when updating the <code>lean-toolchain</code>?<br>\nIf we use something like <code>v4.22.0</code>, it might be confused with the repository’s own version.<br>\nWould something like <code>lean/v4.22.0</code> be better?</p>",
        "id": 538803557,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1757580854
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span> </p>\n<blockquote>\n<p>But it's not a solution for the ecosystem. For example, if two projects run <code>lake update</code> weekly but on different days, then their Mathlib versions will mismatch and it will be hard to import both projects simultaneously without errors.</p>\n</blockquote>\n<p>I hadn’t even thought of that problem! Thank you for pointing it out.<br>\nAs a solution, I think one option is to limit updates of the mathlib version that the repository depends on to “only commits that have a tag.”<br>\nIn other words, edit the <code>lakefile</code> to specify the mathlib version by tag, and then run <code>lake update</code>.</p>",
        "id": 538804166,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1757581030
    },
    {
        "content": "<p>I agree we should move away from using the <code>v4.X.0</code> tags, but this is a big decision, possibly not to be made in this thread, we'll see. :-)</p>",
        "id": 538818493,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1757585483
    },
    {
        "content": "<p>One possibility is that we put the toolchain version number after a <code>+</code> symbol in the tag name, sort of like the <a href=\"https://semver.org/#spec-item-10\">\"metadata\" from SemVer</a>. (I'm not claiming this suggestion is semver-consistent!!!)</p>\n<p>If a project doesn't have releases, e.g. Mathlib, it could just call these tags <code>master+v4.22.0</code>, which hopefully is relatively easy to understand as \"the master branch, as some moment (in fact, first) when it is on toolchain <code>v4.22.0</code>\".</p>\n<p>If the project does have releases, either using SemVer, CalVer, or something else, it could still append these <code>+v4.22.0</code>s to tags. So for example ProofWidgets might release <code>v0.0.69+v4.22.0</code> indicating it is version 0.0.69 of the library itself, in a form that uses the <code>v4.22.0</code> toolchain. That's not super intuitive to me, and suggests an even more verbose style, e.g. <code>v0.0.69+toolchain-v4.22.0</code> (and similarly <code>master+toolchain-v4.22.0</code> for Mathlib).</p>",
        "id": 538819872,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1757585875
    },
    {
        "content": "<p>That means it’s not clear what exactly should be implemented in the lean-update action.</p>",
        "id": 538959292,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1757635665
    },
    {
        "content": "<p>Yes -- the community needs to discuss this. Or just agree to my proposal above. :-)</p>",
        "id": 538971075,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1757643128
    },
    {
        "content": "<p>But for now I think the tooling should support the status quo, which is that these tags are simply of the form <code>v4.X.Y-rcK</code>.</p>",
        "id": 538971110,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1757643156
    },
    {
        "content": "<p>How about attaching multiple tags?<br>\nWhen the Lean toolchain changes, we could use a tag like <code>lean/v4.X.Y</code>, and for the library’s release, we could use a tag like <code>vA.B.C</code>.</p>",
        "id": 539375267,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1757816005
    },
    {
        "content": "<p>At first, I wanted the lean-update action or its successor to be set up automatically when running <code>lake new</code>. However, when creating a GitHub repository, by default GitHub Actions does not have permission to create Pull Requests, which results in an error. Since having this error appear every time is annoying, I came to think it might be better if it is <em>not</em> set up during <code>lake new</code>.</p>",
        "id": 540653349,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1758456476
    },
    {
        "content": "<p>Can you silence “PR permission denied” error?<br>\nIf so, “lake new” could set up lean-update action.</p>",
        "id": 542452447,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1759312083
    },
    {
        "content": "<p>I set up tests for the <em>lean-update</em> action so that whenever a PR is opened, the tests will run automatically.<br>\nSince I don’t have much knowledge about testing GitHub Actions, I’d love to hear from anyone who is more experienced in this area.</p>",
        "id": 542763187,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1759416874
    },
    {
        "content": "<p>Now that I’ve managed to set up the minimum set of tests, I expect it will be easier to continue developing <em>lean-update</em> from here on.<br>\nI’m developing this GitHub Action primarily because I want to use it myself, and I’m satisfied with its current features, but I’ll be more than happy to hear your requests as well.</p>",
        "id": 542765516,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1759417355
    },
    {
        "content": "<blockquote>\n<p>At first, I wanted the lean-update action or its successor to be set up automatically when running <code>lake new</code>. However, when creating a GitHub repository, by default GitHub Actions does not have permission to create Pull Requests, which results in an error. Since having this error appear every time is annoying, I came to think it might be better if it is <em>not</em> set up during <code>lake new</code>.</p>\n</blockquote>\n<p>I think that if permissions are explicitly specified when defining the workflow, it should run without errors.<br>\nTherefore, it might be fine to bundle <em>lean-update</em> when running <code>lake new</code>.</p>",
        "id": 542766032,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1759417481
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"626349\">@Asei Inoue</span> Thanks for your work on <code>lean-update</code>. I noticed that when the action checks for the latest version of mathlib <a href=\"https://github.com/leanprover-community/lean-update/blob/5c7721ca1fe402a57871ee7372a547b6a1f972be/scripts/getLatest.js#L39\">here</a> it doesn't take into account release candidates. Is this intended? I'm happy to PR a fix if not.</p>",
        "id": 558740179,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1763754391
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243562\">@Adam Topaz</span> </p>\n<p>not intended! It seemed to have been working until now, but was that just by chance?</p>",
        "id": 558771211,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1763771861
    },
    {
        "content": "<p>could you open a issue or PR?</p>",
        "id": 558807713,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1763810474
    }
]