[
    {
        "content": "<p>Even for a simple file with a couple of lines of code (importing Mathlib), Lean InfoView takes quite long (like 5-10 minutes) to show the messages. Even after it shows the messages, it again takes the same amount of time to show the messages if I do either Restart Server or Restart File. When VS Code is opened and a file is tried to run, I first see the error: \"Error updating: Error fetching goals: No connection to Lean\" for about 5-10 minutes, and then it runs fine and shows the messages. What might be the issue?</p>",
        "id": 562304812,
        "sender_full_name": "Aishwarya S",
        "timestamp": 1765109043
    },
    {
        "content": "<p>not an expert but try a clean build using these commands, maybe the mathlib download is not complete or corrupt. Execute this commands <br>\n<code>lake clean\nlake exe cache get\nlake build</code></p>",
        "id": 562308656,
        "sender_full_name": "Sham S",
        "timestamp": 1765114332
    },
    {
        "content": "<p>Executed these; but still having the same issues. Anyways, thanks for your suggestion.</p>",
        "id": 562314916,
        "sender_full_name": "Aishwarya S",
        "timestamp": 1765120935
    },
    {
        "content": "<p>Please show us (ideally via a cloneable git repo) your current setup, and exactly what you are doing.</p>",
        "id": 562382396,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1765165342
    },
    {
        "content": "<p>I am just getting started with Lean and have only a few trial files in my project folder. The files I have in my project folder have been uploaded at this repository: <a href=\"https://github.com/AishwaryaS-561/Lean-setup.git\">https://github.com/AishwaryaS-561/Lean-setup.git</a><br>\nLean InfoView takes too long to load and show messages for each of the .lean files in this folder, when I try to run them in VS Code. I really appreciate any help. Thanks in advance!</p>",
        "id": 562401229,
        "sender_full_name": "Aishwarya S",
        "timestamp": 1765179483
    },
    {
        "content": "<p>What is your operating system? If you have a virus scanner, try disabling it temporarily</p>",
        "id": 562404081,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1765180715
    },
    {
        "content": "<p>Are you on Windows? If I understand correctly, a known issue is that loading the infoview for the first time can take a while on windows. (After it's loaded, opening a second file is fast, however.)</p>",
        "id": 562421596,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1765186457
    },
    {
        "content": "<p>Yes. I am using Windows. It does take a while to load for the first time. However it also takes long whenever I open a file. I see the rotating symbol (spinner) which says \"Updating ...\" if I take the cursor near it. It takes too long to go away.</p>",
        "id": 562423888,
        "sender_full_name": "Aishwarya S",
        "timestamp": 1765187135
    },
    {
        "content": "<p>I tried to reproduce this on a Windows machine with your repository, but no luck unfortunately (everything loads after a couple of seconds).</p>\n<p>Some more questions:</p>\n<ul>\n<li>Are you using an anti-virus of some kind?</li>\n<li>Are you on a university machine by any chance, or using a setup with a networked drive?</li>\n<li>Is your project folder connected to a cloud provider (e.g. OneDrive, Google Drive, Dropbox, etc.)?</li>\n</ul>\n<p>I'd also be interested in the output of the 'Show Setup Information' command (Forall menu &gt; Show Setup Information).<br>\n<a href=\"/user_uploads/3121/z4p7Q1xhJEg8Txvi2LqkQHk8/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/z4p7Q1xhJEg8Txvi2LqkQHk8/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"317x436\" src=\"/user_uploads/thumbnail/3121/z4p7Q1xhJEg8Txvi2LqkQHk8/image.png/840x560.webp\"></a></div>",
        "id": 562458973,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1765198331
    },
    {
        "content": "<p>My PC has McAfee Security Scan Plus, which seems to be installed by my university since they manage it remotely through IT policy. I could neither find an option to disable it nor uninstall it. When I try to uninstall, it gives a pop-up message \"We couldn't create the data directory\". Need to see what can be done about it.<br>\nI am not using any setup with a networked drive. Also, my project folder is not connected to a cloud provider.<br>\nI get the following output for 'Show Setup Information':<br>\n<strong>Operating system</strong>: Windows_NT (release: 10.0.26200)<br>\n<strong>CPU architecture</strong>: x64<br>\n<strong>CPU model</strong>: 4 x 11th Gen Intel(R) Core(TM) i5-1135G7 @ 2.40GHz<br>\n<strong>Available RAM</strong>: 8.25 GB</p>\n<p><strong>VS Code version</strong>: Reasonably up-to-date (version: 1.106.3)<br>\n<strong>Lean 4 extension version</strong>: 0.0.221<br>\n<strong>Curl installed</strong>: true<br>\n<strong>Git installed</strong>: true<br>\n<strong>Elan</strong>: Reasonably up-to-date (version: 4.1.2)<br>\n<strong>Lean</strong>: Reasonably up-to-date (version: 4.26.0-rc2)<br>\n<strong>Project</strong>: Valid Lean project (path: c:\\Users\\s.aishwarya\\Desktop\\Desktop Folder\\My Lean Projects\\MyFirstLeanProject)<br>\n<strong>Active Lean version</strong>: leanprover/lean4:v4.26.0-rc2 (set by <code>file://%3F/c%3A/Users/s.aishwarya/Desktop/Desktop%20Folder/My%20Lean%20Projects/MyFirstLeanProject/lean-toolchain</code>)<br>\n<strong>Installed Lean versions</strong>: leanprover/lean4:v4.19.0, leanprover/lean4:v4.20.0-rc5, leanprover/lean4:v4.22.0-rc3, leanprover/lean4:v4.26.0-rc2</p>\n<p>Thanks!</p>",
        "id": 562530594,
        "sender_full_name": "Aishwarya S",
        "timestamp": 1765217035
    },
    {
        "content": "<p>The antivirus is almost certainly the problem</p>",
        "id": 562534857,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1765218527
    },
    {
        "content": "<p>Can you tell the antivirus not to scan the directories containing your lean project and where windows puts the lean binaries?</p>",
        "id": 562535560,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765218803
    },
    {
        "content": "<p>Ask your IT department if there is a whitelisted directory for your anti virus scanner, or at least one where there is a policy to scan on schedule instead of live (like at lunch time). <br>\nThe answer is usually no, but i know some companies that do it, so it's not out of hope.</p>",
        "id": 562537786,
        "sender_full_name": "Alfredo Moreira-Rosa",
        "timestamp": 1765219730
    },
    {
        "content": "<p>Would it be feasible for Lean to detect that it is over a slow filesystem (virus scanner, network) and provide a warning to the user?</p>",
        "id": 562538353,
        "sender_full_name": "Emilio Jesús Gallego Arias",
        "timestamp": 1765219991
    },
    {
        "content": "<p>We did investigate detection of networked drives in the past. While it seems somewhat feasible at linux our friends at apple told us there is no real way to do it consistently for every provider and its even less clear on Windows. So the only thing we could do here is likely exhaustive enumeration of providers.</p>\n<p>Similarly for virus scanners they all have unique means. Note that virus scanners might in particular be a little suspicious of a program that starts to poke around for a virus scanner.</p>",
        "id": 562546635,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1765223329
    },
    {
        "content": "<p>Even after changing the scan schedule in McAfee Security Scan Plus to Weekly, the problem did not go away. So McAfee could not have been causing the issue.<br>\nLater I saw that there is also Sophos Endpoint Agent which could have been causing the issue. I tried running one of the simple .lean files again, while keeping a watch on Sophos in Task Manager. I noticed that Sophos was running for quite long (about 10 minutes) and then Lean InfoView finished loading just a couple of seconds after Sophos almost finished its job.  Looks like Sophos must have led to the issue. Will try to exclude Lean related files from Sophos scan and will update on this matter.<br>\nThank you very much everyone for the suggestions.</p>",
        "id": 562666215,
        "sender_full_name": "Aishwarya S",
        "timestamp": 1765281822
    }
]