[
    {
        "content": "<p>There will soon be an announcement about an upcoming workshop that <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> <span class=\"user-mention\" data-user-id=\"130609\">@Antoine Chambert-Loir</span> and I are organizing, hosted by the Simons Foundation in NYC (June 16-27), of the \"Lean for the Curious Mathematician\" flavor. Question:</p>\n<p>Is it time to move on from \"Curious\" in the name, which can have a less serious connotation, to something like \"Research\"?</p>\n<p>The shift from \"Curious\" to \"Research\" would reflect an evolution in Lean's position within mathematics. While \"Curious\" suggests an exploratory, opt-in approach that made sense when formal verification was more niche, \"Research\" positions Lean as a mainstream research tool that working mathematicians might naturally want to incorporate into their practice. Moreover:</p>\n<ol>\n<li>It avoids any potential perception that these workshops are introductory or recreational rather than professionally relevant</li>\n<li>It aligns with how other professional mathematical tools and workshops are typically branded (e.g., \"Research Symposium on...\")</li>\n<li>It might help with grant applications and institutional support by clearly signaling its relevance to research activities</li>\n</ol>\n<p>I realize there's a long history of the \"Curious\" version, so those of us already doing this kind of work are accustomed to it, but I think to reach the broader base of researchers, it might be time to label it as such? What do people think?</p>",
        "id": 495130397,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1737488074
    },
    {
        "content": "<p>Good suggestion! My gut reaction is: we can have both, depending on the type of workshop. The more introductory tutorial-like workshops can continue the \"Curious\" tradition. But why not add \"Research\" versions as well?</p>",
        "id": 495130862,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1737488239
    },
    {
        "content": "<p>Oh yes, thanks! This was not to say that others shouldn't continue to call their workshops \"Curious\" if they so choose. But if we were to consider calling ours \"Research\", would that go against the grain of the community?</p>",
        "id": 495131358,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1737488424
    },
    {
        "content": "<p>I like the idea of using \"research\" in the title, for the reasons you mention.</p>",
        "id": 495138812,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1737491312
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"130609\">Antoine Chambert-Loir</span> has marked this topic as resolved.</p>",
        "id": 495144294,
        "sender_full_name": "Notification Bot",
        "timestamp": 1737493485
    },
    {
        "content": "<p>So that's settled then :-)</p>",
        "id": 495155060,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1737498124
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> has marked this topic as unresolved.</p>",
        "id": 495155084,
        "sender_full_name": "Notification Bot",
        "timestamp": 1737498134
    },
    {
        "content": "<p>Not that I have anything against \"research\", but I always understood \"curious\" here to mean curious about Lean (and actually a mathematician).</p>\n<p>Also \"Lean for the working mathematician\" will follow a tradition (I am sure this was considered, but just mentioning for completeness).</p>",
        "id": 495268664,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1737548043
    },
    {
        "content": "<p>If you choose to use “Lean for the research mathematician” then you should be aware that the Lean for the curious mathematician always attracted also people interested in Lean for teaching and they may feel less welcome with your new title.</p>",
        "id": 495508735,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1737641755
    },
    {
        "content": "<p>I like the original suggestion: \"Lean for the ?_ Mathematician\" ;)</p>",
        "id": 495509370,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1737641916
    },
    {
        "content": "<p>Lean for the <code>sorry</code> mathematician? No, I don't think that works</p>",
        "id": 495517960,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1737644060
    },
    {
        "content": "<p>something something <code>don't know how to synthesize placeholder</code></p>",
        "id": 495522021,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1737645133
    },
    {
        "content": "<p>Sorry to be boring about it, but there's always \"Lean for Mathematicians\" ...</p>",
        "id": 495563541,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1737657417
    },
    {
        "content": "<p>\"Lean for the [your predicate here] Mathematician\"</p>",
        "id": 495565684,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1737658199
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110865\">Jeremy Avigad</span> <a href=\"#narrow/channel/113488-general/topic/Lean.20for.20the.20.3F_.20Mathematician/near/495563541\">said</a>:</p>\n<blockquote>\n<p>Sorry to be boring about it, but there's always \"Lean for Mathematicians\" ...</p>\n</blockquote>\n<p>In fact, we have <em>already</em> advertized it under this name, just not in English: <a href=\"https://conferences.cirm-math.fr/2970.html\">Lean pour mathématiciens</a></p>",
        "id": 495595823,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1737670969
    },
    {
        "content": "<p>The explanation being that French mathematicians are all curious from what was said there <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 495598476,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1737672052
    }
]