[
    {
        "content": "<p>My colleagues (<span class=\"user-mention\" data-user-id=\"385895\">@Jon Eugster</span>, <span class=\"user-mention\" data-user-id=\"507231\">@Marcus Zibrowius</span>, Immi Halupczok) and I are considering to organize a “Lean for the Curious Mathematician\" workshop in Düsseldorf in the week 04.–08 September, 2023.</p>\n<p>Now we’ve found out that <span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span>  and <span class=\"user-mention\" data-user-id=\"133635\">@Sander Dahmen</span> are organizing a similar workshop in the Netherlands in July;<br>\n<span class=\"user-mention\" data-user-id=\"519559\">@Dagur Ásgeirsson</span> and <span class=\"user-mention\" data-user-id=\"456608\">@Boris Kjær</span> are organizing a masterclass in Lean formalization in Copenhagen in June.</p>\n<p>So we are thinking about whether the market for Lean workshops in 2023 is saturated already. I'd like to avoid a situation where we are competing against each other, especially regarding potential speakers. I'd be grateful about any thoughts on this.</p>",
        "id": 317306126,
        "sender_full_name": "Alexander Bentkamp",
        "timestamp": 1671696343
    },
    {
        "content": "<p>In general, see <a href=\"https://leanprover-community.github.io/events.html\">https://leanprover-community.github.io/events.html</a> for a list of upcoming events.<br>\n<span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> <span class=\"user-mention\" data-user-id=\"133635\">@Sander Dahmen</span> <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> <span class=\"user-mention\" data-user-id=\"406490\">@María Inés de Frutos Fernández</span> it looks like your events are not yet listed.</p>",
        "id": 317306549,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1671696531
    },
    {
        "content": "<p>The Copenhagen event is somewhat specialized, so I don't think that causes \"competition\".</p>",
        "id": 317306900,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1671696696
    },
    {
        "content": "<p>We still don't know the dates of our workshop (we have received confirmation that it was approved, but we are waiting for more details). Should we list it with date TBA?</p>",
        "id": 317308626,
        "sender_full_name": "María Inés de Frutos Fernández",
        "timestamp": 1671697401
    },
    {
        "content": "<p>Yes, that sounds like a good idea</p>",
        "id": 317309351,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1671697627
    },
    {
        "content": "<p>Does the format support that?</p>",
        "id": 317310189,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1671697952
    },
    {
        "content": "<p>2023 sounds just so futuristic to me. I didn't realize it's in a few weeks!</p>",
        "id": 317379332,
        "sender_full_name": "Trebor Huang",
        "timestamp": 1671719501
    },
    {
        "content": "<p>Regarding LFTCM -- is this somehow going to become a \"flagship event\" organised by the community every two years, or is it more flexible? My understanding is that we had one in 2020 and 2022, and the 2024 meeting has already been booked.</p>",
        "id": 317384409,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671720840
    },
    {
        "content": "<p>I also talked to <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span>  about this. Apparently there is a LFTCM admin team, and Jeremy is one of them. I don't know who the others are.</p>\n<p>I wasn't aware that it was supposed to be only every second year. In that case, we'll probably reconsider and only do a smaller workshop or none at all.</p>",
        "id": 317386160,
        "sender_full_name": "Alexander Bentkamp",
        "timestamp": 1671721279
    },
    {
        "content": "<p>Well, I guess it could also be yearly... We just missed 2021...</p>",
        "id": 317390617,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1671722593
    },
    {
        "content": "<p>We don't have anything as specific as an LFTCM admin team! I fielded Alex's query as a member of the general <a href=\"https://leanprover-community.github.io/teams/admin.html\">admin team</a>, in our role as \"the first point of contact for the community as a whole.\"</p>\n<p>This raises the question as to how best to coordinate meetings. For now, the general feeling among the admin team and maintainers is that we don't need anything very formal yet. Someone who wants to hold a meeting is advised to check with the admin team first for information and advice, and then they are advised to announce the plans on a public Zulip stream for feedback. When plans are settled, the meeting should be listed on the <a href=\"https://leanprover-community.github.io/events.html\">events page</a>.</p>\n<p>Maybe, for planning purposes, it would be helpful to list tentative events on the events page, in a special category with the label \"tentative\" or \"in planning\"? That way, anyone planning to hold a meeting will be able to see what  others are working on. </p>\n<p>My personal opinion is that we shouldn't limit the LFTCM meetings. If the community can sustain a dozen a year, why not? We can distinguish them with location and year, e.g. \"Lean for the Curious Mathematician, Providence 2022\". It's really just a matter of having sufficient resources and having enough of an audience to make it worthwhile.</p>\n<p>On the other hand, I can see that it might be nice to have regularly scheduled Lean Together meetings with a standard format and community guidelines. If we get to that stage, we should probably set up a meetings team. (Conferences in CS have \"steering committees,\" whose main job is to twist arms to find organizers every year.)</p>",
        "id": 317392971,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1671723223
    },
    {
        "content": "<p>With all that, I never addressed Alex's question. I don't know whether having two LFTCMs so close together (chronologically and geographically) makes sense, since it might mean that they are competing for participants. I wouldn't object to it, but it might make more sense to stagger them more. We still don't have a good sense of how many people an in-person meeting will draw.</p>",
        "id": 317394210,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1671723602
    },
    {
        "content": "<p>I agree with the general comments Jeremy wrote. And also Leiden in July and Düsseldorf in September seems really close. However the Leiden thing is less specific. It will not be only about Lean.</p>",
        "id": 317394579,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671723704
    },
    {
        "content": "<p>In particular the Leiden thing will definitely not be called LFTCM something.</p>",
        "id": 317394803,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671723765
    },
    {
        "content": "<p>It seems to be called \"Machine-Checked Mathematics\". But maybe I was dreaming it will mix Coq and Lean based on the fact that Assia is an organizer.</p>",
        "id": 317395014,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671723828
    },
    {
        "content": "<p><a href=\"https://www.lorentzcenter.nl/machine-checked-mathematics.html\">https://www.lorentzcenter.nl/machine-checked-mathematics.html</a></p>",
        "id": 317395126,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671723853
    },
    {
        "content": "<p>It still feels like doing the Dusseldorf one a bit later would be better.</p>",
        "id": 317395318,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671723938
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110865\">Jeremy Avigad</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20workshops.202023/near/317392971\">said</a>:</p>\n<blockquote>\n<p>My personal opinion is that we shouldn't limit the LFTCM meetings. If the community can sustain a dozen a year, why not? We can distinguish them with location and year, e.g. \"Lean for the Curious Mathematician, Providence 2022\". It's really just a matter of having sufficient resources and having enough of an audience to make it worthwhile.</p>\n</blockquote>\n<p>I agree with this.  The Sage community has \"Sage Days\" and they have now reached Sage Days 116.<br>\n<a href=\"https://wiki.sagemath.org/Workshops\">https://wiki.sagemath.org/Workshops</a></p>",
        "id": 317403129,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1671726338
    },
    {
        "content": "<p>Sage days are much lighter than LFTCM. Anyone can organize one to gather a couple of friends.</p>",
        "id": 317403283,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671726378
    },
    {
        "content": "<p>maybe we should encourage chill Lean events too :)</p>",
        "id": 317405854,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1671727124
    },
    {
        "content": "<p>Wasn't that what my September workshop was?</p>",
        "id": 317407386,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671727560
    },
    {
        "content": "<p>On a less chill note, if someone is going to look through this thread and round eveything up into some table it might be worth mentioning that AIM have just agreed to fund a virtual Lean workshop in formalising algebraic geometry, June 24-28, 2024, organised by myself, Johan Commelin, Adam Topaz and Joel Riou. There will be some more formal announcement nearer the time (this is over 18 months away!)</p>",
        "id": 317437414,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671737283
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20workshops.202023/near/317395318\">said</a>:</p>\n<blockquote>\n<p>It still feels like doing the Dusseldorf one a bit later would be better.</p>\n</blockquote>\n<p>Both our limited funding and human resources at Düsseldorf are tied to 2023, and September is the last month before teaching starts. So if we stick to a week long format, there's not much leeway.  If we limit ourselves to a weekend event, we could move it to later in the year.</p>",
        "id": 317446450,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1671740927
    },
    {
        "content": "<p>I have zero experience in organizing Lean workshops, but I'm much less worried about finding participants than finding speakers &amp; instructors for tutorial sessions.</p>",
        "id": 317446505,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1671740947
    },
    {
        "content": "<p>If we go in the direction of hands-on tutorials, then it would seem to me that 20-30 participants would already be a good number to work with, and surely it wouldn't be a problem to find that many participants across Germany??  I think we might even fill half the room with participants from Düsseldorf.  But even for this number of participants, we would need some experienced (non-local) instructors.</p>",
        "id": 317446524,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1671740954
    },
    {
        "content": "<p>If we go more in the direction of presentations, then the number of participants will strongly correlate with the number of high profile speakers, and again, this is where I imagine the bottleneck.</p>",
        "id": 317446546,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1671740964
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20workshops.202023/near/317310189\">said</a>:</p>\n<blockquote>\n<p>Does the format support that?</p>\n</blockquote>\n<p>Does any want know this? I don't know how the <code>start_date</code> and <code>end_date</code> fields in <code>events.yaml</code> are processed.</p>",
        "id": 317530627,
        "sender_full_name": "María Inés de Frutos Fernández",
        "timestamp": 1671790369
    },
    {
        "content": "<p>The format doesn't support that  yet. I'll fix it. For future reference, those kind of questions are answered in <a href=\"https://github.com/leanprover-community/leanprover-community.github.io/blob/newsite/make_site.py\">https://github.com/leanprover-community/leanprover-community.github.io/blob/newsite/make_site.py</a>. If you search for <code>event</code> in that file you'll get an answer.</p>",
        "id": 317531598,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671790720
    },
    {
        "content": "<p>Do you know <span class=\"user-mention\" data-user-id=\"392185\">@Clara Löh</span> ? She is in Germany and has been using lean in her teaching</p>",
        "id": 317533239,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671791266
    },
    {
        "content": "<p>I keep hearing about her, but we never met. She would definitely be a great speaker to have at the workshop.</p>",
        "id": 317533967,
        "sender_full_name": "Alexander Bentkamp",
        "timestamp": 1671791510
    },
    {
        "content": "<p>To add to the list (even though we are not as far with the organisation as we wanted to be ...): Philipp Rümmer, Denis-Charles Cisinski, and I are organising a workshop/summer school in Regensburg (Germany) 18--29 September 2023 on proof assistants and their use in mathematics and computer science. Thus, the scope will be wider on the theoretical and application side, and we will cover several proof assistants (including Lean, of course).</p>",
        "id": 317561158,
        "sender_full_name": "Clara Löh",
        "timestamp": 1671800231
    },
    {
        "content": "<p>My impression is that many math students are interested in learning more about this technology (and way of thinking/working) and that there overall might not be enough options in Germany to do so.</p>",
        "id": 317561447,
        "sender_full_name": "Clara Löh",
        "timestamp": 1671800330
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"129120\">@Alexander Bentkamp</span> of course, I would be happy to meet at some point :)</p>",
        "id": 317561513,
        "sender_full_name": "Clara Löh",
        "timestamp": 1671800350
    },
    {
        "content": "<p>Sorry to be slow to catch up. I spent yesterday on airplanes to traveling to visit my in-laws in San Diego, and now I am on California time. The good news is that we seem to have escaped a brutal winter storm that is pounding the most of the US.</p>\n<p>Since Marcus isn't worried about participants, I think we're all enthusiastic a meeting in Dusseldorf. <span class=\"user-mention\" data-user-id=\"129120\">@Alexander Bentkamp</span> <span class=\"user-mention\" data-user-id=\"507231\">@Marcus Zibrowius</span>, in a moment I'll start a private thread with Heather, Patrick, Johan, and me so that we can talk about organization.</p>\n<p>It's nice to see so much meeting activity! I guess this thread will serve as a place for people to share their plans.</p>",
        "id": 317623888,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1671821032
    }
]