[
    {
        "content": "<p>I'm trying to set up a new blueprint for my project, but <code>leanblueprint</code> doesn't seem to support <code>lakefile.toml</code> yet. I've created a PR to solve this: <a href=\"https://github.com/PatrickMassot/leanblueprint/pull/23\">https://github.com/PatrickMassot/leanblueprint/pull/23</a></p>",
        "id": 442067529,
        "sender_full_name": "Michael George",
        "timestamp": 1717343831
    },
    {
        "content": "<p><code>leanblueprint</code> has an issue that would add duplicated entries to lakefile.lean (if the lakefile already contains entries about mathlib and doc-gen4 etc.). Skimming the code, it seems that the PR also didn't consider this scenario for TOML?</p>",
        "id": 442483141,
        "sender_full_name": "Utensil Song",
        "timestamp": 1717493140
    },
    {
        "content": "<p>Another question is whether it's preferred to entries to <code>lakefile.lean</code>(as in the PR) if \"both lakefile.lean and lakefile.toml exist\".</p>",
        "id": 442483746,
        "sender_full_name": "Utensil Song",
        "timestamp": 1717493307
    },
    {
        "content": "<p>Yes, I just preserved the existing behavior. It would be easy to deduplicate for TOML I think if that’s desired. Re defaulting to lakefile.lean, I chose that because it’s what lake does</p>",
        "id": 442648352,
        "sender_full_name": "Michael George",
        "timestamp": 1717542394
    },
    {
        "content": "<p>You might need to ping <span class=\"user-mention silent\" data-user-id=\"210574\">Patrick Massot</span> on Zulip for reviewing the PR. Github PRs are easy to miss when one's busy.</p>",
        "id": 442672607,
        "sender_full_name": "Utensil Song",
        "timestamp": 1717552150
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296911\">Utensil Song</span> <a href=\"#narrow/stream/113488-general/topic/leanblueprint.20with.20lakefile.2Etoml/near/442483141\">said</a>:</p>\n<blockquote>\n<p><code>leanblueprint</code> has an issue that would add duplicated entries to lakefile.lean (if the lakefile already contains entries about mathlib and doc-gen4 etc.). Skimming the code, it seems that the PR also didn't consider this scenario for TOML?</p>\n</blockquote>\n<p>leanblueprint does not add an entry about mathlib of course, only doc-gen and a lib that is relevant only to blueprints, and it asks before doing it. I could try to detect the presence of those libs in the lakefile.lean but I think the risk is extremely low. And indeed using lakefile.toml is a much better solution for this kind of projects. The ability for external tools to edit the project configuration was the main motivation for supporting toml lake files.</p>",
        "id": 442676545,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1717553837
    },
    {
        "content": "<p>And I saw the PR, I simply need to find time to review it.</p>",
        "id": 442676586,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1717553855
    },
    {
        "content": "<p>Actually I ran into the duplication issue a few days ago when setting up blueprint for someone who has already added doc-gen4, that's why I noticed it. But it was trivial to fix so I forgot it really quick.</p>\n<p>Seeing the TOML PR makes me wonder if it would be easier to handle this, as maybe TOML library might already support an insert-or-replace-ish semantics.</p>\n<p>Also for lakefile.lean, it also doesn't need a full parser for lakefile at all, just detect the repo URL which is most likely always there no matter how one writes the rest of the statement.</p>\n<p>I agree that it's not a priority to fix it.</p>",
        "id": 442696194,
        "sender_full_name": "Utensil Song",
        "timestamp": 1717564045
    }
]