[
    {
        "content": "<p>Hello everyone! The first talk of the workshop will start in twenty minutes. All discussions/questions/announcements for this workshop take place on a dedicated stream: <a href=\"#narrow/stream/238830-Lean-for.20the.20curious.20mathematician.202020\">https://leanprover.zulipchat.com/#narrow/stream/238830-Lean-for.20the.20curious.20mathematician.202020</a></p>",
        "id": 203699854,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1594636931
    },
    {
        "content": "<p>Are there any \"Lean for the Curious Mathematician\" type workshops/tutorials scheduled for 2024 in the US?</p>\n<p>Why I ask: This summer I supervised a team of six undergraduates working on a Lean-based project (\"Automated Theorem Proving and Proof Verification\").  It was a great success, and I'm thinking of doing something similar next summer.  The question of hosting week-long workshop/tutorial before the program was raised.</p>\n<p>So I'm wondering: is something planned in the US for next year?  And if not, is there an appetite for such a workshop?</p>",
        "id": 387924423,
        "sender_full_name": "Colleen Robles",
        "timestamp": 1693328641
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"513134\">@Colleen Robles</span>. Last year's LftCM was in the USA: <a href=\"https://icerm.brown.edu/topical_workshops/tw-22-lean/\">https://icerm.brown.edu/topical_workshops/tw-22-lean/</a></p>\n<p>I don't know of any plans to organise another edition in the USA, but I'm sure there would be appetite.</p>",
        "id": 387956398,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1693339487
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"513134\">@Colleen Robles</span>, we ran a mini-workshop at Rutgers last May (with <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> and <span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> as the featured speakers), and will likely run another one, perhaps slightly bigger,  at the end of this year. Please contact me directly if you'd like to be involved...</p>",
        "id": 388020762,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1693365197
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"513134\">@Colleen Robles</span> there will be an edition of <a href=\"https://conferences.cirm-math.fr/2970.html\">LFTCM in March 2024 in Marseille (France)</a> and we hope to have some fundings to help young students. If they have some travel funding (and are willing to come) they can certainly apply; if not, although we cannot promise anything at the moment, their application will be taken into account.</p>",
        "id": 388080981,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1693393105
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"513134\">@Colleen Robles</span> I'll add my voice to the chorus by saying that more educational opportunities centered on Lean in the US would be great. Do you know about the NSF's recent \"dear colleague letter\" for REU sites? <a href=\"https://www.nsf.gov/pubs/2023/nsf23082/nsf23082.jsp\">https://www.nsf.gov/pubs/2023/nsf23082/nsf23082.jsp</a></p>",
        "id": 388110011,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1693402495
    },
    {
        "content": "<p>+1 to Jeremy. For some reason Lean is quite Europe-centred and my impression is that there is money and opportunities available from US institutions who would prefer to be funding people at US universities</p>",
        "id": 388115323,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1693403613
    }
]