[
    {
        "content": "<p>It's been almost a year since I started learning about Lean while looking into Metamath, Linux administration, Git, and Web development. I've been able to do these because I took a leave of absence from Korea Aerospace University in the summer of 2020; it was challenging to spend time learning about things that aren't directly related to aerospace engineering when I was in university.</p>\n<p>On the other hand, each of my friends and other people stopped learning about Lean for one or more of the following reasons: it turned out they weren't interested in formal mathematics or functional programming; they had difficulty reading online textbooks and documents written in English; or they became busy with their work or research.</p>\n<p>I think it's safe to say that in South Korea, you can't find a professor in mathematics who uses a proof assistant to teach themselves and students how to formalize mathematics. This situation leads to a lack of students who wish to study formal mathematics; they aren't interested in it or don't have time to research it.</p>\n<p>As I said in <a href=\"#narrow/stream/113489-new-members/topic/Bulhwi.20Cha.20.26.20Seongwoo.20Shim.3A.20Introductions/near/292962002\">my introduction</a>, I aim to develop games for mathematics education and study symplectic geometry so I can formalize them. Ironically, it looks like I'd be better off using Lean and Metamath Zero to achieve my goals if I dropped out of university. Thus I decided to leave the university this summer. I hope future generations of students in my country won't have obstacles to formalization of mathematics using proof assistants.</p>",
        "id": 322719921,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1674305663
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"488124\">@Hyunsik Chae</span> came to my undergraduate workshop -- he's another Korean lean user.</p>",
        "id": 322725306,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1674307862
    },
    {
        "content": "<p>We met each other online last September. But we haven't talked much because he's been busy finishing his Bachelor's thesis and preparing for graduate school.</p>",
        "id": 322794489,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1674347813
    },
    {
        "content": "<p>Hello and happy new year! Bulwhi has been in touch with me for a couple of months but I was too busy for close connection due to my graduation. <br>\nBy the way, I would love to share that some professors in Korea have recently started to use Lean (unofficially). If you want to know more please let me know :)</p>",
        "id": 322795990,
        "sender_full_name": "Hyunsik Chae",
        "timestamp": 1674348939
    },
    {
        "content": "<p>Do they know about this Zulip chat? If they don't, could you tell them about it?</p>",
        "id": 322816688,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1674368892
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"488124\">Hyunsik Chae</span> <a href=\"#narrow/stream/113488-general/topic/learning.20about.20lean.20alone.20in.20south.20korea/near/322795990\">said</a>:</p>\n<blockquote>\n<p>By the way, I would love to share that some professors in Korea have recently started to use Lean (unofficially). If you want to know more please let me know <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n</blockquote>\n<p>If we don't know when they'll use Lean \"officially,\" students in KR won't have the chance to formalize mathematics with a tutor's guidance anytime soon.</p>",
        "id": 325784407,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1675499671
    },
    {
        "content": "<p>Quite frankly I doubt it will happen in 1-2 years.</p>",
        "id": 325928301,
        "sender_full_name": "Hyunsik Chae",
        "timestamp": 1675588097
    },
    {
        "content": "<p>Hi! A Korean grad student at UMich majoring in math here. I've been using Lean for a couple months as well. I also had to study it by myself and it was tough for me. For me starting on a project and formalizing what I want to, and asking newbie things on Zulip and Xena discord channel has helped a lot. I think building a new culture of math takes quite a bit of time, but otoh I think this also puts us in a position where we could plant the culture in Korea if given a chance. I am by no means an expert, but feel free to hit me up if you are interested in having a chat.</p>",
        "id": 347764237,
        "sender_full_name": "Jineon Baek",
        "timestamp": 1680911770
    },
    {
        "content": "<p>it's likely everyone reads this channel, but in case not, there is <a class=\"stream\" data-stream-id=\"224796\" href=\"/#narrow/stream/224796-Geographic-locality\">#Geographic locality</a>  for this sort of specific thing that you might want to post in as well.</p>",
        "id": 347771649,
        "sender_full_name": "loki der quaeler",
        "timestamp": 1680916337
    }
]