[
    {
        "content": "<p>Hi, another student at the TU Delft (<span class=\"user-mention\" data-user-id=\"613675\">@Luka Janjić</span> ) and I recently did some work on formalizing memory consistency models in Lean. For this we had to work with a model that heavily relied on binary relations and permutations and combinations of them (transitive-, reflexive-, reflexive-transitive-closures, and also unions, intersections, and compositions). We did quite a bit of abstract boilerplate lemma proving pertaining to combinations of these operations on relations (e.g. <code>(r1 or r2+)+ = (r1 or r2)+</code>, where <code>+</code> is the transitive closure of a relation) and would love to contribute them to Mathlib. My Github username is <code>@bigstep22</code> and Luka's is <code>@sourceCode4</code>. Would it be possible to contribute? What stream is best for discussing this?</p>",
        "id": 354713434,
        "sender_full_name": "Eben Rogers",
        "timestamp": 1682870074
    },
    {
        "content": "<p>Those sound like nice things to have in mathlib; I've added you both to mathlib3</p>",
        "id": 354714536,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1682870523
    },
    {
        "content": "<p>Note that you're finding mathlib at an interesting time; we're in the process of converting to mathlib4 (see <a href=\"https://leanprover-community.github.io/mathlib-port-status\">#port-dashboard</a> to see our progress). If you've already written your code in Lean 3 though, I'd encourage you to make a PR to the Lean3 version of mathlib anyway to get some feedback!</p>",
        "id": 354714957,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1682870668
    },
    {
        "content": "<p>Ok, thank you for the fast reply! I remember reading somewhere that Mathlib3 is some sort of a 'feature freeze'. So I'm assuming that eventually we'll have to contribute to both Mathlib3 and 4 for it to be merged? In the meantime, we'll get to work creating a PR.</p>",
        "id": 354715600,
        "sender_full_name": "Eben Rogers",
        "timestamp": 1682870934
    },
    {
        "content": "<p>Right now we are still accepting PRs to mathlib3; but once they're merged they'll appear on <a href=\"https://leanprover-community.github.io/mathlib-port-status/out-of-sync\">#outofsync</a> the next day, which contains a best-effort translation of your changes to Lean4 that you'll have to assemble into a mathlib4 PR yourself. Depending on what exactly you intend to contribute, it _may_ make sense to skip lean3 and go straight to Lean4; but that can be decided in review</p>",
        "id": 354716520,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1682871375
    },
    {
        "content": "<p>Do have a look at <a href=\"https://github.com/leanprover-community/mathlib/pull/18286\">#18286</a> and see whether I caught any of your lemmas there.</p>",
        "id": 354731695,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1682878137
    }
]