[
    {
        "content": "<p>I've a lean3 project where I think irreducibility of <code>ring_quot.smul</code> is causing a problem. Unfortunately, it's private so I can't make it locally semireducible (or give a docs link!). <code>import private</code> seems to give me an object that can't be used with <code>local attribute</code>.</p>\n<p>Is there any other way to change the reducibility besides forking mathlib3 / breaking the too-late rule?</p>",
        "id": 377635224,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690041338
    },
    {
        "content": "<p>Will it be a problem when ported to Lean 4?</p>",
        "id": 377694425,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690067525
    },
    {
        "content": "<p>I'm pretty sure the diamond I'm struggling with will still be there in Lean 4. I can certainly debug it there, but in the interest of not having to rewrite bits of my thesis it's easier to stay with lean 3; mathport can't convert latex documents!</p>",
        "id": 377695435,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690067931
    },
    {
        "content": "<p>I guess there's the easy option of \"make a branch in mathlib3\"; I'd forgotten downstream projects can depend on that and still get oleans</p>",
        "id": 377695640,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690068016
    },
    {
        "content": "<p>I think we can also be generous with the <code>too-late</code> rule here. You've contributed so much to the porting effort that I think you should feel free to unilaterally ignore the <code>too-late</code> rule, in fact. :-)</p>",
        "id": 377710792,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690074941
    },
    {
        "content": "<p>I'll confirm that it actually solves the problem in lean 4 first; it might just reveal more problems...</p>",
        "id": 377831146,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690117582
    },
    {
        "content": "<p>It turns out that removing <code>irreducible</code> was the tip of the iceberg: there's also a pile of missing <code>nsmul</code>/<code>nat_cast</code>/<code>zsmul</code>/<code>int_cast</code> fields: <a href=\"https://github.com/leanprover-community/mathlib4/pull/6073\">#6073</a></p>",
        "id": 377883839,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690132031
    }
]