[
    {
        "content": "<p>I think this is indeed an issue that should get fixed. <span class=\"user-mention\" data-user-id=\"395550\">@Henrik Böving</span> did you consider having a frozen loogle for each monthly release Mathlib tag?</p>",
        "id": 438406421,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1715619020
    },
    {
        "content": "<p>I do not own loogle that's <span class=\"user-mention\" data-user-id=\"470149\">@Joachim Breitner</span>, coincidentally the FRO started talking about something like this just this morning though ^^</p>",
        "id": 438406864,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1715619154
    },
    {
        "content": "<p>Once it lands, the extensions on vscode and nvim will need to be updated</p>",
        "id": 438407059,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1715619225
    },
    {
        "content": "<p>I am guessing there will be a change in the URL routes for getting the json.</p>",
        "id": 438407229,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1715619273
    },
    {
        "content": "<p>Loogle isn't particularly cheap to run, it’s a persistent process that has all of Mathlib plus an index <code>mmap</code>ed. I don’t have urgent plans to support many different versions.</p>\n<p>It would be great if it were easier to run loogle locally; this way you get exactly your stuff, including any libraries you import and whatever changes you have locally. I am sure eventually this will be the case. Until then, <code>loogle</code> tracks mathlib <code>master</code> with a delay of about 6h.</p>",
        "id": 438407631,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1715619407
    },
    {
        "content": "<p>That said, it is possible already now, just not super convenient, and I am keen to hear from early adopters who play around with it. Happy to assist.</p>",
        "id": 438408531,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1715619691
    },
    {
        "content": "<p>I don’t know why I pinged Henrik instead of Joachim, I’m sorry. I did that right before getting lunch, I guess my brain was lacking nutriments.</p>",
        "id": 438418941,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1715623288
    },
    {
        "content": "<p>Now worries at all :-)<br>\nI like having Henrik as my first-level support ;-)</p>",
        "id": 438419015,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1715623306
    }
]