[
    {
        "content": "<p>Hi all</p>\n<p>I am sorry for posting this here. I started learning using LEAN and really enjoy it and hence joining this wonderful community.<br>\nI am Dilpreet Kaur. I am interested in applying for the WISER Project and PECFAR Project this year. My research interests include finite group theory and representation theory. The call for proposals for these projects typically opens in February.</p>\n<p>As you may know, the WISER program supports and funds collaborative STEM research projects led by a pair of women scientists—one from India and one from Germany. The program aims to promote international collaboration, knowledge exchange, and gender equality in science and engineering.</p>\n<p>And, The Paired Early Career Fellowship in Applied Research (PECFAR) is a fellowship programme by the Indo-German Science &amp; Technology Centre (IGSTC) that supports pairs of early-career researchers — one from India and one from Germany — to undertake short research visits for networking, exploring collaborations, and advancing applied research in STEM fields. For this project, the age limit is 40 years as on the date of application.</p>\n<p>If any German group theorist is interested then please contact me at <a href=\"mailto:dilpreetkaur@iitj.ac.in\">dilpreetkaur@iitj.ac.in</a></p>\n<p>Many Thanks!</p>",
        "id": 567074199,
        "sender_full_name": "Dilpreet Kaur",
        "timestamp": 1767935444
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"983252\">@Dilpreet Kaur</span> Could you clarify: are you looking for someone working/living in Germany, or someone with German nationality?</p>",
        "id": 567092323,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1767947783
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> Eligible applicants of these projects are Indian &amp; German Researchers holding regular positions in academia/research institution/industry or holding a long-term nationally recognized fellowships (4 years and above).</p>",
        "id": 567096873,
        "sender_full_name": "Dilpreet Kaur",
        "timestamp": 1767949741
    }
]