[
    {
        "content": "<p>I'm using lean with nvim, and I noticed that even when I'm not using the editor, there are several lean processes eating up a ton of CPU time (and killing my battery!). I'm surprised that lean is doing much while I'm not typing, I wonder if I have some kind of configuration error or something. Any thoughts?</p>",
        "id": 426781251,
        "sender_full_name": "Michael George",
        "timestamp": 1710520607
    },
    {
        "content": "<p>Lean alwys attempts to elaborate the file(s) you are working on until the end after an edit to see if some proof or definition doesn't work out anymore or something like that. If you have big files (or files that generally take long to compile) and edit them at the top it is likely that they are being re-elaborated all the time as you finish typing.</p>\n<p>You can address things like that by splitting it up into more files or placing a #exit below the point you wish to check until now.</p>\n<p>Alternatively there might also be a deeper issue but you will have to provide more detail on your setup.</p>",
        "id": 426788925,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1710523025
    },
    {
        "content": "<p>I wish there was a synchronous \"update on save\" elaboration. I still get this runaway thread issue on macOS</p>",
        "id": 426789469,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1710523203
    },
    {
        "content": "<p>Write an issue for it and it will end up on the FROs queue eventually^^</p>",
        "id": 426789892,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1710523339
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"568451\">@Michael George</span> just to rule it out, if you're working on Mathlib, or something depending on it, and you see it's <em>Mathlib</em> that Lean is compiling, you should double check something isn't wrong with your Mathlib cache. (If you see that's what it is, i.e. Mathlib, say so and  we can elaborate -- oh god pun not intended).</p>",
        "id": 426795932,
        "sender_full_name": "Julian Berman",
        "timestamp": 1710525589
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"395550\">@Henrik Böving</span> : <a href=\"https://github.com/leanprover/vscode-lean4/issues/305\">https://github.com/leanprover/vscode-lean4/issues/305</a></p>",
        "id": 426822250,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1710536874
    },
    {
        "content": "<p>I have given up hope. In the bigger scheme of things I can see that this won't be a priority any time soon.</p>",
        "id": 426822340,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1710536898
    },
    {
        "content": "<p>This seems to have resolved itself for now for me, so maybe whatever it was doing is done now. The problem wasn't caused by a large file, because I've only been editing small files. I was editing files from multiple different projects simultaneously, so I wonder if some build artifacts weren't being found and so were being rebuilt.</p>\n<p>If my laptop starts getting hot again I'll try to do some more investigation and let you know!</p>",
        "id": 428191155,
        "sender_full_name": "Michael George",
        "timestamp": 1711045270
    }
]