[
    {
        "content": "<p>This is the discussion thread for the <a href=\"#narrow/channel/113486-announce/topic/Mathlib.20Initiative/near/530638477\">Mathlib initiative announcement</a>.</p>",
        "id": 531794407,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1753868017
    },
    {
        "content": "<p>There's a mention of possible jobs related to this. Would they be based somewhere in particular?</p>",
        "id": 531794655,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753868084
    },
    {
        "content": "<p>I am interested (as I'm sure lots of people are) but I imagine that will make a big difference to many.</p>",
        "id": 531794782,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753868114
    },
    {
        "content": "<p>It is very, very early days so there's not much I can say but certainly we do plan to hire people, and we do not expect their location to be relevant.</p>",
        "id": 531796862,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1753868625
    },
    {
        "content": "<p>I might add that I'm delighted to see a discussion thread and that we welcome questions, even if we might not yet be able to answer many of them.</p>",
        "id": 531797049,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1753868672
    },
    {
        "content": "<p>I have a question, which is probably down to a lack of my understanding of the terminology. How should I think of the \"The Mathlib Initiative\"? e.g. is it a research grant, a company,  or something in between?</p>",
        "id": 531797680,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1753868816
    },
    {
        "content": "<p>Officially / legally it is a programme of Renaissance Philanthropy. Such programmes can remain incubated in this form indefinitely or they can also evolve into an independent non-profit, say.</p>\n<p>Practically I think it should be thought of as a group of people whose job it is to support Mathlib and the work of the Mathlib Maintainers.</p>",
        "id": 531799104,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1753869234
    },
    {
        "content": "<p>In terms of the categories above, is the following guess somewhat accurate?</p>\n<ul>\n<li>it's not meant to make a profit (unlike a company)</li>\n<li>it's not based at an academic institution (unlike most research grants)</li>\n<li>it will have more startup-like accountability, such as quarterly reports</li>\n</ul>\n<p>(Reading this, it sounds somewhat similar to the Lean FRO --- except that one <del>is an independent entity</del>(not quite, see below), which the Mathlib Initiative is not, right?)</p>",
        "id": 531799471,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1753869331
    },
    {
        "content": "<p>Granted, it's nice to get help with doing payroll, hiring people, legal questions, etc. - spinning up all that yourself sounds like a lot of work.</p>",
        "id": 531799632,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1753869372
    },
    {
        "content": "<p>This is all about right, modulo the detail that the Lean FRO is itself incubated within Convergent Research (albeit with a different setup that I have not studied).</p>",
        "id": 531800246,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1753869552
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"634338\">Michael Rothgang</span> <a href=\"#narrow/channel/113488-general/topic/Mathlib.20initiative.20annoucement.20discussion/near/531799632\">said</a>:</p>\n<blockquote>\n<p>Granted, it's nice to get help with doing payroll, hiring people, legal questions, etc. - spinning up all that yourself sounds like a lot of work.</p>\n</blockquote>\n<p>It is much more than nice, it’s 100% required. Nobody here is competent to do that or even willing to learn. This is already true for the Lean FRO. When you love all the great work that came from the FRO you also love the work done by people you don’t know at Convergent Research who made all this possible.</p>",
        "id": 531804493,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1753870867
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"240862\">Oliver Nash</span> <a href=\"#narrow/channel/113488-general/topic/Mathlib.20initiative.20annoucement.20discussion/near/531796862\">said</a>:</p>\n<blockquote>\n<p>It is very, very early days so there's not much I can say but certainly we do plan to hire people, and we do not expect their location to be relevant.</p>\n</blockquote>\n<p>This is great news. To be entirely honest pending details I think \"a group of people whose job it is to support Mathlib and the work of the Mathlib Maintainers\" is almost precisely work I would be excited to do and very suited for - but even if that didn't work out I'm very excited that it is happening.</p>",
        "id": 531811878,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1753873153
    },
    {
        "content": "<p><del>Here <span class=\"user-mention\" data-user-id=\"662452\">@Jason Reed</span> said he will have more details about the available jobs soon: </del> (See below.) <a href=\"https://mastodon.social/@jcreed/114937599329818056\">https://mastodon.social/@jcreed/114937599329818056</a></p>",
        "id": 531826099,
        "sender_full_name": "Malvin Gattinger",
        "timestamp": 1753877326
    },
    {
        "content": "<p>Malvin,  this is something completely different. Jason talks about the Lean FRO not the Mathlib Initiative.</p>",
        "id": 531829465,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1753878316
    },
    {
        "content": "<p>Ohh, oops. Sorry for the confusion!</p>",
        "id": 531921931,
        "sender_full_name": "Malvin Gattinger",
        "timestamp": 1753906411
    },
    {
        "content": "<p>No problem, the situation is indeed a bit confusing. But we can’t really complain there are too many good news.</p>",
        "id": 531923098,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1753906845
    },
    {
        "content": "<p>The connection here is that both the Mathlib Initiative and the additional hiring that Jason is organizing for the FRO's new interface work are initially funded by Alex Gerko's gifts.</p>",
        "id": 531955385,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1753921532
    },
    {
        "content": "<p>For future reference, the job posting is now here: <a class=\"stream-topic\" data-stream-id=\"284757\" href=\"/#narrow/channel/284757-job-postings/topic/Mathlib.20Initiative/with/535650081\">#job postings &gt; Mathlib Initiative</a></p>",
        "id": 536585676,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1756380864
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/channel/113486-announce/topic/Mathlib.20Initiative/near/530638477\">said</a>:</p>\n<blockquote>\n<p>Although the Mathlib Initiative will work hard on reviewing PRs on the queue, it should be understood that the Mathlib maintainer team retains decision power and will remain in charge of the Mathlib library.</p>\n</blockquote>\n<p>I'm a bit concerned about this part. I think a lot of people will not understand this distinction. The Mathlib Initiative will be the only legal entity with Mathlib in the name and I think most people will assume that it is the organization responsible for the administration of Mathlib when they first hear about it.</p>",
        "id": 537440618,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1756893304
    },
    {
        "content": "<p>I invite people here to look at: <a href=\"https://github.com/mathlib-initiative/TaskList\">https://github.com/mathlib-initiative/TaskList</a></p>\n<p>We want to have a way for the community to communicate its needs to the Mathlib Initiative. Some remarks as follows:</p>\n<ul>\n<li>Every issue opened will be considered, even though we may not respond directly.</li>\n<li>Some good issues will be closed simply because they are too far outside our scope.</li>\n<li>There is clearly some redundancy with the issues on the main mathlib4 repo. The difference is that we commit to consider each of these issues and to triage the list regularly.</li>\n</ul>",
        "id": 560603141,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1764251660
    }
]