[
    {
        "content": "<p>Right now there's a common two-stage process of (S1) a paper presenting theorems followed by (S2) a subsequent formalization paper using some proof assistant to present computer-checked proofs. I've been doing a literature search with the goal of finding (S12) papers that merge these two stages: the computer-checked proofs aren't a subsequent paper but are already in the original paper. The interesting corner case of proofs that were found by a computer in the first place is easy to find, but I'm looking for non-automated examples.</p>\n<p>A search that names any of the popular proof assistants is flooded with examples of S2, and I haven't figured out how to narrow this in a way that finds S12. I haven't even figured out how searches would find my own S12 papers, or <a href=\"https://www.cl.cam.ac.uk/~jrh13/papers/holhol.html\">https://www.cl.cam.ac.uk/~jrh13/papers/holhol.html</a> and its followups, without using pre-knowledge of those papers.</p>\n<p>Has anyone seen names for the S2/S12 distinction? (I've tried various names that produce no search results; the most comprehensible names I've thought of so far are \"papers _on_ computer-checked proofs\" vs. \"papers _with_ computer-checked proofs\", but there's no reason that a paper of the second type would use that terminology.) Does anyone have a list of S12 papers, or individual examples?</p>\n<p>I did notice <a href=\"https://xenaproject.wordpress.com/2023/01/08/lean-2022-round-up/\">https://xenaproject.wordpress.com/2023/01/08/lean-2022-round-up/</a> saying that Mehta and Bloom finished a \"full formalisation of Bloom’s result\" before \"Bloom had received a referee’s report for the paper\", but it isn't clear to me whether formalization here refers to the proofs or just the theorem statements. Also, this example doesn't sound like it has the basic S12 advantage of reducing the referee's proof-checking load.</p>",
        "id": 386821170,
        "sender_full_name": "D. J. Bernstein",
        "timestamp": 1692789983
    },
    {
        "content": "<p>Mehta and Bloom did a full formalization including all proofs down to leans standard axioms (building on mathlib). It is of course unlikely that the referees know lean (but not impossible) though it may have helped convince someone they didn't need to check every last detail. I guess only <span class=\"user-mention\" data-user-id=\"458865\">@Thomas Bloom</span> can say for sure if they heard anything to that effect from the referees/ editor at any point?</p>",
        "id": 386828752,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1692790396
    },
    {
        "content": "<p>Yes, everything including all proofs was formalized. The referee's report was received after the formalisation was completed (and publicly announced), and did not mention Lean or the formalisation, so I don't know whether the referee was aware of it.</p>",
        "id": 386834461,
        "sender_full_name": "Thomas Bloom",
        "timestamp": 1692790616
    },
    {
        "content": "<p>After the referee's report was received I let the editor know about the formalisation, and an appendix has been added to the original paper describing this.</p>",
        "id": 386835426,
        "sender_full_name": "Thomas Bloom",
        "timestamp": 1692790655
    },
    {
        "content": "<p>I'm in a the process of publishing a paper where every result mentioned within the paper is annotated with a link to the formalization, though the paper itself barely mentions formalization</p>",
        "id": 386850122,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1692791651
    },
    {
        "content": "<p>In programming language research (conferences: POPL, PLDI, ICFP) S12 papers are very common. If you look at papers accepted at these conferences, you'll find many examples.</p>",
        "id": 386850153,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1692791666
    },
    {
        "content": "<p>Besides the unit-fractions project, the only example I can think of is <span class=\"user-mention\" data-user-id=\"130308\">@Neil Strickland</span>'s <a href=\"https://arxiv.org/abs/1907.07801\">https://arxiv.org/abs/1907.07801</a>.</p>\n<p>In general, I think S12 is very rare in maths, simply because the boundary of what can be formalized is often quite far from the boundary of research-level maths.</p>",
        "id": 386850810,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1692791904
    },
    {
        "content": "<p>Thanks for the pointers so far! My objective here is to cite a reasonable spread of examples that a skeptical reader can spot-check, so the level of documentation is important: e.g., even if <a href=\"https://arxiv.org/abs/2112.03726\">https://arxiv.org/abs/2112.03726</a> will end up qualifying as S12, right now it's just the 2021 version.</p>",
        "id": 386851526,
        "sender_full_name": "D. J. Bernstein",
        "timestamp": 1692792140
    },
    {
        "content": "<p>And, to be clear, the scope I'm interested in includes any paper that states a theorem; I'm not trying to draw lines between math and CS.</p>",
        "id": 386852904,
        "sender_full_name": "D. J. Bernstein",
        "timestamp": 1692792604
    },
    {
        "content": "<p>With apologies for citing my own work, as far as I'm aware, the main result of this paper (see section 4) did not previously appear in the literature: <a href=\"https://link.springer.com/article/10.1007/s10817-023-09668-0\">https://link.springer.com/article/10.1007/s10817-023-09668-0</a>  (and indeed I found it a bit hard to believe until I had formalised it).</p>",
        "id": 386860553,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1692795032
    },
    {
        "content": "<p>The closest one of my papers comes to (S12) can be found here: <a href=\"https://raw.githubusercontent.com/adamtopaz/CoeffAltPairs/main/main.pdf\">https://raw.githubusercontent.com/adamtopaz/CoeffAltPairs/main/main.pdf</a><br>\nBut I still have not submitted this anywhere, so I don't have any idea what a generic referee might say.</p>",
        "id": 386871696,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1692798069
    },
    {
        "content": "<p><a href=\"https://arxiv.org/abs/2302.10640\">Our paper</a> has a new proof on the group law on Weierstrass curves that afaik isn't anywhere in the published literature, but I guess that's not really a new theorem</p>",
        "id": 386871956,
        "sender_full_name": "David Ang",
        "timestamp": 1692798161
    },
    {
        "content": "<p>Preprint examples are great. de Bruijn commented in 1991 on the goal to \"lighten the burden of referees of mathematical papers\"; clearly this is most effective if the formalization is there before refereeing begins.</p>",
        "id": 386876039,
        "sender_full_name": "D. J. Bernstein",
        "timestamp": 1692799155
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"630204\">D. J. Bernstein</span> <a href=\"#narrow/stream/113488-general/topic/merging.20formalization.20into.20the.20original.20paper/near/386851526\">said</a>:</p>\n<blockquote>\n<p>even if <a href=\"https://arxiv.org/abs/2112.03726\">https://arxiv.org/abs/2112.03726</a> will end up qualifying as S12, right now it's just the 2021 version.</p>\n</blockquote>\n<p>I'll update the arxiv version with the new appendix about the formalisation later this week.</p>",
        "id": 386880579,
        "sender_full_name": "Thomas Bloom",
        "timestamp": 1692800173
    },
    {
        "content": "<p>Great!</p>",
        "id": 386880833,
        "sender_full_name": "D. J. Bernstein",
        "timestamp": 1692800239
    },
    {
        "content": "<p>I was thinking about this topic a lot in the past. Sometimes I was thinking out \"loud\" like here:<br>\n<a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research\">https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research</a></p>\n<p>Since then, my opinions have shifted a bit in the following direction:<br>\nIf you can publish two papers, why wouldn't you want to?<br>\nIf you do S1 in area where S2 is feasible, why don't you first publish S1 and subsequently S2 elsewhere?<br>\nI am not saying it is better for science (arguably, doing S12 together would be better overall) but it is better for you personally -- publications are our currency -- two publications are more than one publication.</p>\n<p>Maybe you solved a problem where S1 was too easy to impress reviewers by S1 alone, so you do S12 together and bring S12 to a formalization conference? I am saying \"S12 to a formalization conference\" because I am worried that, in situation where S1 would be seen as too easy, S12 would not convince \"math reviewers\" either. But I'll be happy if you prove me wrong!</p>",
        "id": 386917723,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1692810113
    },
    {
        "content": "<p>I have two S12 papers, see <a href=\"https://perso.univ-rennes1.fr/sebastien.gouezel/articles/SubMult.pdf\">https://perso.univ-rennes1.fr/sebastien.gouezel/articles/SubMult.pdf</a> (especially Remark 1.3 there) and <a href=\"https://perso.univ-rennes1.fr/sebastien.gouezel/articles/morse_lemma.pdf\">https://perso.univ-rennes1.fr/sebastien.gouezel/articles/morse_lemma.pdf</a> (in the latter paper, the preprint version had more details on the formalization, but the referee asked us to remove it as it was not interesting at all in his own view...)</p>",
        "id": 386923119,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1692812396
    },
    {
        "content": "<p>I think there is a spectrum between S2 and S12. If you make an ITP paper about a folklore theorem (like I did), I think it falls somewhere in between S2 and S12.</p>",
        "id": 386923964,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1692812766
    },
    {
        "content": "<p>I'm interested in hearing about examples in the gray areas too.</p>",
        "id": 386929154,
        "sender_full_name": "D. J. Bernstein",
        "timestamp": 1692814943
    }
]