[
    {
        "content": "<p>What is the minimum computer strength needed to use Lean and Mathlib? I've been using <a href=\"https://live.lean-lang.org\">https://live.lean-lang.org</a> because every time I try to run Lean on my laptop it freezes.</p>",
        "id": 505914564,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1742097414
    },
    {
        "content": "<p>I use a Lenovo ThinkPad Gen 2 (E14) and it works perfectly fine with Lean/mathlib</p>",
        "id": 505915429,
        "sender_full_name": "Jeremy Tan",
        "timestamp": 1742098088
    },
    {
        "content": "<p>Lenovo ThinkPad X1 Nano Gen1 is slow but I wrote a lot of Mathlib code on it.</p>",
        "id": 505915694,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1742098337
    },
    {
        "content": "<p>A laptop bought at 2017 running Win10 with quad-code i5 2.5GHz CPU and 8GB RAM suffices, although importing whole mathlib will take 2 minutes.</p>",
        "id": 505932659,
        "sender_full_name": "Jz Pan",
        "timestamp": 1742111605
    },
    {
        "content": "<p>8GB RAM is the bare minimum nowadays, you'd be better off with 16, and even then I've seen Lean take down my 16G laptop when I have docs open (which are also a real memory hog I think?) which is one reason I'm upgrading my laptop so I can get more RAM. But I'm a heavy user and am compiling my own projects a lot.</p>",
        "id": 505935141,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1742113741
    },
    {
        "content": "<p>If you're on linux, \"Lean takes down my laptop\" can be fixed at the lake level: by default, uses all your cores to build things - this can freeze your computer at seemingly random times if lake decides to do something with your VS Code which is open in the background. You can tell lake to be more nimble, though.</p>",
        "id": 505946329,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1742123021
    },
    {
        "content": "<p>(Perhaps this should be changed in lake... that's a topic for a different thread.)</p>",
        "id": 505946388,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1742123047
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> Could you please open such a topic? I would of course be very interested in hearing more about that issue, i.e. hardware, htop screenshot, ideally a samply profile... If you do mean a freeze over multiple seconds, that almost certainly is thrashing of memory. Which limiting the number of concurrent build processes does indirectly help with.</p>",
        "id": 506102976,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1742206394
    },
    {
        "content": "<p>(also the solution is in no way limited to Linux)</p>",
        "id": 506103147,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1742206438
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> Sure, I'll try to open such a topic soon. Just to clarify</p>\n<ul>\n<li><code>htop</code> is the same/very close to my (Debian) Linux's \"system tray\", right?</li>\n<li>if I need to wait for \"my computer freezes in the background\", I might take a while to encounter this. But I can try to trigger this via \"open lots of files\".</li>\n</ul>",
        "id": 506173319,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1742222715
    },
    {
        "content": "<p>I don't know your system tray</p>",
        "id": 506217868,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1742232462
    },
    {
        "content": "<p><a href=\"https://htop.dev/\">https://htop.dev/</a> should be available in debian.</p>",
        "id": 506284798,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1742254716
    }
]