[
    {
        "content": "<p>Hi people,</p>\n<p>I would like to share a plugin that I wrote for <a href=\"https://obsidian.md/\">Obsidian</a>, which provides syntax highlight for Lean codeblocks: <a href=\"https://github.com/tomaz1502/lean-syntax-highlight\">https://github.com/tomaz1502/lean-syntax-highlight</a></p>\n<p>It is already available in the \"community plugins\" section, so you can use by simply browsing and installing it with the plugin manager.</p>\n<p>I would love to hear your feedback :) (also, please note that this is the very first javascript code I wrote) (yes, I like Lean to the point of learning a bit javascript because of it)</p>",
        "id": 423678480,
        "sender_full_name": "Tomaz Mascarenhas",
        "timestamp": 1709061180
    },
    {
        "content": "<p>It might be worth publishing a standalone codemirror package for Lean too; in principle that would give us syntax highlighting in the github editor too, but in practice we can't have nice things when it comes to highlighters (GitHub <a href=\"https://github.com/github-linguist/linguist/issues/3252\">doesn't support</a> anything but first-party highlighters, and CodeMIrror doesn't accept new languages)</p>",
        "id": 423698390,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1709068729
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"123965\">@Bryan Gin-ge Chen</span> wrote a CodeMirror highlighter for Lean 3 at <a href=\"https://observablehq.com/@bryangingechen/hello-lean-prover#initCodeMirrorLeanMode\">https://observablehq.com/@bryangingechen/hello-lean-prover#initCodeMirrorLeanMode</a>, which might have some tricks you could copy</p>",
        "id": 423698705,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1709068855
    },
    {
        "content": "<p>Given their response in your comment, maybe we can get the nice things by sending a ticket to Github? But yeah, I will publish an npm package either way.</p>",
        "id": 423802833,
        "sender_full_name": "Tomaz Mascarenhas",
        "timestamp": 1709121415
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"360938\">@Tomaz Gomes</span> it seems the Obsidian plugin is broken. Do you happen to know of an easy fix?</p>\n<p>I saw your <a href=\"https://github.com/PrismJS/prism/pull/3765\">open PR for Prism</a>, which would solve this outright. Maybe we can get some more eyes <span aria-label=\"eyes\" class=\"emoji emoji-1f440\" role=\"img\" title=\"eyes\">:eyes:</span>  on that and get people to comment.</p>",
        "id": 455465703,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1722453913
    },
    {
        "content": "<p>Hm, I just updated Obsidian and did some quick tests and it seems working here. Could you share which steps you took?</p>",
        "id": 455469973,
        "sender_full_name": "Tomaz Mascarenhas",
        "timestamp": 1722455124
    },
    {
        "content": "<p>I agree, if the PR was merged then we would get for free highlight for Lean in Obsidian and in many other places that rely on Prism. Unfortunately it seems that the repository have not been maintained for a while :(</p>",
        "id": 455470254,
        "sender_full_name": "Tomaz Mascarenhas",
        "timestamp": 1722455189
    },
    {
        "content": "<p>Hmmm... strange. It stopped working on one machine yesterday, and then today it wouldn't load on another machine either. But I just tested again and it seems to be working. Will post again if I can repro. Sorry for the noise.</p>",
        "id": 455482396,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1722459238
    }
]