[
    {
        "content": "<p>Since I started to learn lean, I cloned several lean repositories to do lean exercises (like MIL etc.), however, in the last few days, when I tried to install some software to may laptop (win11, almost 440GB) I was informed that I don't have enough space, and upon inspection I noticed that the lean + .lake directories are over 40GB!<br>\nIs there a way to reduce used space by maintaining <strong>only one</strong> copy of mathlib? I remember that <span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span> said something about that months ago that involve the new module system, but</p>\n<ul>\n<li>I haven't found the conversation, and</li>\n<li>I don't see how this will reduce the space.</li>\n</ul>\n<p>So is there a way to reduce (pretty urgently) the space used by lean, other than to delete some directories?</p>",
        "id": 564175257,
        "sender_full_name": "Yitzhak Zangi",
        "timestamp": 1765949387
    },
    {
        "content": "<p>There were some community notes put <a href=\"https://leanprover-community.github.io/mathlib-manual/html-multi/Guides/Shared-Mathlib-Installation/?terms=share#Mathlib-Manual--Guides--Shared-Mathlib-Installation\">here</a> and there was a suggestion in passing that one could specify (in each dependent project) the mathlib dependency by using a local path pointing to the shared mathlib, but I think all of these suffer from (at least) the same weakness of requiring the dependent packages to use the exact same version of mathlib.</p>",
        "id": 564181106,
        "sender_full_name": "Chris Bailey",
        "timestamp": 1765953645
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib-manual/html-multi/Guides/Shared-Mathlib-Installation/#Mathlib-Manual--Guides--Shared-Mathlib-Installation\">https://leanprover-community.github.io/mathlib-manual/html-multi/Guides/Shared-Mathlib-Installation/#Mathlib-Manual--Guides--Shared-Mathlib-Installation</a></p>\n<p>Here are my thoughts about it. However, note that the process described there is quite a manual one, and I can't really recommend it.</p>\n<p>The easier solution might be to just delete stuff you don't need anymore or get an external drive...</p>",
        "id": 564181152,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1765953678
    },
    {
        "content": "<p>You could try using filesystem with automatic deduplication too. But that's also not easy to setup, if you're not already on zfs or btrfs.</p>",
        "id": 564182378,
        "sender_full_name": "Jakub Nowak",
        "timestamp": 1765954384
    },
    {
        "content": "<p>If it's urgent then a short-term practical solution is to either delete directories in <code>$HOME/.elan/toolchains</code> corresponding to old versions of lean (each deletion saves about 2-2.5 gigs), or to delete <code>.lake</code> directories in individual projects (if they depend on mathlib then such a deletion could save 8 gigs). Any such deletion can be easily reversed with <code>lake exe cache get</code> in the relevant repo if you want the project running again; the relevant data will be downloaded in under a minute(*).</p>",
        "id": 564213495,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765966142
    },
    {
        "content": "<p>(*) your download speed may vary</p>",
        "id": 564214073,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1765966319
    }
]