[
    {
        "content": "<p>I've noticed that the links to individual theorems/definitions on the right side of the Lean 4 docs are listed in the order they're defined in rather than alphabetical order (which is how they're ordered in the Lean 3 docs). I feel like the alphabetical ordering was more useful and I'm wondering if anyone else feels this way. Has this been previously discussed? Could this be changed?</p>",
        "id": 411638408,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1704667376
    },
    {
        "content": "<blockquote>\n<p>Has this been previously discussed?</p>\n</blockquote>\n<p>no, but you should discuss it if you dont like it.</p>\n<blockquote>\n<p>Could this be changed?</p>\n</blockquote>\n<p>yes</p>",
        "id": 411639155,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1704668018
    },
    {
        "content": "<blockquote>\n<p>you should discuss it if you dont like it.</p>\n</blockquote>\n<p>Gotcha. My perspective is that an alphabetical sidebar is useful for quick lookups. I'm thinking of a scenario where you're browsing a page and you'd like to see if a specific lemma/def is on that page, or maybe you know it is and you want to jump to it quickly. Or a scenario where you want to see which lemmas/defs on that page have a specific prefix. An alphabetical listing is helpful in these scenarios, whereas a non-alphabetical listing is useless.</p>\n<p>Obviously there are other ways to handle these scenarios, like using the search bar or Command-F, but IMHO having an alphabetical listing provides a useful overview of the contents of a file.</p>",
        "id": 411640733,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1704669289
    },
    {
        "content": "<p>Here's a UI proposal:</p>\n<ul>\n<li>Have radio buttons in the right sidebar at the top of the list of declarations, <code>(*) Outline ( ) A-Z</code></li>\n<li>In Outline mode, it's the same as now, but it also includes the section headings that appear in the documentation (with the appropriate CSS style so that they get truncated with an ellipsis and stay each on one line perhaps, and a tooltip with the full heading?)</li>\n<li>In A-Z mode, it shows the declarations in alphabetical order. (No headings are included, that wouldn't make sense)</li>\n<li>We develop some unobtrusive icons to list next to each declaration to show whether each declaration is a definition, a theorem, an inductive type, or something else. (A simple design: a ~2px vertical bar with the same color of the corresponding declaration type used in the main body of the documentation.)</li>\n</ul>",
        "id": 411641231,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1704669739
    },
    {
        "content": "<p>I like it! I would add that the mode should stay consistent when navigating to different pages (as opposed to always starting in Outline mode).</p>",
        "id": 411642013,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1704670466
    },
    {
        "content": "<p>Why only allow reordering the sidebar? Could we also reorder the main body too?</p>",
        "id": 411687656,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1704701251
    },
    {
        "content": "<p>What would that do with doc comments?</p>",
        "id": 411691897,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1704703264
    },
    {
        "content": "<p>Discard them in all views but the default one.</p>",
        "id": 411692121,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1704703366
    }
]