[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"597544\">Samara Zauhy</span> <a href=\"#narrow/stream/113486-announce/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/353172517\">said</a>:</p>\n<blockquote>\n<p>There is a lot of demand for participants with Lean knowledge.</p>\n</blockquote>\n<p>Can you tell us more about this? How many people want to pay Lean users to formalize math problems?</p>",
        "id": 353194095,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1682588621
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"417769\">@Bulhwi Cha</span>, thanks for your question!</p>\n<p>Some of our biggest partners are keen to work with Lean users because of its applicability as a theorem prover. They plan to launch numerous studies that require participants to have either a working or expert knowledge of Lean 3.</p>\n<p>Our understanding is, the more participants fulfil that knowledge criteria on the platform, the more studies they'll be able to publish. We can't share more specific details on a public forum, but hope that you choose to sign up and view the studies to see if they are are of interest.</p>",
        "id": 353214321,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1682591402
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"597544\">@Samara Zauhy</span> can you describe a bit this platform, its commercial model, shareholders, etc?</p>",
        "id": 353217029,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1682591789
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"300245\">@Filippo A. E. Nuccio</span>, </p>\n<p>Prolific is a <a href=\"https://find-and-update.company-information.service.gov.uk/company/08991598\">private limited company</a> in the UK. We provide a pool of vetted participants for researchers looking to get fast and high-quality responses to their studies. </p>\n<p>When researchers publish a study on Prolific, they are charged a percentage over the amount they wish to pay participants. The minimum reward allowed is <strong>$8.00 an hour</strong>, and participants get to keep 100% of that amount, with the option of instant cash-out via PayPal.</p>",
        "id": 353243567,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1682595546
    },
    {
        "content": "<p>I got interested and signed up, then got a bit wary when it asked me about a lot of personal details like country of birth, ethnicity and sex, and finally it seems I will have to verify these details by uploading a passport or ID card? It all seems a bit suspicious if indeed you're just interested in crowd-sourced Lean knowledge</p>",
        "id": 353775642,
        "sender_full_name": "Alex Keizer",
        "timestamp": 1682677008
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"481133\">@Alex Keizer</span>, thanks for raising your concerns!</p>\n<p>Prolific asks details such as <strong>country of birth, ethnicity and sex</strong> because researchers generally need a specific group of people for their studies, so they apply screeners based on the demographic information participants provide. For example, they may need male German residents, between the ages of 18 and 25. This information does not identify you in any way, it just means you will qualify for certain studies, so we'll know to send them your way! </p>\n<p>The reason we ask for <strong>passport details or ID card</strong> is so we can verify our participants are real people, and not bots, or the same person creating multiple accounts. We verify the authenticity of that documentation using a software called <a href=\"https://onfido.com/\">Onfido</a>, and that information is absolutely confidential, and only used for the purpose of verifying the authenticity of your account. This is quite an important step because it ensures that the data our researchers collect from the platform is coming from real people.  </p>\n<p>All data provided to us, both by researchers and participants, are protected under the General Data Protection Regulation (<a href=\"https://gdpr.eu/\">GDPR</a>), this applies to <a href=\"https://ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/lawful-basis-for-processing/special-category-data/\">special categories</a> of data, such as race, ethnic origin, politics, religion, health, sex life or sexual orientation. </p>\n<p>I hope this is helpful, but please don't hesitate to follow up with any questions or further concerns!</p>",
        "id": 353794785,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1682679535
    },
    {
        "content": "<p>Why are bots not allowed to compete? Isn't that the end goal after all?<br>\nI would be surprised if they can make any money on the platform, given the state of the art. But ruling them out seems a bit pessimistic.</p>",
        "id": 353797241,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1682679824
    },
    {
        "content": "<p>Sure, asking about these details makes sense for studies where they are relevant. I just fail to see why it's relevant for Lean studies. You mention GDPR, and I am not a lawyer, but I do know that according to Dutch law, only certain organizations (banks, employers, and the like) are allowed to ask for a copy of ID. I don't know whether this applies to foreign organizations, but it at least should tell you this requirement is a bit shady.</p>",
        "id": 353798880,
        "sender_full_name": "Alex Keizer",
        "timestamp": 1682680047
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/113486-announce/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/353797241\">said</a>:</p>\n<blockquote>\n<p>Why are bots not allowed to compete?</p>\n</blockquote>\n<p>Presumably this is an anti-abuse mechanism; someone creating 100 anonymous bot accounts that answer every survey with \"I don't know\" is much harder to deal with than a single abusive user who runs the same bot through their verified account.</p>",
        "id": 353837691,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1682684927
    },
    {
        "content": "<p>Hi everyone. I thought I might have a unique perspective on this thread. In undergrad, I used to contribute to mathlib (and I still like to follow news about Lean, so I check this channel occasionally). But now I work in economics research at a US government institution. I've used Prolific before as a researcher to conduct online behavioral economics experiments. </p>\n<p>From the perspective of behavioral science research, Prolific is a relatively well-respected platform. Other similar platforms are basically overrun with bots to the point that they're unusable to recruit participants for psychology and economics surveys. So we value that Prolific is a place to find attentive and thoughtful research participants. </p>\n<p>I'm not a Prolific rep or anything, but I wanted to offer my perspective because I think it's interesting the platform is now being used to study Lean.</p>",
        "id": 353850576,
        "sender_full_name": "Andrew  Souther",
        "timestamp": 1682686487
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"481133\">Alex Keizer</span> <a href=\"#narrow/stream/113486-announce/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/353798880\">said</a>:</p>\n<blockquote>\n<p>Sure, asking about these details makes sense for studies where they are relevant. I just fail to see why it's relevant for Lean studies. You mention GDPR, and I am not a lawyer, but I do know that according to Dutch law, only certain organizations (banks, employers, and the like) are allowed to ask for a copy of ID. I don't know whether this applies to foreign organizations, but it at least should tell you this requirement is a bit shady.</p>\n</blockquote>\n<p>Thanks for raising this! KYC is also a requirement for organisations other than banks if they transmit money (for AML purposes). Since participants at Prolific get remunerated for their time, the business falls under that category as well.</p>\n<p>The ID documents you provide at the onboarding stage are only <em>temporarily held</em>. In other words, we do not keep that information in our database. We use it only as a means to identify users in a compliant way, with a 3rd party provider. </p>\n<p>On requesting demographic information, you're absolutely right - ethnicity and nationality information aren't an <em>explicit</em> requirement for Lean 3 studies per say, but it's the minimum <strong>screening information</strong> we need from users when they join our participant pool. That is because, once you claim your account, you will be automatically eligible for studies based on your basic demographic information. </p>\n<p>For instance, if a researcher sets up a study with a US rep sample, we'd send their study to the all users in our participant pool who fit that demographic. Having that information from participants also helps us prevent them from being screened out of studies, as every study that arrives for them will have been pre-screened.</p>",
        "id": 353930674,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1682695300
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/113486-announce/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/353797241\">said</a>:</p>\n<blockquote>\n<p>Why are bots not allowed to compete? Isn't that the end goal after all?<br>\nI would be surprised if they can make any money on the platform, given the state of the art. But ruling them out seems a bit pessimistic.</p>\n</blockquote>\n<p>That's a very interesting point! <span class=\"user-mention\" data-user-id=\"310045\">@Eric Wieser</span> answered it quite well, so I will just build on their answer:</p>\n<p>Not having participants who are (or are using) bots is one of the steps we take to uphold the high data quality standards of the platform, as bot-like responses aren't good quality ones. After all, researchers trust Prolific because of the <a href=\"https://www.prolific.co/blog/data-quality-at-prolific-part-1-what-is-a-good-participant#:~:text=An%20engaged%20participant%20is%20sincere%2C%20motivated%2C%20and%20diligent.&amp;text=These%20are%20people%20who%20care,to%20see%20it%20done%20well.\">quality of our participants</a>. </p>\n<p>Of course, there are many other aspects that contribute to \"poor data\" - unengaged participants will provide similarly poor data and, on a slightly different scale, participants who are over-exposed to manipulation and no longer naïve, may also provide poor data. So, while bots aren't the only problem, they are arguably the lowest bar for ensuring data quality in crowdsourcing platforms!</p>",
        "id": 353937574,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1682696042
    },
    {
        "content": "<p>Hey Lean enthusiasts! <span aria-label=\"space invader\" class=\"emoji emoji-1f47e\" role=\"img\" title=\"space invader\">:space_invader:</span>  We now have several <strong>Lean formalization tasks paying £25/hr</strong>, which are likely to continue for the next few months. </p>\n<p>You can claim your account on the platform and start taking part in tasks <a href=\"https://app.prolific.co/register/participant/waitlist/?campaign_code=CDWL18TH%09&amp;utm_source=Lean+3+zulip&amp;utm_medium=zulip+forum&amp;utm_campaign=lean+3+zulip\">**HERE**</a>. This is an exclusive link that allows you to bypass our signup waitlist. </p>\n<p>Once you’ve verified your account, which is super quick and easy, you can take as many studies as you want. </p>\n<p>Any questions, feel free to reply to this thread or send me a message directly!</p>",
        "id": 360755081,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1684925919
    },
    {
        "content": "<p>anyone has done it and can confirm that it's legit?</p>",
        "id": 360827207,
        "sender_full_name": "Tomaz Gomes",
        "timestamp": 1684942837
    },
    {
        "content": "<p>Some people on the Xena Discord have spoken highly about this opportunity (and in particular it is certainly legit)</p>",
        "id": 360849348,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1684948336
    },
    {
        "content": "<p>Let me reiterate that it is not at all clear to me why you need this detailed demographic information for your studies. The platform may very well have legitimate interest in this data, but your studies apparently do not. I'm extremely concerned that you decided to use this platform that exposes your participants to potential harm.</p>",
        "id": 360859504,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1684951137
    },
    {
        "content": "<p>Oh sorry, <span class=\"user-mention\" data-user-id=\"597544\">@Samara Zauhy</span>, I understood you were organising the studies, but actually on re-reading the thread I believe you are affiliated with Prolific. Is that latter one correct? In that case I apologise, since I should have complained to the study organisers.</p>",
        "id": 360861461,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1684951667
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"597544\">Samara Zauhy</span> <a href=\"#narrow/stream/113486-announce/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/360755081\">said</a>:</p>\n<blockquote>\n<p>Hey Lean enthusiasts! <span aria-label=\"space invader\" class=\"emoji emoji-1f47e\" role=\"img\" title=\"space invader\">:space_invader:</span>  We now have several <strong>Lean formalization tasks paying £25/hr</strong>, which are likely to continue for the next few months. </p>\n<p>You can claim your account on the platform and start taking part in tasks <a href=\"https://app.prolific.co/register/participant/waitlist/?campaign_code=C18J40BU\">**HERE**</a>. This is an exclusive link that allows you to bypass our signup waitlist. </p>\n<p>Once you’ve verified your account, which is super quick and easy, you can take as many studies as you want. </p>\n<p>Any questions, feel free to reply to this thread or send me a message directly!</p>\n</blockquote>\n<p>I'm from the US, could I still sign up?</p>",
        "id": 360879282,
        "sender_full_name": "Peter Li",
        "timestamp": 1684956283
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"238446\">Anne Baanen</span> <a href=\"#narrow/stream/113486-announce/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/360859504\">said</a>:</p>\n<blockquote>\n<p>I'm extremely concerned that you decided to use this platform that exposes your participants to potential harm.</p>\n</blockquote>\n<p>Hey Anne - thank you for raising your concerns! I'm indeed a representative for Prolific and not a study organiser. However, I want to reassure you that Prolific is deeply committed to protecting the anonymity and data of all participants who join our platform. </p>\n<p>In part, what that means is that a participant will never be requested to provide identifiable information to a researcher. Aside from Lean 3 and programming tasks, Prolific is largely used to carry out academic research. As such, to sign up to our platform, we ask demographic information from all of our users. This allows researchers to run studies with a balanced demographic sample. </p>\n<p>Hope this helps address your concerns, but please feel to reach out to me through here or privately on DM! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 360989174,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1685005039
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"619424\">@Peter Li</span> Yes, you can! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> </p>\n<p>We accept participants from most <a href=\"https://participant-help.prolific.co/hc/en-gb/articles/360021985613-Who-can-participate-in-studies-on-Prolific-#:~:text=Prolific%20is%20available%20for%20participants,where%20Prolific%20is%20not%20available.&amp;text=If%20you%20are%20from%20a,live%20in%20an%20OECD%20country.\">OECD countries</a>, with the exception of Turkey, Lithuania, Colombia, Slovakia and Costa Rica where Prolific is not available.</p>",
        "id": 360989801,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1685005171
    },
    {
        "content": "<p>that is a wild set of exceptions</p>",
        "id": 361020254,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1685012009
    },
    {
        "content": "<p>Your email confirmation link also does not use TLS (It's a plain HTTP URL). Besides that some browsers (like mine) will entirely block any HTTP traffic by default, it's almost certainly a good idea not to use such a redirect if you're mentioning you're about to collect passport or driver's license info.</p>",
        "id": 361140133,
        "sender_full_name": "Julian Berman",
        "timestamp": 1685040126
    },
    {
        "content": "<p>My ID verification failed for some reason. Am I effectively forever banned from the platform?</p>",
        "id": 362371520,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1685519066
    },
    {
        "content": "<p>The platform doesn't seem to support people who aren't currently in the country of their nationality. I can't be American in Paris, and I'd guess you can't be French in Cambridge.</p>",
        "id": 362382908,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1685521940
    },
    {
        "content": "<p>These requirements seem to make some sense for the usual use of Prolific, where you want accurate demographic information for studies, but it's certainly an odd quirk when it comes to being a platform looking for Lean users to formalize things. I was told that they're working on it.</p>",
        "id": 362384347,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1685522285
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/stream/113486-announce/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/362382908\">said</a>:</p>\n<blockquote>\n<p>The platform doesn't seem to support people who aren't currently in the country of their nationality. I can't be American in Paris, and I'd guess you can't be French in Cambridge.</p>\n</blockquote>\n<p>Hm, it did work for me (I'm a non-UK citizen on the UK) <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span> but I don't remember the details of the form tbh</p>",
        "id": 362386086,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1685522746
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/stream/113486-announce/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/362382908\">said</a>:</p>\n<blockquote>\n<p>The platform doesn't seem to support people who aren't currently in the country of their nationality. I can't be American in Paris, and I'd guess you can't be French in Cambridge.</p>\n</blockquote>\n<p>I know of other people using it who are non-uk citizens in the UK too, so I don't think its as simple as that. <br>\nI also failed some sort of verification (UK citizen in UK), and sent them some emails to which they said they wouldn't reconsider, but after a week they manually reviewed my account and reinstated me though <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span>.</p>",
        "id": 362387973,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1685523191
    },
    {
        "content": "<p>I seem to be able to work with Prolific living in France with an Italian citizenship. But this is EU-EU <span aria-label=\"flag european union\" class=\"emoji emoji-1f1ea-1f1fa\" role=\"img\" title=\"flag european union\">:flag_european_union:</span> (probably irrelevant, though). On the other hand, is the lean webeditor working for you? Currently, even the basic<br>\n<a href=\"https://leanprover-community.github.io/lean-web-editor/\">https://leanprover-community.github.io/lean-web-editor/</a><br>\ndoes not compile for me.</p>",
        "id": 362477494,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1685543847
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"300245\">@Filippo A. E. Nuccio</span>, there is a thread about the web editor <a href=\"#narrow/stream/113488-general/topic/Web.20editor.20not.20working/near/360726259\">here</a>. Optimistically, it should be live again after the next build.</p>",
        "id": 362478793,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1685544119
    },
    {
        "content": "<p>the mathlib commit they are targetting is <code>e8638a0fcaf73e4500469f368ef9494e495099b3</code>, for people who want to use VSCode instead of the web editor</p>",
        "id": 362479900,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1685544355
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"321696\">@Julian Berman</span>, thanks for flagging! Can you let me know which link you're referring to? We can look into it!</p>",
        "id": 362483673,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1685545115
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"597544\">@Samara Zauhy</span> On of the other problems is that the studies are meant to be done online, and the web editor is broken. Having the <code>commit</code> allows to work locally on VSCode.</p>",
        "id": 362484062,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1685545200
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"597544\">Samara Zauhy</span> <a href=\"#narrow/stream/113486-announce/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/362483673\">said</a>:</p>\n<blockquote>\n<p>Hey <span class=\"user-mention silent\" data-user-id=\"321696\">Julian Berman</span>, thanks for flagging! Can you let me know which link you're referring to? We can look into it!</p>\n</blockquote>\n<p>It was a link that looked like <a href=\"http://url2476.prolific.co/ls/click?upn=&lt;big\">http://url2476.prolific.co/ls/click?upn=&lt;big</a> base64 blob&gt; from the Join Prolific button in this initial email:</p>\n<p><a href=\"/user_uploads/3121/3rg6QOJ8VmdrR1ni37x4Ny1R/Screenshot-2023-05-31-at-11.04.40.png\">Screenshot-2023-05-31-at-11.04.40.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/3rg6QOJ8VmdrR1ni37x4Ny1R/Screenshot-2023-05-31-at-11.04.40.png\" title=\"Screenshot-2023-05-31-at-11.04.40.png\"><img src=\"/user_uploads/3121/3rg6QOJ8VmdrR1ni37x4Ny1R/Screenshot-2023-05-31-at-11.04.40.png\"></a></div>",
        "id": 362485671,
        "sender_full_name": "Julian Berman",
        "timestamp": 1685545493
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321696\">@Julian Berman</span> Oh I see what you mean! This is actually a https link, but for some reason when I scroll by it (not click it) it does show me a regular http url, as you said. </p>\n<p>This is the actual link the button takes you to: <a href=\"https://app.prolific.co/participant/onboarding/complete\">https://app.prolific.co/participant/onboarding/complete</a></p>\n<p>Were you able to open it in your browser or was it blocked? If it was, this is something I can bring back to the team and try to sort out.</p>",
        "id": 362488140,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1685546038
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"300245\">@Filippo A. E. Nuccio</span> Thanks for letting me know - is this a problem you're experiencing when taking Lean studies on the platform? If so, happy to bring it up to the researcher and see what we can do!</p>",
        "id": 362488556,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1685546127
    },
    {
        "content": "<p>Yes, indeed (I sent an e-mail both to the researcher and to your team), but Eric's is probably the solution.</p>",
        "id": 362488849,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1685546187
    },
    {
        "content": "<p>Thanks for sharing <span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span>! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> You can definitely sign up if your nationality doesn't match your country of residence. When sign up fails at that stage, it's usually because of VPN use, or when there's a general mismatch in IP address and a phone number's country code. </p>\n<p>We are however looking at further refining our security system to make sure participants who travel a lot and/or use VPN are able to safely use of the platform without getting flagged.</p>",
        "id": 362490627,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1685546542
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"597544\">Samara Zauhy</span> <a href=\"#narrow/stream/113486-announce/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/362488140\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"321696\">Julian Berman</span> Oh I see what you mean! This is actually a https link, but for some reason when I scroll by it (not click it) it does show me a regular http url, as you said. </p>\n<p>This is the actual link the button takes you to: <a href=\"https://app.prolific.co/participant/onboarding/complete\">https://app.prolific.co/participant/onboarding/complete</a></p>\n<p>Were you able to open it in your browser or was it blocked? If it was, this is something I can bring back to the team and try to sort out.</p>\n</blockquote>\n<p>That means it redirects to some HTTPS link afterwards -- but in the meanwhile someone's visiting an HTTP link and say, someone on the same public network might be able to see (and perhaps decode whatever's in that base64 blob, I didn't really try to see whether anything interesting was being sent back and forth in it), or someone on some malicious network can redirect your domain to some other place such that it never ends up at the HTTPS place you expect someone to land.</p>\n<p>But for me personally yeah, I'm able to override the HTTP block.</p>",
        "id": 362490664,
        "sender_full_name": "Julian Berman",
        "timestamp": 1685546552
    },
    {
        "content": "<p>38 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"113486\" href=\"/#narrow/stream/113486-announce/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean\">#announce &gt; Paid studies to formalize math problems in Lean</a> by <span class=\"user-mention silent\" data-user-id=\"110087\">Scott Morrison</span>.</p>",
        "id": 362542439,
        "sender_full_name": "Notification Bot",
        "timestamp": 1685558383
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"597544\">@Samara Zauhy</span> Hi I just successfully signed up for the account, but I didn't see the study about Lean on the page, just some unrelated studies.<a href=\"/user_uploads/3121/EX6mgcSBjhQopWg7FOB2N-pS/mmexport1686587479930.png\">mmexport1686587479930.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/EX6mgcSBjhQopWg7FOB2N-pS/mmexport1686587479930.png\" title=\"mmexport1686587479930.png\"><img src=\"/user_uploads/3121/EX6mgcSBjhQopWg7FOB2N-pS/mmexport1686587479930.png\"></a></div>",
        "id": 365622339,
        "sender_full_name": "Ziyu Zhou",
        "timestamp": 1686588426
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"413313\">@Ziyu Zhou</span> , Tom here (I work with Samara - she's out this week). I've added you to the eligible group today, so you should now see the study on your dashboard. Let me know if not!  I'm also happy to be contacted via <a href=\"mailto:tom.rodenby@prolific.co\">tom.rodenby@prolific.co</a> if that's easier.</p>",
        "id": 365930041,
        "sender_full_name": "Tom Rodenby",
        "timestamp": 1686674416
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"624687\">Tom Rodenby</span> <a href=\"#narrow/stream/113488-general/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/365930041\">said</a>:</p>\n<blockquote>\n<p>Hey <span class=\"user-mention silent\" data-user-id=\"413313\">Ziyu Zhou</span> , Tom here (I work with Samara - she's out this week). I've added you to the eligible group today, so you should now see the study on your dashboard. Let me know if not!  I'm also happy to be contacted via <a href=\"mailto:tom.rodenby@prolific.co\">tom.rodenby@prolific.co</a> if that's easier.</p>\n</blockquote>\n<p>Thank you! But unfortunately my account has just been suspended. It's strange, I'm Chinese, recently in China but usually in Norway, and I don't know why an account that has been successfully registered is prompted \"We can't verify your ID\". Please forgive me for complaining that your system places too many restrictions on users.</p>",
        "id": 365939987,
        "sender_full_name": "Ziyu Zhou",
        "timestamp": 1686676648
    },
    {
        "content": "<p><a href=\"https://twitter.com/random_walker/status/1672254675679166465\">https://twitter.com/random_walker/status/1672254675679166465</a></p>",
        "id": 369047899,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1687566542
    },
    {
        "content": "<p>Hello! <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span>  For everyone that has tried to sign up to Prolific or have any questions about the process, I am attaching my email so you can reach out on there if preferred: <a href=\"mailto:samara.zauhy@prolific.co\">samara.zauhy@prolific.co</a></p>\n<p>We still have Lean 3 studies running on the platform and paying £25/hr. If you're still interested in joining you can sign up using <a href=\"https://app.prolific.co/register/participant/waitlist/?campaign_code=CDWL18TH%09&amp;utm_source=Lean+3+zulip&amp;utm_medium=zulip+forum&amp;utm_campaign=lean+3+zulip\">this link</a>. </p>\n<p>If you have signed up and still have any questions or need support, please feel free to contact me via email or on this stream! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 370377183,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1687949324
    },
    {
        "content": "<p>(it's 40/hr now actually)</p>",
        "id": 370431704,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1687959173
    },
    {
        "content": "<p>Really? I should've waited.</p>",
        "id": 370517229,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1687973593
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"284160\">Eric Rodriguez</span> <a href=\"#narrow/stream/113488-general/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/370431704\">said</a>:</p>\n<blockquote>\n<p>(it's 40/hr now actually)</p>\n</blockquote>\n<p>Haven't tried yet but from the description you'll be proving rather than formalizing the statements!</p>",
        "id": 370523329,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1687974749
    },
    {
        "content": "<p>Yeah just tried it (I saw several of my own statement formalizations!). Unfortunately, an hour is not really enough to formalize almost any of these, at least for me. I finally finished one by a big case bash, but when I went back to prolific, I got \"You did not complete Proving mathematical problems in Lean on time and you were timed out\" <span aria-label=\"neutral\" class=\"emoji emoji-1f610\" role=\"img\" title=\"neutral\">:neutral:</span> .</p>",
        "id": 370554738,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1687980958
    },
    {
        "content": "<p>If the organizers of this want formalized statements as an end goal, I think they're much likelier to get them if they have people formalize their own statements. I spent the first forty minutes fighting the <code>nat.card</code> API (which someone else must have introduced, and which I am not familiar with) before giving up.</p>",
        "id": 370555651,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1687981149
    },
    {
        "content": "<p>I spent the next forty minutes trying to prove that sin x = 1 if and only if x is of the form <code>pi/2 + 2pi k</code> for integer <code>k</code> as a lemma to another question, but after seeing that I wasn't close to this and there were other things I needed, I gave up on this one too.</p>",
        "id": 370556548,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1687981362
    },
    {
        "content": "<p>I felt guilty to take their 40 bucks having not formalized anything, so I eventually clicked around until I found an easy one using <code>nat.digits</code> which was accomplishable using case bashing and <code>linarith</code>, but I feel this wasn't a very \"human\" proof. If they're looking to train an LLM based on this kind of data, I don't know if it will be very effective.</p>",
        "id": 370557299,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1687981537
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282271\">Bolton Bailey</span> <a href=\"#narrow/stream/113488-general/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/370517229\">said</a>:</p>\n<blockquote>\n<p>Really? I should've waited.</p>\n</blockquote>\n<p>By the way, I shouldn't have complained about this, I see that my account has actually been credited for the ones I did previously. Thanks!</p>",
        "id": 370561817,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1687982584
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282271\">Bolton Bailey</span> <a href=\"#narrow/stream/113488-general/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/370555651\">said</a>:</p>\n<blockquote>\n<p>If the organizers of this want formalized statements as an end goal, I think they're much likelier to get them if they have people formalize their own statements. I spent the first forty minutes fighting the <code>nat.card</code> API (which someone else must have introduced, and which I am not familiar with) before giving up.</p>\n<p>I spent the next forty minutes trying to prove that sin x = 1 if and only if x is of the form <code>pi/2 + 2pi k</code> for integer <code>k</code> as a lemma to another question, but after seeing that I wasn't close to this and there were other things I needed, I gave up on this one too.</p>\n</blockquote>\n<p>Yeah, even when formalizing (not proving) statements I often feel many are worth library support or discussion with the community to arrive at an agreed-upon/consensus formalization (e.g. a problem about two-player games, though one player only have a single option at each turn (so it's like oracle-querying ...)). Consider how much work was needed from <span class=\"user-mention\" data-user-id=\"266253\">@Joseph Myers</span> to formalize IMO geometry problems! However, I think everyone signed a consent form preventing them from disclosing any problems or even their participation.</p>",
        "id": 370591486,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1687992247
    },
    {
        "content": "<p>Hey everyone! We realised there was a slight delay between users signing up to Prolific and getting the Lean study on their page, and we’re happy to say this has now been fixed. If you sign up using <a href=\"https://app.prolific.co/register/participant/waitlist/?campaign_code=CDWL18TH%09&amp;utm_source=Lean+3+zulip&amp;utm_medium=zulip+forum&amp;utm_campaign=lean+3+zulip\">**THIS LINK**</a>, you will be granted access to the  study straight away (also updated on our original comms for new users to the thread).</p>\n<p>Everyone who has already signed up should have full visibility of the first Lean 3 study, all you need to do is log in to your Prolific account. The first study (a Lean 3 test) takes around <strong>50 minutes</strong> to complete and pays <strong>£21.61/hr</strong>. From this initial study you may also unlock further paid Lean 3 tasks, depending on your skill level! </p>\n<p>We are constantly looking for ways to make our product and user experience better, so feel free to share feedback about the platform with us.</p>",
        "id": 376960723,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1689856227
    },
    {
        "content": "<p>Is there a strict time limit on the first study, or is 50 minutes just an estimated time to complete?</p>",
        "id": 376963645,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1689856838
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"422543\">@Stuart Presnell</span> 50 minutes has been the average completion time so far! The max time allowed is 1 hour and 55 minutes .</p>",
        "id": 376965295,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1689857172
    },
    {
        "content": "<p>Thanks!  Does unlocking further tasks depend on the time taken to complete the first study, or is it just based on successfully completing the test?</p>",
        "id": 376970667,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1689858180
    },
    {
        "content": "<p>I ask just because I feel like I'm a bit rusty with Lean 3 and I'm wondering whether I should practice to get back up to speed before starting the study.</p>",
        "id": 376978032,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1689859602
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"422543\">@Stuart Presnell</span> Good question - this is based on skill level and not speed of completion, although you'd need to stick to the max allocated time.</p>",
        "id": 376978318,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1689859658
    },
    {
        "content": "<p>If you run over though you can still message the researcher and they might choose to manually approve the submission based on the responses!</p>",
        "id": 376978566,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1689859718
    },
    {
        "content": "<p>Great, thanks very much</p>",
        "id": 376979213,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1689859835
    },
    {
        "content": "<p><strong>UPDATE</strong>: Lean 3 task reward has increased to <strong>£40/hr</strong> (previously £21.61/hr)! There are still places available, so if you're interested you can still sign up using <a href=\"https://app.prolific.co/register/participant/waitlist/?campaign_code=CDWL18TH&amp;utm_source=Lean+3+Zulip&amp;utm_medium=Zulip+Forum&amp;utm_campaign=Lean+3+Zulip+Acquisition\">**this link**</a>. You will be taken to a Lean 3 study as soon as you signup. The study takes approx. 50 minutes to complete . From this initial study, you can unlock further Lean 3 tasks (also paying £40/hr), based on your skill-level! </p>\n<p>If you have any questions, as always, feel free to DM me here or reply to the thread and I'll address them asap.</p>",
        "id": 381867332,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1691158655
    },
    {
        "content": "<blockquote>\n<p>Hi Bulhwi,</p>\n<p>Sorry, but we weren't able to verify your account and are therefore unable to offer you a place as a participant on Prolific.</p>\n<p>Have a question? Contact our support team.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"597544\">@Samara Zauhy</span> Is there a reason Prolific can't verify my account?</p>",
        "id": 386546629,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1692689265
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"417769\">@Bulhwi Cha</span>, you should be approved now! Let me know if you need any help - if you signed through the link in this thread you should get the Lean 3 study straight away</p>",
        "id": 386643664,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1692720243
    },
    {
        "content": "<blockquote>\n<p><strong>PEC-SUB-0002</strong></p>\n<p>What does it mean?</p>\n<p>Your IP address has been flagged by our system. We run multiple checks with IPs that include checking if the IP has been reported on other websites. You won't be able to take studies from that IP address for now but IPs are regularly reviewed so it could be unflagged in future.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"597544\">@Samara Zauhy</span> I can't start study due to this error.</p>",
        "id": 387571443,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1693182158
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417769\">Bulhwi Cha</span> <a href=\"#narrow/stream/113488-general/topic/Paid.20studies.20to.20formalize.20math.20problems.20in.20Lean/near/387571443\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p><strong>PEC-SUB-0002</strong></p>\n<p>What does it mean?</p>\n<p>Your IP address has been flagged by our system. We run multiple checks with IPs that include checking if the IP has been reported on other websites. You won't be able to take studies from that IP address for now but IPs are regularly reviewed so it could be unflagged in future.</p>\n</blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"597544\">Samara Zauhy</span> I can't start study due to this error.</p>\n</blockquote>\n<p>I've run into this problem before, but changing networks (e.g. using mobile data) worked for me</p>",
        "id": 387612353,
        "sender_full_name": "Paul Lezeau",
        "timestamp": 1693206725
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"417769\">@Bulhwi Cha</span>, are you still having this issue? If so, I can have a look through your account and see what I can do! Echoing what <span class=\"user-mention\" data-user-id=\"376152\">@Paul Lezeau</span>  said, changing networks tend to be the best solution there!</p>",
        "id": 387838306,
        "sender_full_name": "Samara Zauhy",
        "timestamp": 1693300039
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"597544\">@Samara Zauhy</span> The error is gone now. Thanks!</p>",
        "id": 387894542,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1693319508
    }
]