[
    {
        "content": "<p>Lean 3 had support for parameters. In <a href=\"#narrow/stream/287929-mathlib4/topic/The.20classification.20of.20Lie.20algebras/near/435624951\">this message</a> <span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> outlines a way to achieve something similar in Lean 4. Unfortunately it means that statements of intermediate lemmas still mention <code>P.</code> in front of basically everything.</p>\n<p>I am curious to hear what other options people have in mind to support long-winded arguments that introduce several intermediate throw-away constructions/definitions/concepts.</p>",
        "id": 462795904,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1723817600
    },
    {
        "content": "<p>In the Carleson project I use <a href=\"https://florisvandoorn.com/carleson/docs/find/?pattern=ProofData#doc\">carleson#ProofData</a> to capture a list of definitions/assumptions common to chapters 4-7 of the blueprint. </p>\n<ol>\n<li>This is a class, which is keyed by the type <code>X</code>. Most definitions/lemmas already take something related to <code>X</code> as an explicit argument (e.g. <code>(x : X)</code> or (<code>I : Grid X</code>)), and those don't need to take this structure as an additional arguments. Some basic definitions/lemmas that do not depend on <code>X</code> artificially have <code>X</code> as explicit argument to find this class.</li>\n<li>The class depends on other data other than <code>X</code>, but all of these are out-params (so that they don't need to be know for type-class inference to fire).</li>\n<li>I also have <a href=\"https://github.com/fpvandoorn/carleson/blob/1f34aa395c7759348ed4f00eb6fa5e628ed97f7a/Carleson/Defs.lean#L402-L415\">scoped notation</a> to shorten some common definitions, so that you don't have to write the <code>X</code> explicitly.</li>\n</ol>\n<p>This solution works very well in the project.</p>",
        "id": 462827468,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1723828225
    }
]