[
    {
        "content": "<p>I want to review github PRs interactively in my editor (VS Code, neovim, emacs, et), using lsp features etc. I also want to post review comments on github with code suggestions, because that makes it really easy for the PR author to apply my suggestions. But this involves a lot of context switching for me. After checking out the PR locally, and loading it in my editor, I can play around with the code, and try out improvements. Once I'm happy, I have to copy paste the changes, switch back to the editor, find the corresponding part of the diff in the web UI (in a large PR that changes several files etc), select the correct range of lines, paste the suggestion in a</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"bp\">`</span><span class=\"ss\">``suggestion</span>\n</code></pre></div>\n<p>block, and submit the review comment. Then switch back to the editor to review the next hunk in the PR.</p>\n<p>What I would love is that I checkout a new branch <code>&lt;PR-number&gt;_review</code> and make atomic commits there, right from the editor. With the intended comment in the commit message. Then some script turns each of those commits into a github review comment on the right range of lines, and uses the commit message to write the comment, and the patch of the commit to create a</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"bp\">`</span><span class=\"ss\">``suggestion</span>\n</code></pre></div>\n<p>block.</p>\n<p>Does anyone know of such a tool? Or interested in creating it?</p>",
        "id": 574758480,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1771515235
    },
    {
        "content": "<p>Maybe <a href=\"https://marketplace.visualstudio.com/items?itemName=GitHub.vscode-pull-request-github\">GitHub Pull Requests</a></p>",
        "id": 574762292,
        "sender_full_name": "Yiming Fu",
        "timestamp": 1771516250
    },
    {
        "content": "<p>Fair warning that the Github Pull Requests extension <a href=\"#narrow/channel/270676-lean4/topic/Many.20Lean.20processes.20on.20Windows/near/530792453\">does not play well</a> with the Lean extension, because of a bug that Github Pull Requests (seemingly) has and <a href=\"https://github.com/microsoft/vscode-pull-request-github/issues/7403\">doesn't want to fix</a></p>",
        "id": 574762959,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1771516440
    },
    {
        "content": "<p>Last time I looked at that VSCode extension, it couldn't do what I'm asking for. It still required manually taking your code changes in the editor and turning them into a review comment.<br>\nOn top of that, the problem that Floris points out makes it quite a no-go <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span></p>",
        "id": 574764308,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1771516793
    },
    {
        "content": "<p>I only tried it once or twice and I'm not sure if the setup for mathlib still works anymore but I think there was an interface for making suggestions onto a PR from GitHub codespaces.</p>",
        "id": 574766302,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1771517325
    },
    {
        "content": "<p>I sometimes use <a href=\"https://github.com/pwntester/octo.nvim\">octo.nvim</a>, though it’s not perfect. It at least lets me post github suggestions from the editor, but <del>infoview is unavailable when it is in diff/review mode</del> (edit: I retested, and it works! but there is no infoview available for the \"old\" diff, so you can’t compare infoview behaviour side by side between before and after the PR easily).</p>\n<p>I usually deal with that by having the files modified in the PR open in buffers in a separate editor tab (for them, infoview is available as usual) which lets me go back-and-forth easily between review mode and regular edit mode by going through tabs. But I 100% agree the best (which would also probably end up being an editor-independent script) would be something that turns commits on a local branch into a batch of suggestions.</p>",
        "id": 574766524,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1771517388
    },
    {
        "content": "<p>So I did find <a href=\"https://github.com/getsentry/action-git-diff-suggestions\">https://github.com/getsentry/action-git-diff-suggestions</a> just now. It's archived and there is a warning that it doesn't work because GitHub doesn't allow making suggestions on lines that were not modified in the PR.</p>\n<p>I wonder if we should normalize having reviewers open \"suggestion\" PRs targeting the PR branches (rather than <code>master</code>)?</p>",
        "id": 574768089,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1771517789
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"286014\">Robin Carlier</span> <a href=\"#narrow/channel/113488-general/topic/PR.20review.20tooling.20idea/near/574766524\">said</a>:</p>\n<blockquote>\n<p>I sometimes use <a href=\"https://github.com/pwntester/octo.nvim\">octo.nvim</a>, though it’s not perfect. It at least lets me post github suggestions from the editor, but <del>infoview is unavailable when it is in diff/review mode</del> (edit: I retested, and it works! but there is no infoview available for the \"old\" diff, so you can’t compare infoview behaviour side by side between before and after the PR easily).</p>\n</blockquote>\n<p>I can't follow the thread carefully today until much later, but please file issues for this sort of thing if you like! Specifically, fixing this for <a href=\"https://github.com/tpope/vim-fugitive\">fugitive</a> which I use was <a href=\"https://github.com/Julian/lean.nvim/issues/243\">pretty trivial</a>.</p>",
        "id": 574774934,
        "sender_full_name": "Julian Berman",
        "timestamp": 1771519617
    },
    {
        "content": "<p>I always review PR's inside VSCode and have 0 problems, and never use the github interface. It is true that I try things, then copy the code, click on the left to open the \"suggest code\" and past it there, but I configured a ctrl+alt+Z shortcut that restores the file, so when I'm happy I do this, revert the file to its original state and suggest the modification. I'm on Ubuntu now, but I had the exact workflow when on Win. Or am I misundestanding what you're asking for, <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span>? And yes, I'm relying on the GitHub PullRequest extension, although I've never experience the problem mentioned by Floris.</p>",
        "id": 574791986,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1771524200
    },
    {
        "content": "<p>Aah, that Ctrl-Alt-Z trick is smart!</p>",
        "id": 574800573,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1771527016
    },
    {
        "content": "<p>If you say so... I'd be happy to show you my PR review workflow next time we're at the same table, but I am honestly quite happy with the VScode interface.</p>",
        "id": 574801588,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1771527340
    },
    {
        "content": "<p>You revert the file to the original state before making any comment? I remember having tried it but sometimes it was confused by line number because of modification I made to test my comment.</p>",
        "id": 574801879,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1771527440
    },
    {
        "content": "<p>Well, before making the comment I copy my version, and I typically stay on the safe side, like copying the whole proof or the whole statement. Then I revert everything, select the whole proof/statement and click \"suggest code\": on the opened panel I paste my suggestion and click \"suggest\". So I'm not modifying the code but if the author is happy they can just accept my suggestion.</p>",
        "id": 574802345,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1771527608
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/channel/113488-general/topic/PR.20review.20tooling.20idea/near/574800573\">said</a>:</p>\n<blockquote>\n<p>Aah, that Ctrl-Alt-Z trick is smart!</p>\n</blockquote>\n<p>BTW, now that I've double-checked my muscle memory, it is Ctrl-Shift-Z, but I don't think that the smartest part was the choice of Alt....</p>",
        "id": 574802904,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1771527796
    }
]