[
    {
        "content": "<p>Hi!</p>\n<p><a href=\"https://typesig.pl/\">TypeSig</a> is a University of Edinburgh student society with a focus on programming language theory and theorem provers. Our 300 members include undergraduates, Master's and PhD students. Last year, we hosted the Advent of Proof, with submissions from across the UK and even other countries. Daily challenges were released 1st-24th of December. The challenges were self-contained puzzles to be solved in Lean or Agda by filling in holes / sorry left by starter code. The topics were beginner-friendly/intermediate level, and ranged from logic puzzles to proving properties of lambda calculus. Check out last year's problems here: <a href=\"https://typesig.pl/lean/agda/events/2023/11/30/advent-of-proof.html\">AoP2023</a> (Discord account required; no information processed or stored). </p>\n<p>Last year's problems and the platform were kindly provided by Dr Liam O'Connor, and TypeSig is very grateful for his support. This year, we want to run the event again 12th-24th of December, but we need contributors to make it happen. Would you like to submit 1-2 problems? Contributors will be given credit on the Advent of Proof platform, our website and Discord community. </p>\n<p>A problem submission includes:</p>\n<ul>\n<li>a brief text/graphic presentation</li>\n<li>a complete solution in Lean or Agda</li>\n<li>starter code with holes / sorry</li>\n</ul>\n<p>If interested, please send an email to <a href=\"mailto:president@typesig.pl\">president@typesig.pl</a> with the number of problems you'd like to contribute. We'll provide a form for file uploads. The event is set to start December 12, but submissions can come a few days later too.</p>\n<p>Thank you for your interest! <span aria-label=\"octopus\" class=\"emoji emoji-1f419\" role=\"img\" title=\"octopus\">:octopus:</span></p>",
        "id": 486786967,
        "sender_full_name": "Alex Brodbelt",
        "timestamp": 1733678469
    },
    {
        "content": "<p>Can we participate in the event, or is it exclusive for university students?</p>",
        "id": 486922415,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1733729713
    },
    {
        "content": "<p>Everyone can participate!</p>",
        "id": 486981660,
        "sender_full_name": "Alex Brodbelt",
        "timestamp": 1733747068
    }
]