[
    {
        "content": "<p>[soft question]<br>\nCan novel mathematical research be published at conferences such as ITP?</p>\n<p>Let's say I discover a new property of some algebras.<br>\nIt is novel but it the proof was not difficult enough for mathematical journals to be willing to publish such a paper.<br>\nCan I formalize it and submit the (informal) pdf describing the proof to a conference such as ITP?</p>\n<p>Would it be OK ethically?<br>\nAnd would it be viable practically? (that ITP might actually publish such a paper)</p>",
        "id": 336541204,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1677259468
    },
    {
        "content": "<p>I have not published in ITP and cannot answer your question but I think that <a href=\"https://www.springer.com/journal/10817\">https://www.springer.com/journal/10817</a> is potentially a good home for such work (ableit sadly not open access).</p>",
        "id": 336541843,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1677259658
    },
    {
        "content": "<p>Have there been papers of this kind in JAR before?</p>",
        "id": 336544924,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1677260549
    },
    {
        "content": "<p>Or is there any indication they would want such papers?</p>",
        "id": 336544994,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1677260570
    },
    {
        "content": "<p>I should have said that I was asking more generally. I cannot submit to JAR — for a simple reason — my advisor is the chief editor. Is there any journal or conference where submitting such work would be viable?</p>",
        "id": 338298322,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1677496364
    },
    {
        "content": "<p>You can still submit to JAR. Jasmin will just recuse himself from any activities involving your paper. If you're unsure whether a paper is a good fit for JAR, ask Jasmin.</p>",
        "id": 338299830,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1677496838
    },
    {
        "content": "<p>Really? Even if he were a coäuthor?</p>",
        "id": 338304795,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1677498264
    },
    {
        "content": "<p>In that case probably no, but just ask him.</p>",
        "id": 338305066,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1677498359
    },
    {
        "content": "<p>Jeremy Avigad (my advisor) and I once submitted a paper to the journal of Logic and Analysis of which he was an editor.  We let the other editor handle every part of the process.  But I’m sure different people have different feelings on this sort of thing and different journals have different rules.</p>",
        "id": 338305610,
        "sender_full_name": "Jason Rute",
        "timestamp": 1677498508
    },
    {
        "content": "<p>Or better, I can choose a different journal, without a conflict of interest.</p>",
        "id": 338306053,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1677498634
    },
    {
        "content": "<p>\"Better\" may depend on whether or not there is another journal which is just as suitable for publication. Sometimes there's only one ideal journal.</p>",
        "id": 338335223,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1677506657
    },
    {
        "content": "<p>For example, Jasmin just published \"superposition for HOL\" in JAR, but I wouldn't say that was a bad choice because the topic is closely aligned with the journal's scope.</p>",
        "id": 338336026,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1677506850
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197836\">Jireh Loreaux</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/338335223\">said</a>:</p>\n<blockquote>\n<p>\"Better\" may depend on whether or not there is another journal which is just as suitable for publication. Sometimes there's only one ideal journal.</p>\n</blockquote>\n<p>Good point! Are there any other venues (apart from ITP and JAR) for publishing formal proofs that were not written in Mizar?</p>",
        "id": 339198795,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1677788896
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197836\">Jireh Loreaux</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/338336026\">said</a>:</p>\n<blockquote>\n<p>For example, Jasmin just published \"superposition for HOL\" in JAR, but I wouldn't say that was a bad choice because the topic is closely aligned with the journal's scope.</p>\n</blockquote>\n<p>It seems to me that the paper you mentioned was published in JAR but not reviewed by JAR. They say it is a part of a collection \"Selected Extended Papers of CADE 2021\".<br>\n<a href=\"https://link.springer.com/collections/gadbadhdfa\">https://link.springer.com/collections/gadbadhdfa</a></p>",
        "id": 339199460,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1677789134
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/339198795\">said</a>:</p>\n<blockquote>\n<p>Are there any other venues (apart from ITP and JAR) for publishing formal proofs that were not written in Mizar?</p>\n</blockquote>\n<p>I am still interested in this issue. Apart from ITP and JAR, are there any journals or conferences that publish formal proofs not written in Mizar?</p>",
        "id": 339606563,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1677959728
    },
    {
        "content": "<p>Yes -- for example Exp Math (a journal) and CPP (a conference proceedings).</p>",
        "id": 339606876,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1677959923
    },
    {
        "content": "<p><a href=\"https://www.tandfonline.com/journals/uexm20\">https://www.tandfonline.com/journals/uexm20</a></p>",
        "id": 339606939,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1677959989
    },
    {
        "content": "<p><a href=\"https://popl18.sigplan.org/series/CPP\">https://popl18.sigplan.org/series/CPP</a></p>",
        "id": 339607040,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1677960043
    },
    {
        "content": "<p>Exp Math only recently got into formal proofs -- search e.g. <code>formalizing</code> to see some examples. <span class=\"user-mention\" data-user-id=\"252920\">@Alex Kontorovich</span> should be able to say whether Exp Math is still interested in formalisations of mathematics (he's the managing editor of the journal).</p>",
        "id": 339607193,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1677960155
    },
    {
        "content": "<p>Well, just FYI, the entire editorial board and I resigned a few months ago from Exp Math...</p>",
        "id": 339775014,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1678076768
    },
    {
        "content": "<p>Will the journal continue without you?</p>",
        "id": 339798052,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1678089838
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"252920\">Alex Kontorovich</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/339775014\">said</a>:</p>\n<blockquote>\n<p>Well, just FYI, the entire editorial board and I resigned a few months ago from Exp Math...</p>\n</blockquote>\n<p>Not according to <a href=\"https://www.tandfonline.com/action/journalInformation?show=editorialBoard&amp;journalCode=uexm20\">https://www.tandfonline.com/action/journalInformation?show=editorialBoard&amp;journalCode=uexm20</a> !</p>",
        "id": 339799159,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1678090153
    },
    {
        "content": "<p>Perhaps somebody who understands a bit about this could add a remark about it here: <a href=\"https://en.wikipedia.org/wiki/Experimental_Mathematics_(journal)\">https://en.wikipedia.org/wiki/Experimental_Mathematics_(journal)</a></p>",
        "id": 339819322,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1678095935
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/339798052\">said</a>:</p>\n<blockquote>\n<p>Will the journal continue without you?</p>\n</blockquote>\n<p>The more important question is whether the editorial board plans on founding a new journal (hopefully without a commercial publisher)</p>",
        "id": 339860344,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1678107495
    },
    {
        "content": "<p>Did the editorial board resign because they didn't agree with publisher's requirements?</p>",
        "id": 339860794,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1678107614
    },
    {
        "content": "<p>Coming back to this topic... perhaps it would be worthwhile to compile some sort of list (probably on the lean community webpage) of journals that are friendly (whatever that means) to formalized mathematics. This might be especially important now given the news about exp. math. above, and the fact that the other two journals listed on the wiki page that Oliver mentioned (J. Algebra's computational algebra and the LMS J. of computation and mathematics) seem to be dead as well.</p>",
        "id": 340459205,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1678307629
    },
    {
        "content": "<p>Sounds like <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> should start a journal <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 340459387,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1678307687
    },
    {
        "content": "<p>(Notice the winky face!)</p>",
        "id": 340459841,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1678307868
    },
    {
        "content": "<p>Believe me this has been discussed, but the main problem with that is that Kevin Buzzard spent two hours during a boring meeting today not paying any attention and reading, for the first time, emails which had been sent to him in mid-February. A consequence of this is that he now has under 1500 unread emails which is a 2023 record. This is not someone who should be organising anything important :-/</p>",
        "id": 340459920,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1678307890
    },
    {
        "content": "<p>Suggested name of the journal: \"Formal proofs, by friends, for friends\" <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 340460573,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1678308150
    },
    {
        "content": "<p>Yeah that's the other problem, Kevin Buzzard's journal featuring lots of publications by Kevin Buzzard's mates is not a good look</p>",
        "id": 340460841,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1678308249
    },
    {
        "content": "<p>If I remember correctly, there was also the question on whether journals are the appropriate way to publish formalized mathematics (I think we discussed that Johan and some other people at ICERM). I did not bother with trying to write an article about formalization, because I'd rather formalize more mathematics, than do some write-up (or rather port stuff to Lean 4).</p>",
        "id": 340505850,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1678332544
    },
    {
        "content": "<blockquote>\n<p>I did not bother with trying to write an article about formalization, because I'd rather formalize more mathematics, than do some write-up (or rather port stuff to Lean 4).</p>\n</blockquote>\n<p>I think this is not a problem specific to formalization. Most mathematicians enjoy doing new mathematics more than they enjoy writing up the stuff we've already done; but if you don't have journal publications, you won't get an academic job.</p>",
        "id": 340530995,
        "sender_full_name": "David Loeffler",
        "timestamp": 1678347238
    },
    {
        "content": "<p>I agree with the statement about doing mathematics being more enjoyable than writing up the results. However, I would think that most mathematicians consider publishing articles worth the time (if people write articles not for the sake of research but to bolster their cv, then this is an issue imo, but this is another discussion).<br>\nOn the other hand, if you formalize (say) the definition of the Fourier transform and encounter a few pitfalls along the way, does that warrant a paper? It is a very important thing to do and you should get credit for that, but I doubt that a separate publication has too much value. This is not to say that there are no good articles to be written about formalizing mathematics.<br>\nArguably the act of getting mathematics into mathlib is already a form of publication and the deviations can better be documented in the module descriptions or the theory docs.</p>",
        "id": 340537245,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1678349682
    },
    {
        "content": "<p>I agree with you both <span class=\"user-mention\" data-user-id=\"412682\">@Moritz Doll</span> <span class=\"user-mention\" data-user-id=\"481963\">@David Loeffler</span> guys!</p>",
        "id": 340540316,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1678350736
    },
    {
        "content": "<p>I think that if you try and formalise Fourier transform and encounter a few pitfalls along the way then this is <em>exactly</em> the sort of thing that the traditional routes such as ITP and CPP and CICM want to hear about. I would also argue that if you formalise some hard modern mathematics and you don't encounter any pitfalls then there's also an argument for publishing because you will have inevitably have organised the material into some kind of coherent form or abstraction which might not be available in the literature. I learnt this way back in the perfectoid days when Patrick was trying to understand extending continuous maps along injections with dense image and at one point just dropped injectivity and realised what was actually going on (he wrote it up in the paper). Groups with zero are another example. I think these things are worth recording in some way other than &lt;URL to some GitHub page containing some code&gt; which most people will never read or understand without a coherent human-written explanation.</p>",
        "id": 340546243,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1678352468
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"412682\">@Moritz Doll</span></p>\n<blockquote>\n<p>If people write articles not for the sake of research but to bolster their cv, then this is an issue imo, but this is another discussion.</p>\n</blockquote>\n<p>\"Oh, you poor sweet summer child\"...</p>\n<p>Journal publications long ago ceased to serve any purpose whatsoever in the <em>dissemination</em> of research. The Arxiv does that.  Do you know how long it takes for a serious research article to be refereed these days? I've known delays of two years or more. By the time an article gets published, the vast majority of the people in the world who are going to read it have long ago done so.</p>\n<blockquote>\n<p>Arguably the act of getting mathematics into mathlib is already a form of publication and the deviations can better be documented in the module descriptions or the theory docs.</p>\n</blockquote>\n<p>It would be nice if the world worked that way; but, sadly, mathlib PR's won't get you a job.</p>\n<p>(edit: I @ tagged the wrong person for the quote, sorry!)</p>",
        "id": 340548677,
        "sender_full_name": "David Loeffler",
        "timestamp": 1678353148
    },
    {
        "content": "<p>I am not an academic, partially because of some aspects shown in this thread. This is nothing new under the sun, but my impression is that the dynamics of society have changed a lot in the past 30 years due to the internet and the academia is still lagging behind. The reward/punishment system feels outdated to me.</p>",
        "id": 340563079,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1678357113
    },
    {
        "content": "<p>Since I want to get a job in academia, I am also guilty of focusing too much on getting peer-reviewed publications.<br>\nHonestly, writing up formalization papers is much less fun than the actual work.</p>\n<p>Ideally, I would like formal proofs accompanied by a peer-reviewed abstract to count as an \"official\" publication for our CVs.<br>\nThe peer review (which needs to check only the definitions, the top-level theorems, and the abstract) would serve for establishing that the code is correctly aligned to the informal notions (the results claimed in the abstract).<br>\nNobody needs to read the rest of the code; the compiler does.</p>\n<p>Seems I have just reïnvented <a href=\"https://fm.mizar.org/\">https://fm.mizar.org/</a> ooooops!</p>",
        "id": 340565187,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1678357559
    },
    {
        "content": "<p>There's also Isabelle's AFP, which is similar.</p>",
        "id": 340597218,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1678366343
    },
    {
        "content": "<p>I have just realized that AFP has ISSN as well!</p>",
        "id": 340631204,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1678374243
    },
    {
        "content": "<p>Just to add a positive data point to what was already said by <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> above: I do think it is important to also write up formalization results, not for the CV, but for science! <br>\nTogether with a co-author I recently published my first article on formalization ever, a write-up of our formalization of a relatively niche but non-trivial theorem from mathematical logic from the 1990s. A few months later, this article has already led to significantly more immediate reactions and new research interactions than the average “article with sparkling new theorems” but without formalization aspect that I normally post on Arxiv and submit to a regular math journal. This might of course also be thanks to other factors than just the fact of having formalized the result but I don’t think it’s entirely unrelated. <br>\nThis experience so far at least shows me that a careful write-up of a formalization of a known but non-trivial theorem, in which you explain the unexpected turns and insights that occur unavoidably when you formalize a paper proof, has real research value that goes beyond just “improving the CV” or “spreading the gospel of proof assistants”. Incidentally, for me personally these two are not the most useful motivating factors to keep me going with formalization, whereas new collaborations and interactions with others interested in the same math topics as me definitely are! (It is always a shame to me if researchers leave academia just because they got the impression that writing articles is only a bureaucratic and/or self-promotional activity, but that is a longer and different discussion.)<br>\nThe reactions we received on our article were more related to <em>how</em> we proved the theorem than to the formalization aspect itself, even if our formalized proof closely resembles the original one, it was considered difficult and not very well understood (although there was no doubt about its correctness) and our formalization helped clarify some aspects of the proof. Researchers interested in the details of the proof picked up on some changes and clarifications that we had to make <em>because</em> we formalized it. Finally, I recently met for the first time the original author of the pen-and-paper proof that we formalized, and he was very positive about our work. <br>\nIn summary, I think without the accompanying write-up &amp; publication, our formalization might have gone completely unnoticed, and I consider it a necessary and enriching part of the formalization process.</p>",
        "id": 340837286,
        "sender_full_name": "Sam van G",
        "timestamp": 1678448644
    },
    {
        "content": "<p>You can't just say that and not link to the article :)</p>",
        "id": 340849432,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1678451997
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/340849432\">said</a>:</p>\n<blockquote>\n<p>You can't just say that and not link to the article :)</p>\n</blockquote>\n<p>I didn't want to become guilty of the very self-promotion that I was saying in the same post was not the point of writing articles, but since you asked: <a href=\"https://ipqcoq.github.io/cpp2023fereevangool-prepub.pdf\">it's here</a>.</p>",
        "id": 340851325,
        "sender_full_name": "Sam van G",
        "timestamp": 1678452435
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"411579\">Sam van G</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/340837286\">said</a>:</p>\n<blockquote>\n<p>I do think it is important to also write up formalization results, not for the CV, but for science! (...)</p>\n</blockquote>\n<p>I want to second that!<br>\nFormalization can indeed find&amp;fill gaps in existing knowledge, even if nobody has been suspicious of it.</p>\n<p>A few months ago, I formally proved a theorem that sounds nearly trivial:<br>\n\"Grammars are closed under the Kleene star.\"<br>\nI think it is a prime example of what is called a folklore theorem. Almost every computer scientist knows it is true but nobody published its proof.<br>\nProving it turned out to not be as easy as I thought. Informal description starts on page 10 here:<br>\n<a href=\"https://arxiv.org/pdf/2302.06420.pdf\">https://arxiv.org/pdf/2302.06420.pdf</a><br>\nMy proof hasn't gotten any reaction at all. Maybe it will come later. Now it is in review for ITP. The point I am making is that, without formally proving the theorem, I would never care to develop the informal proof and write it down. And possibly nobody would.</p>\n<p>On the other hand, formalization papers also make me a bit sad. Towards the future, I don't like the idea that a Lean code accompanies a piece of MathematiCS. My dream is that the Lean code <em>is</em> the MathematiCS. And, since formalization papers treat the Lean code as a supplementary material (as opposed to being the main thing), they keep anchoring us to the state when the Lean code merely accompanies a piece of MathematiCS. I dream of a future when Lean in the language in which we <em>do</em> MathematiCS, from the first sketch of a new idea. Right now, Lean looks like a foreign language into which we translate our MathematiCS. I want Lean to be our native language for all MathematiCS.</p>",
        "id": 340855601,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1678453500
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/340849432\">said</a>:</p>\n<blockquote>\n<p>You can't just say that and not link to the article :)</p>\n</blockquote>\n<p><a href=\"/user_uploads/3121/bjCuDLYAb28pc1zXowlTzT1C/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/bjCuDLYAb28pc1zXowlTzT1C/image.png\" title=\"image.png\"><img src=\"/user_uploads/3121/bjCuDLYAb28pc1zXowlTzT1C/image.png\"></a></div>",
        "id": 340858233,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1678454154
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/340855601\">said</a>:</p>\n<blockquote>\n<p>I dream of a future when Lean in the language in which we <em>do</em> MathematiCS, from the first sketch of a new idea. Right now, Lean looks like a foreign language into which we translate our MathematiCS. I want Lean to be our native language for all MathematiCS.</p>\n</blockquote>\n<p>I'm afraid most people studying pure mathematics still don't want to learn computer languages. A mathematics professor I met last week had no interest in learning Lean; he only wanted to use a powerful AI that helps mathematicians find new valuable results.</p>",
        "id": 340869951,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1678456947
    },
    {
        "content": "<p>True. I should have written \"in distant future\".</p>",
        "id": 340870300,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1678457040
    },
    {
        "content": "<p>Maybe we should write more introductory textbooks teaching logic, mathematics, and computer science in Lean. Some students might want to learn Lean and these subjects simultaneously.</p>\n<p>I'm no longer a student because I left my university earlier than planned. But I'll teach myself <a href=\"https://en.wikipedia.org/wiki/Formal_science\">formal sciences</a> with Lean and Mathlib. Lean is my second computer language for learning mathematics. (The first one is Metamath.)</p>",
        "id": 340877488,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1678458690
    },
    {
        "content": "<p>It would actually be very alarming if natural language for mathematics is completely supplanted by a mechanically checked language. No matter how flexible Lean is it would not be as flexible as natural languages. And in the distant future mathematics can and will undergo revolutions that makes a large part of what is known now obsolete. A mechanically checked language would be a hinderance, just like how old notation is a hinderance, but much more severe. That's my opinion anyway, and Lean might have something by then to counteract this, who knows</p>",
        "id": 341654825,
        "sender_full_name": "Trebor Huang",
        "timestamp": 1678784083
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"404479\">Trebor Huang</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/341654825\">said</a>:</p>\n<blockquote>\n<p>No matter how flexible Lean is it would not be as flexible as natural languages.</p>\n</blockquote>\n<p>If Lean were as flexible as natural languages, I wouldn't use it because I want moderate restrictions on natural languages. Lean doesn't need the full power of natural languages to represent mathematical knowledge in a human-readable way. Some controlled natural languages (CNLs) as export formats of Lean source files would suffice.</p>",
        "id": 341672000,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1678788594
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417769\">Bulhwi Cha</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/341672000\">said</a>:</p>\n<blockquote>\n<p>If Lean were as flexible as natural languages, I wouldn't use it because I want moderate restrictions on natural languages.</p>\n</blockquote>\n<p>Yes, that's an argument that this will never happen, which is my point: Lean will never be that way.</p>",
        "id": 341687474,
        "sender_full_name": "Trebor Huang",
        "timestamp": 1678792599
    },
    {
        "content": "<p>I'm not saying that Lean doesn't have the ability to be like that if the designers wanted it to. I'm saying that Lean is deliberately not that way.</p>",
        "id": 341687989,
        "sender_full_name": "Trebor Huang",
        "timestamp": 1678792754
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"404479\">Trebor Huang</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/341687474\">said</a>:</p>\n<blockquote>\n<p>Yes, that's an argument that this will never happen, which is my point: Lean will never be that way.</p>\n</blockquote>\n<p>Then it wouldn't sound very alarming if Lean and its associated CNLs <em>substantially</em> supplanted natural languages for mathematics.</p>",
        "id": 341688199,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1678792806
    },
    {
        "content": "<p>I think the better part of Lean to be popularized/standardized is some particular viewpoints, like stressing the difference of (say) a ring and itself considered as its own ideal, or using filters to organize limits etc. The HoTT book is working in this direction: It is explicitly <em>not</em> formal, but nevertheless contains many viewpoints generated from the formalization process.</p>",
        "id": 341688787,
        "sender_full_name": "Trebor Huang",
        "timestamp": 1678792987
    },
    {
        "content": "<p>Bringing this back to the thread topic, this would enable us to refer to these ideas without having to convince a colleague that this is not some \"weird foundational quirk\"</p>",
        "id": 341689230,
        "sender_full_name": "Trebor Huang",
        "timestamp": 1678793115
    },
    {
        "content": "<p>Thus will make for better publishability, because the community acceptance is higher</p>",
        "id": 341689307,
        "sender_full_name": "Trebor Huang",
        "timestamp": 1678793144
    },
    {
        "content": "<p>Talking about natural language and formalized mathematics, my main barrier when I was learning how to use tactics was translating small steps that we usually do in informal maths into tactics. So I just had an idea.</p>\n<p>Imagine a tactic <code>natlang</code> that prompts a text box widget in the infoview and accepts instructions written informally. Then it processes it and tries to output the corresponding tactics that does what the user said. The output would be in form of a <code>Try this: ...</code></p>",
        "id": 342066595,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1678889065
    },
    {
        "content": "<p>Why bother with a tactic you have to type? the text box could just always be there.</p>",
        "id": 342066844,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1678889113
    },
    {
        "content": "<p>That's even better, yes, but that would have to be implemented in core I believe?</p>",
        "id": 342067108,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1678889165
    },
    {
        "content": "<p>Either way, the core of the idea is having a translation from small steps written in natural language into a sequence of tactics</p>",
        "id": 342067482,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1678889242
    },
    {
        "content": "<p><a href=\"#narrow/stream/113488-general/topic/LeanAide.20translation.3A.20Natural.20language.20to.20Lean.203/near/312762354\">LeanAide</a> doesn't need a text box ... In general, OpenAI's Codex expects that you write comments and it will fill in the code.</p>",
        "id": 342680863,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1679094579
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"224323\">Junyan Xu</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/342680863\">said</a>:</p>\n<blockquote>\n<p><a href=\"#narrow/stream/113488-general/topic/LeanAide.20translation.3A.20Natural.20language.20to.20Lean.203/near/312762354\">LeanAide</a> doesn't need a text box ... In general, OpenAI's Codex expects that you write comments and it will fill in the code.</p>\n</blockquote>\n<p>Thanks for mentioning this. Indeed in general a comment can be picked up by a code action. Since this is not fast enough at present it will need to be lazy and explicitly invoked, but in the longer run running fast/async may be possible.</p>",
        "id": 343097292,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1679313323
    },
    {
        "content": "<p>Just my two cents, but there is an already existing long-established tradition and protocol by which pure mathematicians give each other \"credit\" for work done (which turns into academic jobs, tenure, etc etc), namely publications in respected math journals (not CS, not conference proceedings, etc). I don't see anything in the short- to medium-turn in math culture that will change that.  What makes a journal \"respected\"? Largely, the editorial board, and the decisions said board makes to publish what it sees are the highest quality submissions that it receives (or solicits). So if people who spend a lot of time formalizing mathematics want to get such credit, I think it's essential that there be a <em>pure math</em> journal devoted to reporting (in ways already described by others) on major advances in this field. Moreover, I think it's clear that the formalization community benefits significantly when more pure-trained mathematicians are drawn into it; rewards of the type that lead to aforementioned \"credit\" can accelerate this process. I've been working with an organization to create an infrastructure to allow very high quality Diamond open access journals to be formed for very low cost, and low time commitment for the editors (which is how you draw high-quality people, who have severe demands on their time). I'll leave it at that...</p>",
        "id": 343535030,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1679438671
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"404479\">Trebor Huang</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/341654825\">said</a>:</p>\n<blockquote>\n<p>It would actually be very alarming if natural language for mathematics is completely supplanted by a mechanically checked language. No matter how flexible Lean is it would not be as flexible as natural languages. And in the distant future mathematics can and will undergo revolutions that makes a large part of what is known now obsolete. A mechanically checked language would be a hinderance, just like how old notation is a hinderance, but much more severe. That's my opinion anyway, and Lean might have something by then to counteract this, who knows</p>\n</blockquote>\n<p>I cannot stop thinking about this issue. Let me outline my personal thoughts...</p>\n<p>On the one hand, I am concerned that if I keep using mathematical notation on paper then I will never become fluent in Lean because Lean will stay as a \"foreign language\" to me, which I \"translate\" MathematiCS into. Writing stuff in Lean notation on paper does not necessarily mean that I must write everything formally; I'd rather write stuff in a Lean-based pseudocode (so that I don't have to be explicit about all details but I will keep training my brain to work with the Lean notation).</p>\n<p>On the other hand, I am worried that using Lean notation on paper would be a hinderance, no matter how much I get used to it. Lean is inherently designed to be \"one dimensional\" -- everything is written as a sequence of symbols. There is possibly a great value in mathematical notation being \"two dimensional\" -- you can write stuff above and below other symbols (not just lower and upper indices but terms of any length). Maybe Lean notation cannot be tweaked on paper in such a way that I will get the benefits of not having to write everything into a line.</p>",
        "id": 355087852,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1683019904
    },
    {
        "content": "<p>That dimensionality issue will likely be fixed by widgets.</p>",
        "id": 355088195,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1683019982
    },
    {
        "content": "<p>PS: I admit that, when I write my thoughts down, I realize I sound like a moron -- basically I am saying something like \"give me one language that I can use for the rest of my life so that I will never have to learn anything new\".</p>",
        "id": 355091788,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1683020899
    },
    {
        "content": "<p>Since some of you asked about this, you might have a look here... <a href=\"https://jexpmath.org/index.php/jem/about/editorialTeam\">https://jexpmath.org/index.php/jem/about/editorialTeam</a></p>",
        "id": 374474168,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1689129761
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"252920\">Alex Kontorovich</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/374474168\">said</a>:</p>\n<blockquote>\n<p>Since some of you asked about this, you might have a look here... <a href=\"https://jexpmath.org/index.php/jem/about/editorialTeam\">https://jexpmath.org/index.php/jem/about/editorialTeam</a></p>\n</blockquote>\n<p>Does the scope of the journal include formalization? It is not clear from the description on the website.</p>",
        "id": 374480967,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1689133462
    },
    {
        "content": "<p>Editor-in-Chief Jacob Tsimerman notably signed both <a href=\"https://futureoflife.org/open-letter/pause-giant-ai-experiments/\">https://futureoflife.org/open-letter/pause-giant-ai-experiments/</a> and <a href=\"https://www.safe.ai/statement-on-ai-risk\">https://www.safe.ai/statement-on-ai-risk</a></p>",
        "id": 374758569,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1689201445
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"266304\">Siddhartha Gadgil</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/374480967\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"252920\">Alex Kontorovich</span> <a href=\"#narrow/stream/113488-general/topic/Publishability.20of.20novel.20research/near/374474168\">said</a>:</p>\n<blockquote>\n<p>Since some of you asked about this, you might have a look here... <a href=\"https://jexpmath.org/index.php/jem/about/editorialTeam\">https://jexpmath.org/index.php/jem/about/editorialTeam</a></p>\n</blockquote>\n<p>Does the scope of the journal include formalization? It is not clear from the description on the website.</p>\n</blockquote>\n<p>Not necessarily. At Exp Math (the Taylor Francis journal), we ran one special issue on it, but I don't know if the new journal will be interested. It's really a pure math journal reporting on strange, suggestive patterns discovered in one field that likely require eyes from another field to make significant progress....</p>",
        "id": 375058265,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1689281312
    }
]