[
    {
        "content": "<p>Hi everyone. There's an upcoming book promoted by Quanta Books (subsidiary of the Simons Foundation) which is introduced as follows:</p>\n<blockquote>\n<p>THE PROOF IN THE CODE is the definitive account of the birth and rise of Lean, a proof assistant developed by Microsoft that is transforming the enterprise of mathematics and ushering in a new era of human-computer collaboration. Although Lean was originally conceived of as a code-checking program, a small group of mathematicians recognized its potential to become something far more powerful: the “truth oracle” that thinkers have sought for centuries, a tool to definitively verify or refute any mathematical or logical assertion, no matter how complex. This is the story of the grassroots effort to make that dream a reality. Filled with insights about the future of math, computers, and AI, THE PROOF IN THE CODE is a brilliant work of journalism by Kevin Hartnett, a leading math writer whose research and reporting offer a profound answer to a longstanding mystery: Can computers reveal universal truths? (<a href=\"https://www.quantabooks.org/\">https://www.quantabooks.org/</a>)</p>\n</blockquote>\n<p>I've seen people expressing their dissatisfaction with it. To quote <a href=\"https://types.pl/@jpoiret/113924659561135969\">Josselin Poiret</a>:</p>\n<blockquote>\n<p>This promotional introduction is probably one of the most upsetting I've ever read. Sensationalist to the point of rewriting history and erasing decades of proof assistant research, implementations and formalization projects. Maybe the book isn't as insulting to the community at large as this small blurb, but I would doubt it given Quanta's track record.</p>\n<p>This constant aggrandizing of a few projects's achievements with no acknowledgments of what's come before and all the people contributing to the field needs to stop. It fuels that false idea that there's a definitive hierarchy in research, an idea that bureaucrats at the head of research institutions use as an excuse to silo funding into a small number of research units.</p>\n<p>It's also just factually wrong.</p>\n<p>We stand on the shoulder of fellow researchers, not just a couple giants.</p>\n</blockquote>\n<p>In response to this, <a href=\"https://mathstodon.xyz/@jonmsterling/113925064804978321\">Jon Sterling</a> writes</p>\n<blockquote>\n<p>this abstract is so absurd. Fuck quanta... I think the Lean team needs to comment publicly to clarify whether they agree with this crap.</p>\n</blockquote>\n<p>Opinions on this? Should the Lean team feel compelled to comment? I don't want to stir up any drama, but I simply couldn't help but bring it up, because I too care about the quality of journalism.</p>",
        "id": 497106314,
        "sender_full_name": "Paul Schwahn",
        "timestamp": 1738366277
    },
    {
        "content": "<p>even \"developed by Microsoft\" is already wrong, isn't it? but anyways \"quality of journalism\" and that introduction seem to have not much in-common<span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 497109459,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1738368173
    },
    {
        "content": "<p>This is a sensational abstract for a book, which takes some liberties with facts (see Jon’s message above). But I think it is pretty clear that the word “truth oracle” with all its exaggeration is referring to the small kernel checking proofs, which is again not new in lean. A lot is owed to those who worked for decades on logic, type theories, math foundations, ITP development, automation etc. Even mathlib borrows several ideas from formalisations in other ITPs. </p>\n<p>However these replies pretending that the author is talking about the entscheidungs problem are not exactly being unsensational. It is reading too much into a bit of pop science. Further it is clear that lean did have a revolutionary effect on the math community. It brought in as users, a non-trivial number of research mathematicians who weren’t primarily working on theorem prover development. This is a substantial achievement that none of the big theorem provers can claim. In my area of work, the set of ITP users was almost entirely disjoint from the researchers in this area until lean arrived, and there are very clear cultural reasons for this. There is nothing wrong in writing a book that highlights these issues even if it is disliked by the users of other ITPs. There is a nice story to be told here. I hope the authors do justice to it without belittling the efforts of everybody else.</p>",
        "id": 497112660,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738370459
    },
    {
        "content": "<p>If anything we in computer science tend to silo ourselves into our niches. We claim that our work helps address grand challenge X(in this case theorem provers for math), and then we measure our research impact not on the application area or end users of X (math/mathematicians), but amongst our fellow researchers (other ITP folks, logicians etc). The former is deemed too practical to be considered worthy of research interest. Lean broke this mould. That is something worth talking about, and as CS researchers, it is something worth learning lessons from.</p>",
        "id": 497114865,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738372102
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"764770\">@Kevin Hartnett</span></p>",
        "id": 497119421,
        "sender_full_name": "Jason Rute",
        "timestamp": 1738375912
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"385895\">Jon Eugster</span> <a href=\"#narrow/channel/113488-general/topic/Quanta's.20abstract.20of.20THE.20PROOF.20IN.20CODE/near/497109459\">said</a>:</p>\n<blockquote>\n<p>even \"developed by Microsoft\" is already wrong, isn't it? but anyways \"quality of journalism\" and that introduction seem to have not much in-common<span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>\n</blockquote>\n<p>I am not entirely sure what the issue is with this clause, is it that it should be \"developed at Microsoft\"?</p>",
        "id": 497127264,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1738382726
    },
    {
        "content": "<p>I don't actually understand the situation, but I think Microsoft is definitely involved in the project but doesn't own it in a strict sense. Probably \"Developed by the Lean FRO\" would be more accurate. Maybe Lean 3 and the initial versions of Lean 4 were developed primarily by Microsoft Research though. Someone please correct me if I'm wrong.</p>",
        "id": 497128363,
        "sender_full_name": "Niels Voss",
        "timestamp": 1738383630
    },
    {
        "content": "<p>Thanks for your input! Personally I think it's not fair to judge a book by just a promotional abstract, but I reckon that wasn't the point of the responses to begin with - the anger was more directed at Quanta itself. The abstract does make it sound like though that Lean is \"the only game in town\" - not only from the perspective of a working mathematician who heavily profits from its unique community as well as Mathlib (here I would see no big issue), but also in the general context of theorem provers overall. I think the latter is the \"rewriting history\" part that people take issue with.<br>\nOn the other hand - it's just an abstract. You can obviously not expect it to summarize a whole book. So I suppose a lot comes down to charity of interpretation, as long as the book isn't released. Still, there is room for improvement with the sensationalism...</p>",
        "id": 497129943,
        "sender_full_name": "Paul Schwahn",
        "timestamp": 1738385102
    },
    {
        "content": "<p>IMO I wouldn't begrudge a 6-sentence blurb from not mentioning proof assistants that the book isn't focused on. This isn't an SoK paper it's a popular science book.</p>",
        "id": 497130414,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1738385551
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"268315\">@Anatole Dedecker</span>  Perhaps you can explain the Microsoft point, you said in the mastodon thread \"Lean was never really \"developed by Microsoft\" as the abstract says, rather than the main developers were affiliated to Microsoft Research\". What's the difference?</p>",
        "id": 497132458,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1738387485
    },
    {
        "content": "<p>Perhaps one very notable point here is that the primary author is not at Microsoft Research anymore, thath does say a lot... Then again, \"developed by Amazon\" would probably not be better (neither would \"developed at the KIT or CMU\" or similar).</p>\n<p>My take is that it's a recognizable name of a big company so it goes well in a sensationalist abstract, and of all the half-truths that could go there it's perhaps the least egregious one.</p>",
        "id": 497135631,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1738390685
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/channel/113488-general/topic/Quanta's.20abstract.20of.20THE.20PROOF.20IN.20CODE/near/497114865\">said</a>:</p>\n<blockquote>\n<p>If anything we in computer science tend to silo ourselves into our niches. We claim that our work helps address grand challenge X(in this case theorem provers for math), and then we measure our research impact not on the application area or end users of X (math/mathematicians), but amongst our fellow researchers (other ITP folks, logicians etc). The former is deemed too practical to be considered worthy of research interest. Lean broke this mould. That is something worth talking about, and as CS researchers, it is something worth learning lessons from.</p>\n</blockquote>\n<p>Slight tangent, but we have the same problems in pure math. All too often, we end up justifying number theory because \"cryptography\", etc...</p>",
        "id": 497137979,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1738393025
    },
    {
        "content": "<p>I already had concerns at \"definitive account\" :)</p>",
        "id": 497138793,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1738393806
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/stream/113488-general/topic/Quanta's.20abstract.20of.20THE.20PROOF.20IN.20CODE/near/497112660\">said</a>:</p>\n<blockquote>\n<p>Even mathlib borrows several ideas from formalisations in other ITPs.</p>\n</blockquote>\n<p>Notably, the formalization of topology and measure theory is heavily influenced by Isabelle. The filter library is pretty much a direct port.</p>",
        "id": 497142965,
        "sender_full_name": "Chris Wong",
        "timestamp": 1738397940
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/channel/113488-general/topic/Quanta's.20abstract.20of.20THE.20PROOF.20IN.20CODE/near/497138793\">said</a>:</p>\n<blockquote>\n<p>I already had concerns at \"definitive account\" :)</p>\n</blockquote>\n<p>Isn't this what one might expect from a blurb for a popular science book? This is not the abstract of a paper.</p>",
        "id": 497144445,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1738399035
    },
    {
        "content": "<p>Another small thing. Looking at the replies to Jon Sterling's thread, the criticism appears to come from a community that carries deep resentment towards the members of the lean community for essentially not incorporating or dealing with their research in exotic foundations. While correcting misinformation and giving credit to researchers is definitely important and necessary, I don't see how it helps to cater to charged criticisms from this community. As Kim says, this is the blurb of a pop science book, not a paper.</p>\n<p>EDIT: This comment doesn’t accurately reflect Jon Sterling’s opinions or that of others in the thread. For this is I apologise.</p>",
        "id": 497147743,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738401698
    },
    {
        "content": "<p>That seems overly harsh</p>",
        "id": 497150274,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1738403764
    },
    {
        "content": "<p>I am happy to share specific instances of what I am talking about in DMs, since this is a public channel <span class=\"user-mention\" data-user-id=\"307953\">@Ruben Van de Velde</span></p>",
        "id": 497150677,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738404127
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"466334\">@Shreyas Srinivas</span> I think your speculations about the secret motivations of people writing those messages on mastodon are not useful here.</p>",
        "id": 497152504,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1738405644
    },
    {
        "content": "<p>I was speaking of public posts, but I apologise for that anyway</p>",
        "id": 497152586,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738405722
    },
    {
        "content": "<p>To me, \"the 'truth oracle' that thinkers have sought for centuries, a tool to definitively verify or refute any mathematical or logical assertion, no matter how complex\" is completely unambiguous. I don't see how it could refer to anything else than the Entscheidungsproblem. Of course we all know that Lean does not solve the Entscheidungsproblem, so we can try to read something else into the sentence. But let's not pretend that the abstract itself says something else.</p>",
        "id": 497153835,
        "sender_full_name": "David Wärn",
        "timestamp": 1738406863
    },
    {
        "content": "<blockquote>\n<p>the “truth oracle” that thinkers have sought for centuries, a tool to definitively verify or refute any mathematical or logical assertion, no matter how complex</p>\n</blockquote>\n<p>I think the writer of the abstract should replace the word \"assertion\" with \"proof.\"</p>",
        "id": 497164717,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1738416359
    },
    {
        "content": "<p>For whatever it's worth, I would not have interpreted that as being about the Entscheidungsproblem, and I don't think there's any age where I would have. (As a 13 year old I didn't know the term \"Entscheidungsproblem\", but I would still have understood it to mean \"verify a proof is true or find a flaw\", not \"verify that a statement is true or that it's not\")</p>",
        "id": 497186896,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1738434621
    },
    {
        "content": "<p>Um... The Entscheidungsproblem is literally about deciding statements, not proofs</p>",
        "id": 497431776,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738588480
    },
    {
        "content": "<p>and the description of a 'truth oracle' also seems to be about deciding statements</p>",
        "id": 497431969,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738588529
    },
    {
        "content": "<p>I think it's fair enough to say that this is the holy grail people have been seeking, as long as it is sufficiently clear that lean is not the holy grail</p>",
        "id": 497432168,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738588567
    },
    {
        "content": "<p>people <em>do</em> still wish to have tools that decide statements, not proofs, and much of the tension between ITP and ATP is how much to pretend that we can actually do that vs giving in to the reality and checking proofs instead of statements</p>",
        "id": 497432444,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738588642
    },
    {
        "content": "<p>Is it fair to expect a blurb for a pop science book to deal with that level of detail? That being said changing statements to proofs might make it more correct</p>",
        "id": 497433563,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738588920
    },
    {
        "content": "<p>Really looking forward to this book!</p>",
        "id": 497446565,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1738592079
    },
    {
        "content": "<p>Also, I think a reasonable interpretation of \"truth oracle\" is referring to some Lean + AI combination. I know some mastodon posters just dismiss it as \"<a href=\"https://mathstodon.xyz/@jonmsterling/113650721487372413\">AI pseudoscience</a>\", but I find it funny that people would raise such objections when 1) this is possibly the only field where AI outputs can be reliably and automatically checked 2) there is an actual example (AlphaProof) of a system that decides IMO statements, using Lean as a crucial part of the process.</p>",
        "id": 497448075,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1738592441
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/113488-general/topic/Quanta's.20abstract.20of.20THE.20PROOF.20IN.20CODE/near/497431776\">said</a>:</p>\n<blockquote>\n<p>Um... The Entscheidungsproblem is literally about deciding statements, not proofs</p>\n</blockquote>\n<p>No disagreement there, I'm well aware. I realize my last message had some grammatical ambiguity: when I say that \"I would have interpreted it\", the \"it\" was the book abstract</p>",
        "id": 497471761,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1738597770
    },
    {
        "content": "<p>the book abstract is clearly about deciding assertions</p>",
        "id": 497472115,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738597845
    },
    {
        "content": "<p>so I'm still confused unless you have an extra 'not' in your first post</p>",
        "id": 497472232,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738597869
    },
    {
        "content": "<p>That is, I'm agreeing with <span class=\"user-mention silent\" data-user-id=\"130377\">David Wärn</span> 's assessment, the text is unambiguously about the Entscheidungsproblem</p>",
        "id": 497472531,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738597933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"417769\">@Bulhwi Cha</span> if you replace the word \"assertion\" with \"proof\" it's no longer about the \"'truth oracle' that thinkers have sought for centuries\"</p>",
        "id": 497472846,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598003
    },
    {
        "content": "<p>If it is targeted at an audience that has heard of the Entscheidungsproblem, then I would agree.<br>\nI am quite sure that the author didn't intend to claim that the abstract was talking about the Entscheidungsproblem, so I think it must have been ambiguous to at least one person.</p>",
        "id": 497472996,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1738598036
    },
    {
        "content": "<p>An oracle that checks  proof and pronounces it correct is a truth oracle</p>",
        "id": 497473001,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738598037
    },
    {
        "content": "<p>?</p>",
        "id": 497473099,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598051
    },
    {
        "content": "<p>A truth oracle tells you whether things are true, it's right in the name</p>",
        "id": 497473166,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598066
    },
    {
        "content": "<p>The whole point is that much of the progress in mathematics and logic has been in the search for this holy grail that we now know cannot exist in full generality</p>",
        "id": 497473355,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598108
    },
    {
        "content": "<p>In plain speak, it is not unusual to equate truth to proof</p>",
        "id": 497473388,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738598117
    },
    {
        "content": "<p>It is only in math speak that we start being clear about these distinctions</p>",
        "id": 497473506,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738598146
    },
    {
        "content": "<p>truth to existence of a proof, not to the proof itself</p>",
        "id": 497473590,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598162
    },
    {
        "content": "<p>if you have a proof and the oracle tells you this proof is well formed this is not so oracular of an activity</p>",
        "id": 497473722,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598190
    },
    {
        "content": "<p>changing statement to proof in that blurb would make it completely wrong</p>",
        "id": 497473962,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598247
    },
    {
        "content": "<p>I think this is going to be inherently subjective and down to our cultural associations with the words \"truth\" and \"oracle\". It's totally fine and reasonable to hear \"truth oracle\" and read \"decides arbitrary propositions\". But my point is that this would <em>never</em> have been my first interpretation, at any point in my life, so it's certainly not <em>unambiguously</em> wrong and misleading</p>",
        "id": 497473995,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1738598255
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/channel/113488-general/topic/Quanta's.20abstract.20of.20THE.20PROOF.20IN.20CODE/near/497473722\">said</a>:</p>\n<blockquote>\n<p>if you have a proof and the oracle tells you this proof is well formed this is not so oracular of an activity</p>\n</blockquote>\n<p>That depends on what the first occurrence of \"proof\" means in your sentence.</p>",
        "id": 497474055,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1738598268
    },
    {
        "content": "<p>It is immediately clarified afterward, I don't see how it can be misread</p>",
        "id": 497474174,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598285
    },
    {
        "content": "<blockquote>\n<p>the “truth oracle” that thinkers have sought for centuries, a tool to definitively verify or refute any mathematical or logical assertion, no matter how complex.</p>\n</blockquote>",
        "id": 497474209,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598296
    },
    {
        "content": "<p>given an assertion, verify or refute it, no matter how complex</p>",
        "id": 497474392,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598336
    },
    {
        "content": "<p>that's the Entscheidungsproblem</p>",
        "id": 497474425,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598344
    },
    {
        "content": "<p>so then the question is if \"logical assertion\" refers to a proof or a statement</p>",
        "id": 497474456,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1738598351
    },
    {
        "content": "<p>you don't refute proofs</p>",
        "id": 497474529,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598366
    },
    {
        "content": "<p>Also, although this was not my first interpretation, it can be argued that the author is talking about the much advertised AI + lean combo as <span class=\"user-mention\" data-user-id=\"325367\">@Mauricio Collares</span> pointed out above.</p>",
        "id": 497474545,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738598371
    },
    {
        "content": "<p>Yes, \"verify\" to me means \"verify a claim (which I have a reason to believe, i.e. a proof)\". There are many instances in everyday English where \"verify\" means \"verify that some proof is correct\", e.g. taxes</p>",
        "id": 497474586,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1738598380
    },
    {
        "content": "<p>Verifying a claim generally doesn't come with the presumption that the claimant is providing the verification</p>",
        "id": 497474951,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598455
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/channel/113488-general/topic/Quanta's.20abstract.20of.20THE.20PROOF.20IN.20CODE/near/497474529\">said</a>:</p>\n<blockquote>\n<p>you don't refute proofs</p>\n</blockquote>\n<p>That once again depends on the meaning of the word \"proof\".</p>",
        "id": 497475038,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1738598470
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/113488-general/topic/Quanta's.20abstract.20of.20THE.20PROOF.20IN.20CODE/near/497474529\">said</a>:</p>\n<blockquote>\n<p>you don't refute proofs</p>\n</blockquote>\n<p>Why not? You can refute proof candidates</p>",
        "id": 497475053,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738598475
    },
    {
        "content": "<p>you say something, I check whether it's really true. I am verifying your claim</p>",
        "id": 497475063,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598478
    },
    {
        "content": "<p>And how many people distinguish between proof and proof candidates in plainspeak</p>",
        "id": 497475184,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738598495
    },
    {
        "content": "<p>that's the plain meaning of the term in english</p>",
        "id": 497475186,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598495
    },
    {
        "content": "<p>so I have to come up with reasons that convince me, you may or may not have supplied them</p>",
        "id": 497475342,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598523
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/channel/113488-general/topic/Quanta's.20abstract.20of.20THE.20PROOF.20IN.20CODE/near/497474951\">said</a>:</p>\n<blockquote>\n<p>Verifying a claim generally doesn't come with the presumption that the claimant is providing the verification</p>\n</blockquote>\n<p>Hmm, I wouldn't say so, I would expect \"verifying\" a claim to involve checking a provided proof. Wouldn't you say that in the academic review process for a math paper that the reviewers are \"verifying\" that the paper is correct by checking the proofs?</p>",
        "id": 497475681,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1738598598
    },
    {
        "content": "<p>I said not necessarily</p>",
        "id": 497475874,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598641
    },
    {
        "content": "<p>verification <em>can</em> come with a justification from the claimant but it need not in general</p>",
        "id": 497476010,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598667
    },
    {
        "content": "<p>I am not going to argue that the current phrasing in the abstract is optimal. But I don't agree that it is unambiguously misleading and wrong.<br>\nExpecting \"proof\" to mean \"formal proof in the sense of logic\" in the abstract of a pos-sci book is ignoring the vast majority of meanings that \"proof\" has outside of logic.</p>",
        "id": 497476014,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1738598668
    },
    {
        "content": "<p>I am arguing that it is unambiguously saying what it is supposed to</p>",
        "id": 497476156,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598703
    },
    {
        "content": "<p>it is a stretch to read \"truth oracle\" and interpret it as \"proof checker\", I think the blurb is using truth oracle to mean truth oracle</p>",
        "id": 497476393,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598756
    },
    {
        "content": "<p>That sentence is <em>not talking</em> about proof checking</p>",
        "id": 497476706,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598820
    },
    {
        "content": "<p>That’s a matter of interpretation</p>",
        "id": 497476784,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738598838
    },
    {
        "content": "<p>You are reading it as a logician</p>",
        "id": 497476850,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738598853
    },
    {
        "content": "<p>no, I am reading the words by their plain meaning</p>",
        "id": 497476888,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598866
    },
    {
        "content": "<p>People do not use the word \"assertion\" to mean \"justification\" in plain language</p>",
        "id": 497477046,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598893
    },
    {
        "content": "<p>[Quoting…]</p>\n<p>That’s what I mean. You are reading it with a level of clarity that being a logician gives you</p>",
        "id": 497477111,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738598908
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/channel/113488-general/topic/Quanta's.20abstract.20of.20THE.20PROOF.20IN.20CODE/near/497476010\">said</a>:</p>\n<blockquote>\n<p>verification <em>can</em> come with a justification from the claimant but it need not in general</p>\n</blockquote>\n<p>What would be an example of something in mathematics that a verifier would verify without there being an attached proof?</p>",
        "id": 497477244,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1738598941
    },
    {
        "content": "<p>An exercise?</p>",
        "id": 497477357,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738598971
    },
    {
        "content": "<p>Usually you would use \"prove or disprove\" instead of \"verify or refute\" in a math class</p>",
        "id": 497477576,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738599017
    },
    {
        "content": "<p>for a general english context I would think of something rather like political fact checking</p>",
        "id": 497477755,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738599064
    },
    {
        "content": "<p>an assertion is made, and it is a fact checker's job to verify or refute the assertion</p>",
        "id": 497477837,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738599083
    },
    {
        "content": "<p>Hmm, I suppose I have seen exercises phrased as \"verify that a group of this order has this structure\". Admittedly I have found that a weird phrasing in the past.</p>",
        "id": 497478058,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1738599134
    },
    {
        "content": "<p>in a math context I think there is a slight difference in meaning from \"prove\": \"verify\" means \"convince yourself\" and \"prove\" means \"write something that would convince me\"</p>",
        "id": 497478292,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738599194
    },
    {
        "content": "<p>Well, in the context of exercises, the point for me has always been for me to convince the professor I understand the material! Maybe there are people who do exercises for fun and not because they are part of a problem set.</p>",
        "id": 497479009,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1738599363
    },
    {
        "content": "<p>I think that's why you won't see \"verify\" in exercises much</p>",
        "id": 497479490,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738599467
    },
    {
        "content": "<p>Anyway, my point is that while the \"truth oracle\" sentence is fine, the following sentence strongly implies that lean is a truth oracle, or at least doesn't care to clarify on the ways it is not the magical tool that solves all problems</p>",
        "id": 497480846,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738599847
    },
    {
        "content": "<p>I don't even think the \"truth oracle\" sentence is acceptable. The precursor is:</p>\n<blockquote>\n<p>... a small group of mathematicians recognized [Lean's] potential to become something far more powerful: the \"truth oracle\" that thinkers have sought ...</p>\n</blockquote>",
        "id": 497481648,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1738600055
    },
    {
        "content": "<p>that's true, the \"truth oracle\" can only really be described as a guiding star or otherwise influence on ideas for tools, it's not literally a thing that exists</p>",
        "id": 497482480,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738600264
    },
    {
        "content": "<p>I think you could probably use the same words to describe GPT</p>",
        "id": 497482644,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1738600310
    },
    {
        "content": "<p>If someone described ChatGPT like that in a pop science book, I wouldn’t object to it. There is some literary license to write in a flamboyant way in such books.</p>",
        "id": 497484179,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738600751
    },
    {
        "content": "<p>Anyway, to summarize my thoughts, I see six possibilities:</p>\n<ol>\n<li>The blurb author meant to say that the Lean community thinks Lean will solve the Entsheidungsproblem, in which case they are mistaken, because we are familiar with Gödel's incompleteness theorem.</li>\n<li>The blurb author did not mean to say that the Lean community thinks Lean will solve the Entsheidungsproblem, but rather to speculate that Lean will have some sort of AI that can find proofs as well as any human, in which case they probably shouldn't have used the phrase \"no matter how complex\".</li>\n<li>The blurb author meant to say that the Lean community thinks Lean has the potential to mechanically check proofs, in which case they not exactly wrong. But they are wrong in that Lean and all other ITPs already do this by their very nature, and so it's not right to say that Lean was \"originally conceived\" as something else.</li>\n<li>The blurb author thinks or feels that all these things exist on some kind of imprecisely-specified spectrum and doesn't mind using the phrase \"truth oracle\" to represent all parts of that spectrum at once. In which case, they are being pretty vibey in a \"not even wrong\" sort of way.</li>\n<li>The blurb author takes the esoteric philosophical view that truth and provability are the same thing, and that Lean can prove all true statements by enumerating all proofs, even though it would take arbitrarily long amounts of time.</li>\n<li>The blurb author doesn't really understand these concepts and is just trying to summarize the book in a way that sounds cool.</li>\n</ol>\n<p>Truly though, I feel none of these rise to \"fuck Quanta\" levels of public repudiation.</p>",
        "id": 497487292,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1738601589
    },
    {
        "content": "<p>As an expert writing for a non-expert audience, there's a strong expectation that you don't mislead. Think from the perspective of someone who doesn't already know what a proof assistant does or what the Entscheidungsproblem is: \"the “truth oracle” that thinkers have sought for centuries, a tool to definitively verify or refute any mathematical or logical assertion, no matter how complex\" is clearly going to tell you whether a statement is true or false. It's not poetic license, it's misleading. \"The most upsetting I've ever read\" is pretty rich but I do hope this blurb gets changed.</p>",
        "id": 497488488,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1738601890
    },
    {
        "content": "<p>Well part of what I am suggesting is that I'm not sure the person who wrote this is an expert.</p>",
        "id": 497489811,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1738602229
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282271\">Bolton Bailey</span> <a href=\"#narrow/stream/113488-general/topic/Quanta's.20abstract.20of.20THE.20PROOF.20IN.20CODE/near/497487292\">said</a>:</p>\n<blockquote>\n<p>Truly though, I feel none of these rise to \"fuck Quanta\" levels of public repudiation.</p>\n</blockquote>\n<p>Agreed. Neither does it merit claims about some projects getting too much attention.</p>",
        "id": 497490370,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738602366
    },
    {
        "content": "<p>Well, if they aren't, then they should at least be <em>consulting</em> experts about this blurb.</p>",
        "id": 497490448,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1738602392
    },
    {
        "content": "<p>Honestly, if this sentence <em>isn't</em> supposed to mean what it purports, and instead it is supposed to mean \"Lean is a proof verifier\", then this is just a (bad) recapitulation of something stated in the first sentence: \"... Lean, a proof assistant ...\"</p>\n<p>If I were rewriting this, while trying to retain as much of the original as possible, but also giving credit where it's due and being accurate, I would write something like:</p>\n<blockquote>\n<p>THE PROOF IN THE CODE is the definitive account of the birth and rise of Lean, a proof assistant initially developed at Microsoft that is transforming the enterprise of mathematics and ushering in a new era of human-computer collaboration. Although Lean was originally conceived as a tool for verifiying correctness of programs, a small group of mathematicians recognized it can also be used as a proof assistant --- a tool to verify mathematical proofs. Such tools have existed for decades, and Lean builds upon those years of insight, but Lean's particular feature set took the mathematical world by storm in a way that previous proof assistants did not. This is the story of a grassroots effort to bring Lean into mainstream programming and forever change the interaction between mathematicians and computers. Filled with insights about the future of math, computers, and AI, THE PROOF IN THE CODE is a brilliant work of journalism by Kevin Hartnett, a leading math writer whose research and reporting offer a profound answer to a longstanding mystery: Can computers reveal universal truths?</p>\n</blockquote>\n<p>In the above, I've attempted to remedy many of the issues with the original:</p>\n<ol>\n<li>Lean was <em>initially</em> developed <em>at</em> Microsoft. I think <em>by</em> is also reasonable here, but Lean is no longer developed there.</li>\n<li>It retains the \"originally conceived as a tool for verifying correctness of programs\", because, from what I can tell, that is accurate (although Leo knew it could also be used for mathematics).</li>\n<li>This makes clear that Lean is a proof assistant, just explaining the claim in the first sentence, and it does not claim to solve the Entscheidungsproblem.</li>\n<li>It makes clear that it is not the first, and pays homage to those that came before.</li>\n<li>It emphasizes one of the key points about the Lean / mathematician interaction: not that Lean was the first to fill this role, but that it had much greater appeal to mathematicians than other proof assistants.</li>\n<li>It tries to still to flamboyant (e.g., \"took the mathematical world by storm\") to appeal to the reader.</li>\n</ol>\n<p>Is the above perfect? Perhaps not, but I think it proves it's possible to complete the task without making wild claims that are, if not <em>unambiguously</em>, at least <em>easily</em> interpreted as Lean solving the Entscheidungsproblem, and (hopefully) without pissing off users of other proof assistants.</p>",
        "id": 497490453,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1738602394
    },
    {
        "content": "<p>I'm on the Scientific Advisory Board at Quanta (the magazine, not the new book series which prompted this discussion...). Once the dust settles here, if you think there is some useful feedback that could go back to their editors/writers, please let me know and I'll be happy to pass it along. (If you think it's easy to write for the public, saying things in such a way that lay people will learn something, but without upsetting experts who know the myriad ways one has to lie to succeed at the former... well, then I guess you've never tried writing for the public...)</p>",
        "id": 497509393,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1738608516
    },
    {
        "content": "<p>(I've been on numerous email threads of experts similarly dissecting various Quanta articles over the years. Hence the appeal on my website: \"If you have a complaint about an article, please send it to the other mathematician on the Board, Laura DeMarco\" <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>...)</p>",
        "id": 497510095,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1738608771
    },
    {
        "content": "<p>I think as long as it's emphasized that it's the proofs that are being checked and not the statements themselves, the theorem proving aspect will be factually authentic. And then in terms of not giving all the credit towards lean, the main point should be that lean brings together a lot more mathematicians.</p>",
        "id": 497529219,
        "sender_full_name": "Frederick Pu",
        "timestamp": 1738616030
    },
    {
        "content": "<p>(Perhaps worth noting that we would like to be checking statements too --- of course not universally --- currently <code>plausible</code> is barely usable, but I'm hopeful this will change and we'll get to a future where as soon as you type <code>:=</code>, any easy counterexamples are shown in the InfoView.)</p>",
        "id": 497553304,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1738626067
    },
    {
        "content": "<p>Update: I had a chat with Jon Sterling. It was a healthy exchange about my message above, about his thread. I realised that I ended up misrepresenting his position and for that I unreservedly apologise again. </p>\n<p>We discussed the replies to his mastodon thread and this Zulip thread, as well as the general state of affairs about the discussion of proof assistants history and its presentation in the press. He proposed that there should be a joint effort in the form of a position paper or editorial to clarify the history and current status of proof assistants and what they can or cannot do, and I personally agree that this would be a good step forward.</p>",
        "id": 498109779,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1738845092
    },
    {
        "content": "<p>A Quanta article about the history of proof assistants and how they take different approaches, but also learn from each other, would be a good read and a useful 'soft' reference, if done well. Of course, an actual detailed survey paper aimed at experts would be good, too, but in the current AI-is-magic environment, especially with things like proof assistants feeding into AI-winning-at-math!!1! (when given problems/solutions in advance?), having a mass-audience article might be better. Certainly to inform people who might be investing money in companies that want to treat the proof assistant+LLM as some kind of woo-woo that will somehow give us AGI</p>",
        "id": 498113506,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1738846252
    }
]