[
    {
        "content": "<p>I am currently preparing my undergraduate thesis, which is written on <a href=\"#narrow/channel/113488-general/topic/Cauchy-Riemann\">my formalization of the Cauchy-Riemann equations in LEAN</a>,  and my school hosts an undergraduate research symposium, which my advisor recommended I present at. The even requires a poster,  and I am struggling to figure out what to include on the poster.  How much space should be devoted to background on formalization and Lean? How should I present the code on the poster? Should I include explanations for each tactic? I am sure there is no one right answer to any of these questions, but if anyone has any insight to some general advice, or examples of posters they have presented for similar projects that they could share, it would all be greatly appreciated. Thank you all in advance for your time.</p>",
        "id": 510424979,
        "sender_full_name": "Henry Goodell",
        "timestamp": 1743897737
    },
    {
        "content": "<p>Nobody is in a position here to answer these questions, we have no idea what the local conventions of your undergraduate symposium are, you didn't even tell us who the audience is which is a necessary prerequisite for saying anything coherent. These questions are for your local supervisor not the community here. </p>\n<p>However, having supervised several such projects myself I would say that the key points are that you should ensure that the audience understands the poster, you should ensure that the main point is delivered clearly, near the top, in a way that is appropriate to the audience, you should only include code if it's making a point (eg \"here is a three line statement of the equations in lean\" or \"here is an extremely short code snippet representing a proof\" because code is boring as hell to read on a poster) but most importantly you should get going ASAP and show preliminary versions of the work to samples of people who will be the audience or local supervisors who know what's expected, and get feedback, because your poster will no doubt be unconventional, which is fine and even good, bit you don't want it to be an advert for how crappy lean is or how painful it is to use. </p>\n<p>If the audience is people with a mathematical background then I would recommend as much notation as possible so the code looks as close to what is written in the books as possible. This <em>is</em> a question that the community here would be able to give coherent advice on even without knowing all of the context which you omitted in your question.</p>",
        "id": 510456200,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1743924081
    }
]