[
    {
        "content": "<p>Resharing this WIP std4 roadmap in general for greater visibility: <a href=\"https://github.com/leanprover/std4/blob/jhx/roadmap/docs/Roadmap.md\">Roadmap</a>. We are interested in your feedback, either here or on the PR.</p>",
        "id": 418402954,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1706347248
    },
    {
        "content": "<p>I'm not really sure what is intended by the documentation section? Is it referring to adding descriptions to the mathlib4 docs page or something else entirely?</p>\n<p>The other sections of the roadmap seem much more concrete (we will do these things) whereas the documentation section is much more nebulous (\"we will describe the tactics\").</p>",
        "id": 418447972,
        "sender_full_name": "Thea Brick",
        "timestamp": 1706391181
    },
    {
        "content": "<p>(cc: <span class=\"user-mention\" data-user-id=\"110994\">@Joe Hendrix</span> )</p>",
        "id": 418461105,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1706404753
    },
    {
        "content": "<p>I don't think it's nebulous, although it's not particularly detailed, or perhaps we're not sure what else to say about the documentation of tactics. I think we could aim for a little more, like the <code>add_tactic_doc</code> command from lean 3 that allowed classifying tactics and putting them on a unified documentation page.</p>",
        "id": 418461222,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1706404859
    },
    {
        "content": "<p>Yes, I would like to have tactics documented in a way that we can both build a reference manual similar to the Mathlib 3 tactic's page and also be able to refer to that when people are writing tutorials, manuals and other documents in Verso.  I think my priorities personally are focused on other areas though so it'd be great to get help here both in planning and technical work.</p>",
        "id": 418461766,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1706405483
    },
    {
        "content": "<p>I am definitely in favor of more tools for monadic verification, this has been something that would be helpful on one of my projects, and it seems a bit too program-verification related for mathlib.</p>",
        "id": 418939057,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1706657262
    }
]