[
    {
        "content": "<p>Announcement: <a href=\"#narrow/stream/113486-announce/topic/Rubik's.20cubes\">https://leanprover.zulipchat.com/#narrow/stream/113486-announce/topic/Rubik's.20cubes</a></p>",
        "id": 473457969,
        "sender_full_name": "Utensil Song",
        "timestamp": 1727623096
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"459227\">@Violeta Hernández</span>  Interesting work, particularly the constructive approach. Reading the future work section on README reminds me that I've long wished for <a href=\"https://arxiv.org/abs/1708.05598\">On the nxnxn Rubik's Cube</a> and alike to be formalized in Lean, which seems to be the general case. As the 3x3x3 case has been worked on from various angles. Wonder if similar goals also interests you.</p>",
        "id": 473458272,
        "sender_full_name": "Utensil Song",
        "timestamp": 1727623349
    },
    {
        "content": "<p>I haven't looked at the code yet, but there are also lots of interesting things to do with 3x3! For example it was only recently proven that every even position (even number of quarter turns) is a commutator, and if I recall right, the proof is pretty simple. It could be cool to computably prove this.</p>",
        "id": 473475052,
        "sender_full_name": "Nir Paz",
        "timestamp": 1727632816
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296911\">Utensil Song</span> <a href=\"#narrow/stream/113488-general/topic/Rubik's.20cubes.20discussions/near/473458272\">said</a>:</p>\n<blockquote>\n<p>Reading the future work section on README reminds me that I've long wished for <a href=\"https://arxiv.org/abs/1708.05598\">On the nxnxn Rubik's Cube</a> and alike to be formalized in Lean, which seems to be the general case. </p>\n</blockquote>\n<p>This is really cool! I'm glad there's actual literature on the mathematics on Rubik's cubes.</p>",
        "id": 473500041,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1727650919
    },
    {
        "content": "<p>The future work section was meant less as \"I will do this in the future\" and more as \"this might be fun to do if you're interested\". This was a pretty time-consuming endeavor and I don't think I'll have the time to follow it up in the near future.</p>",
        "id": 473500111,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1727650971
    },
    {
        "content": "<p>A main difficulty with the general nxnxn case is that my equivalence of \"pieces represent both stickers in a Rubik's cube and their positions\" doesn't work anymore. There will generally be various pieces with the same stickers on them. As a consequence, there are more possible solved states.</p>\n<p>Even cubes have the extra difficulty that they can be \"rotated\", whereas odd cubes always have their centers fixed in place.</p>",
        "id": 473500199,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1727651062
    },
    {
        "content": "<p>I actually think the 3x3x3x3 case might actually be simpler, since a lot of the concepts generalize straightforwardly.</p>",
        "id": 473500212,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1727651080
    },
    {
        "content": "<p>I wonder how hard it will be to provably implement the Schreier–Sims algorithm to automatically solve these kinds of problems. It will probably require <code>native_decide</code></p>",
        "id": 473512420,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1727656920
    },
    {
        "content": "<p>Oddly enough the most computationally expensive part of my code is the <code>Stickers</code> code for inputting a Rubik's cube manually. <code>Array.map</code> seems to be the bottleneck - I had to raise <code>maxHeartbeats</code> to a million for a particular proof.</p>",
        "id": 473521044,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1727660083
    },
    {
        "content": "<p>The proofs regarding the algorithm itself were relatively quick.</p>",
        "id": 473521100,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1727660126
    },
    {
        "content": "<p>Oh wait, you mean whether it'd be feasible to use Schreier-Sims to find the algorithms for permuting/flipping edges and corners automatically?</p>",
        "id": 473521744,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1727660582
    },
    {
        "content": "<p>That's an interesting question. There's really no need for it in this 3xx33 case - there's only four explicit algorithms required and I found them by either using a solver or asking my cuber friends. And I imagine that in the general nxnxn case, you could also just find a few families of algorithms and hopefully they'd work the same for center pieces in different layers.</p>",
        "id": 473521859,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1727660689
    },
    {
        "content": "<p>In GAP, for example, you can directly input the permutations on the stickers the turns represent, and it can compute the order for you: <a href=\"https://web.archive.org/web/20240410065206/https://www.gap-system.org/doc/Examples/rubik.html\">https://web.archive.org/web/20240410065206/https://www.gap-system.org/doc/Examples/rubik.html</a> . I'm wondering whether that could be done in Lean, although I agree that there's no need for it here</p>",
        "id": 473522029,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1727660781
    },
    {
        "content": "<p>Computational group theory is something I know little about... but I'd also love seeing it in Lean <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 473522075,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1727660822
    },
    {
        "content": "<p>Having skimmed the code, I would like to share that it's well organized clean code, well documented, reminiscent of Mathlib quality, yet on such a concretely perceivable object (Rubik's Cube). Reading the code is a rather pleasant experience.</p>",
        "id": 473608930,
        "sender_full_name": "Utensil Song",
        "timestamp": 1727679198
    },
    {
        "content": "<p>Amazing！！！I want to know if it can be used to prove that Thistlethwaite's algorithm has less than 52 moves？</p>",
        "id": 473710706,
        "sender_full_name": "chenjulang",
        "timestamp": 1727698949
    },
    {
        "content": "<p>That requires lookup tables in the millions of moves. So it would almost definitely require <code>native_decide</code>. But in every other regard, it should be possible.</p>",
        "id": 473900737,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1727745043
    },
    {
        "content": "<p>I didn't actually introduce any API for the quarter/half turn metrics, but that should be pretty easy <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 473900766,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1727745062
    },
    {
        "content": "<p>Being able to prove <em>any</em> nontrivial bounds on God's number would be a pretty cool project</p>",
        "id": 473900810,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1727745087
    },
    {
        "content": "<p>Something like <a href=\"https://www.ryanheise.com/cube/human_thistlethwaite_algorithm.html\">https://www.ryanheise.com/cube/human_thistlethwaite_algorithm.html</a> could be cool, the cases seem simpler in most situations</p>",
        "id": 473972060,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1727768251
    },
    {
        "content": "<p>I was going to mention that <span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span> taught me a cool way to generate proofs instead of using <code>native_decide</code> when I saw he is on the thread. I will let him expand on it.</p>",
        "id": 473984649,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1727772297
    },
    {
        "content": "<p>I learnt it from Mario! Or more specifically, from understanding how he wrote norm_num in Lean 3. I'm not completely sure how the ideas there transfer nicely here, but I will think about it.</p>",
        "id": 473995670,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1727775839
    }
]