[
    {
        "content": "<p>Hi,</p>\n<p>Every time I start a Lean project, mathlib's build artifacts consume another 4.3 GB of my disk space. This adds up really fast, so I'm reluctant to start new Lean projects.</p>\n<p>I get it, mathlib is large. But is there at least a way to only spend 4.3 GB <em>total</em>, rather than <em>per project</em>?</p>\n<p>If an answer is documented somewhere, I couldn't find it.</p>\n<p>Thanks!</p>",
        "id": 455445943,
        "sender_full_name": "finegeometer",
        "timestamp": 1722447822
    },
    {
        "content": "<p>I haven't tried this so far, but one relatively simple solution could be to replace the duplicate files with hardlinks using a tool like <a href=\"https://github.com/pauldreik/rdfind\">https://github.com/pauldreik/rdfind</a>. Just make sure it is indeed the same Mathlib version.</p>",
        "id": 455449332,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1722448577
    },
    {
        "content": "<p>I believe the symlink solution was proposed and rejected because something breaks in windows</p>",
        "id": 455451538,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1722449236
    },
    {
        "content": "<p>Don't use it on Windows then. We're talking about a quick workaround here, not something that would be put in Lake as such.</p>",
        "id": 455474689,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1722456709
    },
    {
        "content": "<p>As a more officially (by <code>lake</code>) supported workaround you can also download mathlib once and then have your personal projects with <code>require mathlib from \"local\" / \"path\" / \"to\" / \"mathlib\"</code> in their lakefiles, that should avoid duplication at the cost of some additional maintainance like having to keep all projects on the same mathlib version and dealing with relative paths between projects.</p>",
        "id": 455487217,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1722460884
    },
    {
        "content": "<p>I do wish lake automatically managed mathlib like that on Linux and macOS, moreso on Linux. I have a smaller Linux partition than windows for other reasons, and this gets filled up very fast by lean</p>",
        "id": 455490511,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1722462207
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"385895\">Jon Eugster</span> <a href=\"#narrow/stream/113488-general/topic/Saving.20disk.20space.3F/near/455487217\">said</a>:</p>\n<blockquote>\n<p>that should avoid duplication at the cost of some additional maintainance like having to keep all projects on the same mathlib version and dealing with relative paths between projects.</p>\n</blockquote>\n<p>Just to be clear, this cost is not the cost of Jon's workaround; this is the cost of wanting to use one copy of mathlib only, and would be paid by any solution to your problem</p>",
        "id": 455494637,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1722463975
    },
    {
        "content": "<p>Sure. But if someone has, say, 10 projects, and 5 of them are kept on the latest toolchain, then that's 17GB space freed up. So an automated solution is worth it.</p>",
        "id": 455497938,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1722465070
    },
    {
        "content": "<p>I have a suggestion to the Mathlib team:</p>\n<p>Is it possible to create a version of Mathlib which has all the statements but all set to \"sorry\" or unproven. Such that the Mathlib library could be used without having the 4GB of compiled proof files.</p>\n<p>It seems a bit pointless for day-to-day work having 4GB of proof files. When in reality all we really need is the propositional statements and some verification that the propositional statements have been proved at some point - but the actual proofs themselves are unnecessary for day-to-day work.</p>\n<p>Another suggestion is that instead of storing the proof files on the user's computer, the Mathlib propositions could be stamped with some verification code and/or url to show that the statements have been proved.  (much like a blockchain?)</p>\n<p>i.e. it would be great to separate out the Mathlib propositions from the related proofs, so as to create a lighter library. What's your opinion?</p>",
        "id": 455521019,
        "sender_full_name": "Mr Proof",
        "timestamp": 1722476868
    },
    {
        "content": "<p>See <a href=\"#narrow/stream/287929-mathlib4/topic/Running.20Mathlib.20under.20.60set_option.20debug.2EbyAsSorry.60\">https://leanprover.zulipchat.com/#narrow/stream/287929-mathlib4/topic/Running.20Mathlib.20under.20.60set_option.20debug.2EbyAsSorry.60</a></p>",
        "id": 455546711,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1722486675
    },
    {
        "content": "<p><code>debug.byAsSorry</code> is solving a slightly different problem, but yes, we have considered (and may be able to implement in the future) the possibility of splitting oleans into the core part and the \"irrelevant proofs\" part.</p>",
        "id": 455619364,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1722510463
    },
    {
        "content": "<p>That would be great if you get this to work. I did begin, a couple of months ago,  an experiment of embedding Lean into a symbolic algebra GUI thing for Windows, but I put that into hibernation for the time being as the mathlib library was just too big to be practical. With some combination of <code>debug.byAsSorry</code> and perhaps sharing the library between projects etc. I might revive it. I'm sure other people would find that useful too. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 455796569,
        "sender_full_name": "Mr Proof",
        "timestamp": 1722561671
    },
    {
        "content": "<p>Would it be desirable if I wrote some instructions somewhere on the community wiki about how to setup a shared mathlib for your projects with the existing tools? Where would be a good place?</p>\n<p>I'd be surprise if lake decided to support any setup with shared packages as there are various small issues that might need user-specific answers, but if there was a \"standard way\" to achieve that, maybe eventually that gets refined to a point where support by lake is possible.</p>",
        "id": 455870666,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1722587311
    },
    {
        "content": "<p>For what it's worth: <a href=\"https://github.com/leanprover-community/leanprover-community.github.io/pull/510\">leanprover-community.github.io#510</a> adds the tips and tricks I know about setting up custom lakefiles. See <a href=\"https://github.com/joneugster/leanprover-community.github.io/blob/global_mathlib/templates/install/tricks.md\">here</a> for the rendered version.</p>",
        "id": 455914399,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1722598859
    }
]