[
    {
        "content": "<p>Are there any folks in the Lean community who are visually impaired and use a screen reader? Or has anyone taught Lean to a student who uses a screen reader? I noticed that VS Code has accessibility tools - I’m curious if anyone has experience or feedback using this?</p>",
        "id": 379662161,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1690590209
    },
    {
        "content": "<p>I don't have the answer, but just wanted to highlight that some input from visually impaired users would be very helpful. Especially in the infoview, I think the accessibility story is pretty tragic at the moment (e.g. <a href=\"https://github.com/leanprover/vscode-lean4/issues/54\">this issue</a>).</p>",
        "id": 379663179,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1690590672
    },
    {
        "content": "<p>If you actually have a student who uses a screen reader, please get into contact with us.  We want to make Lean more accessible, and I can invest time into making this happen.</p>",
        "id": 379686496,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1690603351
    },
    {
        "content": "<p>I think using VSCode is a very bad start for blind people. If we want to make Lean accessible to them then we should focus on the vim or emacs extensions.</p>",
        "id": 379710160,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1690615465
    },
    {
        "content": "<p>And this would probably also involve upstream work to make sure unicode is better handled by braille display libraries (one should at least check the status in brltty for instance).</p>",
        "id": 379710357,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1690615537
    },
    {
        "content": "<p>Last time I checked, my PhD advisor who uses vi+brltty still complained about people using unicode-math in their TeX files.</p>",
        "id": 379711277,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1690615867
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110043\">Gabriel Ebner</span> <a href=\"#narrow/stream/113488-general/topic/Screen.20Readers.20in.20VS.20Code/near/379686496\">said</a>:</p>\n<blockquote>\n<p>If you actually have a student who uses a screen reader, please get into contact with us.  We want to make Lean more accessible, and I can invest time into making this happen.</p>\n</blockquote>\n<p>Thank you for the offer! I don’t have a student at the moment, but I’ll definitely reach out if/when I do. I’ve previously collaborated with a blind computational chemist, and was recently talking with her about ways my group might make our <em>publications</em> more accessible. This led me to thinking more broadly about making Lean accessible, so I thought I’d drop a note here, since others may have encountered this. I think with all the interactivity and automation that’s buildable, there’d be a lot of neat possibilities. But I definitely agree we need feedback from users to make this practical and appropriate.</p>",
        "id": 379798734,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1690636597
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/113488-general/topic/Screen.20Readers.20in.20VS.20Code/near/379710160\">said</a>:</p>\n<blockquote>\n<p>I think using VSCode is a very bad start for blind people. If we want to make Lean accessible to them then we should focus on the vim or emacs extensions.</p>\n</blockquote>\n<p>I am not certain this is true: see for instance the latest <a href=\"https://code.visualstudio.com/updates/v1_80#_accessibility\">release notes</a> which make a whole bunch of improvements for screen readers.</p>",
        "id": 379925913,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1690685412
    }
]