[
    {
        "content": "<p>Is the following \"safe\" behaviour:</p>\n<p>1) I want to work on latest version of file X in FLT (which has no cache)<br>\n2) I <code>git checkout main; git pull; lake exe cache get (for mathlib); lake build FLT/X.lean</code><br>\n3) After compilation of <code>X.lean</code> has finished, I open VS Code, and close all tabs other than X.lean.<br>\n4) On the command line I <code>lake build</code> because I may as well build all of FLT as I might need it later on when working on X.lean. </p>\n<p>I have absolutely no feeling about whether this sort of behaviour can cause problems. An example of what I'm unsure about: let's say I very quickly decide that I want to now take a look at Y.lean which is not an import of X.lean (e.g. because I want to apply a new result in X to a sorry in Y). Can I just open Y.lean in VS Code and not even care about whether command line compilation has got up to Y.lean yet, or is there some kind of \"best practice\" I should be sticking to here and this is not it?</p>",
        "id": 560986755,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764497173
    },
    {
        "content": "<p>I <em>think</em> you can open Y.lean fine, but I would not make changes to Y.lean or allow it to build its dependencies in parallel with your other <code>lake build</code>. But then maybe <code>lake</code> is smart enough to deal with it</p>",
        "id": 560987035,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1764497488
    },
    {
        "content": "<p>While Lake does nothing to prevent overlapping builds, Lake should generally be robust to them. However, this is not a well-tested aspect of Lake, so some breakage could happen. Nonetheless, I don't think the risk is worth altering your development workflow. Worst case, something goes wrong and you have to clobber <code>.lake</code> and rebuld / re-fetch the cache. Best (and most likely) case, everything just works.</p>",
        "id": 561001949,
        "sender_full_name": "Mac Malone",
        "timestamp": 1764511833
    },
    {
        "content": "<p>(If something does go wrong, it would also be great to hear about it! It would be nice to make this work consistently.)</p>",
        "id": 561002007,
        "sender_full_name": "Mac Malone",
        "timestamp": 1764511901
    },
    {
        "content": "<p>I should add that nothing has ever gone wrong for me in the past and it's a habit I'm slowly doing more and more as FLT gets bigger. It just occurred to me that it might not be wise!</p>",
        "id": 561002379,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764512205
    }
]