[
    {
        "content": "<p>A website that did the following would be useful:</p>\n<ol>\n<li>List pairs (triples, etc.) of Unicode characters that have a similar appearances in many typefaces.</li>\n<li>Allow a user to select typefaces and then display the sets of similar characters in the chosen typefaces.</li>\n</ol>\n<p>I doubt that any such website exists, but I thought I'd see whether anyone knows of one.  (This question would be appropriate for Agda's Zulip chat as well, and other forums, I'd guess.)</p>\n<p>Such as site would be useful because, I feel, no typeface is likely to be ideal for making all characters readily distinguishable for every user in every application.  It would be difficult to design such a typeface, and there's not really a need for it: probably no source code file or document uses all sets of similar characters.  One just needs the right typeface for any particular source file or document.</p>\n<p>[I'm quite open to suggestions to try this or that typeface, but so far none of the several typefaces I've seen suggested here have been perfect for me for all contexts.  Example: At sizes I like to display, <em>JuliaMono</em> does a great job with \"α\" vs. \"a\", but the angle brackets look like parentheses.  <em>JetBrains Mono NL</em> makes angle brackets and parentheses very distinguishable, but the \"α\" looks a lot like an \"a\".]</p>",
        "id": 473272553,
        "sender_full_name": "mars0i",
        "timestamp": 1727492519
    },
    {
        "content": "<p>(Just for clarification, sure, I know that I can ask my editor to tell me the the Unicode value and key combinations for any character in a buffer.  More useful for me is that I have font size changes mapped to key combinations, so I can temporarily make text bigger.  But distinguishable characters still help me avoid confusion and silly bugs, and make reading code easier.)</p>",
        "id": 473284334,
        "sender_full_name": "mars0i",
        "timestamp": 1727498668
    },
    {
        "content": "<p>In case anyone's interested, I found this page that allows generating lists of Unicode characters that are similar in appearance to a those supplied by the user:  <a href=\"https://util.unicode.org/UnicodeJsps/confusables.jsp\">https://util.unicode.org/UnicodeJsps/confusables.jsp</a><br>\nIt's not what I was looking for, but it may be useful.  It misses some similarities--for example parentheses and angle brackets are not considered to have a similar appearance, and it doesn't seem to know that there are arrows that might be confused for the Lean function type arrow.</p>",
        "id": 473289551,
        "sender_full_name": "mars0i",
        "timestamp": 1727501104
    },
    {
        "content": "<p>This website might be useful, which \"shows how Unicode math symbols are supported by various monospace fonts\":<br>\n<a href=\"https://mono-math.netlify.app/\">https://mono-math.netlify.app/</a></p>",
        "id": 473737831,
        "sender_full_name": "Jiazhen Xia",
        "timestamp": 1727704230
    }
]