[
    {
        "content": "<p>I don't know how to diagnose this, but basically I observe that on the initial use of a file (i.e. compiling the \"import\" lines) it is slower than the web editor, even though the rest of the time it's way faster than the web editor. I read Kevin's thread and thought maybe it's to do with windows defender so I turned it off for the folder but initial loading is still slow. Maybe I need to restart to see if it has any effect? How else do I diagnose the problem?</p>",
        "id": 553260067,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1762104180
    },
    {
        "content": "<p>One hypothesis I have is that reading olean files is a bottleneck</p>",
        "id": 553261682,
        "sender_full_name": "Robin Arnez",
        "timestamp": 1762105573
    },
    {
        "content": "<p>Maybe the web editor is running Lean with some optimization tricks, such as always keeping the <code>.olean</code>s of all of Mathlib in RAM instead of reading from a disk?</p>",
        "id": 553263804,
        "sender_full_name": "Malvin Gattinger",
        "timestamp": 1762107483
    },
    {
        "content": "<p>Did you try turning Windows Defender off for not just the folder but for your entire home directory? Turning it off for the repo alone was not enough for me and I didn't do any experiments with seeing exactly what I could get away with, my experiments have been focussed on trying and failing to make the problem come back after I did this. Note that I can quite imagine that <code>lake build</code> is accessing files in e.g. <code>.elan</code> (for sure) and for all I know <code>.cache/mathlib</code> too.</p>",
        "id": 553275146,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1762118796
    },
    {
        "content": "<p>I could do that, but I imagine it would be also helpful to know which folders exactly does Lean use?</p>",
        "id": 553275238,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1762118892
    },
    {
        "content": "<p>Hmm, I just tried to be helpful by seeing if just telling Windows Defender to ignore /Users/buzzard/.elan instead of /Users/buzzard would still leave me in my state of ecstasy, but I am sufficiently incompetent with macs to know how to tell windows defender to ignore a hidden directory.</p>",
        "id": 553275308,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1762118974
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"422703\">Malvin Gattinger</span> <a href=\"#narrow/channel/113488-general/topic/slowdown.20on.20initial.20use/near/553263804\">said</a>:</p>\n<blockquote>\n<p>Maybe the web editor is running Lean with some optimization tricks, such as always keeping the <code>.olean</code>s of all of Mathlib in RAM instead of reading from a disk?</p>\n</blockquote>\n<p>The Linux kernel does that trick for you without help from us.</p>",
        "id": 553279102,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1762122763
    },
    {
        "content": "<p>I would hope windows has a file cache as well but I don't know</p>",
        "id": 553279109,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1762122773
    },
    {
        "content": "<p>Windows has memory mapped files, but i don't know if lean code takes advantage of that.</p>",
        "id": 553279863,
        "sender_full_name": "Alfredo Moreira-Rosa",
        "timestamp": 1762123634
    },
    {
        "content": "<p>Memory mapped files is not the topic here but yes we do make use of them.</p>",
        "id": 553280100,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1762123921
    }
]