[
    {
        "content": "<p>Hi friends! I wonder how a <code>tactic_state</code> can be splited into multiple sub-goals. For example, suppose a tactic_state contains goal A and goal B, I want to obtain <em>two</em> tactic_state objects, one for goal A and another for goal B. Thanks for any suggestions!</p>\n<p>Context: I am trying to reproduce the <a href=\"https://arxiv.org/abs/2205.11491\">SOTA paper</a>, thus needs to modify <a href=\"https://github.com/openai/lean-gym\">lean-gym</a>, such that it can create multiple subgoals. The lean-gym currently only creates one subgoal. I have tried to read tactic writing and metaprogramming related tutorials but still cannot find out a way yet.</p>",
        "id": 323378845,
        "sender_full_name": "fzyzcjy",
        "timestamp": 1674605485
    },
    {
        "content": "<p>this doesn't make sense to do. Each <code>tactic_state</code> represents a partial proof of the original goal, so unless goal B has already been closed you can't have a tactic state containing only goal A without erroneously dropping goal B</p>",
        "id": 323379496,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1674605835
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> Hi thanks for the reply! Totally agree that partially proving goal A without B proved is nonsense. However, that paper is doing a tree search, so roughly speaking, the AI (which interacts with Lean) will solve goal A and B separately using two searches. I am willing to accept unsoundness at this phase, because later the AI can generate a full proof and I can just plug in that proof text into a <code>.lean</code> file and let Lean check again.</p>",
        "id": 323380387,
        "sender_full_name": "fzyzcjy",
        "timestamp": 1674606356
    },
    {
        "content": "<p>A goal in lean is represented as a <code>mvar</code>, which you can manipulate using <code>get_goals</code> and <code>set_goals</code>. So you can just do <code>[A, B] &lt;- get_goals, set_goals [A]</code> if you want to drop B</p>",
        "id": 323380586,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1674606455
    },
    {
        "content": "<p>Thank you so much! Let me try it</p>",
        "id": 323380813,
        "sender_full_name": "fzyzcjy",
        "timestamp": 1674606594
    }
]