[
    {
        "content": "<p>Here's something I don't understand. When doing experiments (e.g. answering user questions on Zulip) I often type <code>import Mathlib</code> in a scratch file in my local copy of the mathlib repo (on the master branch). Now say I want to update mathlib. I exit VS Code (just for safety's sake), type <code>git pull</code> then <code>lake exe cache get</code> then <code>lake build</code> just to check everything worked, and it's always the case that <code>lake build</code> terminates successfully in a couple of seconds. I then open VS Code again, and it opens at the file which begins <code>import Mathlib</code> and after a few seconds the orange bars appear, and then I have to wait for 10 seconds and my memory fills up and the fan comes on and my swap fills up and I get a warning saying \"Zulip has become unresponsive\", and then the orange bars disappear and I dismiss the Zulip warning and I'm back to a slick experience. </p>\n<p>Is this expected or am I missing a trick? Or is the trick to click \"buy\" on this new laptop?</p>",
        "id": 495580944,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1737664492
    },
    {
        "content": "<p>I very rarely use <code>import Mathlib</code> on my computer: I only use it in the online playground.</p>",
        "id": 495582270,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1737665046
    },
    {
        "content": "<p>For me, on a fairly recent Framework laptop (i.e. not some super powerful desktop machine or Mac, but a fairly recent AMD laptop CPU with an SSD), the orange bars appear almost immediately, and then it takes roughly 2-3s for them to disappear. After that, Lean is still busy for another 6s or so. In total, it takes roughly 10s until Lean has settled entirely, and 4-5s until the orange bars disappear.</p>\n<p>The sequence of events is roughly as follows:</p>\n<ol>\n<li>You launch VS Code. VS Code starts initializing itself.</li>\n<li>VS Code starts initializing the Lean 4 VS Code extension <a href=\"https://code.visualstudio.com/api/references/activation-events#onStartupFinished\">\"some time after\"</a> VS Code has finished initializing. Since all extensions share the extension host process, this is likely done in sequence, so having other extensions installed might delay the initialization of the Lean 4 VS Code extension.</li>\n<li>The Lean 4 VS Code extension detects an open Lean tab and starts initializing a language client (provided by VS Code) for the Lake project that the corresponding Lean file belongs to. This involves launching the language server process and performing the LSP <a href=\"https://microsoft.github.io/language-server-protocol/specifications/lsp/3.17/specification/#lifeCycleMessages\">initialization dance</a>. If this process takes longer than 250ms, the Lean 4 VS Code extension starts displaying a progress bar in the bottom right.</li>\n<li>Once the language server process has launched and has been informed about the open Lean file by the language client, it launches another process (the so-called \"file worker\") that elaborates the file.</li>\n<li>Additionally, once the language server process has launched, it starts loading the .ilean files of the whole project. This only needs to be done once for the whole project, and it is done in parallel with the rest of the server operations, so except for consuming CPU usage of one of your cores and putting some pressure on your storage medium, it should not interfere with the latency of other server operations. This is the part that causes Lean to be busy for another 6s or so on my laptop.</li>\n<li>Once the file worker process has launched, it starts displaying orange progress bars for the file. The orange bars for the import section of the file remain until we have heard back from Lake about the current status of the imports and until all .olean files from the import section of the file have been loaded into the file worker process. For <code>import Mathlib</code>, this includes all .olean data for all of Mathlib.</li>\n<li>Once all .olean data has been imported, the file worker process starts processing the file beyond the set of imports, and the orange progress bars move down in the file.</li>\n</ol>\n<p><a href=\"/user_uploads/3121/nhO42OJFDVqbgDogFpR8gHUg/image.png\">VS Code startup</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/nhO42OJFDVqbgDogFpR8gHUg/image.png\" title=\"VS Code startup\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1610x968\" src=\"/user_uploads/thumbnail/3121/nhO42OJFDVqbgDogFpR8gHUg/image.png/840x560.webp\"></a></div>",
        "id": 495668984,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1737710866
    },
    {
        "content": "<p>Do (5)-(7) also happen when you type <code>lake build</code> on the command line? Or is there less work involved?</p>",
        "id": 495671444,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1737711612
    },
    {
        "content": "<p>If there is nothing to build, then there is definitely less work involved.</p>",
        "id": 495671570,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1737711661
    },
    {
        "content": "<p>One thing that is perhaps also worth pointing out is that if you launch VS Code with lots of open tabs, then the Lean 4 VS Code extension will initialize separate language clients (i.e. everything from step 3 onwards) for every single project in your tabs, and VS Code's language client library will also inform the language server about every open file in your tabs (i.e. everything from step 4 onwards for every single open Lean file). So if you have lots of open tabs, this can definitely exhaust your CPU resources and slow down the whole process for every individual file.</p>\n<p>This is unfortunately just how VS Code's language client library works at the moment, and there is <a href=\"https://github.com/microsoft/vscode-languageserver-node/issues/848\">currently no good way</a> to disambiguate visible tabs from invisible tabs on either the VS Code side or the language server side.</p>",
        "id": 495673377,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1737712248
    },
    {
        "content": "<p>Oh many thanks Marc! I habitually have ten or more tabs open in VS Code so this is my mistake! I had no idea this made a difference, I am completely clueless about what's going on under the hood (or at least I was before your very informative messages). I can easily change this part of my workflow. </p>\n<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> I have been burnt too often by importing \"the right amount\" and then <code>exact?</code> failing because it turns out that I had only imported the right amount to make the statements compile. With this new trend of having many <code>Defs.lean</code> files in mathlib this was happening more and more often to me, so I've switched to always importing everything.</p>",
        "id": 495724841,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1737728289
    },
    {
        "content": "<p>If there was a version of <code>exact?</code> which would find declarations which I hadn't imported then this would be another viable solution for me but right now I'm just super excited to learn that closing all but one of my tabs will make my life a lot better.</p>",
        "id": 495725045,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1737728357
    },
    {
        "content": "<p>PS :-/</p>\n<p><a href=\"/user_uploads/3121/4u7_PoRJoWlDUR56Nq293fRq/code.png\">code.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/4u7_PoRJoWlDUR56Nq293fRq/code.png\" title=\"code.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"644x983\" src=\"/user_uploads/thumbnail/3121/4u7_PoRJoWlDUR56Nq293fRq/code.png/840x560.webp\"></a></div>",
        "id": 495726777,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1737728888
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113488-general/topic/startup.20time.20in.20VS.20Code/near/495725045\">said</a>:</p>\n<blockquote>\n<p>I'm just super excited to learn that closing all but one of my tabs will make my life a lot better.</p>\n</blockquote>\n<p>To be clear, this should only matter when booting up VS Code. In general, while there will be active file worker processes for tabs that aren't visible, these invisible files shouldn't consume much CPU and should mostly be idle. It's only when you start or restart the language server that all open tabs are elaborated, which is expensive.</p>",
        "id": 495727440,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1737729077
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"221921\">Marc Huisinga</span> <a href=\"#narrow/stream/113488-general/topic/startup.20time.20in.20VS.20Code/near/495673377\">said</a>:</p>\n<blockquote>\n<p>This is unfortunately just how VS Code's language client library works at the moment, and there is <a href=\"https://github.com/microsoft/vscode-languageserver-node/issues/848\">currently no good way</a> to disambiguate visible tabs from invisible tabs on either the VS Code side or the language server side.</p>\n</blockquote>\n<p>Currently the lean language server starts the file worker child progress once it receives the corresponding <code>didOpen</code> request. Would it be better decoupling it to a dedictated rpc method for starting the file worker?</p>",
        "id": 495845894,
        "sender_full_name": "Shanghe Chen",
        "timestamp": 1737790161
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"560873\">Shanghe Chen</span> <a href=\"#narrow/channel/113488-general/topic/startup.20time.20in.20VS.20Code/near/495845894\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"221921\">Marc Huisinga</span> <a href=\"#narrow/stream/113488-general/topic/startup.20time.20in.20VS.20Code/near/495673377\">said</a>:</p>\n<blockquote>\n<p>This is unfortunately just how VS Code's language client library works at the moment, and there is <a href=\"https://github.com/microsoft/vscode-languageserver-node/issues/848\">currently no good way</a> to disambiguate visible tabs from invisible tabs on either the VS Code side or the language server side.</p>\n</blockquote>\n<p>Currently the lean language server starts the file worker child progress once it receives the corresponding <code>didOpen</code> request. Would it be better decoupling it to a dedictated rpc method for starting the file worker?</p>\n</blockquote>\n<p>Unfortunately no. We used to do something along these lines in the past (namely, we used a language client middleware to filter certain <code>didOpen</code> notifications to the server for files that weren't in the set of tabs at all, as VS Code sometimes spuriously emits <code>didOpen</code> for those kinds of files as well), but it caused all kinds of race conditions that were very difficult to track down with VS Code's language client library itself, <a href=\"https://github.com/microsoft/vscode-languageserver-node/issues/848#issuecomment-2185043021\">some of which are mentioned in the linked thread</a>. <br>\nPut simply, the language client library expects <code>didOpen</code> notifications to be emitted at the exact point where it emits them, and if you change anything about when or whether <code>didOpen</code> notifications are emitted, you will run into all kinds of problems.</p>\n<p>The only good solution for this problem that doesn't have any major drawbacks is for the language client library to implement this feature itself and ensure that it doesn't race with any of its other features by design. Fortunately, in the linked thread, we were eventually able to convince the LSP maintainer that this is a needed feature, and they implemented it afterwards. On the other hand, unfortunately, Microsoft appears to have de-prioritized all work on LSP immediately after that, so this feature hasn't been released in a stable version yet and the LSP maintainer still appears to be busy working on other VS Code topics.</p>",
        "id": 495850889,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1737794574
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"221921\">Marc Huisinga</span> <a href=\"#narrow/channel/113488-general/topic/startup.20time.20in.20VS.20Code/near/495727440\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113488-general/topic/startup.20time.20in.20VS.20Code/near/495725045\">said</a>:</p>\n<blockquote>\n<p>I'm just super excited to learn that closing all but one of my tabs will make my life a lot better.</p>\n</blockquote>\n<p>To be clear, this should only matter when booting up VS Code. In general, while there will be active file worker processes for tabs that aren't visible, these invisible files shouldn't consume much CPU and should mostly be idle. It's only when you start or restart the language server that all open tabs are elaborated, which is expensive.</p>\n</blockquote>\n<p>Oh I often restart the language server if I change imports and get the \"imports out of date\" error. I click the button, wait for a while, and then restart the server if I get bored waiting for it to finish on the basis that for all I know it might make things faster. Can you clarify the difference between \"Restart file\" and \"Restart server\"? To me these are just synonymous, I don't even know what a server is, they just both mean \"start again after a pause\" as far as I am concerned.</p>",
        "id": 495903789,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1737838009
    },
    {
        "content": "<p>'Restart file' rebuilds the imports if necessary and starts re-elaborating the file from the top. 'Restart server' restarts the full language server, which is something that you should only need to do when Lean has somehow started breaking.<br>\nSee also <a href=\"https://github.com/leanprover/vscode-lean4/blob/master/vscode-lean4/manual/manual.md#file-restarting\">the corresponding extension manual section</a>.</p>",
        "id": 495904347,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1737838462
    },
    {
        "content": "<p>'Restart server' also doesn't rebuild the imports of any file, it really just restarts the language server process in case something went wrong.</p>",
        "id": 495904607,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1737838670
    }
]