[
    {
        "content": "<p>I am new to Lean. I want to formalize Fast Fourier Transform in Lean which is not formalized yet as per the info in this link: <a href=\"https://leanprover-community.github.io/undergrad_todo.html\">https://leanprover-community.github.io/undergrad_todo.html</a>. So, is it ok for me to work on it? Is there any way to find out what's currently being formalized in Lean?</p>",
        "id": 355844960,
        "sender_full_name": "Jagadish Bapanapally",
        "timestamp": 1683221929
    },
    {
        "content": "<p>A good way to work out if someone else is already working on something is to:</p>\n<ul>\n<li>Search this Zulip</li>\n<li>Search the GitHub PRs (open and closed)</li>\n<li>Ask on Zulip as you just did!</li>\n</ul>",
        "id": 355847537,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1683222633
    },
    {
        "content": "<p>A question from the peanut gallery: if current trends continue, the port of mathlib from Lean 3 to Lean 4 will be nearly done in a few months. Would people recommend starting a new project like this with Lean 3 (with access to all of mathlib, but in a few months when mathlib[3] stops accepting PRs you have to learn a slightly different language and use mostly-automated-tooling to port your work in progress to mathlib4), or with Lean 4 (where you have access to only the most foundational 60% of mathlib right now)?</p>",
        "id": 355902458,
        "sender_full_name": "Patrick Stevens",
        "timestamp": 1683242491
    },
    {
        "content": "<p>I would recommend doing this in lean3 simply due to mathlib access; but if you're a new lean user, it is probably better to do this in a standalone project rather than PR it to mathlib</p>",
        "id": 355905987,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1683244841
    },
    {
        "content": "<p>I expect the \"mostly-automated-tooling\" story to be much better at standalone projects than at PRs.</p>",
        "id": 355906095,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1683244913
    },
    {
        "content": "<p>I think the answer depends a bit on what the subject area of the project is.</p>",
        "id": 355914663,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1683249281
    },
    {
        "content": "<p>But I would say the opposite: if at all plausible, just work in Lean 4.</p>",
        "id": 355914724,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1683249309
    },
    {
        "content": "<p>Question: Is mathlib4 currently accepting PRs <em>not</em> related to the port? Even if they aren't being focused on now, is it ok to make PRs and just expect them to be backlogged for a few months?</p>",
        "id": 356184887,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1683332110
    },
    {
        "content": "<p>If they are solely new files, based on completely ported files, yes please, PRs accepted!</p>",
        "id": 356201699,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1683342273
    },
    {
        "content": "<p>If they add new lemmas that need to go in earlier files, those are fine too, we'll just need to think a little about how to label them / whether to just put them in the right place already.</p>",
        "id": 356201731,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1683342305
    },
    {
        "content": "<p>We have been discussing marking some files which are ported and have all downstream dependencies ported as \"archived\", which can be freely modified in mathlib4 without needing backporting. The framework for that is not quite settled!</p>",
        "id": 356201831,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1683342376
    },
    {
        "content": "<p>I have two students in London working on dimension theory in lean 4 and I encouraged them to PR to mathlib 4: their work will live in new files and won't be backported</p>",
        "id": 356222032,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1683355107
    },
    {
        "content": "<p>My graduate class this past semester started in Lean 3 and ended up in Lean 4 <span aria-label=\"lol\" class=\"emoji emoji-1f606\" role=\"img\" title=\"lol\">:lol:</span>  They wanted to do some things with edge colorings of graphs and all the dependencies had been ported. With decreasing depth in the unported dependency graph,  we are getting close to “port the things I might need if not ported” being  reasonable advice.</p>",
        "id": 356305159,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1683379932
    },
    {
        "content": "<p>What were the edge coloring results? <span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span> just proved a bunch of those.</p>",
        "id": 356325225,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1683386011
    }
]