[
    {
        "content": "<p>Last year I resigned as a mathlib maintainer. I did not make clear my reasons for resigning at the time and I will say something about my reasons now. </p>\n<p>The reason is principally because of a conduct issue. I won't go into too much detail about this issue. I have spoken to the code of conduct team and they did not take action to resolve the problem.</p>\n<p>I think that improvements need to be made to mathlib's approach to code of conduct.</p>\n<ul>\n<li>\n<p>It is a very bad idea for code of conduct issues to be handled by people too close to the people involved in the complaint, in particular when warnings have been made about the consequences of taking a stand or speaking out. I don't think that having more senior people on the team would fix this problem.</p>\n</li>\n<li>\n<p>The scope of the code of conduct needs to be made clear. Much of what took place did not happen on GitHub or Zulip. The warnings that I have received about what might happen in future are also likely referring to things that may happen outside of GitHub and Zulip. Some open source projects have a very broad scope for their code of conduct. Mathlib needs to decide what its scope should be.</p>\n</li>\n<li>\n<p>There needs to be a clear distinction between the personal opinions of individuals and the community's officially enforced stance.</p>\n</li>\n</ul>\n<p>Now that mathlib has become a much larger project, and a project without serious competitors, there are going to be more competing interests involved. I consider the problems I have faced to be basically an issue of competing interests. For this reason I think mathlib needs clear goals and values. There will be internal and external pressure to go against these values, and the community needs to be able to resist that, and right now I don't think it can. I don't have all the answers here, and I know this is not an easy problem, but I think it will make a huge difference to the future of mathlib to take this sort of issue seriously.</p>",
        "id": 523805604,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1749750715
    },
    {
        "content": "<p>OK, so what do I need to do about this?</p>",
        "id": 523933022,
        "sender_full_name": "Jeremy Tan",
        "timestamp": 1749816558
    },
    {
        "content": "<p>Personally this reminds me of the Monica Cellio case on Stack Exchange. I have always believed that changing your username to say \"Reinstate Monica\", \"SE is evil\", etc. is a plain dumb idea</p>",
        "id": 523933556,
        "sender_full_name": "Jeremy Tan",
        "timestamp": 1749816792
    },
    {
        "content": "<p>Nevertheless I will propose a couple of improvements to the code of conduct process:</p>\n<ul>\n<li>The scope of the CoC is everything related to mathlib – both online and offline spaces. This was taken from the Wikimedia Foundation's CoC (historically I edited Wikipedia articles, all the way back in the early 2010s).</li>\n<li>None of the enforcers of the code of conduct (e.g. arbitrators) can be a maintainer themselves.</li>\n</ul>",
        "id": 523935448,
        "sender_full_name": "Jeremy Tan",
        "timestamp": 1749817498
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110044\">@Chris Hughes</span> On behalf of the maintainer team, thank you for your suggestions; we will discuss them at the next maintainers meeting. Not only the code of conduct team but also several members of the maintainers team have tried to address your concerns, and we are sorry that you are not satisfied with the responses. The Lean Community platforms are not the place to litigate personal grievances or settle external disputes, and there is only so much we can do to resolve them. We will continue to do everything we can to keep these platforms a safe and welcoming environment for everyone.</p>",
        "id": 523996402,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1749839673
    },
    {
        "content": "<p>Can I just reiterate my first point</p>\n<p><span class=\"user-mention silent\" data-user-id=\"110044\">Chris Hughes</span> <a href=\"#narrow/channel/113488-general/topic/Statement.20on.20my.20resignation.20as.20a.20maintainer/near/523805604\">said</a>:</p>\n<blockquote>\n<p>It is a very bad idea for code of conduct issues to be handled by people too close to the people involved in the complaint, in particular when warnings have been made about the consequences of taking a stand or speaking out.</p>\n</blockquote>\n<p>I am not interested in asking for a verdict from the community about my particular case. If I do ever ask for a verdict from the community, it will only be if I can present all the evidence in confidence to people who aren't at risk of retaliation and so on.</p>\n<p>The purpose of this message was to ensure that the community does have a realistic strategy for dealing with conduct problems, and not just my own. Most people in my situation would not make public statements like mine, they would leave silently. There needs to be a real plan that people have confidence in, that doesn't require people to make this sort of public pressure.</p>",
        "id": 524006985,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1749844913
    },
    {
        "content": "<p>I'm not sure what happened, but I'd like to know what this \"real plan\" could be.</p>",
        "id": 524037137,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1749871477
    },
    {
        "content": "<p>So I think that's a complicated problem, and I'll try to answer it while keeping this discussion theoretical. I do think that the solution goes a long way beyond rules and enforcement. I don't think I'm qualified to fully answer this question. I do not think it's something that's going to be fixed overnight.</p>\n<p>I think expectations need to be much clearer. People involved were often simply following what seemed to be the best path to stay of trouble.</p>\n<p>I think serious attention needs to be paid to the question of who is in charge and how is that power exercised. Ostensibly we have an admin team, but I don't think every voice on that team has equal weight.</p>\n<p>I think that external factors have a huge impact on whether mathlib is a safe and welcoming environment. In order to have a career in formalized mathematics as a mathlib contributor you need to be able to attend conferences, publish papers, get qualifications and so on. This may or may not be the responsibility of the maintainers, but it's certainly something that anybody who wants the community to do well needs to pay attention to.</p>\n<p>I don't think the responsibility for this lies solely with the maintainers. Part of the purpose of going public is that the community would just pay more attention to questions of management and culture. Another purpose of speaking out is to empower other people who have go through similar things; it will be harder to blame people for what's happening to them if other people have been through similar things.</p>",
        "id": 524045678,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1749884297
    },
    {
        "content": "<p>\"and a project without serious competitors\"</p>\n<p>I might like to challenge that some. There are mamy small projects with carefully defined goals- not unserious, but instead with a smaller scope.</p>",
        "id": 524049539,
        "sender_full_name": "Jeremy Ravenel",
        "timestamp": 1749889384
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"928979\">Jeremy Ravenel</span> <a href=\"#narrow/channel/113488-general/topic/Statement.20on.20my.20resignation.20as.20a.20maintainer/near/524049539\">said</a>:</p>\n<blockquote>\n<p>\"and a project without serious competitors\"</p>\n<p>I might like to challenge that some. There are mamy small projects with carefully defined goals- not unserious, but instead with a smaller scope.</p>\n</blockquote>\n<p>I agree, but I think it's fair to say that for some fields of mathematics, mathlib is the only reasonable choice. The reason I mentioned that is because this has an effect on the culture in two ways. It means that the success of the project can be a less important individual motivation. It also means that the cost of taking a risk and expressing an unpopular opinion or rocking the boat in some way is much higher because there's nowhere else to go.</p>",
        "id": 524049979,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1749889871
    },
    {
        "content": "<p>I know it's hard, but some people may want to create an alternative.</p>",
        "id": 524050104,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1749890028
    },
    {
        "content": "<p>I don't think fracturing the ecosystem would be a good outcome. That does mean we need to take extra care with governance, of course</p>",
        "id": 524050300,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1749890235
    },
    {
        "content": "<p>Alternative libraries wouldn't necessarily fracture the ecosystem. Some formalizers might want to create libraries that choose <em>unique</em> approaches to formalized mathematics. Those libraries could explore methods or subjects that Mathlib doesn't care about. I think those would expand the ecosystem, not fracture it.</p>",
        "id": 524050408,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1749890374
    },
    {
        "content": "<p>But why would you want to default to creating an alternative rather than making mathlib4 better?</p>",
        "id": 524052629,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1749893273
    },
    {
        "content": "<p>One could do both simultaneously, although it'd increase the amount of the work.</p>",
        "id": 524053640,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1749894481
    },
    {
        "content": "<p>When someone has done work in formalization, they have usually selected a topic for which they have a refined approach or improvement, so maybe they get irritated when the refinements aren't considered separately.</p>\n<p>Sorry if this interrupts some from the topic here.</p>",
        "id": 524088234,
        "sender_full_name": "Jeremy Ravenel",
        "timestamp": 1749935726
    },
    {
        "content": "<p>I think I've said most of what I wanted to say on this topic and I will switch off Zulip notifications and my engagement may be minimal from now on.</p>\n<p>A lot has been written on these topics and any plan moving forward is probably best informed by that and not my particular case. Mathlib is more than just an open source project, it is also an academic research project and this brings different challenges, and different things have been written about good practice there. It may also play a role similar to that of an academic journal; people have talked about how getting something merged into mathlib may be a stamp of approval for a formalization paper. It is also the project that is dominating the field of formalized mathematics right now, so it's important to get it right.</p>",
        "id": 524401388,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1750150024
    }
]