[
    {
        "content": "<p>In parallel with the <code>job postings</code> stream, I was wondering if it would be possible to have a stream dedicated to opportunities for people without a doctorate or who are newer to the field, along the lines of graduate programs looking for students.</p>",
        "id": 377459542,
        "sender_full_name": "Kayla Thomas",
        "timestamp": 1689986926
    },
    {
        "content": "<p>I don't want to discourage this idea, because it is a very good one, and I hope we will see more posts about this. But, given that both post- and pre-doctoral announcements are infrequent, I'm not sure of the value of separating them out. We certainly already have announcements about PhD positions in job postings (don't we?). In fact keeping them all in one places probably has extra value (everyone is more likely to use it if there's only one place to know about).</p>",
        "id": 377510483,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690011548
    },
    {
        "content": "<p>I agree with Scott. If needed we can rename <code>job postings</code> to be slightly more general (but I don't have a concrete suggestion atm). At least we could clarify the scope in the extended stream description.</p>",
        "id": 377512162,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1690012004
    },
    {
        "content": "<p>Currently the description is</p>\n<blockquote>\n<p>Job postings related to Lean or theorem proving</p>\n</blockquote>",
        "id": 377512330,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1690012049
    },
    {
        "content": "<p>I changed the description to \"Job postings and opportunities for students, related to Lean or theorem proving\". Happy to take suggestions!</p>",
        "id": 377547364,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1690020931
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 377659976,
        "sender_full_name": "Kayla Thomas",
        "timestamp": 1690050065
    }
]