[
    {
        "content": "<p>Good morning! My student <span class=\"user-mention\" data-user-id=\"683050\">@Abram M</span> is running a survey on the state of research software engineering in mathematics. If you use or develop software to advance mathematics research, we'd greatly appreciate your responses here: <a href=\"https://southalabama.az1.qualtrics.com/jfe/form/SV_3WefG6b5sQEk2Ls\">https://southalabama.az1.qualtrics.com/jfe/form/SV_3WefG6b5sQEk2Ls</a></p>\n<p>Information on risks, consent, etc. is available at that link. Thank you for your support of my student researcher, and please share with anyone else you think may be interested in advancing our understanding of research software in mathematics.</p>",
        "id": 474845582,
        "sender_full_name": "Steven Clontz",
        "timestamp": 1728055215
    },
    {
        "content": "<p><span aria-label=\"point up\" class=\"emoji emoji-1f446\" role=\"img\" title=\"point up\">:point_up:</span> hopefully no one minds me re-upping this opportunity to help us understand the state of research software engineering supporting mathematics research.  <a href=\"https://southalabama.az1.qualtrics.com/jfe/form/SV_3WefG6b5sQEk2Ls\">https://southalabama.az1.qualtrics.com/jfe/form/SV_3WefG6b5sQEk2Ls</a> If you'll be at JMM this January, you can learn more about this project at the <a href=\"https://code4math.org\">https://code4math.org</a> exhibit hall booth.</p>",
        "id": 482646858,
        "sender_full_name": "Steven Clontz",
        "timestamp": 1731687149
    },
    {
        "content": "<p>Very minor survey feedback in case it's helpful -- the question on \"Select all costs for software development in your funding proposals?\" seems like it's intending to be a multi-select, but it only lets you select one option. Also, there are questions on \"your institution\" which might be tricky to interpret if someone's answered that they're employed in industry -- I answered them as if \"my institution\" is my company (even though I even happen also to be associated with an institution, but they don't know or care about this work of mine at the moment).</p>",
        "id": 482650277,
        "sender_full_name": "Julian Berman",
        "timestamp": 1731688257
    },
    {
        "content": "<p>Thank you for that feedback! We based the survey on a survey of RSE in general who published their open data, so we chose to keep the questions similar. Abram just fixed the single/multi select issue you found. 🛠</p>",
        "id": 482651021,
        "sender_full_name": "Steven Clontz",
        "timestamp": 1731688515
    },
    {
        "content": "<p>I found the 'select two' questionnaire a bit confusing. I can't remember the exact question, but I had to calculate mentally that I clicked on exactly two checkboxes for each option over all questions. The 'row' and 'column' of the question I think should be switched at least, or better, represented as a matrix of checkboxes</p>\n<p>I appreciate the direction of the survey! Research tools facilitate research greatly, and  people working on that deserves credit.</p>",
        "id": 482903476,
        "sender_full_name": "Jineon Baek",
        "timestamp": 1731884215
    }
]