[
    {
        "content": "<p>currently, i just don't nixify projects with dependencies. I like my hercules CI / flake parts nixification for lean projects that don't depend on other lean libraries, but I fall back to github for projects that depend </p>\n<p>In principle, I feel like it'd be easy enough to walk <code>lake-manifest.json</code> and use <code>pkgs.fetchGitHub</code> to grab each repo at each rev, recursively call <code>lake2nix</code> on each dependency, then wire up all the symlinks. </p>\n<p>Has anyone started this or have major disagreements about the high level conceptual design? </p>\n<p>Note, I have less  clear an idea of a <em>developer experience</em> with dependencies in devshells than I do of simply a build / <em>CI experience</em> (as well as lifting every <code>lake exe foo</code> to a <code>nix run foo</code>)</p>",
        "id": 456015072,
        "sender_full_name": "Quinn",
        "timestamp": 1722625444
    },
    {
        "content": "<p>I will be extremely psyched when there's an easy way to build lean projects with nix</p>",
        "id": 456116063,
        "sender_full_name": "James Sully",
        "timestamp": 1722669346
    },
    {
        "content": "<p>Speaking as someone who has <a href=\"https://github.com/Kha/nale\">investigated</a> this topic before, a few caveats that ultimately made me give up on that approach: if you want to build each module as a separate Nix derivation (not absolutely necessary for deployment, but probably necessary for local development), then</p>\n<ul>\n<li>expect at least ~30% build time overhead. Nix is not made for building thousands of small derivations, there may even be some quadratic overhead in there.</li>\n<li>keep in mind that you will not be able to profit from the Mathlib cache or other non-Nix caches</li>\n<li>be aware that there hasn't been any progress on the content-addressed cache for Nix in years, without which you will not be able to benefit from any system changes we make in the future to avoid rebuilds either</li>\n</ul>",
        "id": 456349457,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1722788071
    },
    {
        "content": "<p>thanks for the insight! what would a content-addressed cache look like? not super familiar with that term.</p>",
        "id": 459325077,
        "sender_full_name": "Quinn",
        "timestamp": 1723164336
    },
    {
        "content": "<p><a href=\"https://discourse.nixos.org/t/content-addressed-nix-call-for-testers/12881\">https://discourse.nixos.org/t/content-addressed-nix-call-for-testers/12881</a></p>",
        "id": 459375706,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1723182117
    }
]