[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"470149\">@Joachim Breitner</span>, I have some feedback about the new unused simp linter:</p>\n<ol>\n<li>It is truly amazing <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span> </li>\n<li>When there are several unused simp lemma in the same simp call/same proof/neighboring proofs, fixing linter warnings starts feeling like a game of memory: As soon as you perform one suggested edit, all linter warnings disappear and you either have to wait a minute for the declaration to reload (yes, my proofs are a bit eh... <span aria-label=\"grimacing\" class=\"emoji emoji-1f62c\" role=\"img\" title=\"grimacing\">:grimacing:</span>) or you start editing blindly with what you remember.</li>\n<li>There seems to be one <code>Try this</code> suggestion per extraneous lemma in a simp call, instead of one suggestion per simp call. This exacerbates the previous point.</li>\n</ol>",
        "id": 528449015,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1752316749
    },
    {
        "content": "<p>For 2 with proofs of different theorems: always work up from the last warning in the file</p>",
        "id": 528454684,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1752322861
    },
    {
        "content": "<p>Can I just stop reading after 1? :-)</p>",
        "id": 528455937,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1752324194
    },
    {
        "content": "<blockquote>\n<p>I chose to display a separate warning for each unused argument. This means that the user has to click multiple times to remove all of them (and wait for re-elaboration in between). But this just means multiple endorphine kicks, and the main benefit over a single warning that would have to span the whole argument list is that already the squigglies tell the users about unused arguments.</p>\n</blockquote>",
        "id": 528455971,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1752324244
    },
    {
        "content": "<p>I guess one could have multiple diagnosis, one per unused simp argument, and all of them offer the same all-removing hint? But that looks odd in the InfoView as well</p>",
        "id": 528456054,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1752324359
    },
    {
        "content": "<p>When I had a lot of unused simps in slow proofs I changed the setting of vs code to be slower in updating the UI - not sure if it was the default LSP UI or the \"ErrorLens\" extension, but eventually I managed to edit fast enough to still see a few squiggly lines before they would have to be re-generated.</p>\n<p>And I have a related but more general question: Is there a \"accept all linter hints in this file\" function or how hard would it be to make that?</p>",
        "id": 528457504,
        "sender_full_name": "Malvin Gattinger",
        "timestamp": 1752325838
    },
    {
        "content": "<p>We don't have that yet, and I also hope we get it eventually. Ideally not only in VSCode but also in batch mode (so that you can update many files in one go)</p>",
        "id": 528458303,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1752326639
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"470149\">Joachim Breitner</span> <a href=\"#narrow/channel/113488-general/topic/unused.20simp.20argument.20linter.20feedback/near/528455971\">said</a>:</p>\n<blockquote>\n<p>the main benefit over a single warning that would have to span the whole argument list is that already the squigglies tell the users about unused arguments</p>\n</blockquote>\n<p>Aha, so a single warning has to correspond to a single <em>contiguous</em> squiggle? That's a bit unfortunate here</p>",
        "id": 528460692,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1752328804
    },
    {
        "content": "<p>I could also try to add a second hint labeled “remove all unused simp arguments” if there is more than one. Probably this hint wouldn't show the diff (to be considerate of the screen space).</p>",
        "id": 528465292,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1752333285
    },
    {
        "content": "<p>Are non-contiguous squiggles under consideration?</p>",
        "id": 528467186,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1752334965
    },
    {
        "content": "<p>I had previously thought you could get them by attaching your message to <code>mkNullNode #[part1, part2]</code></p>",
        "id": 528467225,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1752335003
    },
    {
        "content": "<p>Hmm, maybe I simply didn't know about that trick.</p>",
        "id": 528467987,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1752335876
    },
    {
        "content": "<p>But in LSP a diagnostic has a range, not a list of ranges, so I'm not too hopeful:<br>\n<a href=\"https://microsoft.github.io/language-server-protocol/specifications/lsp/3.17/specification/#diagnostic\">https://microsoft.github.io/language-server-protocol/specifications/lsp/3.17/specification/#diagnostic</a></p>",
        "id": 528468131,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1752336023
    },
    {
        "content": "<p>I guess the diagnostic could be duplicated for lsp, but maybe working around the protocol is unwise</p>",
        "id": 528488303,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1752359875
    }
]