[
    {
        "content": "<p>Hi!<br>\nLike LeanSAT, do we have features in Lean which let me call a SAT solver to solve a given boolean expression? I want it to work like a function which takes a given expression and returns SAT or UNSAT, and not as a tactic in a proof (like <code>bv_decide</code>). The goal here is to build a solver for a specific problem with help from the SAT solver, and prove its correctness. How do I go about achieving this, exactly?</p>",
        "id": 495580502,
        "sender_full_name": "Aatman Supkar",
        "timestamp": 1737664304
    },
    {
        "content": "<p>LeanSAT already has all of the machinery you are asking for under the hood, what kind of application are you building exactly?</p>",
        "id": 495582754,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1737665266
    },
    {
        "content": "<p>I expect to write the input as a structure in the file (a graph G in my case), write a function which answers a query about a certain graph parameter w.r.t. G, and return true/false. I then also want to prove the correctness of said function.</p>",
        "id": 495583740,
        "sender_full_name": "Aatman Supkar",
        "timestamp": 1737665684
    },
    {
        "content": "<p>Well in principle you can find all infrastructure for working with SAT related datastructures here: <a href=\"https://github.com/leanprover/lean4/tree/master/src/Std/Sat\">https://github.com/leanprover/lean4/tree/master/src/Std/Sat</a>. Example use case for how to implement bitblasting with it here <a href=\"https://github.com/leanprover/lean4/tree/master/src/Std/Tactic/BVDecide/Bitblast\">https://github.com/leanprover/lean4/tree/master/src/Std/Tactic/BVDecide/Bitblast</a>. Recovering proof certificates here <a href=\"https://github.com/leanprover/lean4/tree/master/src/Std/Tactic/BVDecide/LRAT\">https://github.com/leanprover/lean4/tree/master/src/Std/Tactic/BVDecide/LRAT</a>. And the code to both hook that up with the real world SAT solvers (and also the for your uninteresting part for hooking it up  to the tactic world) here <a href=\"https://github.com/leanprover/lean4/tree/master/src/Lean/Elab/Tactic/BVDecide\">https://github.com/leanprover/lean4/tree/master/src/Lean/Elab/Tactic/BVDecide</a>. Do note that apart from <code>Std.Sat</code> we do not provide stability guarantees for any of these APIs though</p>",
        "id": 495585322,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1737666361
    },
    {
        "content": "<p>Okay, I'll need some time to go through this and get back to you. Thanks! By the way, what is bitblasting?</p>",
        "id": 495586082,
        "sender_full_name": "Aatman Supkar",
        "timestamp": 1737666659
    },
    {
        "content": "<p>I think bitblasting = treating fixed-width integer arithmetic as a SAT problem, with one (boolean) variable for each bit of your integer variables?</p>",
        "id": 495599681,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1737672636
    },
    {
        "content": "<p>We don't really use a notion of integers here, it's just <code>BitVec</code> which can be interpreted in both a signed and an unsigned fashion depending on the operations you run on them. But the basic idea is corret yes.</p>",
        "id": 495600701,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1737673225
    },
    {
        "content": "<p>I mostly posted the bitblasting because it's currently the only thing that translates a higher level description into an AIG in a performant and verified manner</p>",
        "id": 495600933,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1737673334
    },
    {
        "content": "<p>RE your original question, we have been developing a Lean library called <a href=\"https://github.com/FormalSAT/trestle\">trestle</a> which has a bunch of utilities for writing \"formally verified encodings\" to SAT. We have some examples for graph problems -- <a href=\"https://github.com/FormalSAT/trestle/blob/7fa464943fce4f0a6d55f4633ca7372ee658e53f/Examples/GraphColoring.lean\">graph coloring</a> and <a href=\"https://github.com/FormalSAT/trestle/blob/dev/Experiments/Keller/Encoding.lean\">Keller graphs</a>.</p>\n<p>Trestle is designed for formally verifying math theorems which were proven by reduction to CNF that is machine-checked to be UNSAT. We have utilities for exporting CNFs and calling solvers, but those utilities are functionally equivalent to those in <code>Std.Sat</code>. So, depending on your use case, the <code>bv_decide</code> machinery may be a better fit.</p>",
        "id": 495601410,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1737673577
    },
    {
        "content": "<p>Ah, thanks for the heads up! I'll check it out. I'm working on <a href=\"https://en.wikipedia.org/wiki/Boxicity\">graph boxicity</a> in particular, and I wanted to design tools which could provide computational aid, so stuff like testing what happens on some specific graph as opposed to proving theorems. Nonetheless, this looks interesting, so I'll check it out, thanks!</p>",
        "id": 495604183,
        "sender_full_name": "Aatman Supkar",
        "timestamp": 1737675241
    }
]