[
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/15439\">#15439</a> splits a few variable statements in <code>Geometry/Manifold</code>, separating binder updates and declaring new variables. Doing both at the same time can yield confusing errors (see <a href=\"https://github.com/leanprover/lean4/pull/2789\">lean4#2789</a>).</p>\n<p>If this is desired (my understanding is it is), <a href=\"https://github.com/leanprover-community/mathlib4/pull/15400\">#15400</a> proposes a linter against this. Currently, the linter only lints in some cases (when the binder update is for a variable from a previous scope), but this already finds quite some cases in mathlib. Help going over the errors and fixing them is very welcome.<br>\nI tried to make the error message very clear; let me know if you're stuck.</p>",
        "id": 455912960,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1722598404
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> this seems useful! what is the status here? Should we look at <a href=\"https://github.com/leanprover-community/mathlib4/pull/15400\">#15400</a> first?</p>",
        "id": 460029783,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1723451661
    },
    {
        "content": "<p>I just pushed three local commits to <a href=\"https://github.com/leanprover-community/mathlib4/pull/15400\">#15400</a>, which are basically tweaks to the error message.</p>\n<p>Current status is that the linter needs to be improved first: the current behaviour both has false negatives (missing variable commands which should be split) and false positives (complaining about <code>variable</code>s which should not be linted (though they might be a code smell)).</p>",
        "id": 460084631,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1723469933
    },
    {
        "content": "<p>In a nutshell, the linter works by</p>\n<ul>\n<li>parsing the variable binders in a <code>variable</code> command (this is not hard and works well; the code could be cleaned up, but that can happen in parallel to fixing errors)</li>\n<li>comparing these to the previously declared variables, i.e. the current scope <em>before</em> the command took effect</li>\n<li>using this to find variable commands which should be split (this is also not hard and works)</li>\n</ul>\n<p>The second step is not fully implemented, as I don't see a nice and clean was to do this. (I am using an approximation, which leads to the issue above.) The issue is described <a href=\"#narrow/stream/113488-general/topic/Get.20scope.20*before*.20some.20syntax.20is.20evaluated\">here</a>, in essence: calling <code>getScope</code> when the linter is run on the <code>variable</code> command returns the scope <em>after</em> the command, which is not what I need.</p>",
        "id": 460085397,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1723470169
    },
    {
        "content": "<p>My current plan for a fix is to make the linter</p>\n<ul>\n<li>replace the command by a <code>section temp</code> command</li>\n<li>elaborate that, then get the current scopes (after the section command)</li>\n<li>the <em>previous</em> scope then has the information I want<br>\nActually, if the above works, something simpler also does: just replace the <code>variable</code> by some other command (such as <code>open Nat</code>; I only care about the variables in the current scope)</li>\n</ul>\n<p>I will get to this, perhaps this week, but help with above (or suggesting an easier fix, if it exists), is certainly appreciated! (Also with fixing the offenders, once the linter works well.)</p>",
        "id": 460085470,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1723470188
    },
    {
        "content": "<p>I wonder whether there should be a way of choosing whether a linter runs before or after a command is elaborated.  Currently, it is after and I do not think that there is a choice.  Sometimes, though, being able to run some code <em>before</em> a command is very useful.</p>",
        "id": 460086333,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1723470472
    },
    {
        "content": "<p>That certainly would solve my issue.</p>",
        "id": 460086799,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1723470629
    },
    {
        "content": "<p>That requires a patch to the linter framework, right?</p>",
        "id": 460098501,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1723474431
    },
    {
        "content": "<p>I think so: I would be happy to learn that there is a setting for this, but I do not think that there is.</p>",
        "id": 460107376,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1723477289
    },
    {
        "content": "<p>This, combined with <code>withoutModifyingEnv</code> would also allow to parse a modification of the linted command, without having to jump through hoops to avoid creating two declarations with the same name.</p>",
        "id": 460107544,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1723477334
    }
]