[
    {
        "content": "<p>I see in many places references to the <code>Vector</code> type (fixed-size <code>Array</code>), which looks wonderful, but at least my Lean 4.14.0 doesn't seem to support it out-of-the-box unless I load some external libraries.</p>\n<p>Am I just doing something wrong? Or is this something that is soon coming to Lean 4 core, just not yet? Or something that will require external libraries also in the future? And if external libraries are needed, should I be looking at mathlib, batteries, or something else (both mathlib and batteries seem to have some stuff related to <code>Vector</code>)?</p>",
        "id": 490418260,
        "sender_full_name": "Jukka Suomela",
        "timestamp": 1734901096
    },
    {
        "content": "<p>it seems to me that <code>Vector</code> (not <code>List.Vector</code> which was formerly known as <code>Mathlib.Vector</code>) is defined in the <code>Init</code> package, but was upstreamed from <code>batteries</code> about a month ago, and is currently part of <code>v4.15.0-rc1</code>.</p>",
        "id": 490418593,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1734901421
    },
    {
        "content": "<p>in short: you're not doing anything wrong, <code>Vector</code> isn't included out of the box for <code>v4.14.0</code>, but it seems it will be once <code>v4.15.0</code> is released</p>",
        "id": 490418681,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1734901491
    },
    {
        "content": "<p>OK, wonderful, thanks, so I'll just wait for the next version update and start enjoying it after that! I had difficulties finding this kind of information anywhere online…</p>",
        "id": 490418788,
        "sender_full_name": "Jukka Suomela",
        "timestamp": 1734901599
    },
    {
        "content": "<p>You can use it today if you add a dependency on batteries, or use v1.15.0rc1</p>",
        "id": 490419199,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1734902023
    },
    {
        "content": "<p>For me this would be just a convenience, so I can easily wait for the next version if I can that way avoid extra dependencies. :)</p>",
        "id": 490419546,
        "sender_full_name": "Jukka Suomela",
        "timestamp": 1734902376
    },
    {
        "content": "<p>(I also don't really understand this, but in batteries the <code>lean-toolchain</code> file currently says <code>4.15.0-rc1</code>, so can I actually use the current version batteries without also switching to 4.15.0-rc1? I tried to use batteries with 4.14.0 and just got a pile of errors asking me to switch to 4.15.0-rc1.)</p>",
        "id": 490419912,
        "sender_full_name": "Jukka Suomela",
        "timestamp": 1734902733
    },
    {
        "content": "<p>Batteries with 4.14.0 should be fine, if you have errors you can ask for help with them on <a class=\"stream\" data-stream-id=\"113489\" href=\"/#narrow/channel/113489-new-members\">#new members</a>; it sounds like a configuration error somewhere on your side</p>",
        "id": 490420641,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1734903502
    },
    {
        "content": "<p>To use Batteries with v4.14.0, you can't just require the main branch, you need to require the <code>v4.14.0</code> tag.</p>",
        "id": 490576373,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1734984593
    },
    {
        "content": "<p>Yes, thanks, got help for it here: <a class=\"stream-topic\" data-stream-id=\"113489\" href=\"/#narrow/channel/113489-new-members/topic/.E2.9C.94.20Batteries.20with.20Lean.204.2E14.2E0\">#new members &gt; ✔ Batteries with Lean 4.14.0</a></p>",
        "id": 490580767,
        "sender_full_name": "Jukka Suomela",
        "timestamp": 1734986657
    }
]