[
    {
        "content": "<p>I'm wondering if anyone knows what has been done and, or is being done, in Lean or elsewhere, in terms of formalizing and verifying digital signal processing algorithms, such as the FFT, FIR and IIR filters, etc.</p>",
        "id": 396563926,
        "sender_full_name": "Kayla Thomas",
        "timestamp": 1697226942
    },
    {
        "content": "<p>Hello Kayla<br>\nFrom the things you mention we probably share an area of interest.</p>\n<p>The way I think of it is there is some mathematical theorems that should be in place before doing signal processing type proofs becomes a reasonable proposition. Let's call this necessary math \"Mathematics for Signal Processing\".</p>\n<p>In this repo <a href=\"https://github.com/MohanadAhmed/LeanMathSigProc\">https://github.com/MohanadAhmed/LeanMathSigProc</a> I am starting to slowly do some of this math but I still think I have a long way.</p>\n<p>In <a href=\"https://github.com/leanprover-community/mathlib4/pull/6517\">#6517</a> I tried to define DFT (the slow version of FFT but mathematically more malleable ) </p>\n<p>Any form of signal processing which deals with stochastic signals wil need significant effort to build up the probability part of mathlib. </p>\n<p>Finally <span class=\"user-mention\" data-user-id=\"346070\">@Tomas Skrivan</span> and <span class=\"user-mention\" data-user-id=\"310045\">@Eric Wieser</span> might have knowledge of some other relevant efforts.</p>",
        "id": 396573329,
        "sender_full_name": "MohanadAhmed",
        "timestamp": 1697232515
    },
    {
        "content": "<p>While strictly I'm a member of the \"signal processing group\" at my department, I have nothing to offer here besides agreeing that it would be great to have some results in this area!</p>",
        "id": 396576136,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1697234383
    },
    {
        "content": "<p>Thank you for the info. I honestly don't know much about the subject, but I am helping to refactor a signal processing library for work, and I have to ensure that I don't introduce errors while doing so, so formalization came to mind. I'm not really looking to work on formalizing it myself, since I have another formalization project I am already working on, but was hoping maybe there was something already out there.</p>",
        "id": 396585595,
        "sender_full_name": "Kayla Thomas",
        "timestamp": 1697241795
    }
]