[
    {
        "content": "<p>Dear maintainers of Verso,</p>\n<p>I recently tried to write documentation using <code>verso</code> and ran into a few difficulties that took a while to untangle. I thought it might be helpful to report them, since they seem likely to affect new users.</p>\n<h2>1. Version mismatch between <code>verso</code> and <code>verso-templates</code></h2>\n<p>The README of the <code>verso</code> repository links to <code>verso-templates</code>, but that repository currently appears to use older Lean / Verso versions. When I tried to import (an older version of) mathlib and use something like `Mathlib.Data.Set.Basic, I ran into “unreachable code” errors. I am not sure if it is because of the version mismatch, but this was quite confusing.<br>\nOnce I updated the verisons, I had the same issue as described in 2.</p>\n<h2>2. Example projects are not safe to copy verbatim</h2>\n<p>After realizing that the main <code>verso</code> repository itself contains example projects, I cloned those instead. However, copying the examples verbatim requires renaming <code>DemoTextbook</code>. Otherwise, the build fails with errors like:</p>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code><span class=\"w\"> </span><span class=\"o\">[</span><span class=\"m\">298</span>/309<span class=\"o\">]</span><span class=\"w\"> </span>Running<span class=\"w\"> </span>DemoTextbook\nerror:<span class=\"w\"> </span>DemoTextbook.lean:<span class=\"w\"> </span>could<span class=\"w\"> </span>not<span class=\"w\"> </span>disambiguate<span class=\"w\"> </span>the<span class=\"w\"> </span>module<span class=\"w\"> </span><span class=\"sb\">`</span>DemoTextbook.Meta.Lean<span class=\"sb\">`</span><span class=\"p\">;</span><span class=\"w\"> </span>multiple<span class=\"w\"> </span>packages<span class=\"w\"> </span>provide<span class=\"w\"> </span>distinct<span class=\"w\"> </span>definitions:\n<span class=\"w\">  </span>textbook<span class=\"w\"> </span><span class=\"o\">(</span>hash:<span class=\"w\"> </span>825556ba2f7f673b<span class=\"o\">)</span>\n<span class=\"w\">  </span>verso<span class=\"w\"> </span><span class=\"o\">(</span>hash:<span class=\"w\"> </span>1bea9ae421a13634<span class=\"o\">)</span>\n</code></pre></div>\n<p>This happens because multiple packages define modules under the <code>DemoTextbook</code> namespace, but this is not obvious from the error message or from the documentation.</p>\n<h2>Possible improvements</h2>\n<ul>\n<li>Keep example projects out of the main <code>verso</code> repository and have the <code>verso-templates</code> for the examples.</li>\n<li>Clearly document that the directories and / or files must be renamed before reuse.</li>\n</ul>\n<p><strong><em>Note:</em></strong> Everything I described happened while trying to set up a <code>textbook</code>/ <code>Manual</code>. I did not try the others.</p>\n<p>Thanks for all the work on Verso — once things are set up, it’s a great tool. If i can do anything to assist you, just let me know. I would be happy to help.</p>",
        "id": 570828160,
        "sender_full_name": "Marx",
        "timestamp": 1769700897
    },
    {
        "content": "<p>Thanks for the feedback!</p>\n<p>I'll get that templates repo updated to this week's Lean release right away, and find a way to make this an automatic part of new Lean version processes.</p>\n<p>The contents of <code>test-projects</code> are intended for testing parts of Verso itself while working on it, and I don't think we can take them out of the repository. What would have indicated to you that they weren't intended to be copied and used? In any case, I'll add a README to that effect to the <code>test-projects</code> directory.</p>\n<p>I'm glad you got up and going despite the difficulties!</p>",
        "id": 570831569,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1769701698
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span>  Thank you for the answer! <br>\nOh okay, I see! This explains quite a bit. I think i was confusing, that the <code>DemoTextbook</code>from the templates looked quite similar and the sentence \"To base your own book on it, copy the contents of this directory and add the following files:\" in the README of the <code>test-projects/textbook</code>led me to thinking, it was intended to serve as \"base\" from my own project.</p>",
        "id": 570836873,
        "sender_full_name": "Marx",
        "timestamp": 1769702944
    },
    {
        "content": "<p>Once upon a time, they were. Leaving that README was an oversight when I created the verso-templates repository. I'm sorry to have not noticed it - but they are now deleted, the templates repository is up to date, and the other README is added.</p>\n<p>Thank you once again for the helpful feedback!</p>",
        "id": 570837736,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1769703200
    },
    {
        "content": "<p>Thank you very much!</p>",
        "id": 570840187,
        "sender_full_name": "Marx",
        "timestamp": 1769703842
    }
]