[
    {
        "content": "<p>Regarding the <a href=\"https://lean-lang.org/functional_programming_in_lean/\">FPiL book</a>, I appreciate the ongoing efforts to develop the new Verso format. However, the transition to Verso feels like a step backward in some ways. We lost the search functionality, and the formatting seems less polished compared to resources like <a href=\"https://leanprover-community.github.io/mathematics_in_lean/index.html#mathematics-in-lean\">Mathematics in Lean</a> and <a href=\"https://hrmacbeth.github.io/math2001/#the-mechanics-of-proof\">The Mechanics of Proof</a>. What do you all think?  I am planning to start writing a book and am curious to know what other authors have to say about Verso or alternative approaches for an online book.</p>",
        "id": 527296054,
        "sender_full_name": "Alexandre Rademaker",
        "timestamp": 1751738665
    },
    {
        "content": "<p>The <a href=\"https://lean-lang.org/doc/reference/latest/\">Lean Reference</a> has search though, so the lack of search in FPiL does not seem to be due to a limitation of Verso.</p>",
        "id": 527297516,
        "sender_full_name": "suhr",
        "timestamp": 1751740468
    },
    {
        "content": "<p>It seems like the search is still somewhat limited though.</p>",
        "id": 527297569,
        "sender_full_name": "suhr",
        "timestamp": 1751740542
    },
    {
        "content": "<p>Full-text search is coming!</p>",
        "id": 527297578,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1751740554
    },
    {
        "content": "<p>I think starting a new Lean book using anything else than Verso would be extremely unwise.</p>",
        "id": 527297667,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1751740672
    },
    {
        "content": "<p>I agree the cosmetic aspect is not yet great, but anyone can contribute CSS to Verso, you don’t to wait for David to turn into a web designer.</p>",
        "id": 527297722,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1751740736
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> for the update. </p>\n<p>I agree <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span>, and I am willing to try Verso. Yes, perhaps my personal preferences regarding the cosmetic aspect (as you mentioned) can be easily addressed with some CSS adjustments. </p>\n<p>That said, let me emphasize that I really respect the work <span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span> is doing with Verso. I was trying to contribute my personal perspective on the current Verso documents, have updates from the community, and see what directions people are considering. <span class=\"user-mention\" data-user-id=\"657719\">@Terence Tao</span> is using Verso in <a href=\"https://github.com/teorth/analysis\">https://github.com/teorth/analysis</a>. Does anyone know what the difference is between the 'documentation' and 'Verso page' links? Are both sources produced with Verso? Or perhaps the documentation was extracted from the code and comments, and the 'verso pages' refer to the ones produced in Verso.  I guess the README itself is maintained manually, right?</p>",
        "id": 527305497,
        "sender_full_name": "Alexandre Rademaker",
        "timestamp": 1751750933
    },
    {
        "content": "<p>The documentation links are built with <a href=\"https://github.com/leanprover/doc-gen4/\">https://github.com/leanprover/doc-gen4/</a></p>",
        "id": 527305581,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1751751056
    },
    {
        "content": "<p>In the analysis repo, the documentation is generated by doc-gen from the source lean as part of the blueprint package, but the Verso pages are generated (from the same source lean files) by a separate tool (with its own lake files, etc.).  So a certain amount of manual updating of multiple config files are needed (as well as the main README) for both outputs whenever I add a new section.  In principle this could be done in a more integrated fashion, but I anticipate the sectioning will in fact stabilize in a few weeks, so it would become moot for that project at least.</p>",
        "id": 527305605,
        "sender_full_name": "Terence Tao",
        "timestamp": 1751751077
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"121542\">@Alexandre Rademaker</span> Thanks for the feedback! I finished implementing full-text search for the language reference yesterday (before it searched just the tagged metadata, like technical terms, section headers, and function or option names - like the index of a book). That will be rolling out in the next RC/release cycle.</p>\n<p>After a couple of weeks vacation, I'll be upstreaming it so every Verso-based online book can have both quick access to specifically-tagged items and a proper text based search.</p>",
        "id": 527306165,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1751751786
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span> </p>\n<p>I don't think Verso has a feature to convert books into PDFs, but I would like it to have one.<br>\nThat's because when using an AI like Notebook LM to learn from what I've written, it's easier to train it with content in PDF format.</p>",
        "id": 527313952,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1751763977
    },
    {
        "content": "<p>My understanding from <a class=\"stream-topic\" data-stream-id=\"113489\" href=\"/#narrow/channel/113489-new-members/topic/Printable.20form.20of.20language.20reference.3F/with/520532042\">#new members &gt; Printable form of language reference?</a> is that Verso might eventually have the ability to export to PDF, but it's very low priority. I can definitely see a few advantages of being able to do so, although requesting PDFs because they are easier to train LLMs on is certainly a niche use case (surely it would be better to just use a generic program that converts web pages to pdfs?)</p>",
        "id": 527320976,
        "sender_full_name": "Niels Voss",
        "timestamp": 1751775107
    },
    {
        "content": "<p>Some background with respect to the Analysis Book project: The reason we have this setup is because Terence explicitly set \"gateway to mathlib usage\" as a goal.  The idea here is that the Verso pages are just a pretty and readable view to example proofs and that students who want to do the exercises can just clone the repository and work in the <code>./analysis</code> subfolder without being confronted with Verso. </p>\n<p>In general, I would also recommend Verso: It's powerful for anything involving Lean code and currently in a very useable state (with the rough edges discussed above).</p>",
        "id": 527327874,
        "sender_full_name": "Pim Otte",
        "timestamp": 1751784494
    },
    {
        "content": "<p>A PDF feature would be great, and the foundations of it are available. So far, it's not been high enough up the priority list to spend the (significant) time that a quality PDF output would require, however - for example, a system based on print has to format cross-references differently, and the text should read naturally whether it's a clickable link to a given section or a \"on page 378\"-style cross-reference. All these little details add up. I'd personally also really like an epub version. This is something where a dedicated external contributor could make a big impact.</p>",
        "id": 527373472,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1751836436
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span>, would you consider giving a presentation about the Verso architecture? In one of the office hours? A step-by-step guide on how to start a book/website using Verso.</p>\n<p>I finally managed to create a first version of the book I started writing. Still, I didn't really understand why I need to define the code blocks (see the definition of <a href=\"https://github.com/leanprover/verso/blob/main/examples/textbook/DemoTextbook/Meta/Lean.lean\">savedLean</a>). I would like to avoid having two lake projects and duplicate the dependencies; maybe you can advise on a better structure in my case. </p>\n<p>Finally, in VS Code, within a code block, the InfoView is not functioning as expected; it fails to update the proof state.</p>",
        "id": 529603836,
        "sender_full_name": "Alexandre Rademaker",
        "timestamp": 1752948240
    },
    {
        "content": "<p>In the near future, I'll be substantially improving the documentation for getting started with Verso. I'd be happy to give a presentation once that's been done - right now, I think it would be a duplication of effort, and I think a presentation is more useful as a way to start Q&amp;A based on decent docs, rather than as a way to get started with it. How does that sound?</p>",
        "id": 529863474,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1753096098
    },
    {
        "content": "<p>Of course — who am I to impose anything different? But deadlines are critical to me... I'm just starting this project of turning the repository <a href=\"https://github.com/arademaker/fad\">https://github.com/arademaker/fad</a> into a book, and I must admit I haven’t made much progress yet because I am confused by the structure of Verso and its examples. I’m already convinced that not using Verso at this point would be a mistake, but I had hoped it would be simpler to use. Understanding how block declarations and other basics work seems essential to avoid a lot of rework later when adapting the material.</p>",
        "id": 529921368,
        "sender_full_name": "Alexandre Rademaker",
        "timestamp": 1753113736
    },
    {
        "content": "<p>What are your deadlines?</p>",
        "id": 530081801,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1753168333
    },
    {
        "content": "<p>Sorry, I forgot to answer. The second semester started this week. I would like to have an initial version of the book online as soon as possible so the students can follow its progress as the course evolves.</p>",
        "id": 532763230,
        "sender_full_name": "Alexandre Rademaker",
        "timestamp": 1754325851
    },
    {
        "content": "<p>I'm working on better, more explanatory examples this week. I'll post here when they're up.</p>",
        "id": 532830624,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1754367535
    }
]