[
    {
        "content": "<p>I often use ctrl-space to give me suggestions for the lemma I'm looking for. But the output is totally weird to me. Frequently I do not see the full type of the suggested lemma, VS Code cuts it off after a few lines. In the gif example attached, you can see that sometimes 5 lines are displayed and sometimes two. Can I persuade VS Code to just tell me the type of the lemma, rather than just giving me the list of typeclasses in the input and then truncating after two lines? You can see in the video that sometimes VS Code displays 2 lines, and somtimes 5, and I can see no rhyme or reason for the choice. I would like to see \"as much as possible\" and there is clearly room to display this. I can hover over the output to see the full type but the font size is too tiny for me to read and I don't know how to increase it, and I don't really want to hover anyway, I just want to see the output on the font size I've selected. Am I making sense? Why is VS Code sometimes only displaying two lines of output and sometimes 5? Concrete example: why can't I see the full type of <code>finsum_mem_congr</code>?</p>\n<p><a href=\"/user_uploads/3121/oGunumzj4l_-PQLcMQJGNH5b/autocomplete2.gif\">autocomplete2.gif</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/oGunumzj4l_-PQLcMQJGNH5b/autocomplete2.gif\" title=\"autocomplete2.gif\"><img data-animated=\"true\" data-original-content-type=\"image/gif\" data-original-dimensions=\"1663x863\" src=\"/user_uploads/thumbnail/3121/oGunumzj4l_-PQLcMQJGNH5b/autocomplete2.gif/840x560-anim.webp\"></a></div>",
        "id": 507854622,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1742842709
    },
    {
        "content": "<p>The relevant setting category is Editor › Suggest but I can't find the setting</p>",
        "id": 507856959,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1742843466
    },
    {
        "content": "<p>I had a similar issue. I assume someone likely has a better solution but if not I found you can drag on the size of the right hand box so that it is big enough to see any (or most) type declarations. It will keep that size until you quit the editor (I am not sure if there is a way to save it). <br>\n<a href=\"/user_uploads/3121/ltMdBZd-OHp_Y9QvcVDuslmP/vscode.png\">vscode.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/ltMdBZd-OHp_Y9QvcVDuslmP/vscode.png\" title=\"vscode.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1982x305\" src=\"/user_uploads/thumbnail/3121/ltMdBZd-OHp_Y9QvcVDuslmP/vscode.png/840x560.webp\"></a></div>",
        "id": 507871467,
        "sender_full_name": "David Ledvinka",
        "timestamp": 1742848592
    },
    {
        "content": "<p>I think the reason that VS Code cuts this information off in this way is that it retains the line breaks in code blocks and then just omits all characters on the same line that exceed the width of the box. AFAIK there's no good way to configure this other than increasing the size of the box (even the auto-completion font size setting doesn't seem to affect it). </p>\n<p>I've played around a bit with the VS Code API to see whether there is something we can do to improve the way it renders this, e.g. by moving the type from the \"detail\" field to the \"documentation\" field, but all of the alternatives are even worse.</p>\n<p>We could drop the full implicit prefix so that type classes don't show up in the type, if that is a desired change (<a href=\"https://github.com/leanprover/lean4/pull/7676\">lean4#7676</a>). It's not perfectly clear to me that type class dependencies are never of interest, though.</p>",
        "id": 507984529,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1742898795
    },
    {
        "content": "<p>We had a similar discussion w.r.t to the loogle extension. The conclusion iirc was that typeclass instances matter but implicits don’t</p>",
        "id": 507995698,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1742901981
    },
    {
        "content": "<p>Adding anything to the description makes it cluttered. But I think vscode doesn’t trim white spaces at the end of the description. I used it to sneak in an empty new line to improve vertical spacing between the options</p>",
        "id": 507995939,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1742902050
    },
    {
        "content": "<p>Ofc this is a brittle way to improve the UI since vscode devs could change this behaviour any day</p>",
        "id": 507996266,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1742902145
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/channel/113488-general/topic/viewing.20types.20of.20ctrl-space.20suggestions.20in.20VS.20Code/near/507995939\">said</a>:</p>\n<blockquote>\n<p>Adding anything to the description makes it cluttered. But I think vscode doesn’t trim white spaces at the end of the description. I used it to sneak in an empty new line to improve vertical spacing between the options</p>\n</blockquote>\n<p>There is no issue with vertical separation here and we are not talking about VS Code's QuickPick UI, but its auto-completion UI.</p>",
        "id": 508002776,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1742904067
    }
]