[
    {
        "content": "<p>I was reviewing a PR which added a new file <code>Mathlib/Algebra/Category/ModuleCat/Sheaf/Quasicoherent.lean</code>. I was editing the file, maybe I saved my edits, maybe I didn't, it doesn't matter, it's not my PR. I then closed VS Code, and later on switched to master on the command line, stashing my changes in the process, and typed <code>code .</code>, and I was faced with this:</p>\n<p><a href=\"/user_uploads/3121/6l2sq3B1Ksvj0c6TIBdPNhvo/Screenshot-from-2024-06-26-22-23-16.png\">Screenshot-from-2024-06-26-22-23-16.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/6l2sq3B1Ksvj0c6TIBdPNhvo/Screenshot-from-2024-06-26-22-23-16.png\" title=\"Screenshot-from-2024-06-26-22-23-16.png\"><img src=\"/user_uploads/3121/6l2sq3B1Ksvj0c6TIBdPNhvo/Screenshot-from-2024-06-26-22-23-16.png\"></a></div><p>I can't click anything, drag anything, close the error box, or use VS Code at all. The only thing I can do is exit and then try <code>code .</code> again where the same thing happens. I'm sure I'll be able to fix it perhaps by switching back to the PR I was reviewing or popping my stash or whatever, but this is certainly a bit weird and it's not the first time I've had such a scary popup recently, but I'd never seen such things before until a couple of days ago.</p>\n<p>Edit: indeed switching back to the PR, closing the unsaved Quasicoherent.lean file in VS Code and then switching back to master has got me up and running again. But should this be happening at all?</p>",
        "id": 447340051,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1719437284
    },
    {
        "content": "<p>That's just nodejs spitting out an entire stack trace to tell you that the file it is trying to open doesn't exist</p>",
        "id": 447351847,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719442930
    },
    {
        "content": "<p>Usually vscode knows how to handle this situation smoothly, so this could just be some missing error handling code in the extension. Less likely, it could be a bug introduced in some recent vscode version</p>",
        "id": 447352156,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719443092
    },
    {
        "content": "<p>One thing you can try is move your vscode back a couple of versions or so and see if you get it again</p>",
        "id": 447352222,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719443115
    },
    {
        "content": "<p>If as I recall, you are on ubuntu, and you installed vscode from the snap store then it is quite easy to do this revert</p>",
        "id": 447352672,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719443283
    },
    {
        "content": "<p>But I want to confirm this before going on any further</p>",
        "id": 447352767,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719443354
    },
    {
        "content": "<p>I'm afraid I have no memory of how I installed VS Code, but I will confess that I'm also unlikely to start fiddling with my system getting earlier versions of software.</p>",
        "id": 447353002,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1719443515
    },
    {
        "content": "<p>What does <code>snap list code</code> give you (on the terminal)</p>",
        "id": 447353354,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719443712
    },
    {
        "content": "<p>Sorry changed the command there a bit</p>",
        "id": 447353377,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719443730
    },
    {
        "content": "<p>If you are using a snap store version of vscode, reverting to an old version and then back to a new version can be done with zero trouble. I did that twice this month because of some weird vscode bugs in the latest versions. I am trying to rule out the possibility that the issue lies with a recent update of vscode itself as opposed to the extension which is a distinct possibility.</p>",
        "id": 447354639,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719444188
    },
    {
        "content": "<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>error: no matching snaps installed\n</code></pre></div>",
        "id": 447354915,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1719444256
    },
    {
        "content": "<p>okay then it isn't that simple</p>",
        "id": 447354962,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719444274
    },
    {
        "content": "<p>The scary popups are deliberate. We now display them when activating the extension would otherwise fail due to internal bugs, which would otherwise leave users confused about why their Lean does not work. So the error is likely old, but the fact that we display it is new.</p>\n<p>It's very unfortunate that the VS Code UX is so bad when the error is too large and I'll fix that ASAP. I'll also look into the error you reported. Please keep reporting these kinds of errors so that we can fix these bugs.</p>",
        "id": 447408570,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1719474191
    },
    {
        "content": "<p>Can't they go into the debug console and be truncated?</p>",
        "id": 447418378,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719477261
    },
    {
        "content": "<p>That's where they went since the Lean 4 VS Code extension started and nobody reported them.</p>",
        "id": 447418528,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1719477328
    },
    {
        "content": "<p>The debug console is also not sufficiently visible for users to understand why their Lean 4 extension doesn't work when it fails to launch due to an internal error.</p>",
        "id": 447418684,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1719477368
    },
    {
        "content": "<p>Then maybe a toast with just the last two lines of the stacktrace will get their attention?</p>",
        "id": 447422225,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719478557
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 447422339,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719478582
    },
    {
        "content": "<p>(To unfamiliar readers: toast refers to  the error box that pops up on the lower right hand corner when something goes wrong)</p>",
        "id": 447422519,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719478649
    },
    {
        "content": "<p>Both the excessively large error popup and the error itself should be resolved by <a href=\"https://github.com/leanprover-community/vscode-lean4/pull/488\">vscode-lean4#488</a>, which is now available in 0.0.170.</p>\n<p>The issue was that when you have unsaved changes in a file, close VS Code, delete the file (e.g. by switching branches) and then re-open VS Code, VS Code tells us about this file with unsaved changes as if it actually exists in the file system. One place in the extension was not resilient against this, and so it crashed.<br>\nThis issue was introduced more than two years ago and started affecting the activation of the VS Code extension a couple of months ago.</p>",
        "id": 447454078,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1719488062
    },
    {
        "content": "<p>Vscode doesn't tell the user that the file exists. It shows the title of such files with a strikethrough so it clearly knows it is showing a file that isn't in the folder when vscode is reopened. But the extension API might not reflect this fact.</p>",
        "id": 447459540,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1719489438
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466334\">Shreyas Srinivas</span> <a href=\"#narrow/stream/113488-general/topic/VS.20Code.20error.20too.20big.20to.20remove/near/447459540\">said</a>:</p>\n<blockquote>\n<p>Vscode doesn't tell the user that the file exists.</p>\n</blockquote>\n<p>It does when you have unsaved changes in that file before deleting it. In the case where VS Code shows the file with a strikethrough, it doesn't inform the extension about this file, either.<br>\n<a href=\"/user_uploads/3121/1W9nxtiPnJdvf9U5Z2nvQ9Gv/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/1W9nxtiPnJdvf9U5Z2nvQ9Gv/image.png\" title=\"image.png\"><img src=\"/user_uploads/3121/1W9nxtiPnJdvf9U5Z2nvQ9Gv/image.png\"></a></div>",
        "id": 447460095,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1719489630
    }
]