[
    {
        "content": "<p>I've found the abbreviation engine that the vscode extension utilizes to be a paradigm shift in the way it allows for accessing a far wider range of unicode symbols than are otherwise readily accessible by regular input methods. I'd love to have similar capability for general typing of notes or other features.</p>\n<p>Are there any tools that are similar that work as more generalized IME layers for other contexts? or is there a possibility that the lean input system could be either broken out into a separate standalone tool, or maybe a setting that enables it in other non-lean files as well?</p>",
        "id": 547953579,
        "sender_full_name": "Conner Bondurant",
        "timestamp": 1761835082
    },
    {
        "content": "<p>Within VS Code, you can adjust the 'Lean 4: Input &gt; Languages' setting to enable the abbreviation mechanism in other languages (e.g. Markdown). You may also find the <a href=\"https://github.com/leanprover/vscode-lean4/blob/master/vscode-lean4/manual/manual.md#unicode-input\">manual entry</a> helpful.</p>\n<p>Outside of VS Code, there is <a href=\"https://www.npmjs.com/package/@leanprover/unicode-input\">unicode-input</a> as a standalone TS library of the abbreviation logic and <a href=\"https://www.npmjs.com/package/@leanprover/unicode-input-component\">unicode-input-component</a> as a standalone TS library for an input field that can be used on webpages (e.g. the search bar of <a href=\"https://loogle.lean-lang.org/\">Loogle</a> or of <a href=\"https://lean-lang.org/doc/reference/latest/\">the language reference</a>).</p>",
        "id": 547960887,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1761836580
    },
    {
        "content": "<p>oh that sounds perfect</p>",
        "id": 547962016,
        "sender_full_name": "Conner Bondurant",
        "timestamp": 1761836818
    },
    {
        "content": "<p>I recently made <a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general/topic/Compose.20key.20sequences.20for.20Lean/with/547166337\">#general &gt; Compose key sequences for Lean</a>  which works on Linux and probably also on Windows via WinCompose. This might be a bit different than what you're looking for though, since my script extracts only the sequences from the VSCode extension for use with other tools rather than the extension's input system itself.</p>",
        "id": 547964871,
        "sender_full_name": "Anthony Wang",
        "timestamp": 1761837418
    },
    {
        "content": "<p>Well that also gives me another keyword that I wasn't aware of in the form of the compose key. So that'll probably be another avenue to explore as well.</p>",
        "id": 547978673,
        "sender_full_name": "Conner Bondurant",
        "timestamp": 1761840626
    },
    {
        "content": "<p>Yet another possibility is to use <a href=\"https://github.com/OneDeadKey/kalamine\">https://github.com/OneDeadKey/kalamine</a> to make your own keyboard layout full of math unicode symbols.</p>",
        "id": 548046912,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1761865569
    }
]