[
    {
        "content": "<p>To whom it may concern, </p>\n<p>To make my widget-view thing work in vscode, I modified the code for the vscode extension's infoview quite a lot. In particular infoview.ts is now just a dumb pipe that forwards all the server messages to the webview which is running some react code to update the infoview. So all of the code to do with formatting messages and handling the state of the infoview is now done in the webview javascript. The HTML of the webview page is set once and then the rest is done with server messages and code running in the webview.</p>\n<p>But I broke stuff like freezing the state and the red highlighting thing. I don't want to cause a regression in functionality so I thought I'd make a thread where we can chat about what should be in the featureset for this overhauled version, or perhaps it is best left alone.</p>\n<p>My questions are: </p>\n<ol>\n<li>does anyone use the red code highlighting feature? (sometimes when you hover over an error message or goal the relevant sourcetext will be highlighted in red.) </li>\n<li>the goal view came with output freezing, which I intend to keep, are there any other features of the infoview that are needed by anyone? Filtering different members of the local variables list should be possible using the widget system.</li>\n</ol>",
        "id": 196886471,
        "sender_full_name": "Edward Ayers",
        "timestamp": 1588939154
    },
    {
        "content": "<p>I never use the red thing. For a very long time I thought this was a bug, before someone told me it is a feature.</p>",
        "id": 196886673,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1588939309
    },
    {
        "content": "<p>About 2, see <a href=\"https://github.com/leanprover/vscode-lean/issues/151\" title=\"https://github.com/leanprover/vscode-lean/issues/151\">https://github.com/leanprover/vscode-lean/issues/151</a></p>",
        "id": 196886727,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1588939328
    },
    {
        "content": "<p>I only just found out about the red highlighting feature. I only ever use Display Goal, never Display Messages.</p>",
        "id": 196888175,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1588940431
    },
    {
        "content": "<blockquote>\n<p>does anyone use the red code highlighting feature? (sometimes when you hover over an error message or goal the relevant sourcetext will be highlighted in red.) </p>\n</blockquote>\n<p>Oh, I almost forgot about that. That's perfect for the feature I just PR'd, <a href=\"https://github.com/leanprover-community/vscode-lean/issues/158\" title=\"https://github.com/leanprover-community/vscode-lean/issues/158\">vscode-lean#158</a>, which adds a \"sticky position\" flag to give live goal feedback somewhere other than the current cursor position. Right now there is no visible indicator of where it is or even if it is on, so a little red line on the mark would help.</p>",
        "id": 196888176,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1588940431
    },
    {
        "content": "<p>Maybe it would be cool to have that the infoview produces a goal state etc under your cursor, and then you have the option to 'pin' the state, then the infoview will report what is going on at that cursor position and the cursor infoview will render below that</p>",
        "id": 196894419,
        "sender_full_name": "Edward Ayers",
        "timestamp": 1588944113
    },
    {
        "content": "<p>This sounds great! The infoview has definitely needed a refactoring along the lines you described for a while.</p>",
        "id": 196904300,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1588949300
    }
]