[
    {
        "content": "<p>As some of you might know, the WebAssembly language has been co-developed with <a href=\"https://webassembly.github.io/spec/core/\">its formal spec</a>, and this subsequently has been mechanized in Isabelle and then Coq. So far, the three artifacts (formal prose spec, formal math spec, Isabelle, Coq) have to be kept in sync manually. To improve this the people behind WebAssembly started to build a tool that generates these artifacts from a common source of truths.</p>\n<p>Over the Easter holidays, I had fun targetting, as the _first_ theorem prover backend of this tool, Lean4, and it is now “essentially complete” with regard to the current (incomplete) input spec of this (still very WIP) tool. This is the current output:</p>\n<p><a href=\"https://github.com/Wasm-DSL/spectec/blob/joachim/spectec/test-lean4/SpecTec.lean\">https://github.com/Wasm-DSL/spectec/blob/joachim/spectec/test-lean4/SpecTec.lean</a></p>\n<p>(This is still on a branch, see &lt;<a href=\"https://github.com/Wasm-DSL/spectec/pull/2\">https://github.com/Wasm-DSL/spectec/pull/2</a>&gt; for status on its merge progress.)</p>\n<p>Posting this here in case someone wants to play around with it.</p>\n<p>And, thinking a bit bigger, maybe some people want to get behind a community effort making the Lean4 formalization of the WebAssembly spec at least as good as <a href=\"https://github.com/WasmCert/WasmCert-Isabelle\">the Isabelle one</a> (maintained basically by one very talented person, Conrad Watt) and <a href=\"https://github.com/WasmCert/WasmCert-Coq\">the Coq one</a> (maintained by a research group around Philippa Gardner).</p>",
        "id": 348778976,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1681316621
    },
    {
        "content": "<p>Hello I'm resurrecting this thread</p>",
        "id": 540639168,
        "sender_full_name": "(deleted)",
        "timestamp": 1758440158
    },
    {
        "content": "<p>WebAssembly has changed so much and it has so much potential</p>",
        "id": 540639225,
        "sender_full_name": "(deleted)",
        "timestamp": 1758440203
    },
    {
        "content": "<p>It is a widely used programming language with a rigorous specification, so it's very useful in program verification</p>",
        "id": 540639252,
        "sender_full_name": "(deleted)",
        "timestamp": 1758440239
    },
    {
        "content": "<p>Do you think it's wise to build a program verification framework based on WebAssembly</p>",
        "id": 540639276,
        "sender_full_name": "(deleted)",
        "timestamp": 1758440269
    },
    {
        "content": "<p>Despite \"assembly\" in its name it's closer to a high level programming language than assembly code</p>",
        "id": 540639311,
        "sender_full_name": "(deleted)",
        "timestamp": 1758440312
    },
    {
        "content": "<p>I am certainly interested. One of my back burner projects is a compiler targeting WASM, and I am interested in writing some of the software with lean. Having a formal specification of WASM in lean would be very useful.</p>",
        "id": 540665983,
        "sender_full_name": "Julia Scheaffer",
        "timestamp": 1758469636
    },
    {
        "content": "<p>I currently have a prototype compiler written in rust, but I'd like to transition to Lean so that I can use stronger type theory <span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 540666065,
        "sender_full_name": "Julia Scheaffer",
        "timestamp": 1758469713
    },
    {
        "content": "<p>I think that writing a verified WASM interpreter in Lean would also be a fun project (I don't know if Lean is particularily well suited to do this)</p>",
        "id": 540666432,
        "sender_full_name": "Julia Scheaffer",
        "timestamp": 1758470126
    }
]