[
    {
        "content": "<p>Are we using the same notion of model as the one we use when talking about ZFC or theories of arithmetic? In these contexts, a model is a structure that satisfies a collection of sentences, where 'structure' is understood as an interpretation for the symbols for variables, constants, relations, and functions. </p>\n<p>If we're using the same concept of model, what is the collection of sentences in question here? i.e. what is the collection of axioms the model satisfies? Is it the valid typing judgments and valid steps in the derivation of typing judgments?</p>",
        "id": 478403823,
        "sender_full_name": "nrs",
        "timestamp": 1729653587
    },
    {
        "content": "<p>I'm sure you've read Mario's paper on the type theory of Lean. But for a general and simplified explanation, a type theory can always cast in a form that only involves functions and equations, just like how the axioms of groups involves multiplication (functions) and associativity (equations). This is a special case of first order theories, so the definition of models applies.</p>\n<p>But of course much stronger things are true: for example we can take direct products of type theory models just like how we can take direct products of groups, exactly because only equations are involved.</p>\n<p>Another caveat is we usually express these using multi-sorted theories. For example in the definition of a module (in commutative algebra), we have two sets R and M, and the scalar multiplication is a map <code>R * M -&gt; M</code>. The model theory for first order multi-sorted theories is essentially the same as the usual model theory you learn, but you just need multiple sets for the interpretation of variables, etc.</p>\n<p>For an extremely simple example, a model for a dependent type theory would contain a set <code>Ctx</code> that models the possible contexts, and a set <code>Typ</code> for types. There is an operation <code>ctx : Typ -&gt; Ctx</code> that assigns a type to the context it belongs in. So <code>isOdd n : Prop</code> is sent to the context <code>n : Nat</code>. Then there is a set <code>Term</code> and an operation <code>ty : Term -&gt; Typ</code>. So a typing judgement <code>x : X</code> is expressed as <code>ty(x) = X</code> and can be interpreted in the model.</p>",
        "id": 478408024,
        "sender_full_name": "Trebor Huang",
        "timestamp": 1729656366
    },
    {
        "content": "<p>It is a similar notion, but not quite the same. The kind of 'structure' you mention, with interpretations for functions and relations, is the data of a model of a <em>first-order</em> theory. ZFC and certain theories of arithmetic are all first-order theories. On the other hand, Lean is not a first-order theory but rather a <em>type theory</em>. The definition of model is correspondingly different, though in many ways analogous.</p>",
        "id": 478408136,
        "sender_full_name": "ğš ğš˜ğš“ğšŒğš’ğšğšŒğš‘ ğš—ğšŠğš ğš›ğš˜ğšŒğš”ğš’",
        "timestamp": 1729656456
    },
    {
        "content": "<p>Thank you very much for answers!</p>",
        "id": 478465916,
        "sender_full_name": "nrs",
        "timestamp": 1729680576
    }
]