[
    {
        "content": "<p>(I hope this topic is different enough from topic <code>Predictions for 2025</code>. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> )</p>\n<p>1) What you plan and/or hope to achieve in 2025, using Lean?<br>\n2) Happy Holidays! :)</p>",
        "id": 489808815,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1734543223
    },
    {
        "content": "<ul>\n<li>I plan to prove the correctness of the solution of Project Euler 3rd problem: see <a href=\"#narrow/channel/236449-Program-verification\">here</a></li>\n<li>I also plan/hope to start tinkering with SimpleGraph again, from very beginnings with something simple towards, dunno, as complex as I can afford. Better to be slow but stable (?), probably.</li>\n<li>I hope to start some standard functional programming, using Lean, and make some tiny working software maybe.</li>\n<li>And maybe something else too. It's probable (maybe some p=0.25) that I start studies in math September 2025, then I will try to do all the math using Lean, at least until it maybe becomes too hard.</li>\n</ul>\n<p>Ok, that's all! Happy Holidays and Happy 2025! <span aria-label=\"happy\" class=\"emoji emoji-1f600\" role=\"img\" title=\"happy\">:happy:</span></p>",
        "id": 489810102,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1734543695
    },
    {
        "content": "<p>I hope to have understood far better, by the end of 2025, just how hard it is to formalize the proof of \"[big list of hard theorems proved in the 1980s] -&gt; Fermat's Last Theorem\". I am entertaining the idea more and more that by the end of 2025 we will have made substantial progress towards this. Initially my argument that this \"must be hard\" was \"if we can do this then we must have formalised the Wiles and Taylor/Wiles papers in some form or other, and this is hundreds of pages of mathematics so it must be hard\" but now I am looking at what actually needs to be done and thinking \"do you know what, this doesn't seem too bad\". One switch in mindset I've had is that I am generating lots of preliminary work and leaving lots of <code>sorry</code>s for other people (or for me later on) but all these <code>sorry</code>s were certainly known in the 1980s, so if by the end of 2025 we have 200 open issues on the FLT repo but all of them correspond to mathematics known in the 1980s then, at least for the initial goal I've set out to prove, this doesn't matter.</p>",
        "id": 489812573,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1734544558
    },
    {
        "content": "<p>Get Lindemann Weierstrass landed <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 489812900,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1734544680
    },
    {
        "content": "<p>I think the biggest threat with the FLT project is that Andrew will get it done in a few months and then be out of a job for his PhD <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 489813171,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1734544791
    },
    {
        "content": "<p>In 2025, I hope that the specialized LLMs we LLM developers create for Lean theorem proving can truly be of help to all of you—the contributors in the Lean community—whether in a form similar to ChatGPT, GitHub Copilot, or something like Cursor. Connecting machines with humans has always been the ultimate goal for us, the developers of these machines. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 489815231,
        "sender_full_name": "Huajian Xin",
        "timestamp": 1734545537
    },
    {
        "content": "<p>I think we then say \"1980s? We meant 1960s\"</p>",
        "id": 489815576,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1734545671
    },
    {
        "content": "<p>hopefully have some sort ai based refactoring and metaproggraming capabilities. so that we can feed in a paper and get a bunch of preliminary definitions that can be distilled and refactored by us soup computers</p>",
        "id": 489816687,
        "sender_full_name": "Frederick Pu",
        "timestamp": 1734546079
    },
    {
        "content": "<p>on that I want to make miniF2F but for metaproggraming and have a library for writing certified parsers</p>",
        "id": 489817445,
        "sender_full_name": "Frederick Pu",
        "timestamp": 1734546362
    },
    {
        "content": "<ol>\n<li>Learn how Lean formalizes the basic topics of undergrad maths. Get some practice doing proofs with those topics.</li>\n<li>Learn how Lean works under the covers (questions like what's the architectural picture, when does computation happen, etc.). Or if that's too much/hard, learn how to learn about this (questions like how to trace what's going on inside Lean as I ask it to do something).</li>\n<li>Learn a bit more about the proof assistant, type theory, foundations, etc. landscapes. Like how Lean contrasts with Agda, why we opted to use type theory instead of set theory, and how the different type theories interact.</li>\n<li>Implement a toy dependent type system, and figure out how to map some Lean concepts onto it.</li>\n</ol>",
        "id": 489828516,
        "sender_full_name": "screentime",
        "timestamp": 1734550488
    },
    {
        "content": "<p>My goal for 2025 is to recruit more people in operator algebras to Lean and help them become proficient contributors to the formalization of the subject.</p>",
        "id": 489829603,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1734551015
    },
    {
        "content": "<p>i hope to get my free probability project (aiming for the free version of CLT) done and in shape to merge in mathlib</p>",
        "id": 489829819,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1734551129
    },
    {
        "content": "<p><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msubsup><mi>π</mi><mn>1</mn><mrow><mi mathvariant=\"normal\">e</mi><mi mathvariant=\"normal\">t</mi></mrow></msubsup><mo stretchy=\"false\">(</mo><msup><mi mathvariant=\"double-struck\">P</mi><mn>1</mn></msup><mo>∖</mo><mo stretchy=\"false\">{</mo><mn>0</mn><mo separator=\"true\">,</mo><mn>1</mn><mo separator=\"true\">,</mo><mi mathvariant=\"normal\">∞</mi><mo stretchy=\"false\">}</mo><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">\\pi_1^{\\mathrm{et}}(\\mathbb{P}^1\\setminus\\{0,1,\\infty\\})</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1.0641em;vertical-align:-0.25em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">π</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.7936em;\"><span style=\"top:-2.4519em;margin-left:-0.0359em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">1</span></span></span><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\"><span class=\"mord mathrm mtight\">et</span></span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.2481em;\"><span></span></span></span></span></span></span><span class=\"mopen\">(</span><span class=\"mord\"><span class=\"mord mathbb\">P</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8141em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">1</span></span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">∖</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">{</span><span class=\"mord\">0</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord\">1</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord\">∞</span><span class=\"mclose\">})</span></span></span></span> ;)</p>",
        "id": 489837839,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1734554450
    },
    {
        "content": "<p>My goal is to finally publish the stuff that I have been building up in lean for the last 1.5 years in various pieces of TCS, especiallt algorithms theory. Things are already beginning to look bright, in the sense that I am beginning to see simpler proof expositions than I find in the literature in a few places.  I also predict that in 2025, we might see the first formalises papers in algorithms conferences in general. </p>\n<p>But I am also not too keen to count my chickens before they hatch.</p>",
        "id": 489840719,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1734555723
    },
    {
        "content": "<p>As part of my candidacy exam, I am formalizing the categorical semantics of a few lambda calculi. If I get things in good enough shape, I'll consider a PR with hyperdoctrines and maybe CWFs as my first Mathlib contribution. </p>\n<p>For Advent of Code, I started porting Rust's <a href=\"https://docs.rs/pathfinding/latest/pathfinding/\">pathfinding crate</a>. I might put this up on my GitHub as a package after I clean things up a bit. I've been thinking a lot first about if I want to replicate their approach of using hashmaps that preserve insertion order and how to handle termination.</p>",
        "id": 489841067,
        "sender_full_name": "Chris Henson",
        "timestamp": 1734555862
    },
    {
        "content": "<p>express procedural languages such as C as a monad <code>M</code>. Then write an elaborator that elaborates C syntax into that monad <code>M</code> so that we can use leans do notation to construct ad-hoc dafney style proofs</p>",
        "id": 489842093,
        "sender_full_name": "Frederick Pu",
        "timestamp": 1734556325
    },
    {
        "content": "<p>One of my goals is to build a program logic in Lean. Hopefully, this will help me understand any technical differences between Lean and theorem provers with more longer histories in program verification like Rocq (I'm looking at you, generalized rewriting ;))</p>",
        "id": 489842512,
        "sender_full_name": "Markus de Medeiros",
        "timestamp": 1734556560
    },
    {
        "content": "<p>I am doing a lean game that follows my general topology course. I plan to finish it in the following months, and use it as additional material for the course in the next academic year (maybe grant some extra points to the students that finish it).</p>",
        "id": 489847744,
        "sender_full_name": "Miguel Marco",
        "timestamp": 1734559110
    },
    {
        "content": "<p>I'll probably be trying to:</p>\n<ul>\n<li>make <code>lean.nvim</code> feel even more polished so that a few more people use it</li>\n<li>write some more meaningful programming library for Lean -- possibly returning to a JSON Schema implementation or to embedding PyPy in Lean, or possibly trying to write something like a magic wormhole implementation</li>\n<li>Continue looking for a small piece of math I can learn enough to contribute to FLT in some tiny way</li>\n</ul>",
        "id": 489853695,
        "sender_full_name": "Julian Berman",
        "timestamp": 1734561686
    },
    {
        "content": "<p>With help from others:</p>\n<ul>\n<li>Finish the Carleson project</li>\n<li>Port a good part of it to Mathlib</li>\n<li>Start a new project formalizing research-level harmonic analysis</li>\n</ul>",
        "id": 489855846,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1734562713
    },
    {
        "content": "<p>Construct the monster vertex algebra (and its automorphism group).</p>",
        "id": 489866444,
        "sender_full_name": "Scott Carnahan",
        "timestamp": 1734568723
    },
    {
        "content": "<p>I hope to make more progress on AperiodicMonotilesLean, moving beyond setting up background definitions and API for tilings to things more directly related to the actual proofs of aperiodicity, as well as starting to PR the background definitions and API to mathlib.</p>\n<p>I also hope to expand the mathlib coverage of geometric definitions and API needed to at least state a greater proportion of past IMO problems idiomatically, if no-one else gets the relevant definitions and API into mathlib first.</p>",
        "id": 489872906,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1734573602
    },
    {
        "content": "<p>I hope to fully formalize succinct non-interactive arguments (SNARKs) this year. If finished, this will be a large-scale formalization of an important cryptographic primitive with practical impacts (lots of money on blockchains rely on these proof systems being sound).</p>\n<p>I also hope to avail myself of any AI tool that can speed up this formalization project. So far cursor has been helpful in making routine edits, but it would be nice to have a more integrated tool that can prove non-trivial theorems</p>",
        "id": 489876894,
        "sender_full_name": "Quang Dao",
        "timestamp": 1734576523
    },
    {
        "content": "<p>I hope to finish contributing to mathlib the proof that the error function isn't elementary</p>",
        "id": 489879254,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1734578212
    },
    {
        "content": "<p>I'm really interested in using Lean for ordinary software engineering tasks, with judicious use of the theorem-proving functionality in ways that eliminate the possibility of classes of bugs in a pretty concrete, user facing way. </p>\n<p>In particular I'd like to try to use lean to:</p>\n<ol>\n<li>write tooling that can interact with Git repositories</li>\n<li>computer graphics, and in particular setting as a goal writing an implementation of Tetris in Lean (and ultimately, maybe even some original games)</li>\n</ol>",
        "id": 489913025,
        "sender_full_name": "Greg Shuflin",
        "timestamp": 1734598247
    },
    {
        "content": "<p>I want to complete the easy direction of <a class=\"stream-topic\" data-stream-id=\"113486\" href=\"/#narrow/channel/113486-announce/topic/Regular.20Matroid.20Decomposition.20Theorem\">#announce &gt; Regular Matroid Decomposition Theorem</a> next year.</p>",
        "id": 489952141,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1734610710
    },
    {
        "content": "<p>I plan, even if it is just on my own time, to get a better sense of what are all the AI tools currently available for Lean.  How does one install them? How does one use them?  How does one make simple improvements to them?  And in what situations are they useful?  (I don’t think I have a lot of time for this given my other work and life responsibilities, so I’d also love for others to take this on as well.)</p>",
        "id": 489953583,
        "sender_full_name": "Jason Rute",
        "timestamp": 1734611187
    },
    {
        "content": "<p>My goal is to get more people involved in <a href=\"https://heplean.github.io/HepLean/\">HepLean</a>, from both the Lean and physics communities. In particular, I plan on developing the necessary infrastructure and foundations to make this easier.</p>",
        "id": 489972413,
        "sender_full_name": "Joseph Tooby-Smith",
        "timestamp": 1734617361
    },
    {
        "content": "<ul>\n<li>(perhaps still in 2024) show a better \"last updated\" value in the <a href=\"https://jcommelin.github.io/queueboard/index.html\">mathlib review and triage dashboard</a></li>\n<li>contribute to the Carleson project</li>\n<li>(with <code>Yury Kudriashov</code>) formalise Moreira's version of Sard's theorem, PR it to mathlib</li>\n<li>ensure Morse-Sard's theorem on manifolds lands in mathlib</li>\n<li>perhaps: define Sobolev spaces and prove the Sobolev embedding theorem</li>\n<li>perhaps: some fun differential geometry project, such as defining Riemannian metrics</li>\n<li>(with others) create a German version of lean-verbose and use it for teaching math first-years</li>\n</ul>",
        "id": 489976300,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1734618634
    },
    {
        "content": "<p>Right now my plans are to:</p>\n<ul>\n<li>Finish all my ordinal refactors so people stop complaining <span aria-label=\"stuck out tongue\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"stuck out tongue\">:stuck_out_tongue:</span></li>\n<li>(With help of others) get combinatorial game theory into a more workable place, and start formalizing some actual games!</li>\n<li>Prove nimbers are algebraically complete</li>\n<li>Potentially, start learning about PCF theory and get it into Mathlib</li>\n</ul>",
        "id": 491150943,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1735452757
    },
    {
        "content": "<ol>\n<li>Recreate my blog post about the Mercator projection as a connection (thus straight lines are different from the shortest distance and the connection has torsion).</li>\n<li>Principal bundles, connections as differential forms, curvature as a differential form, Einstein's equation via Cartan (is this even possible?), gravitational waves (lol)</li>\n<li>Brownian motion, Black-Scholes</li>\n</ol>",
        "id": 491152765,
        "sender_full_name": "Dominic Steinitz",
        "timestamp": 1735454932
    },
    {
        "content": "<p>I want to explore Lean for program verification, in particular using the <a href=\"https://github.com/AeneasVerif/aeneas\">aenas</a> Rust verification toolchain to verify a SPHINCS+ implementation, and try to use macros/automation to streamline the process for the verification of other cryptographic algorithms / programs.</p>\n<p>Also, the creator of <a href=\"https://github.com/getkyo/kyo/\"><code>kyo</code></a>, an effect system for Scala, has shown interest in formalizing the kernel of <code>kyo</code>, so I'd love to make a meaningful contribution to that project in Lean.</p>",
        "id": 491172645,
        "sender_full_name": "Ayhon",
        "timestamp": 1735475436
    }
]