[
    {
        "content": "<p>where is <code>Lean.ofReduceNat</code> used?</p>\n<p>I find <code>Lean.ofReduceBool</code> when I use native_decide, but I haven't seen <code>Lean.ofReducedNat</code>as an axiom in outputs of <code>#print axioms</code></p>",
        "id": 522357533,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1749043337
    },
    {
        "content": "<p><a href=\"#narrow/channel/113489-new-members/topic/Where.20is.20the.20axiom.20.60ofReduceNat.60.20used.3F/near/509653198\">#new members &gt; Where is the axiom &#96;ofReduceNat&#96; used? @ 💬</a></p>",
        "id": 522362704,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1749044599
    },
    {
        "content": "<p>I am of the opinion that we should remove it</p>",
        "id": 522363048,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1749044674
    },
    {
        "content": "<p>yeah bugs hide in unused features as they're less tested. it's been a while and no one has come up with a way to use ofReduceNat</p>",
        "id": 522367475,
        "sender_full_name": "(deleted)",
        "timestamp": 1749045694
    },
    {
        "content": "<p>there's an argument that ofReduceNat extracts more information from a native call than ofReduceBool. well the thing is it's possible to state all sorts of properties with ofReduceBool already</p>",
        "id": 522368356,
        "sender_full_name": "(deleted)",
        "timestamp": 1749045896
    },
    {
        "content": "<p>if ofReduceNat reduces a function call to 37, then ofReduceBool can be used to get a proof that that the function call returns 37 instead</p>",
        "id": 522368990,
        "sender_full_name": "(deleted)",
        "timestamp": 1749046042
    },
    {
        "content": "<p>indeed, as long as you are willing to run the compiled code twice, you can always replace an <code>ofReduceNat</code> proof with <code>ofReduceBool</code>. (Run the function in meta code, observe the result, then assert that the function equals its result using <code>ofReduceBool</code> and let the kernel do the verification.) I don't think you can really avoid having to run the code twice anyway though with <code>ofReduceNat</code>, because if you are creating a call where you really don't know what it's going to reduce to because you have not run the function and will rely on the kernel to do that, then you will have difficulty writing the remainder of the proof in a type correct way because the immediately next lemma application is going to contain the reduced form inside its typing constraints.</p>",
        "id": 522451289,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1749071057
    }
]