[
    {
        "content": "<p>One thing that I really found missing while trying to learn LEAN for the first time was something like Software Foundations. I found Software Foundations amazing since I could read <em>all</em> of it just from my editor (EMACS) and interactively step through the proofs. There are quite a few books for LEAN that have a lean project that is meant to be accompanied with reading of a PDF/markdown page, but I feel like the best way to learn a programming language is to spend time writing programs in it, and a separate markdown book distracts from the experience somewhat.</p>\n<p>So, after consulting with Leo, I'm thinking of trying to attempt this translation myself. Of course there will be a differences that would need careful handling. For example, tactics in LEAN feel much more refined than the ones in Rocq (atleast, in the time the book was being written), so it might be worth spending more effort in introducing the tactic language early on/to investigate it in more detail. There might also be some differences caused by universe polymorphism in LEAN (which is not available by default in Rocq) that are also worth looking into but I'm not sure, such quirks will become more apparent during the process of the translation. At the very least, I feel like it requires careful thought and discussion.</p>\n<p>I've made a <a href=\"https://github.com/satiscugcat/software-foundations-lean\">github repo</a> for this, but as of this moment, it contains only an initialised LEAN project.</p>",
        "id": 524954295,
        "sender_full_name": "Sati",
        "timestamp": 1750372012
    },
    {
        "content": "<p>You will find that at least the material covered in volume 1 will need substantial revision. I worked through the first few chapters in lean in early 2024</p>",
        "id": 524954441,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750372147
    },
    {
        "content": "<p>There are substantial differences in the way we use supposedly analogous tactics between Rocq and Lean</p>",
        "id": 524954476,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750372183
    },
    {
        "content": "<p>For example I recall that they use reflexivity quite often and their simpl tactic does not close those goals</p>",
        "id": 524954511,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750372226
    },
    {
        "content": "<p>And there is a lot of material dedicated to inversion which is taken care of easily by Lean’s cases tactic</p>",
        "id": 524954526,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750372243
    },
    {
        "content": "<p>Further lean has a lot of different ways of peforming induction which might be useful in PL proofs but aren’t described in vol 1. For example functional induction.</p>",
        "id": 524954585,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750372296
    },
    {
        "content": "<p>Yeah, that makes sense, in general I've also felt that Rocq primitives are less sophisticated than LEAN (like LEAN's match, with which when working with dependent types, does case elimination which Rocq's match .. with .. end does not). Tactics also mesh much better with other program primitives.</p>",
        "id": 524955159,
        "sender_full_name": "Sati",
        "timestamp": 1750372935
    },
    {
        "content": "<p>I wouldn’t say they are better or worse since those are determined by subjective standards. I am just saying that there are substantive differences both in terms of tactic behaviour and proof culture. Further the differences mean that beyond the basic conceptual and pedagogical idea behind volume 1, the whole content and organisation needs some careful rethinking</p>",
        "id": 524956101,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750373899
    },
    {
        "content": "<p>Right, I get what you mean. I'll try to take some time to think about this. (Also, I should have been more careful with my wording, I don't think one is objectively better/worse either.)</p>",
        "id": 524956373,
        "sender_full_name": "Sati",
        "timestamp": 1750374094
    },
    {
        "content": "<p>You could try writing it in verso using the manual template. It gives a lot of interactivity for free within the compiled book</p>",
        "id": 524956457,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750374163
    },
    {
        "content": "<p>Yeah, I took a look at Verso earlier, and I'm not completely sure if it does what I want. As far as I understand, it allows you to write in a DSL in LEAN, which you can get a compiled book/page out of. But for someone looking at the source code, it'd just be confusing, and I want the reader to be able to navigate the book entirely through the source code as easily as possible, if that makes sense. Do correct me if I have a misunderstanding about something.</p>",
        "id": 524956859,
        "sender_full_name": "Sati",
        "timestamp": 1750374574
    },
    {
        "content": "<p>There is a tool called subverso that lets you separate the code from the text by allowing you to insert code references into it. I don’t fully understand how it works, but it is worth pinging the experts on this.</p>",
        "id": 524957386,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750375085
    },
    {
        "content": "<p>Hmm, Ill try to take a better look into it, but generally I'm deeply hesitant towards using a tool that modifies the language itself, because for someone stepping through the program files, it'd be distracting.</p>",
        "id": 524957808,
        "sender_full_name": "Sati",
        "timestamp": 1750375456
    },
    {
        "content": "<p>Depending on what sort of interactivity you seek however verso might be sufficient. Just the generic verso output provides very rich interactivity for the codeblocks</p>",
        "id": 524957837,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750375487
    },
    {
        "content": "<p>You can click and check definitions. Look at proof states line by line and so on</p>",
        "id": 524957874,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750375517
    },
    {
        "content": "<p>Hmmm</p>",
        "id": 524957991,
        "sender_full_name": "Sati",
        "timestamp": 1750375641
    },
    {
        "content": "<p>There's actually a part in hoare logic where <code>inversion</code> is much much easier than without it.</p>",
        "id": 524965261,
        "sender_full_name": "Quinn",
        "timestamp": 1750381857
    },
    {
        "content": "<p>I still haven't cracked <code>hoare_while</code> in lean!</p>",
        "id": 524972321,
        "sender_full_name": "Quinn",
        "timestamp": 1750389858
    },
    {
        "content": "<p>Is your code available somewhere so I can try it out?</p>",
        "id": 525014728,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1750414534
    },
    {
        "content": "<p>i'll DM you! it's a part of a larger product I don't want to post publicly yet</p>",
        "id": 525024674,
        "sender_full_name": "Quinn",
        "timestamp": 1750418658
    }
]