[
    {
        "content": "<p>We're currently running (with <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> and <span class=\"user-mention\" data-user-id=\"130609\">@Antoine Chambert-Loir</span> and many others on here) the \"Lean for Mathematicians\" workshop at the Simons foundation, and so a number of new people are joining zulip. It was reported to me that it's somewhat difficult for newcomers to figure out how to use zulip, where to post what kinds of questions. (E.g., \"new members\" thread vs \"Is there code for X\" thread vs \"general\", etc etc) Do we have something like a \"welcome package\"? Does anyone get alerted when a new member joins? If so, maybe there could be a (presumably automated?) welcome message that goes out, and gives some helpful hints about how to interact on here (use your real name, be cordial, write MWEs, etc)? Just a thought... Thanks!</p>",
        "id": 524359978,
        "sender_full_name": "Alex Kontorovich",
        "timestamp": 1750126369
    },
    {
        "content": "<p>There are no alerts for Zulip admins, as far as I know. Ideally we would be able to customize the welcome message to point to a link, but the PR for that is still open: <a href=\"https://github.com/zulip/zulip/pull/32862\">https://github.com/zulip/zulip/pull/32862</a></p>",
        "id": 524363189,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1750129213
    },
    {
        "content": "<p>Nevertheless, we could still write that message, and post it on our website. Then people can point to it.</p>\n<p>If someone wants to post a first draft, I think we can get something ready today.</p>",
        "id": 524368787,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1750133958
    },
    {
        "content": "<p>Moreover, we could probably write our own welcome bot. I'm not sure if we can actually detect a user being created, but surely we can detect the first time they post. (Presumably such a bot would need to live on someone's server, however.)</p>",
        "id": 524375006,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1750138649
    },
    {
        "content": "<p>Given that the PR is not stalled and marked as high prio, I think we can wait for it a little longer and see whether that fulfills our needs</p>",
        "id": 524386508,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1750144770
    }
]