[
    {
        "content": "<p>Hi!</p>\n<p><span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> and I are teaching a Lean course in the fall semester. I am considering to add a large exercise/small project to ask the students to formalize their favorite conjecture and make a PR to <code>formal-conjectures</code>. Would this be welcome?</p>\n<p>More details:</p>\n<ul>\n<li>This would entail approx. 30-60 PRs by relatively new Lean users (~1 month of experience)</li>\n<li>We will require that the formalization is carefully checked by another student before making a PR (hopefully lessening the reviewing burden)</li>\n<li>We will make sure there are 1-2 follow-up exercises to incorporate reviewer comments into their PR, so that the PRs don't get abandoned.</li>\n<li>Probably the PRs will actually come in ~2 months</li>\n</ul>\n<p>For the students, this is good practice both in git and in Lean. It would be nice if these PRs get reviewed within ~1 week, if possible. It is very possible that some students will find this interesting, and voluntarily start making more PRs.</p>",
        "id": 541178459,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1758704771
    },
    {
        "content": "<p>Hi! That would be great - I'm quite happy to support this on the reviewing &amp; merging side of things. Out of curiosity, have you already decided where these conjectures would be sourced? (or perhaps this will be left up to the students?)</p>",
        "id": 541179787,
        "sender_full_name": "Paul Lezeau",
        "timestamp": 1758705194
    },
    {
        "content": "<p>Great!<br>\nI think I would mostly leave it up to the students, but of course I can guide them by giving a couple of sources. Do you have suggestions for sources?</p>",
        "id": 541187186,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1758707370
    },
    {
        "content": "<p>Oh, one complication: I cannot force the students to sign the contributor license agreement with Google... I could still ask them to do this, and provide an alternative for the students that don't want to do this...</p>",
        "id": 541188253,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1758707724
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"111080\">Floris van Doorn</span> <a href=\"#narrow/channel/524981-Formal-conjectures/topic/student.20exercise.3A.20contributing.20to.20formal.20conjectures/near/541187186\">said</a>:</p>\n<blockquote>\n<p>Great!<br>\nI think I would mostly leave it up to the students, but of course I can guide them by giving a couple of sources. Do you have suggestions for sources?</p>\n</blockquote>\n<p>Re sources, I think conjectures from papers (arXiv/other places!) could be a good source, particularly for students that are interested in flavours of maths that don't appear too much in e.g. the Erdős problems list. </p>\n<p>If that's helpful, we can set up an issue on the repo and add a few suggestions (this might also be helpful later to avoid duplication of work among the students!)</p>",
        "id": 541197622,
        "sender_full_name": "Paul Lezeau",
        "timestamp": 1758710822
    },
    {
        "content": "<p>That sounds great! We'd be happy to have the students contribute and will do our best to review these PRs quickly!</p>",
        "id": 541211634,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1758715429
    },
    {
        "content": "<p>Coming back to this: we're assigning the project this week, and ask the students to create a first version in 1-2 weeks, so expect some PRs from new contributors over the next weeks. There are about 40 students taking the class, and they can do this either alone or in pairs.</p>\n<p>We cannot force the students to create a Google account / sign the contributor license agreement with Google. We will strongly encourage every student to do this and make a PR, but for the students that don't want to do this, they can make a PR to <a href=\"https://github.com/fpvandoorn/formal-conjectures/\">my fork</a> of formal conjectures (in which case we will review the PRs).</p>",
        "id": 554698341,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1762780692
    },
    {
        "content": "<p>cool, looking forward to the contributions!</p>",
        "id": 554698594,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1762780768
    },
    {
        "content": "<p>Just of of curiosity, can you force the students to have a Github account?</p>",
        "id": 554698958,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1762780858
    },
    {
        "content": "<p>No. I will make special arrangements if a students doesn't want to create a GitHub account. This hasn't happened yet.<br>\nA Google account does feel a bit different, so there I will explicitly communicate an alternative option.</p>",
        "id": 554702089,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1762781784
    },
    {
        "content": "<p>For students that don't wish to sign the CLA/create a Google account, one alternative that <span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> and I have discussed <a href=\"https://github.com/google-deepmind/formal-conjectures/pull/1186\">here</a> would be the following:</p>\n<ol>\n<li>The students open a PR, which is then reviewed and so on</li>\n<li>Once the review process is complete, someone (e.g. me) opens a \"shadow\" PR referencing the original one with the student as a co-author (and adding their name to the list of formal-conjecture contributors if they are happy with that)</li>\n</ol>",
        "id": 554923663,
        "sender_full_name": "Paul Lezeau",
        "timestamp": 1762870604
    },
    {
        "content": "<p>I'm not sure if the CLA permits that workaround</p>",
        "id": 555218393,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1762980009
    },
    {
        "content": "<p>Has DeepMind considered \"donating\" formal-conjectures to leanprover-community? The Lean community (unfortunately) doesn't use copyleft licenses, so that shouldn't be a problem.</p>",
        "id": 555575270,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1763123204
    },
    {
        "content": "<p>I can imagine a few strategic reasons why folks would want very tight control of the project, but I can't imagine people would deliberately break whatever CI checks are put in place to avoid incompatibilities with DeepMind internal use. Maybe it's possible to do it without changing maintainership?</p>",
        "id": 555575689,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1763123355
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"325367\">Mauricio Collares</span> <a href=\"#narrow/channel/524981-Formal-conjectures/topic/student.20exercise.3A.20contributing.20to.20formal.20conjectures/near/555575270\">said</a>:</p>\n<blockquote>\n<p>Has DeepMind considered \"donating\" formal-conjectures to leanprover-community? The Lean community (unfortunately) doesn't use copyleft licenses, so that shouldn't be a problem.</p>\n</blockquote>\n<p>I like this idea of moving formal-conjectures to the leanprover-community github organization! Especially when there is more contributions from outside Google DeepMind (which we hope very much to become more and more the case).  </p>\n<p>In any case, I hope the current requirements are  not holding back too many people. While I can see that a teaching situation in a public university might be special/different, having CLAs in place for open source projects seems to be the norm.  For instance tensorflow, chromium, android, keras, jax, alphafold, cirq all require a CLA and the CLA-signing for those also require a Google account (which can exclusively be used for that, I suppose).</p>",
        "id": 556630765,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1763236767
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"325367\">Mauricio Collares</span> <a href=\"#narrow/channel/524981-Formal-conjectures/topic/student.20exercise.3A.20contributing.20to.20formal.20conjectures/near/555575689\">said</a>:</p>\n<blockquote>\n<p>I can imagine a few strategic reasons why folks would want very tight control of the project, but I can't imagine people would deliberately break whatever CI checks are put in place to avoid incompatibilities with DeepMind internal use. Maybe it's possible to do it without changing maintainership?</p>\n</blockquote>\n<p>I wouldn't worry much about those incompatibilities, we could manage, I suppose, especially if maintainership is kept.</p>",
        "id": 556630828,
        "sender_full_name": "Moritz Firsching",
        "timestamp": 1763236842
    }
]