[
    {
        "content": "<p>This channel is a space to discuss the formalization of categorical and 2-categorical aspects of fibrations via displayed categories. </p>\n<p>A displayed category over a category <code>C</code> is a structure equivalent to \"a category <code>D</code> and functor <code>F : D ⥤ C</code>\", but instead of having a single collection of objects of <code>D</code> with a map <code>F.obj</code> to the objects of <code>C</code>, the objects are given as a family indexed by objects of <code>C</code>, and similarly for the morphisms. Similarly, Grothendieck fibrations can be formulated in a \"displayed\" way, and this formulation crucially avoids any reference to equality on objects, in contrast to the standard definition of Grothendieck fibrations. Working with equality of objects and rewriting along them leads one to the so-called dependent hell for rewriting. The hope is that we can use displayed categories to avoid the dependent hell while developing the theory of fibrations. </p>\n<p>A definition of displayed categories, its basic API, and the notion of displayed Grothedieck fibration is formalized in </p>\n<p><a href=\"https://github.com/sinhp/displayed_categories\">https://github.com/sinhp/displayed_categories</a></p>",
        "id": 515147290,
        "sender_full_name": "Sina Hazratpour 𓃵",
        "timestamp": 1745956584
    },
    {
        "content": "<p>Hello! I took the liberty to register to this channel because I am interested in getting the equivalence between fibrations over <code>C</code> and pseudofunctors to <code>Cat</code> in mathlib at some point. So I figured the topic would interest me.<br>\nFyi, while this is not directly related to displayed categories nor fibrations, I am currently working (privately for now) on bringing a nice API for \"categorical pullback\" of categories (i.e pullbacks in the (2,1)-category sense, in which the square only commutes up to a specified natural isomorphism), and I hope to include a proof that (co)cartesian fibrations (aka (co)fibered categories) are stable under such pullbacks.</p>",
        "id": 515150070,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1745957691
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"286014\">Robin Carlier</span> <a href=\"#narrow/channel/500728-Displayed-Categories/topic/Welcome.20.26.20Intro/near/515150070\">said</a>:</p>\n<blockquote>\n<p>Hello! I took the liberty to register to this channel because I am interested in getting the equivalence between fibrations over <code>C</code> and pseudofunctors to <code>Cat</code> in mathlib at some point. So I figured the topic would interest me.<br>\nFyi, while this is not directly related to displayed categories nor fibrations, I am currently working (privately for now) on bringing a nice API for \"categorical pullback\" of categories (i.e pullbacks in the (2,1)-category sense, in which the square only commutes up to a specified natural isomorphism), and I hope to include a proof that (co)cartesian fibrations (aka (co)fibered categories) are stable under such pullbacks.</p>\n</blockquote>\n<p>great, while hereafter i am mostly going to be involved reviewing PRs I know that <span class=\"user-mention\" data-user-id=\"587858\">@Fernando Chu</span> is also interested in formalizing the equivalence you mentioned, so maybe a good idea to coordinate with him here about this. Feel free to PR any new changes.</p>",
        "id": 515243946,
        "sender_full_name": "Sina Hazratpour 𓃵",
        "timestamp": 1746002781
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 515291497,
        "sender_full_name": "Sina Hazratpour 𓃵",
        "timestamp": 1746016270
    }
]