[
    {
        "content": "<p>I am still a very novice Lean/Mathlib user, but with interest in formalising mathematics for some time (coming from Coq, which is more commonly used in the Computer Science community, esp. in France). I just started a personal project and spent most of a day browsing the documentation of Mathlib to try to find out how to do things at least half right (I need polynomials and power series in noncommutative variables, which I don't think is there at the moment).</p>\n<p>My question here is rather methodological: how to understand how the Mathlib library works. There are a lot of structures out there, and I am clearly getting lost. The fact that many algebraic structures exist in both \"additive\" and \"multiplicative\" variants doesn't make things any easier (even though I understand this, partly).</p>\n<p>Just looking at the definition of a class it not sufficient, as some definitions are clearly equivalent even though they are intended for different purposes. <code>Zero</code>(types with a distinguished zero element) and <code>Inhabited</code> (types with a distinguished default element) are equivalent, though of course the intent of what to do with them is different; <code>Add</code> and ``Mul``` are also the same thing, types with an internal binary operation. So the intent has to be somehow described somewhere, otherwise the user cannot know which one to use. I understand that some notations can be attached to a class, but looking at the source code or browsing the documentation doesn't show that, at least not simply.</p>\n<p>Is there a place I can go to catch on quicker?</p>\n<p>(Sorry, accidentally posted before I was done)</p>",
        "id": 476062837,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1728545686
    },
    {
        "content": "<p>Indeed, just browsing through mathlib sources will not point you towards good practices or explain the design decisions. I would start with <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a>.</p>",
        "id": 476063583,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1728545875
    },
    {
        "content": "<p>Indeed, <strong>Mathematics in Lean</strong> is among my bookmarks too. I've tried reading it from scratch at least twice, always having trouble when things start getting rough (around the \"Structures\" and \"Hierarchies\" chapters, which at least seems coherent with my preoccupations) - and I need to get to at least the \"Topology\" part, which won't be a walk in the park since I learned topology 35-40 years ago without the \"filter\" word ever being pronounced.</p>\n<p>Now, maybe my idea of getting in by formalising some topic from scratch instead of some results from an established topic is not the best.</p>",
        "id": 476065604,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1728546382
    },
    {
        "content": "<p>It depends also on what you mean by \"from scratch\"</p>",
        "id": 476082631,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1728550951
    },
    {
        "content": "<p>But as a first project (though I'm hardly an expert myself) it's probably easier to prove some property of existing objects in mathlib as opposed to defining something altogether new and then proving stuff about it</p>",
        "id": 476082895,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1728551037
    },
    {
        "content": "<blockquote>\n<p>(I need polynomials and power series in noncommutative variables, which I don't think is there at the moment).</p>\n</blockquote>\n<p>I think the former is <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=TensorAlgebra#doc\">docs#TensorAlgebra</a> ?</p>",
        "id": 476089580,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1728553143
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/stream/113489-new-members/topic/.28Documentation.29.20.22Reading.22.20the.20Mathlib.20library/near/476089580\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>(I need polynomials and power series in noncommutative variables, which I don't think is there at the moment).</p>\n</blockquote>\n<p>I think the former is <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=TensorAlgebra#doc\">docs#TensorAlgebra</a> ?</p>\n</blockquote>\n<p>It might, but I'm not sure because I didn't pay enough attention in these algebra classes a long time ago.</p>\n<p>I see the library assumes a commutative semiring for the coefficients; at least some of the theory I had in mind doesn't need commutativity (though most interesting examples will be commutative I guess).</p>\n<p>Thanks for the replies anyway.</p>",
        "id": 476128639,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1728565282
    }
]