[
    {
        "content": "<p>I'm a bit confused about the use of ×ₘ for the pair (f, g). The docstring says</p>\n<blockquote>\n<p>Construct a morphism in a product category by giving its constituent components.<br>\nThis constructor should be preferred over <code>Prod.mk</code>, because lean infers better the<br>\nsource and target of the resulting morphism.</p>\n</blockquote>\n<p>but why is it then not used in e.g. Mathlib/CategoryTheory/Functor/Currying.lean? Also, why does the simp lemma <code>prod_comp</code> simplify to <code>(f.1 ≫ g.1, f.2 ≫ g.2)</code> and not to <code>(f.1 ≫ g.1 ×ₘ f.2 ≫ g.2)</code>, would it make any difference?</p>\n<p><del>I'm not 100% sure but I think it makes a difference and the reason why stuff like <code>rw[← curryObj]</code> does't work in my current project is that <code>curryObj</code> doesn't use <code>×ₘ</code> but I am.</del></p>\n<p>Ah, nvm, I think the last line is not true. So it's probably just cosmetics, but still curious what difference it makes and when we should use <code>×ₘ</code>, because some of my terms only type check when using ×ₘ, so I assume there is something deeper going on?</p>",
        "id": 538099946,
        "sender_full_name": "Klaus Gy",
        "timestamp": 1757272945
    },
    {
        "content": "<p>The fact that some of your terms only type check when using <code>×ₘ</code> is precisely what the docstring means when it says that \"lean infers better the source and target of the resulting morphism\". Using a type synonym like <code>×ₘ</code> makes your code 'line up' more directly with the definitions and lemmas defined for product categories, so Lean is more likely to find the 'right' types/implicit arguments on its own.</p>",
        "id": 538200674,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1757331467
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"359992\">@Robert Maxton</span>  Yes, that's also how I understood it, but then sometimes <code>simp</code> drops the <code>×ₘ</code> e.g. in <code>prod_comb</code>, or the currying definition doesn't use them. So I feel when sticking to <code>f ×ₘ g</code>, one needs to constantly be aware to not use lemmas which change it to <code>(f, g)</code> instead.</p>\n<p>Is there a good reason why <code>(f, g)</code> is still used in so many places in mathlib?</p>",
        "id": 538205948,
        "sender_full_name": "Klaus Gy",
        "timestamp": 1757332927
    },
    {
        "content": "<p>Unfortunately, there is some tension around <code>simp</code>-normal forms. Ideally, you would like <code>simp</code> to stay \"within the specific library's notation\" exactly until there are no more specific lemmas to simplify with, then to unfold the notation into some simpler/more general form, and then repeat the process. But it's often quite difficult to even pinpoint that line at all, never mind get <code>simp</code> to cooperate. (I am currently running into exactly this problem in <code>TopCat</code>, where many expressions are best simplified as categorical compositions and only reduced to compositions of <code>ContinuousMap</code>s as a last resort.)</p>",
        "id": 538206877,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1757333161
    },
    {
        "content": "<p>In this case, I would imagine that whoever wrote the library thought that once you pass the initial point of 'making Lean infer the types of theorem statements', it's more useful to reduce <code>×ₘ</code> to <code>Prod</code> which has a <em>ton</em> of API for it</p>",
        "id": 538207123,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1757333225
    },
    {
        "content": "<p>But this may in fact be untrue</p>",
        "id": 538207195,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1757333245
    },
    {
        "content": "<p>At any rate, you may consider just using <code>attribute [-simp] &lt;unhelpful simp lemmas&gt;</code> within your own code at first, and then if you consistently find yourself <code>-simp</code>ing the same lemmas put forth a PR or suggestion to that effect later</p>",
        "id": 538207360,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1757333293
    },
    {
        "content": "<p>Thanks a lot for the good explanation! I didn't know <code>attribute [-simp]</code>, that sounds really helpful :)</p>",
        "id": 538208030,
        "sender_full_name": "Klaus Gy",
        "timestamp": 1757333488
    }
]