[
    {
        "content": "<p>I have read Lean FRO's roadmap (<a href=\"https://lean-fro.org/about/roadmap/\">https://lean-fro.org/about/roadmap/</a>) and found this text. What \"seamlessly integrate and switch between different languages within Lean\" means? </p>\n<p>Can we write other programming languages such as Rust, Julia, C++... in Lean? I don't understand this.</p>\n<div class=\"codehilite\" data-code-language=\"Markdown\"><pre><span></span><code><span class=\"gu\">### 10\\. Language Extensibility</span>\n\n<span class=\"gs\">**Description**</span>: A key goal for Lean is to enhance its extensibility to support complex standalone and embedded languages effectively. This aspect of development focuses on making Lean adaptable and versatile in handling a variety of programming and markup languages, which is essential for its broader applicability and user engagement.\n\n<span class=\"gs\">**Inspiration from Racket**</span>: Drawing inspiration from the <span class=\"sb\">`#lang`</span> feature in Racket, which allows a source file to indicate that it's written in a separate language with its own syntax, we aim to bring similar functionality to Lean. This feature would allow users to seamlessly integrate and switch between different languages within Lean, enhancing its flexibility and usability for diverse programming needs.\n\n<span class=\"gs\">**Improvements to Grammar Authoring Tools**</span>: In theory, Lean parsers can be created to parse arbitrary languages today. In practice, valuable tools for doing so that have been created for implementing the Lean language itself are not sufficiently generic yet to support all language authors, especially around the handling of custom tokens. We aim to support creators of both embedded and standalone languages in Lean better in this regard.\n\n<span class=\"gs\">**Project Leadership**</span>: Sebastian Ullrich is leading the development of this crucial component. His expertise and vision are instrumental in guiding the project towards achieving these ambitious goals of language extensibility.\n\n<span class=\"gs\">**Suitability for Contributors**</span>: Given the technical complexity and innovative nature of this component, it is best suited for contributors with a strong background in software development.\n</code></pre></div>",
        "id": 438397585,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1715616231
    },
    {
        "content": "<p>We have <a href=\"https://github.com/tydeu/lean4-alloy\">https://github.com/tydeu/lean4-alloy</a> as an example of this.</p>",
        "id": 438415134,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1715622006
    },
    {
        "content": "<p>But I think this comment is more about Lean4's extensive metaprogramming capabilities</p>",
        "id": 438415313,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1715622091
    },
    {
        "content": "<p>Oh, <a href=\"https://github.com/leanprover/verso\">verso</a> should also be mentioned here.</p>",
        "id": 438415492,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1715622151
    },
    {
        "content": "<p>You mean, switch DSL in Lean?</p>",
        "id": 438499970,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1715661345
    }
]