[
    {
        "content": "<p>Q1. In the statement </p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">Odd</span><span class=\"w\"> </span><span class=\"mi\">13</span>\n</code></pre></div>\n<p>is <code>Odd</code> a <strong>type</strong>? What is the correct terminology?</p>\n<hr>\n<p>Q2. In the statement </p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">Odd</span><span class=\"w\"> </span><span class=\"o\">(</span><span class=\"mi\">13</span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">ℤ</span><span class=\"o\">)</span>\n</code></pre></div>\n<p>Is ℤ a <strong>type</strong> also?</p>",
        "id": 476432954,
        "sender_full_name": "rzeta0",
        "timestamp": 1728668571
    },
    {
        "content": "<ol>\n<li>No, <code>Odd</code> is a function that returns a <code>Prop</code>, which might be called a \"predicate\". <code>Odd (13 : ℤ)</code> is a <code>Prop</code>. It's mostly ok to say that <code>Odd (13 : ℤ)</code> is a \"type\" and <code>Odd</code> is a \"family of types\", but you can't say it is a <code>Type</code> or \"family of <code>Type</code>s\".</li>\n<li>Yes, <code>ℤ : Type</code>, which you can check with <code>#check ℤ</code></li>\n</ol>",
        "id": 476433490,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1728668835
    },
    {
        "content": "<p>Are you using \"type\" informally, and <code>Type</code> as something built into Lean?</p>\n<p>I need to explore this more as I was surprised by  your answer.</p>\n<p>So <code>13</code> is not of type <code>Odd</code>. If I accept this, and go with <code>Odd 13</code> is a predicate, meaning it is true or false, then <code>Odd</code> must be a property of 13. </p>\n<p>Is \"<strong>property</strong>\" correct terminology? </p>\n<p>So <code>Odd</code> and <code>Even</code> are properties that are defined in Mathlib, and can be true or false when applied to a number.</p>\n<p>... just thinking out loud.</p>",
        "id": 476459810,
        "sender_full_name": "rzeta0",
        "timestamp": 1728681163
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"724904\">rzeta0</span> <a href=\"#narrow/stream/113489-new-members/topic/.60Odd.20.2813.3A.20.20.E2.84.A4.29.60.20-.20is.20Odd.20a.20.22type.22.3F/near/476459810\">said</a>:</p>\n<blockquote>\n<p>Are you using \"type\" informally, and <code>Type</code> as something built into Lean?</p>\n</blockquote>\n<p>Yes, arguably the Lean spelling of \"type\" as in \"type theory\" is <code>Sort u</code>, which generalizes over <code>Type</code> and <code>Prop</code></p>",
        "id": 476463206,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1728682958
    },
    {
        "content": "<p>So 24 hours later with some thinking about this .. I think I've come to the following understanding:</p>\n<ul>\n<li><code>13</code> has a <code>type</code>, and that is natural number.</li>\n<li><code>Odd</code> is <strong>definition</strong>. Objects conform to that definition or not. If they do, then the statement <code>Odd n</code> is true, else false.  </li>\n<li>It just so happens the <code>Odd</code> is implemented as a function with an input and output. Other definitions which result in true/false don't have to be a function?</li>\n</ul>\n<p>Is this correct? Or at least not wrong?</p>",
        "id": 476557410,
        "sender_full_name": "rzeta0",
        "timestamp": 1728772770
    },
    {
        "content": "<p>You are inventing new words for \"predicate\" and for <code>Prop</code> (i.e. proposition) it sounds like. So it's hard to say whether it's correct or not -- if the mental model helps you, great -- Otherwise what you're calling <code>definition</code> is what Eric suggested \"predicate\" for, and what you're calling \"thing which is true or false\" is more or less what Lean calls <code>Prop</code> (though it is not really precisely \"true or false\" but rather \"thing which has a proof if it's true and which will not if it's not true\").</p>",
        "id": 476558048,
        "sender_full_name": "Julian Berman",
        "timestamp": 1728773638
    },
    {
        "content": "<p><del>\"Is equal to 37 or equal to 73\" is I believe what you in your terminology would call \"a definition which is implemented as a function which takes <em>2</em> inputs\". You give me a number and I prove if it's either 37 or 73 (and then it's true) or else I cannot in which case it's false.</del></p>\n<p>Actually I guess here \"two numbers where the first number is 37 times the second number\" is the example for a Prop-valued function of 2 arguments, you give me 2 numbers <code>a</code> and <code>b</code> and I should prove <code>a = 37 * b</code> for the \"definition\" to be true.</p>",
        "id": 476558231,
        "sender_full_name": "Julian Berman",
        "timestamp": 1728773868
    },
    {
        "content": "<p>\"There are an infinite number of primes\" is I believe a \"definition\" which takes 0 arguments. Again though there's standard terminology for this in Lean, so once you get the concepts I think it's better if you do finally try to accept the terminology that's used for it.</p>",
        "id": 476558292,
        "sender_full_name": "Julian Berman",
        "timestamp": 1728773934
    },
    {
        "content": "<p>Julian, I understand I think your recommendation to get used to the Lean documentation. Sadly it doesn't seem to match my intuition for what the concepts actually are.</p>\n<p>Anyway, here is an example of the friction caused by the terminology.</p>\n<p>To prove something is <code>Odd</code>, in plain paper maths we need to show it <strong>conforms to</strong> the <strong>definition</strong> of <code>Odd</code>. That is, <code>Odd</code> is a definition.</p>\n<p>If we say <code>Odd</code> is a <strong>function</strong>, then the idea of checking to see if <code>13</code> conforms to a function, doesn't make immediate sense to most people coming from a non-Lean maths background, I would suggest.</p>\n<p>(but I don't even have an undergrad degree in maths so tell me I'm wrong).</p>",
        "id": 476561688,
        "sender_full_name": "rzeta0",
        "timestamp": 1728777888
    },
    {
        "content": "<hr>\n<p><code>sin(z)</code> is a function. What conforms to this function? </p>\n<p><code>Prime</code> is a definition. 13 conforms, but 12 doesn't.</p>",
        "id": 476561822,
        "sender_full_name": "rzeta0",
        "timestamp": 1728778063
    },
    {
        "content": "<blockquote>\n<p><code>sin(z)</code> is a function. What conforms to this function? </p>\n<p><code>Prime</code> is a definition. 13 conforms, but 12 doesn't.</p>\n</blockquote>\n<p>Both <code>sin</code> and <code>Prime</code> are both definitions and functions. The difference is that <code>sin</code> returns a real number, whereas <code>Prime</code> returns a proposition.</p>\n<p>A quick note on notation: Lean uses functional-programming style notation for function calls. So instead of <code>f(x)</code>, we write <code>f x</code>, and instead of <code>f(sin(x))</code> we write <code>f (sin x)</code>. This is done so that function calls work better with currying.</p>\n<p>So <code>sin 0</code> is a real number, which is 0. And <code>Prime 13</code> is a proposition, which is (equivalent to) <code>True</code>. Also, <code>Prime 12</code> is a valid proposition, which is (equivalent to) <code>False</code>.</p>",
        "id": 476562152,
        "sender_full_name": "Niels Voss",
        "timestamp": 1728778498
    },
    {
        "content": "<p>One way to think about it is the following:</p>\n<p>A proposition is a sentence that makes a claim that is either true or false. For example, “The dog is green” is a proposition whereas “Green” is not a proposition. We can prove whether or not propositions are true.</p>\n<p>Similarly, we can prove whether or not the proposition “The number <code>x</code> is odd” is true but we cannot prove anything about “Odd” because it’s not a proposition (it’s not a sentence making a claim).</p>\n<p>You can think of <code>Odd</code> as a function that when given a number <code>x</code> it returns the proposition  “The number <code>x</code> is odd.”</p>\n<p>So we cannot prove <code>Odd</code> because it is not a proposition, but we can prove <code>Odd 13</code> because that is a proposition.</p>",
        "id": 476594778,
        "sender_full_name": "Eric Paul",
        "timestamp": 1728814132
    },
    {
        "content": "<p>Or maybe a good way to see <code>Odd</code> is as an incomplete sentence: \"is an odd number\". You cannot prove \"is an odd number\"; you need a number to serve as the subject of the sentence: <code>Odd</code> is \"something\" that will give you a full true-or-false sentence if you give it a number.</p>\n<p>And that's what a function is: \"something\" that will give you a thing of a given type (a sentence, a real number) if you give it a thing of the appropriate type (an integer, a real number). (There are other constraints, of course, like it will give you the same \"thing\" if you try it multiple times with the same \"thing\")</p>",
        "id": 476596249,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1728815673
    },
    {
        "content": "<ul>\n<li>So <code>Odd</code> is a function, which happens to be a useful definition. </li>\n<li>And because it is a definition, the output is true/false (predicate).</li>\n</ul>\n<p>That's correct?</p>",
        "id": 476610280,
        "sender_full_name": "rzeta0",
        "timestamp": 1728829584
    },
    {
        "content": "<ul>\n<li>Yes</li>\n<li>No, not all functions are true/false-valued. Eg <code>sin</code> is a function whose value is a real number</li>\n</ul>",
        "id": 476611059,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1728830259
    },
    {
        "content": "<p>\"predicate\" usually means \"a function of one argument that returns <code>Prop</code> (aka  true/false)\"</p>",
        "id": 476637628,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1728853580
    },
    {
        "content": "<p>And \"relation\" is \"a function of two arguments that returns <code>Prop</code>\"</p>",
        "id": 476637658,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1728853612
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/stream/113489-new-members/topic/.60Odd.20.2813.3A.20.20.E2.84.A4.29.60.20-.20is.20Odd.20a.20.22type.22.3F/near/476611059\">said</a>:</p>\n<blockquote>\n<ul>\n<li>Yes</li>\n<li>No, not all functions are true/false-valued. Eg <code>sin</code> is a function whose value is a real number</li>\n</ul>\n</blockquote>\n<p>Agreed, not all functions are true / false. But if a function is a <strong>definition</strong>, then the application to its parameters (one or more) results in true/false.</p>\n<p>Is that right?</p>",
        "id": 476639619,
        "sender_full_name": "rzeta0",
        "timestamp": 1728855785
    },
    {
        "content": "<p>No. See the extensive discussion of the sine function above.</p>",
        "id": 476639640,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1728855840
    },
    {
        "content": "<p>Definitions can have any type. They can be natural numbers like <code>def thirtySeven := 37</code>, functions from natural numbers to natural numbers like <code>factorial</code>, functions from reals to reals like <code>sin</code>, functions from natural numbers to propositions (aka predicates) like <code>Odd</code>. Not all functions are definitions; a definition is something that can expand to something in terms of lower level primitives and other definitions. An example of a function that is not a definition is <code>Nat.succ</code>, which is a function from natural numbers to natural numbers which is axiomatically postulated as part of the inductive type <code>Nat</code>.</p>",
        "id": 476639872,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728856088
    },
    {
        "content": "<p>Another common case where functions exist that aren't definitions is when you take a function as an argument, such as the <code>f</code> argument to <code>Function.Injective</code></p>",
        "id": 476640008,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1728856271
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"724904\">rzeta0</span> <a href=\"#narrow/stream/113489-new-members/topic/.60Odd.20.2813.3A.20.20.E2.84.A4.29.60.20-.20is.20Odd.20a.20.22type.22.3F/near/476639619\">said</a>:</p>\n<blockquote>\n<p>Agreed, not all functions are true / false. But if a function is a <strong>definition</strong>, then the application to its parameters (one or more) results in true/false.</p>\n</blockquote>\n<p>What you are describing here (a function which returns a proposition) is what we would call a <strong>predicate</strong> or <strong>relation</strong>. (The terms are used mostly interchangeably, but relations generally take more than one argument.)</p>",
        "id": 476640028,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728856311
    },
    {
        "content": "<p>So what I've learned from this thread is that my original question should have asked about the difference between a <strong>function</strong> and a <strong>definition</strong>.</p>\n<ul>\n<li>not all functions are definitions, eg <code>Nat.succ</code></li>\n<li>all definitions are functions</li>\n</ul>\n<p>Is the second point correct? If yes, that will help clarify things in my  mind.</p>",
        "id": 476647214,
        "sender_full_name": "rzeta0",
        "timestamp": 1728864189
    },
    {
        "content": "<p>The second point is correct only if you consider \"constants\" like <code>def two : Nat := 2</code> as zero-argument functions.</p>",
        "id": 476647728,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1728864727
    },
    {
        "content": "<p>To summarize the terminology:</p>\n<ul>\n<li>A <strong>type</strong> in Lean is an element of <code>Sort n</code> for some universe level n. So for example, <code>Nat</code>, <code>Bool</code>, and <code>Type</code> itself are types. By the Curry-Howard correspondence (aka propositions as types paradigm), propositions like \"2 + 2 = 4\" and \"2 + 2 = 5\" are types as well.</li>\n<li>A <strong>function</strong> is an element of the type <code>A -&gt; B</code> for some types <code>A</code> and <code>B</code>. (Technically many people would also consider dependent functions to be functions).</li>\n<li>A <strong>proposition</strong> is an element of the type <code>Prop</code> (which is the same as <code>Sort 0</code>). These represent statements that can be true or false.</li>\n<li>A <strong>predicate</strong> (also called a <strong>property</strong>) is an element of type <code>A -&gt; Prop</code> for some type <code>A</code>. All predicates are functions, but none are types.</li>\n<li>An <strong>explicitly-defined term</strong> is a variable that the user created with the <code>def ...</code> command. So this includes <code>sin</code> and <code>Nat</code>, but not <code>Nat.succ</code> nor <code>Sort n</code>.</li>\n<li>A <strong>definition</strong> is not really a standardized term, so we don't use the term that often. Most people use it to refer to an actual \"<code>def ...</code>\" statement. Some people think <strong>definition = predicate</strong>, as you did at the start of the thread, and some think of <strong>definition = explicitly-defined term</strong>, as you did in your last message.</li>\n</ul>",
        "id": 476662313,
        "sender_full_name": "Niels Voss",
        "timestamp": 1728874428
    },
    {
        "content": "<p>As examples:</p>\n<ul>\n<li><code>2 + 2 = 5</code> - a <strong>proposition</strong> and a <strong>type</strong>, but not a <strong>function</strong> or <strong>predicate</strong>.</li>\n<li><code>sin</code> - a <strong>function</strong> and <strong>explicitly-defined term</strong>, but not a <strong>type</strong>, <strong>proposition</strong> or a <strong>predicate</strong>.</li>\n<li><code>Odd</code> - a <strong>function</strong>, <strong>predicate</strong>, and <strong>explicitly-defined term</strong>, but not a <strong>type</strong> or <strong>proposition</strong>.</li>\n<li><code>Odd 13</code>, a <strong>proposition</strong> and a <strong>type</strong>, but not a <strong>function</strong> or <strong>predicate</strong>.</li>\n<li><code>Nat.succ</code>, a <strong>function</strong>, but not a <strong>proposition</strong>, <strong>predicate</strong>, <strong>type</strong>, or <strong>explicitly-defined term</strong></li>\n</ul>\n<p>Note that all propositions are also types (because of the Curry-Howard correspondence), and all predicates are also functions.</p>",
        "id": 476663034,
        "sender_full_name": "Niels Voss",
        "timestamp": 1728874738
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"521331\">Niels Voss</span> <a href=\"#narrow/stream/113489-new-members/topic/.60Odd.20.2813.3A.20.20.E2.84.A4.29.60.20-.20is.20Odd.20a.20.22type.22.3F/near/476662313\">said</a>:</p>\n<blockquote>\n<ul>\n<li>A <strong>definition</strong> is not really a standardized term, so we don't use the term that often. Most people use it to refer to an actual \"<code>def ...</code>\" statement. Some people think <strong>definition = predicate</strong>, as you did at the start of the thread, and some think of <strong>definition = explicitly-defined term</strong>, as you did in your last message.</li>\n</ul>\n</blockquote>\n<p>This is the only bullet I would disagree with. With my logician hat on \"definition\" very much is a standard term, and it means more or less what you called \"explicitly-defined term\", although it's less about whether you used the <code>def</code> command specifically as whether it is thought of as an abbreviation for something else and it can be unfolded to that.</p>",
        "id": 476750761,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728903391
    },
    {
        "content": "<blockquote>\n<p>it's less about whether you used the <code>def</code> command specifically as whether it is thought of as an abbreviation for something else and it can be unfolded to that.</p>\n</blockquote>\n<p>So <code>Int</code>, <code>Nat.succ</code>, <code>Classical.choice</code>, and <code>Nat -&gt; Nat</code>, are not considered definitions because they don't unfold to anything?</p>",
        "id": 476824251,
        "sender_full_name": "Niels Voss",
        "timestamp": 1728924977
    },
    {
        "content": "<p>Right. (With the small caveat that sometimes things like <code>Int</code> are informally called definitions because they are another kind of conservative extension of the system, although to be perfectly rigorous about that it's not just <code>Int</code> but the whole package including <code>Int.ofNat</code>, <code>Int.negSucc</code> and <code>Int.rec</code>. But it doesn't meet the strict criterion for being a definition that I gave.)</p>",
        "id": 476833599,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728929816
    },
    {
        "content": "<p>would it be helpful for Lean to designate some objects as axiomatic?</p>\n<p>to make it clear to readers/writers of code that something is axiomatic, and others are derived eg definitions.</p>\n<p>currently you either know or you don't.</p>\n<p>(and it possibly also then allows systems to be constructed from user-defined axioms)</p>",
        "id": 476842998,
        "sender_full_name": "rzeta0",
        "timestamp": 1728934828
    },
    {
        "content": "<p>There is an <code>axiom</code> command</p>",
        "id": 476844609,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1728935699
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"724904\">rzeta0</span> <a href=\"#narrow/stream/113489-new-members/topic/.60Odd.20.2813.3A.20.20.E2.84.A4.29.60.20-.20is.20Odd.20a.20.22type.22.3F/near/476842998\">said</a>:</p>\n<blockquote>\n<p>currently you either know or you don't.</p>\n</blockquote>\n<p>Is this not something that's answered by \"go to definition\" in the editor?</p>",
        "id": 476845557,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1728936167
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span>  </p>\n<p>As you say, go to definition will take you to the definition, and you can keep following \"go to definition\".</p>\n<p>But nothing in the code highlights that an object is axiomatic.</p>\n<p>I just tried to go back from <code>13</code> to <code>inductive Nat</code> and reading the code doesn't tell me it is axiomatic.</p>\n<p>I guess \"go to definition\" on Nat takes me to itself, which might be a clue, but this seems not ideal.</p>\n<p>(caveat - I'm out of my depth with this question, I'm just curious)</p>",
        "id": 476847599,
        "sender_full_name": "rzeta0",
        "timestamp": 1728937362
    },
    {
        "content": "<p>What exactly is the difference between \"axiomatic\" and \"non-axiomatic\"?<br>\nThe existence of inductive types is posited by an axiom of type theory. <code>Nat</code> is a particular inductive type, with an explicit definition: namely, it has the two constructors <code>zero : Nat</code>and <code>succ : Nat -&gt; Nat</code>.<br>\nSo is <code>Nat</code> axiomatic because its definition doesn't involve the keyword <code>def</code> in the Lean syntax? Or is it non-axiomatic because its existence just follows from the axioms (like anything else), but is not itself an axiom?</p>",
        "id": 476854930,
        "sender_full_name": "Paul Schwahn",
        "timestamp": 1728941887
    },
    {
        "content": "<p>If you use <code>#print</code>, it will reliably tell you if something is a definition or not.</p>\n<ul>\n<li>If it says <code>axiom</code>, <code>inductive</code>, <code>structure</code>, <code>class</code>, <code>constructor</code>, <code>recursor</code>, or <code>Quotient primitive</code> then it's not a definition, it doesn't unfold to anything.</li>\n<li>If it says <code>def</code> then it's a definition.</li>\n<li>If it says <code>opaque</code>, then it's borderline: it's not a definition by my strict definition of the term (it doesn't unfold), but it is a conservative extension.</li>\n<li>If it says <code>theorem</code> it's also borderline, because it's also like <code>opaque</code> except that it <em>is</em> actually defeq to its body anyway because it's a proof</li>\n</ul>",
        "id": 476857575,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1728943711
    }
]