[
    {
        "content": "<p>Hi everyone,</p>\n<p>I'm Orly, and I've been curious for a long regarding both formal proofs and functional programming. Lean looks perfect for both. I did the natural numbers game, and I'd like to start trying writing some code in my computer and doing own small projects to learn.</p>\n<p>I started by following <a href=\"https://docs.lean-lang.org/lean4/doc/quickstart.html\">instructions in the official Lean manual</a>, I had vscode and installed the lean extension, and started following setup guide. However I got into trouble and got confuse. I guess I need particularly precise instructions.<br>\nI'll tell you my experience:</p>\n<hr>\n<p>In point 2 it recommends <a href=\"https://lean-lang.org/functional_programming_in_lean/\">Functional Programming in Lean</a> which sounds perfect for me. I start looking at the book, and it says </p>\n<blockquote>\n<p>Lean, on the other hand, integrates these features into the interaction with the editor, providing commands that cause the text editor to display feedback integrated into the program text itself. This chapter provides a short introduction to interacting with Lean in an editor</p>\n</blockquote>\n<p>And recommends having editor opened together with the book. I already am wondering myself why the link to the book in the setup guide is at the beginning before finishing installation. It recommends trying the commands, starting by a simple \"#eval 1 + 2\", which I guess I must think about as my first hello world. So I guess I need to keep the setup guide.</p>\n<hr>\n<p>I go through Installing Required Dependencies and Install Lean Version Manager without problems, but then in section Set up Lean 4 Project I don't know what to do at first. I feel like I need the simple hello world, should I create just a lean file or should I create a new standalone project? Since it is the equivalent to a simple hello world, I guess just one file should be enough. Since I have the lean installed I tried creating a directory myself to put hello world. I created a file \"hola.lean\" with the line \"#eval 1 + 2\" inside. After saving the file it starts installing a version of lean, but I get a message \"Opened folder does not contain a valid Lean 4 project. Please open a valid Lean 4 project containing a 'lean-toolchain' file for full functionality. Click the following link to learn how to set up or open Lean projects:\"<br>\nSo I guess my next step is to create a project using the setup guide.</p>\n<hr>\n<p>Ok, I clicked in \"Create a new standalone project\", and name my directory \"OrlyTriesSetup\". But now it created a directory with so many files. What is this?  Should I write under one of this files? Should I create a new file for my hello world (actually eval  1 + 2) ??? I really feel like the structure of this new just created project is not obvious.<br>\n<a href=\"/user_uploads/3121/KxOq_fFHd9SzEMfgxwY3ePou/Screenshot-2025-02-23-at-21.56.05.png\">Screenshot 2025-02-23 at 21.56.05.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/KxOq_fFHd9SzEMfgxwY3ePou/Screenshot-2025-02-23-at-21.56.05.png\" title=\"Screenshot 2025-02-23 at 21.56.05.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"516x716\" src=\"/user_uploads/thumbnail/3121/KxOq_fFHd9SzEMfgxwY3ePou/Screenshot-2025-02-23-at-21.56.05.png/840x560.webp\"></a></div><hr>\n<p>I guess the correct file to write is Main.lean, it already has a hello world inside.<br>\n<a href=\"/user_uploads/3121/2Q_Cbo7Lj7Peze6vAPtCpUWN/Screenshot-2025-02-23-at-22.01.54.png\">Screenshot 2025-02-23 at 22.01.54.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/2Q_Cbo7Lj7Peze6vAPtCpUWN/Screenshot-2025-02-23-at-22.01.54.png\" title=\"Screenshot 2025-02-23 at 22.01.54.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1102x752\" src=\"/user_uploads/thumbnail/3121/2Q_Cbo7Lj7Peze6vAPtCpUWN/Screenshot-2025-02-23-at-22.01.54.png/840x560.webp\"></a></div><p>However nothing happens. The book says \"Lean, on the other hand, integrates these features into the interaction with the editor, providing commands that cause the text editor to display feedback integrated into the program text itself.\". How do I activate? how do I even run this hello world?</p>\n<hr>\n<p>Here I get very frustrated, last time I just didn't want to proceed after this. Now I tried everything again, I still don't know where did I deviate from instructions or why I can't follow now. How do I start reading the book and keep trying small commands by myself in the simplest way?</p>\n<p>This time I thought I could ask help here, hope this is not too much. </p>\n<p>Thanks everyone,<br>\nOrly</p>\n<hr>\n<p>TLDR: Hi, I'm new, my name is Orly, help me run the simplest line in lean on vscode so I can start reading the functional programing in lean4 book.</p>",
        "id": 501426968,
        "sender_full_name": "Orly",
        "timestamp": 1740359123
    },
    {
        "content": "<p>You should be able to see what Lean is doing in the info view panel on the right side of your screen</p>",
        "id": 501437007,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1740366655
    },
    {
        "content": "<p>This main function is mostly intended to be used as <code>lake exe &lt;project name&gt;</code>, but you can do <code>#eval main</code> to run it, and you should see the output on hover.<br>\nDo you see the output of <code>#eval 1 + 2</code> when you hover over the highlight?</p>",
        "id": 501451238,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1740376071
    },
    {
        "content": "<p>Yes, thanks to both. I just created a new file in this repo and it worked to see the evaluations in the \"Lean infoview\" that is open side by side (I could swear yesterday the \"Lean infoview\" just said No messages after writing the line in the Main.lean file, but now I tried it again and it is working).</p>\n<p>Also, I can see that hovering over the eval expression gives me information. Nice trick, thanks.</p>",
        "id": 501671831,
        "sender_full_name": "Orly",
        "timestamp": 1740439295
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"880134\">Orly</span> has marked this topic as resolved.</p>",
        "id": 501964120,
        "sender_full_name": "Notification Bot",
        "timestamp": 1740546709
    }
]