[
    {
        "content": "<p>Hello,<br>\nI am a rising sophomore at Duke University that is working with Lean on a summer research program. I also have some prior experience with other proof assistants like Coq and Idris, as well as significant experience with functional programming (Haskell).<br>\nI would like to contribute orthogonality on affine subspaces to mathlib, which should close <a href=\"https://github.com/leanprover-community/mathlib4/pull/5539\">#5539</a>. I have already proven some of the desired lemmas, so I think that I should be able to go through with this.<br>\nCould I please get write access to non-master branches for this? My GitHub username is <code>MithicSpirit</code> (yes, it is with an \"i\" instead of a \"y\"). Considering the deadline on freezing mathlib3 is almost up I think that it would make more sense for this to be on mathlib4 if that is possible; the code for this isn't very difficult to convert between the two versions so this is not that significant (although I do prefer working with Lean4).</p>",
        "id": 374098315,
        "sender_full_name": "Ricardo Prado Cunha",
        "timestamp": 1689029112
    },
    {
        "content": "<p>Yes please make any future PRs to mathlib4 only! <span class=\"user-group-mention\" data-user-group-id=\"2494\">@maintainers</span> can <code>MithicSpirit</code> have push access to mathlib4?</p>",
        "id": 374154966,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1689058237
    },
    {
        "content": "<p>Invitation sent!</p>",
        "id": 374160768,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1689060022
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 374359914,
        "sender_full_name": "Ricardo Prado Cunha",
        "timestamp": 1689101252
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"620085\">Ricardo Prado Cunha</span> has marked this topic as resolved.</p>",
        "id": 374359924,
        "sender_full_name": "Notification Bot",
        "timestamp": 1689101256
    }
]