[
    {
        "content": "<p>Hi all, I'm new here and looking for a way to contribute something small to the mathlib, just to get my feet wet.  I majored in math as an undergraduate about 15 years  ago, and I'm back in school now studying computer science. I'm in an intro software engineering class and we've been assigned to find an open-source project and contribute to it. I learned about this project a few years ago from reading several articles written by Kevin Buzzard, and have wanted to become a part of the community ever since—this assignment is giving me the push I needed to give it a try.</p>\n<p>Is there ANY low-hanging fruit left for someone who's only familiar with basic undergraduate mathematics (not even advanced undergraduate math)? I just want to contribute a small thing, like a simplification or an elementary lemma/theorem. Something in the area of linear algebra would be my preference if I could choose. Does anyone have any suggestions for basic topics I could possibly contribute?</p>\n<p>One idea I had when looking through the documentation: I noticed that I couldn't find a proof that the trace of a matrix is equal to the sum of its eigenvalues. Is that a problem that is tractable at the moment for someone just starting out with Lean? I guess my worry is that anything that's not in the library by now isn't there for a reason—because it's probably quite difficult based on the current state of the library. My thought is that if a community of professional mathematicians hasn't done it yet, then what the heck makes me think I could?</p>\n<p>(The example I mentioned above won’t work—as Bolton helped me figure out.)</p>\n<p>Any advice/guidance anyone could offer would be met with the deepest appreciation! If you think this is honestly not something that I should undertake, I'm happy to hear that as well so that I can look for another project. (I only have about a month to learn the basics of how the project functions, contribute  something to it, and write about my experience.) However, if I can get started now, it'd be awesome to be a part of this project for the indefinite future. I'm planning to apply to grad school for mathematics next year, and it would be cool to participate in this project regularly as I learn more and more math in the coming years...</p>",
        "id": 440607955,
        "sender_full_name": "Chance Nahuway",
        "timestamp": 1716612550
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/LinearAlgebra/Matrix/Charpoly/Eigs.html#Matrix.trace_eq_sum_roots_charpoly\">Matrix.trace_eq_sum_roots_charpoly</a> is the closest thing I can find, perhaps with this in hand it wouldn't be too hard to prove the theorem with the sum of the eigenvalues. Before you attempt that, though, it would probably be prudent to get a feel for how Lean works with something like the natural number game, if you haven't tried that already.</p>",
        "id": 440609802,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1716614781
    },
    {
        "content": "<p>I finished about half of the Natural Number game tonight and felt the addictiveness I’ve been reading about :) Thank you for that suggestion Bolton, that is extremely helpful!</p>",
        "id": 440610078,
        "sender_full_name": "Chance Nahuway",
        "timestamp": 1716615139
    },
    {
        "content": "<p>Unfortunately, the comments in the source code of the function you showed me explain that we can’t state the theorem “trace equals sum of eigenvalues” because the multiplicity of an eigenvalue is defined in an incompatible way in Lean. I presume there is no way around this or else the author of that function would have fixed it. :/</p>",
        "id": 440611132,
        "sender_full_name": "Chance Nahuway",
        "timestamp": 1716616272
    },
    {
        "content": "<p>There is not much hope to contribute after doing half the natural number game. But you can continue to learn and then contribute. See <a href=\"https://leanprover-community.github.io/learn.html\">https://leanprover-community.github.io/learn.html</a></p>",
        "id": 440643980,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1716650653
    },
    {
        "content": "<p>If you're looking for other low-hanging matrix-based linear algebra contributions, there may be some listed at <a href=\"https://github.com/eric-wieser/lean-matrix-cookbook\">https://github.com/eric-wieser/lean-matrix-cookbook</a> (which is where the \"sum of eigenvalues\" result linked above came from)</p>",
        "id": 440647195,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1716653480
    },
    {
        "content": "<p>(or rather, listed in the associated PDF, but absent from that repository!)</p>",
        "id": 440647226,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1716653507
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/stream/113489-new-members/topic/Undergrad.20Math.20Contribution/near/440647195\">said</a>:</p>\n<blockquote>\n<p>If you're looking for other low-hanging matrix-based linear algebra contributions, there may be some listed at <a href=\"https://github.com/eric-wieser/lean-matrix-cookbook\">https://github.com/eric-wieser/lean-matrix-cookbook</a> (which is where the \"sum of eigenvalues\" result linked above came from)</p>\n</blockquote>\n<p>Thank you Eric, I'll go start digging there now! This is EXACTLY the sort of thing I was looking for :)</p>",
        "id": 440648368,
        "sender_full_name": "Chance Nahuway",
        "timestamp": 1716654504
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/113489-new-members/topic/Undergrad.20Math.20Contribution/near/440643980\">said</a>:</p>\n<blockquote>\n<p>There is not much hope to contribute after doing half the natural number game. But you can continue to learn and then contribute. See <a href=\"https://leanprover-community.github.io/learn.html\">https://leanprover-community.github.io/learn.html</a></p>\n</blockquote>\n<p>Thank you Patrick, that's where I found the natural number game. I finished the other half this morning and my addiction has only deepened :) Now I guess I'll move on to <em>Mathematics in Lean</em>. Even if I'm not able to contribute anytime this month as I'd hoped, I look forward to learning about the project and helping out someday.</p>",
        "id": 440648413,
        "sender_full_name": "Chance Nahuway",
        "timestamp": 1716654569
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"721959\">Chance Nahuway</span> has marked this topic as resolved.</p>",
        "id": 440679339,
        "sender_full_name": "Notification Bot",
        "timestamp": 1716690440
    }
]