[
    {
        "content": "<p>After several weeks of struggling to find an equivalent of Heather MacBeth's <code>le_or_succ_le</code> for natural numbers in marthlib that is suitable for beginners to use ... I think the only way forward is to add one to mathlib upstream,</p>\n<p>So my question is - what's the process? </p>\n<p>Do I fill in a request form? Add it to a forum? Provide a sample implementation for more expert people to refine and add?</p>\n<p>I'm hoping the answer isn't \"create a PR\" because that excludes people who aren't great at coding or using git but who might have valid ideas for mathlib.</p>\n<p>Anyway I feel strongly there is a need for <code>le_or_succ_le</code> so I'm open to recommendations and guidance.</p>",
        "id": 474235982,
        "sender_full_name": "rzeta0",
        "timestamp": 1727858975
    },
    {
        "content": "<p>(for other readers, there is <a href=\"#narrow/stream/113489-new-members/topic/mathlib.20version.20of.20.60le_or_succ_le.60/near/474137426\">a thread</a> about <code>le_or_succ_le</code> specifically)</p>",
        "id": 474236978,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1727859253
    },
    {
        "content": "<p>Have you read <a href=\"https://github.com/leanprover-community/mathlib4?tab=readme-ov-file#contributing\">https://github.com/leanprover-community/mathlib4?tab=readme-ov-file#contributing</a> and the other documentation that is linked from that section?</p>",
        "id": 474237083,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1727859284
    },
    {
        "content": "<p>In this particular case I'm not sure I am convinced that <code>le_or_succ_le</code> is actually a useful lemma</p>",
        "id": 474237268,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1727859345
    },
    {
        "content": "<p>In general you can discuss new additions to mathlib here. In the specific case I am not sure it is a useful result to have: for beginners it is probably OK, but mathlib is usually not written with the goal of being read by beginners (this is why we have other learning resources!), otherwise it would not scale very well.</p>",
        "id": 474237772,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1727859493
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/stream/113489-new-members/topic/how.20to.20add.20a.20new.20lemma.20to.20upstream.20mathlib/near/474237268\">said</a>:</p>\n<blockquote>\n<p>In this particular case I'm not sure I am convinced that <code>le_or_succ_le</code> is actually a useful lemma</p>\n</blockquote>\n<p>I'd welcome an explanation as to why it is not useful.</p>\n<p>For context:</p>\n<ol>\n<li>It was deemed useful enough that Heather Macbeth had to create one for her course, because mathlib didn't have one.</li>\n<li>I don't think arguments of \"you can  construct it with other lemmas yourself\" is right because we should think about ease of use of mathlib too</li>\n<li>How does it compare to other existing lemmas which could also be argued as similarly not useful?</li>\n</ol>",
        "id": 474237909,
        "sender_full_name": "rzeta0",
        "timestamp": 1727859541
    },
    {
        "content": "<hr>\n<p>\"but mathlib is usually not written with the goal of being read by beginners\"</p>\n<p>I am genuinely surprised by this statement.</p>",
        "id": 474238052,
        "sender_full_name": "rzeta0",
        "timestamp": 1727859584
    },
    {
        "content": "<p>Why? If you want to learn a programming language, say C, you should not read a very complex software written in C, but rather an introductory text with examples written with this goals. Of course I am not saying we want to make the code hard to read on purpose, but just that beginners and advanced users do different things, and one has to start learning how to do simple things, without fighting with hard problems.</p>",
        "id": 474239607,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1727859945
    },
    {
        "content": "<p>For example for a beginners something like <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=CovariantClass#doc\">docs#CovariantClass</a> is total nonsense, and they should not spend time thinking about it, but we have good reasons to have use it in mathlib</p>",
        "id": 474239949,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1727860031
    },
    {
        "content": "<p>Again let me stress that we are very happy to welcome new users! I am just suggesting that at the beginning they should use our learning tools rather than fighting with the complexity of mathlib.</p>",
        "id": 474240592,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1727860194
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"130384\">@Riccardo Brasca</span>  - thanks for your thoughts and I appreciate you taking the time.</p>\n<p>I'm not sure I follow your logic. If a lemma will be useful to newcomers and beginners, why not include it in mathlib?</p>\n<p>If we only include \"advanced\" lemmas then we've excluded a huge number of ref people- remember everyone starts as a beginner.</p>\n<p>To quote you \"and one has to start learning how to do simple things, without fighting with hard problems\" - this is precisely the reason I think <code>le_or_succ_le</code> should be in mathlib. To make it easy for beginners to do easy things.</p>\n<p>What have I misunderstood?</p>",
        "id": 474246542,
        "sender_full_name": "rzeta0",
        "timestamp": 1727861967
    },
    {
        "content": "<hr>\n<p>I'll also wait for Eric to explain why he thinks it is not a useful lemma.</p>\n<p>The more I understand the better :)</p>",
        "id": 474246837,
        "sender_full_name": "rzeta0",
        "timestamp": 1727862065
    },
    {
        "content": "<p>I was talking about the way mathlib is set up in general, whose goal is not to be read by beginners. Of course it should be usable by beginners! Indeed I am not 100% sure your lemma is out of scope, it may be useful and it may be not. The point is that any lemma we add comes with a maintenance cost. The point is that one can produce thousands of specific results specific for <code>ℕ</code>, that are specific cases of more general stuff or can be proven with some automation. Some of them are there because they are maybe needed <em>before</em> the more general thing is available, but it is simply unreasonable to add all of them. Again, I am not sure about yours, it is surely not crazy, I just want to explain the general philosophy that saying \"it seems OK\" is not enough.</p>",
        "id": 474247734,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1727862341
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"130384\">@Riccardo Brasca</span> - thanks - that makes a lot of sense, clearly there should be some filter for selecting what should and should no go into mathlib.</p>\n<p>So the next question is - how do we decide regarding this lemma? Is it merely the opinion of high-profile maintainers, or is there a more objective process based on published criteria?</p>\n<p>My amateurish argument would be:</p>\n<ol>\n<li>as a beginner(+) creating educational material it would be immensely helpful</li>\n<li>the fact that Heather MacBeth felt the need to create it for her highly regarded course is significant validation of the need</li>\n<li>her implementation is simple, indicating relatively low maintenance cost</li>\n</ol>\n<p><em>( + have been coding since the 1980s, and have been teaching a wide range of tech/programming over the last decade+, to a range of audience including data science specialists all the way down to 7-17 year olds, so I hope I have developed an intuition for what would be a positive addition. I also have contributed to other libraries in different fields to make them easier for more beginners to enter their respective ecosystems )</em></p>",
        "id": 474265259,
        "sender_full_name": "rzeta0",
        "timestamp": 1727867887
    },
    {
        "content": "<p>Honestly, I would view the fact that Heather added the lemma to her repository, but did not contribute it to mathlib as probable evidence that the lemma was purely \"educational\", rather than anything else.</p>",
        "id": 474265802,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727868017
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> and yet when the question is asked elsewhere on this site about how to achieve a similar effect to that lemma using <strong>simple</strong> methods there appear to be no answers.</p>\n<p>This tells us that there is a barrier to beginners that exists.</p>\n<p>\"Making easy tasks easy to do\" should not be antithetical to mathlib's design.</p>",
        "id": 474267195,
        "sender_full_name": "rzeta0",
        "timestamp": 1727868406
    },
    {
        "content": "<p>I somewhat disagree with your definition of \"simple\": in my view, there were simple solutions in the other thread.</p>",
        "id": 474268890,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727868871
    },
    {
        "content": "<p>I think the missing piece here is that while the lemma on its own seems useful, the interpretation of mathlib currently (to anthropomorphize) is that in most cases le_total or le_or_lt will suffice to prove things. And if not, we have a quite general typeclass for things where lt implies succ_le. Note that the lemmas mentioned above don't mention Nat. So it's trying to avoid installing duplicate lemmas on Nat if it can avoid to. And what a mathlib beginner is asked to learn is that it's worthwhile to think and prove in general terms.</p>",
        "id": 474271210,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1727869408
    },
    {
        "content": "<p>While the lemma exists in Heather Macbeth's course, I think there it is really about how to utilize a particular shape of lemma in tactic based proofs, and not so much about the particular mathematical content of the lemma itself.</p>",
        "id": 474271657,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1727869495
    },
    {
        "content": "<p>My handwaved comparison to beginners learning other programming languages is the common occurrence of beginners to write wrapper API for simple language calls. Like <code>def print_int x = print(\"%d\", x)</code>. Undoubtedly printing ints is useful. The beginner writes the function initially, exercising their new knowledge about syntax, calling functions, specialization. But soon, they learn the general, fluent, approach, and delete this helper function.</p>",
        "id": 474272577,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1727869684
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"321459\">Damiano Testa</span> <a href=\"#narrow/stream/113489-new-members/topic/how.20to.20add.20a.20new.20lemma.20to.20upstream.20mathlib/near/474268890\">said</a>:</p>\n<blockquote>\n<p>in my view, there were simple solutions in the other thread.</p>\n</blockquote>\n<p>Yes, the discussion in the other thread seemed to frequently amount to \"I want to do X, but without using Y because my course hasn't covered it yet\". This is a reasonable question to ask when learning, but it is not a reasonable thing for mathlib to help you to do in the wider context of Y being allowed.</p>",
        "id": 474272791,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1727869732
    },
    {
        "content": "<p>You can even view the non-inclusion of this lemma in mathlib as a further learning resource: <code>exact?</code> will not prove it for you, so you can leave it as an exercise to beginners!</p>",
        "id": 474274250,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727870000
    },
    {
        "content": "<p>I think the conclusion of this thread is that simple tools won't be provided because more powerful ones are preferred - and if that means the incline that beginners have to climb has gaps on it, that is to be accepted.</p>\n<p>Following Yakov's example - mathlib wants to be a language of <code>print(\"%d\", x)</code> and not also <code>print(x)</code>.</p>\n<p>I may fundamentally disagree with that as a design philosophy for mathlib, but I can't change that on my own.</p>\n<p>I'll mark this thread as resolved.</p>",
        "id": 474274831,
        "sender_full_name": "rzeta0",
        "timestamp": 1727870139
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"724904\">rzeta0</span> has marked this topic as resolved.</p>",
        "id": 474274845,
        "sender_full_name": "Notification Bot",
        "timestamp": 1727870142
    },
    {
        "content": "<p>I think it's closer to having <code>print(x)</code> instead of <code>print_int(x)</code></p>",
        "id": 474275588,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727870309
    },
    {
        "content": "<p>because the <code>\"%d\"</code> part is typeclass inference</p>",
        "id": 474275668,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727870334
    },
    {
        "content": "<p>I think we _could_ have this lemma, just stated over Order.succ and LinearOrder</p>",
        "id": 474279148,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1727870975
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"724904\">rzeta0</span> <a href=\"#narrow/stream/113489-new-members/topic/.E2.9C.94.20how.20to.20add.20a.20new.20lemma.20to.20upstream.20mathlib/near/474274831\">said</a>:</p>\n<blockquote>\n<p>and if that means the incline that beginners have to climb has gaps on it</p>\n</blockquote>\n<p>The trick here is for beginners to use the \"ladder\" that Heather's course provides, which avoids running into those gaps <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 474280897,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1727871360
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"308899\">Yakov Pechersky</span> <a href=\"#narrow/stream/113489-new-members/topic/.E2.9C.94.20how.20to.20add.20a.20new.20lemma.20to.20upstream.20mathlib/near/474279148\">said</a>:</p>\n<blockquote>\n<p>I think we _could_ have this lemma, just stated over Order.succ and LinearOrder</p>\n</blockquote>\n<p>I was actually thinking of a version with <code>CovBy</code>. I think both of those are reasonable.</p>",
        "id": 474314950,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1727879619
    },
    {
        "content": "<p>In all honesty, I think <span class=\"user-mention\" data-user-id=\"724904\">@rzeta0</span> is right here (i.e., in this particular instance, not necessarily in general), this lemma is worth having. Of course, we can get to it easily (e.g., with the defeq of <code>le_or_lt</code>), but we have plenty of convenience lemmas, including ones specialized to <code>Nat</code>, and the maintenance burden of this is low. To other maintainers in this thread, I would like you to consider the perspective of reviewing code of an experienced user. I don't think we would bat an eye if an experienced user said \"I want this lemma, it's convenient for me.\" and a PR including it would be merged.</p>",
        "id": 474315463,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1727879766
    },
    {
        "content": "<p>(Note the the reason for specialization to <code>Nat</code> in this case is because the more general versions about <code>Order.succ</code> or <code>CovBy</code> have to go through defeqs to apply to <code>Nat.succ</code>.)</p>",
        "id": 474315719,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1727879831
    },
    {
        "content": "<p>Also, even specialized to nat, it would not be hard to get this theorem in Batteries, which is more willing to accept theorems specialized to nat when needed</p>",
        "id": 474336097,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1727884629
    }
]