[
    {
        "content": "<p>Hi All!<br>\nDoes anyone have some pointers on how to solve NNG lvl6 of the &lt;= world?<br>\nMost levels before this went quite smoothly, but on this level it feels like I am not getting anywhere. I've searched for hints elsewhere online, but am surprised to find that even relatively recent posts related to the NNG (e.g. <a href=\"https://www.youtube.com/watch?v=5GkisJ0OImg\">https://www.youtube.com/watch?v=5GkisJ0OImg</a> ) show a version of the NNG of lean 4 that had a lot more intermediate worlds, and therefore more tactics unlocked before reaching this level. Therefore the solutions I find in these sources are unfortunately not usable.<br>\nThanks a lot for any help!<br>\nPS: if anyone knows what happened to the removed 'intermediate' levels, such as the Function and Proposition worlds) I'd be quite curious to know that too!</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"5GkisJ0OImg\" href=\"https://www.youtube.com/watch?v=5GkisJ0OImg\"><img src=\"https://uploads.zulipusercontent.net/7f52fab08a18c78402f02f13b9edd93f902cd7bd/68747470733a2f2f692e7974696d672e636f6d2f76692f35476b69734a304f496d672f64656661756c742e6a7067\"></a></div>",
        "id": 450525161,
        "sender_full_name": "Thijs Vromen",
        "timestamp": 1720634957
    },
    {
        "content": "<p>I removed function and proposition world because feedback from users said that they were a bit weird and abstract, and in particular nothing to do with natural numbers. My initial motivation for putting them in was that I wanted to figure out how to teach <code>intro</code>, <code>apply</code> and <code>exact</code> and I thought that by introducing functions as in functional programming I could do this. But after a discussion with Patrick Massot he convinced me that it was possible to teach these tactics without ever introducing abstract types <code>X</code> and abstract propositions <code>P</code> (because this was what he was doing in his course in Orsay), and NNG4 shows he was right.</p>",
        "id": 450541259,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1720638969
    },
    {
        "content": "<p>Re inequality world level 6 (antisymmetry): yeah, these levels are hard. Humans have such a geometric and intuitive understanding of inequalities, but the only tool you have is induction and its consequences. Here's a hint: replace the inequalities with equalities and then eliminate y from everything. Now look at the theorems you have already from earlier in this world.</p>",
        "id": 450544220,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1720639520
    },
    {
        "content": "<p>Thank you, I got it now! Interesting how much it helps to know whether you're on the right track; previously I tried something similar but gave up much too quickly.<br>\nRE the removed levels: sounds very reasonable. I can imagine it can get quite abstract explaining more formal mathematics and functional programming at the same time. I, for one, don't really know what abstract types/propositions are. Do you (or anyone else who reads this) maybe have a recommendation for a (hopefully as fun as NNG4) resource to learn more about functional programming (in Lean)?</p>",
        "id": 450557234,
        "sender_full_name": "Thijs Vromen",
        "timestamp": 1720643058
    },
    {
        "content": "<p>I learnt what little I know about functional programming from <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a> but isn't there even a book called something like functional programming in Lean??</p>",
        "id": 450558606,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1720643372
    },
    {
        "content": "<p>As a mathematician I've never been too worried about the programming side of things, in fact the thing I enjoy about Lean the most is that I can write proofs without ever having to worry about running the corresponding functions or even thinking about them as functions or coding or anything like that.</p>",
        "id": 450558886,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1720643426
    },
    {
        "content": "<p>Oh woops, there is! I'll take a look at both, thanks.</p>",
        "id": 450568351,
        "sender_full_name": "Thijs Vromen",
        "timestamp": 1720646680
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"735367\">Thijs Vromen</span> has marked this topic as resolved.</p>",
        "id": 450592602,
        "sender_full_name": "Notification Bot",
        "timestamp": 1720654784
    }
]