[
    {
        "content": "<p>I've been using Neovim with Lean very happily for a few weeks.  Tried creating a new repo.  One time with github, then <code>lake init</code>, the second time with <code>lake new LearnLean</code>, then I hooked that up to github.  I install mathlib without apparent trouble.  I can edit some of my own source files, and that's fine.  I see \"Processing file ...\" for a second, and then the type information appears, and everything's great.  But when I edit the Main.lean created by lake, I get an error \"Unknown package: LearnLean ...\" from <code>import «LearnLean»</code>, and \"Processing file ...\" hangs there.  I'm not sure whether anything's happening.  The OS doesn't show Lean or anything like that using CPU.  I get tired of it and quit nvim.</p>\n<p>After that, nvim gives me \"E21: Cannot make changes, 'modifiable' is off\", not only on Main.lean, but on every Lean source file that I open in that repo, unless I explicitly <code>:set modifiable</code> in nvim.  The file permissions are all readable, and the problem doesn't happen with vim--only neovim.  I see no nvim swap files in the usual place, .local/state/nvim</p>\n<p>The reason I remade the repo a second time was to get rid of this problem, but it's back.  It's not a problem in other repos for Lean source or otherwise.</p>\n<p>Apologies if this is not a Lean problem, but something else.  I've never seen it before, and it certainly seems to be triggered by Lean.  Did I break something by quitting nvim when I got the error in Main.lean?  What to do to fix it?</p>",
        "id": 426628856,
        "sender_full_name": "mars0i",
        "timestamp": 1710450324
    },
    {
        "content": "<p>I've now tracked down the problem to a configuration in lean.nvim and submitted issue: <a href=\"https://github.com/Julian/lean.nvim/issues/333\">https://github.com/Julian/lean.nvim/issues/333</a></p>\n<p>(By default, lean.nvim prevents editing the Lean standard library.  It does this by preventing editing of any file that is under a path <code>*/src/lean/</code>.  Since I put my source code under <code>~/src</code>, and then group code under <code>~/src</code> into directories named after the language I'm using, I put one of my Lean repos under <code>~/src/lean/</code>, making lean.nvim think that my repo was part of the standard library, even though it's not intermingled with the standard library.)</p>",
        "id": 426667933,
        "sender_full_name": "mars0i",
        "timestamp": 1710473419
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"617444\">mars0i</span> has marked this topic as resolved.</p>",
        "id": 426667939,
        "sender_full_name": "Notification Bot",
        "timestamp": 1710473426
    }
]