[
    {
        "content": "<p>Is there a way to not having to recompile every dependency for every project?<br>\nMore specifically, can I compile a package once and then just tell lake where it is?</p>",
        "id": 393590272,
        "sender_full_name": "Scott Rieter",
        "timestamp": 1695861330
    },
    {
        "content": "<p>The problem is that projects depends on a very specific version of your dependencies, and it's in general unlikely that you even end up with shareable dependencies. However, mathlib's cache support puts things in a per-user folder</p>",
        "id": 393623427,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1695880649
    },
    {
        "content": "<p>Thank you for your answer.</p>\n<p>Yeah, I kind of expected it wouldn't be practical. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span><br>\nDo you think the very specific version requirements of packages (which are sometimes even specific git commits) are primarily a result of the fast-paced development of the project as a whole?<br>\nAnd does that mean that dependencies might become shareable in the future once things have stabilized and there is a higher focus on backwards-compatibility?</p>\n<p>Also, without practical use and merely as an exercise to learn more about the lean toolchain, is it still possible to build a given package, say, std4, once in advance, store the build somewhere and then use it when building mathlib and some other project (which happens to require the exact same version)?</p>",
        "id": 393646114,
        "sender_full_name": "Scott Rieter",
        "timestamp": 1695888584
    },
    {
        "content": "<p>Just to check that you're aware: you know that I never ever build mathlib or anything else? I use <code>lake exe cache get</code> to download precompiled binaries for mathlib and all its dependencies, so I'm up and running quickly without ever needing to compile anything.</p>",
        "id": 393773412,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1695922526
    },
    {
        "content": "<p>I realize that what I'm asking for is impractical for most actual use cases, probably including mine.</p>\n<p>As far as I understand it, mathlib4 is the only package that supports fetching precompiled binaries.<br>\nSuppose I have several projects which all depend on the same version of std4 but not on mathlib4.<br>\nAre there other options besides recompiling std4 or adding mathlib4 as a dependency so I can use <code>lake exe cache get</code>?</p>",
        "id": 393794650,
        "sender_full_name": "Scott Rieter",
        "timestamp": 1695930467
    },
    {
        "content": "<p>This is a planned feature as part of the reservoir and cloud build effort but it is not here yet</p>",
        "id": 393795286,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1695930725
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"654320\">Scott Rieter</span> has marked this topic as resolved.</p>",
        "id": 393814779,
        "sender_full_name": "Notification Bot",
        "timestamp": 1695940625
    }
]