[
    {
        "content": "<p>Hello Everyone,</p>\n<p>I'm currently in Grade 12 but in about a month I'll be in College. I've only started using Lean yesterday, I barely have any experience with proof assistants, only knowing some basic Idris2 but the technology heavily interests me.</p>",
        "id": 373360041,
        "sender_full_name": "Perigord",
        "timestamp": 1688779038
    },
    {
        "content": "<p>I'm currently going through the \"Theorem Proving in Lean 4\" book,  though in my install <code>Proof : Prop → Type</code> was not found. I know later on it's mentioned that <code>Proof</code> is redundant though I'd still like to know how it is defined. Als</p>",
        "id": 373360478,
        "sender_full_name": "Perigord",
        "timestamp": 1688779261
    },
    {
        "content": "<p>Welcome!</p>",
        "id": 373375814,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1688788691
    },
    {
        "content": "<p>Can you give a more precise pointer in to the book? Where is <code>Proof</code> discussed?</p>",
        "id": 373375833,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1688788712
    },
    {
        "content": "<p>It is mentioned at the very start of <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/propositions_and_proofs.html\">Chapter 3: Propositions and Proofs</a> as a way of introducing the Propositions-as-Types paradigm.<br>\n<code>Proof</code> is not actually something in Lean. This discussion of <code>Proof</code> was more to explain a possible way that logic <em>could</em> be encoded in Lean, not how it actually is. Lean actually expresses proofs without the <code>Proof</code> type. It explains later that  if <code>P</code> is a proposition then instead of writing <code>Proof P</code> to represent the types of proofs of <code>P</code>, we can just consider <code>P</code> to be the type of its own proofs (this is the subject of the rest of the chapter).</p>",
        "id": 373381615,
        "sender_full_name": "Niels Voss",
        "timestamp": 1688792610
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"630796\">Perigord</span> has marked this topic as resolved.</p>",
        "id": 373388266,
        "sender_full_name": "Notification Bot",
        "timestamp": 1688796219
    }
]