[
    {
        "content": "<p>I'm trying to set up lean in VS code and got a bit confused about the docker container. Is it recommended to use docker containers when using lean? For example, the Mathematics in Lean project contains a dockerfile which prompts VScode to ask me whether I want to use a docker container. As I understand it a docker copies your file to a space so any modifications in it stays in that space? but it actually confuses me because I can't move files around on my PC as easily.</p>\n<p>I'm not that familiar with workspaces and related workflows in general, so it'll be great if someone can explain to me what are the benefits of doing so or is it just an optional thing for those who know what they're doing.</p>",
        "id": 440909223,
        "sender_full_name": "awefhio",
        "timestamp": 1716838329
    },
    {
        "content": "<p>I don't use a docker container</p>",
        "id": 440912999,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1716840301
    },
    {
        "content": "<p>The <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a> project contains a dev container so people are familiar with docker and such can use it, but you don't have to use it.</p>\n<p>Particularly the setup in that dev container is very basic, it's just a bare Ubuntu, with elan  and lean 4 VSCode extension installed, <del>and it doesn't map some path to your actual paths outside the container, so all modification you do indeed stays inside the container</del>.</p>\n<p><del>So, it's indeed not recommend to use the dev container provided by <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a> project, unless you are just on Github Codespace, and just want to look around, and do nothing persistent.</del></p>",
        "id": 440963313,
        "sender_full_name": "Utensil Song",
        "timestamp": 1716871298
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"722108\">awefhio</span> has marked this topic as resolved.</p>",
        "id": 441018677,
        "sender_full_name": "Notification Bot",
        "timestamp": 1716895688
    },
    {
        "content": "<p>Sorry my previous comment was incorrect because I seldom use dev containers but my own container scripts (for test Ubuntu on Mac) where I have to mount things explicitly.</p>\n<p>The workspace files are mounted in the dev container so you are actually modifying local files so they are persistent.</p>\n<p>See <a href=\"https://code.visualstudio.com/remote/advancedcontainers/change-default-source-mount\">https://code.visualstudio.com/remote/advancedcontainers/change-default-source-mount</a> .</p>",
        "id": 441022961,
        "sender_full_name": "Utensil Song",
        "timestamp": 1716897300
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"722108\">awefhio</span> has marked this topic as unresolved.</p>",
        "id": 441026358,
        "sender_full_name": "Notification Bot",
        "timestamp": 1716898413
    },
    {
        "content": "<p>two questions:</p>\n<ol>\n<li>if I move the local files around, say to a different directory, does the container script still point to the same container an let the container know where the local files are?</li>\n<li>if I create a new container for a new project, does it have to install lean (and other packages) from scratch? wondering whether that'll get cumbersome once projects starts to get larger.</li>\n</ol>\n<p>and also just wondering in general, what advantage does using a container have over running everything directly in the local directory.</p>",
        "id": 441027188,
        "sender_full_name": "awefhio",
        "timestamp": 1716898702
    },
    {
        "content": "<p>Scoping it to dev container but not general container:</p>\n<ol>\n<li>The dev container will still mount the workspace directory if you move files within it, the movement can be seen by the container, and vise versa</li>\n<li>If multiple projects are using the same dockerfile, then the base image doesn't need to be recreated for each projects, they will be shared across projects, that's how docker works.</li>\n</ol>\n<p>In genera I don't see why I need to work on Lean in a container, except when my Ubuntu CI is broken, and I need to figure out why on my Mac, that's usually a FFI issue or issues about other dependencies.</p>",
        "id": 441029665,
        "sender_full_name": "Utensil Song",
        "timestamp": 1716899551
    },
    {
        "content": "<p>thanks!</p>",
        "id": 441030463,
        "sender_full_name": "awefhio",
        "timestamp": 1716899844
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"722108\">awefhio</span> has marked this topic as resolved.</p>",
        "id": 441030472,
        "sender_full_name": "Notification Bot",
        "timestamp": 1716899848
    }
]