[
    {
        "content": "<p>Suppose I'm developing proofs of some results in (Nat) arithmetic and number theory and I use <code>linarith</code> or <code>nlinarith</code> to discharge simple sub-goals.  Is there a possibility that my proofs are secretly circular and I just don't know it because of how these tactics are implemented?</p>\n<p>I'm not sure this question entirely makes sense, or if what I mean is whether the soundness of my proofs depends on an unstated assumption that <code>linarith</code> and friends are correct, and a proof of that (if it's been formalized) in turn depends on the results I'm trying to prove.</p>",
        "id": 469475756,
        "sender_full_name": "Benjamin Jones",
        "timestamp": 1726077268
    },
    {
        "content": "<p>Soundness does not depend on the soundness of tactics. Tactics generate proof terms, and a <code>by</code> expression evaluates to a complete proof term. The proof term is checked by the kernel.</p>\n<p>You can use <code>by?</code> to see the proof term generated by a sequence of tactics. You can also use <code>#print your_thm_name</code> to see the full proof term.</p>",
        "id": 469476434,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1726077513
    },
    {
        "content": "<p>You can also do <code>#print axioms your_thm_name</code> to verify that there are no linarith-specific axioms being introduced.</p>",
        "id": 469476494,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1726077540
    },
    {
        "content": "<p>If you're proving really low-level facts about Nat for some pedagogical purpose, then using <code>linarith</code> might be too powerful, since <code>linarith</code> constructs proofs using a library of proved facts about Nat and that low-level fact might be in that library in some form.</p>",
        "id": 469478019,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1726078102
    },
    {
        "content": "<p>I once developed a theory of integers independent from Lean's, defining them as a quotient rather than the more computational definition in core. When proving things like multiplication being well-defined I had to prove a bunch of tricky \"natural number game\"-like levels, but I used standard tactics to do them and when I looked at the proof terms they were indeed \"circular\" in the sense that sometimes lean would use the <code>zify</code> tactic and facts about its internal integers <code>Int</code> to deduce things about my implementation <code>MyInt</code>. Not logically circular but also not what I was expecting!</p>",
        "id": 469480897,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1726079401
    },
    {
        "content": "<p>Thanks for the replies! This is good motivation for me to go look at the proof terms now :)</p>",
        "id": 469482369,
        "sender_full_name": "Benjamin Jones",
        "timestamp": 1726080009
    },
    {
        "content": "<p>Looking at the proof terms in simple sub-goal I have, <code>linarith</code> does introduce casts to GMP-backed <code>Int</code> and uses <code>zify</code> just as <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> indicated.</p>\n<p>Just comparing the size of the proof terms when using <code>linarith</code> vs. a much simpler <code>contradiction</code> based proof is pretty interesting.</p>",
        "id": 469485566,
        "sender_full_name": "Benjamin Jones",
        "timestamp": 1726081276
    },
    {
        "content": "<p>Don't forget to also compare the size of the time taken to write the proof :-)</p>",
        "id": 469511090,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1726090900
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"621618\">Benjamin Jones</span> has marked this topic as resolved.</p>",
        "id": 469525556,
        "sender_full_name": "Notification Bot",
        "timestamp": 1726099545
    }
]