[
    {
        "content": "<p>There's <a href=\"https://leanprover-community.github.io/mathematics_in_lean/C02_Basics.html#proving-facts-about-algebraic-structures\">this bit</a> in Mathematics in Lean:</p>\n<blockquote>\n<p>The left and right versions are easily shown to be equivalent, given the commutativity of <code>⊓</code> and <code>⊔</code>. <strong>It is a good exercise to show that not every lattice is distributive by providing an explicit description of a nondistributive lattice with finitely many elements.</strong> It is also a good exercise to show that in any lattice, either distributivity law implies the other</p>\n</blockquote>\n<p>Regarding the part I bolded — I just want to confirm that this isn't something we can actually do with the material explained in the book so far, is it? I expect we'd need to define a type of a specific shape and somehow posit it is a Lattice. I'm sure it's doable but am I correct that this isn't something that was actually covered in the book so far, and so isn't really expected to be solved?</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span></p>",
        "id": 498146323,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1738855315
    },
    {
        "content": "<p>I think that part is only meant to be done informally (if at all). To formalize that in Lean, you'd indeed need to construct an instance of a lattice, and constructing instances of structures is explained in chapter 6.</p>",
        "id": 498149397,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1738856051
    },
    {
        "content": "<p>Makes sense, thanks!</p>",
        "id": 498151930,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1738856702
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"418569\">Dan Abramov</span> has marked this topic as resolved.</p>",
        "id": 498152064,
        "sender_full_name": "Notification Bot",
        "timestamp": 1738856735
    }
]