[
    {
        "content": "<p>Currently, I'm thinking about getting a new laptop and since I expect to use Lean a lot in the next years it makes sense to optimize for that. I assume that RAM is the most important factor, are there any other things to look out for? </p>\n<p>Also, what amount of RAM is sensible? For using Isabelle, up to 64GB are recommended according to its website. </p>\n<p>I might get funding from my department fur buying the laptop, but that's not entirely clear yet. So I would both be interested in the ideal, expensive configuration and the more affordable, but still reasonably fast one.</p>",
        "id": 402200930,
        "sender_full_name": "Jonas Bayer",
        "timestamp": 1700044852
    },
    {
        "content": "<p>You'll be perfectly fine with 16 GB and 8+ cores for basically all developments. The Isabelle idea of \"if it doesn't work get more RAM\" does not apply to Lean right now.</p>",
        "id": 402201458,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1700045019
    },
    {
        "content": "<p>Was about to say something along those lines. I think most users here don't go above 16GB of RAM. Maybe some power users who do a lot of local builds have 32GB of RAM.</p>\n<p>Skimming through <a class=\"stream-topic\" data-stream-id=\"270676\" href=\"/#narrow/stream/270676-lean4/topic/Lake.20parallel.20builds\">#lean4 &gt; Lake parallel builds</a>, I found this:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"110087\">Scott Morrison</span> <a href=\"#narrow/stream/270676-lean4/topic/Lake.20parallel.20builds/near/401454297\">said</a>:</p>\n<blockquote>\n<p>In-file parallelism (coming!) will help here.</p>\n<p>Disentangling the mathlib import tree can help as well. (i.e. locate moments when relatively few files are compiling simultaneously, and then try and reduce import dependencies on those).</p>\n<p>It might also be possible, but only with a substantial change to Lake, to prioritize compiling those files with the most downstream dependents. This would mean that during the phases when we are CPU bound rather than import bound, we work on the files which will open up more tasks.</p>\n</blockquote>\n<p>So it sounds like you'd be able to benefit more from having a higher number of cores if you're looking for a way to spend more money</p>",
        "id": 402202832,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1700045465
    },
    {
        "content": "<p>Also RAM is easily upgradable and either you need it or not. I was working on a gaming laptop with 16GB and at some point I started using more memory so I just upgraded to 64GB.</p>",
        "id": 402223896,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1700051130
    },
    {
        "content": "<p>Apple's unified memory is <em>not</em> easily upgradable, just fyi. I recommend Linux <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 402240981,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1700055268
    },
    {
        "content": "<p>I have 32Gb of RAM and never ran out of memory while using Lean.</p>",
        "id": 402251522,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1700057625
    },
    {
        "content": "<p>A fast CPU also helps. I often see students trying to use Lean on computers where it requires a <em>lot</em> of patience.</p>",
        "id": 402251717,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1700057674
    },
    {
        "content": "<p>I'll add one note: I almost never run Lean <em>on</em> my laptop because it's 10 years old, and it's a bit slow, although it does have 16 Gb of RAM, and as Patrick said, that is always enough for me. Instead, when I use my laptop, I ssh into a more powerful desktop machine using Tailscale and use the remote VS Code feature. It works wonderfully.</p>",
        "id": 402255193,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1700058592
    },
    {
        "content": "<p>I have been thinking of trying that for  a long while. My main worry is that then all the code is remote, and when I’m on a train or so I have to remember to copy it locally first.</p>",
        "id": 402260392,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1700059954
    },
    {
        "content": "<p>I also often use Lean over SSH, with the VS Code extension, and it works like a charm. Of course one needs an internet connection.</p>",
        "id": 402261288,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1700060163
    },
    {
        "content": "<p>Does it reconnect seamlessly if the connection drops?</p>",
        "id": 402276308,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1700064091
    },
    {
        "content": "<p>Yes, it reconnects seamlessly. I have occasionally run into the problem of not having something locally when I'm without a connection, but that can be a problem a lot of times anyway because I can't get a cache, so it's not too different.</p>",
        "id": 402381274,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1700108426
    },
    {
        "content": "<p>Thanks a lot for all this helpful input!</p>",
        "id": 402444668,
        "sender_full_name": "Jonas Bayer",
        "timestamp": 1700133085
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"605003\">Jonas Bayer</span> has marked this topic as resolved.</p>",
        "id": 402444684,
        "sender_full_name": "Notification Bot",
        "timestamp": 1700133093
    },
    {
        "content": "<p>I have 16 GB RAM and it appears to be just enough for running Lean and having a few other apps opened at the same time. I would pay extra attention to how fast your drive is.</p>",
        "id": 402529663,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1700158744
    }
]