[
    {
        "content": "<p>There's nothing wrong with them per se but having to deal with the concept of an \"index\" feels strangely cumbersome to me.</p>\n<p>This is a very \"vibes\" complaint but it feels similar like going from <code>foreach</code> to a plain <code>for</code> loop.</p>\n<p>Somehow I really want to think of <code>⋃ i, A i</code> as a kind of a <code>flatMap</code>, and when I do <code>flatMap</code> in programming, the concept of an \"index\" never shows up. But here it does. I think I would've expected to deal with \"sets of sets\" (and two different flavors of flattening over them) than with \"indexed sets\".</p>\n<p>Does my complaint make any sense? Is this a stylistic thing to align with how it's usually done in mathematics? Are there clear advantages to thinking in terms of indexing as opposed to having union/intersect flatten a \"set of sets\" or something similar? Should I \"respect\" <code>I</code> a little bit more, is it more than just machinery here?</p>",
        "id": 499934924,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1739641815
    },
    {
        "content": "<p>For whatever reason, in Lean there's less of an emphasis on point-free programming.</p>\n<p>For what it's worth, you <em>could</em> write <code>Set.iUnion A</code> directly. It's just that the notation for it doesn't expose the point-free version.</p>",
        "id": 499935867,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1739642242
    },
    {
        "content": "<p>If you have an actual set of sets (<code>A : Set (Set X)</code>) then there's <code>⋃₀ A</code> for <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Set.sUnion#doc\">docs#Set.sUnion</a></p>",
        "id": 499936085,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1739642291
    },
    {
        "content": "<p>(Connecting these: <code>⋃ i, A i = ⋃₀ (Set.range A)</code>)</p>",
        "id": 499936770,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1739642440
    },
    {
        "content": "<p>Ah great, looks like <code>sUnion</code> is slightly closer to my taste. Good to know it's easy to convert.</p>",
        "id": 499937073,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1739642504
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"418569\">Dan Abramov</span> has marked this topic as resolved.</p>",
        "id": 499937095,
        "sender_full_name": "Notification Bot",
        "timestamp": 1739642507
    },
    {
        "content": "<p>Broader picture, indexed families of sets are a common object, so it makes sense to support them.</p>\n<p>Certainly <code>Set.sUnion</code> is important too (<code>Set</code> forms a monad with <code>x =&gt; {x}</code> as <code>pure</code>, <code>Set.sUnion</code> as <code>flatten</code>/<code>join</code>, and <code>Set.image</code> as <code>fmap</code>. There's a monad instance <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Set.monad#doc\">docs#Set.monad</a>, but it's not enabled by default because it causes some surprising coercions to become enabled that create terms that aren't idiomatic), but I feel like sets of sets aren't nearly as common as indexed families. Maybe it's because the index tends to have some meaning than a set of sets throws away?</p>",
        "id": 499938543,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1739643141
    },
    {
        "content": "<p>I guess a difference is that there cannot be duplicated sets in \"set of sets\" but there could be for an indexed family of sets.</p>",
        "id": 499944436,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1739648344
    }
]