[
    {
        "content": "<p>Tactics can be employed for type resolution instead of proposition proving, i.e. tactics can be used in the body of functions whose type is not Prop. Usually, when the type of the function is Prop, we can straightforwardly see them as producing and rewriting logical propositions into implied or equivalent ones. But what does it mean to use tactics when you're not attempting to prove something, i.e., outside the context of theorems and propositions? I've seen this once or twice so far.</p>",
        "id": 467595859,
        "sender_full_name": "nrs",
        "timestamp": 1725466914
    },
    {
        "content": "<p>Using tactics to produce a non-Prop term is indeed discouraged, not so much for any theoretical reason, but for the kind of terms that tactics produce.</p>\n<p>Ultimately, a tactic proof produces a term of the given type, just like a term-mode proof.</p>\n<p>However, with very few exceptions, the terms produced by tactics are usually very unwieldy.  As a consequence, it is usually very hard to <em>prove</em> anything about the terms constructed by tactics and hence the definition is \"correct but essentially unusable\".</p>",
        "id": 467597232,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1725467185
    },
    {
        "content": "<p>(Tactics construct terms, both values and proofs are terms, so tactics can construct values.)</p>",
        "id": 467597548,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1725467252
    },
    {
        "content": "<p>Try using <code>by?</code> (or equivalently <code>show_term by</code>) to see what term a tactic script produces.</p>",
        "id": 467597682,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1725467280
    },
    {
        "content": "<p>Ah that makes a lot of sense! thank you very much for the explanation!</p>",
        "id": 467597983,
        "sender_full_name": "nrs",
        "timestamp": 1725467345
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"749978\">nrs</span> has marked this topic as resolved.</p>",
        "id": 467608719,
        "sender_full_name": "Notification Bot",
        "timestamp": 1725469553
    }
]