[
    {
        "content": "<p>Is there a difference between a forall expression like <code>∀ x, Pred x</code>and a plain function <code>fun x =&gt; Pred x</code>?</p>\n<p>I'm finding it difficult to find what a forall expression actually does because cmd+clicking on different forms of forall expressions just takes me to various syntax and binder helpers, not any <code>Forall</code> type declaration. So I don't know what forall expressions ultimately construct or return</p>",
        "id": 505989804,
        "sender_full_name": "aron",
        "timestamp": 1742154496
    },
    {
        "content": "<p>Yes, there's a big difference between those, but it's the difference between function types and function expressions.</p>\n<p>If you had asked \"is there a difference between <code>∀ x : T, Pred x</code> and <code>(x : T) → Pred x</code>, then the answer would be \"no\". The forall is just familiar notation when the function type is dependent and a proposition.</p>",
        "id": 505990086,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1742154706
    },
    {
        "content": "<p>The docs for the \"forall type declaration\" is <a href=\"https://leanprover-community.github.io/mathlib4_docs/foundational_types.html\">here</a>.</p>",
        "id": 505990219,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1742154793
    },
    {
        "content": "<p>ah yes I should've written an example of function <em>type</em> syntax, not an example of a function value expression</p>\n<p>but <span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> you're saying that forall syntax <code>∀ (t : T), r</code> is literally just syntax sugar over <code>(t : T) → r</code>?</p>",
        "id": 505990482,
        "sender_full_name": "aron",
        "timestamp": 1742154979
    },
    {
        "content": "<p>Yes, however, if you see <code>∀ x ∈ s, p x</code>, that's syntax sugar for <code>(x : _) -&gt; x ∈ s -&gt; p x</code>.</p>",
        "id": 505990572,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1742155054
    },
    {
        "content": "<p>ha, yes I was literally about to say: is <code>∀ x ∈ m, Pred x m</code> just syntax sugar over <code>x → x ∈ m → Pred x m</code>?</p>\n<p>i.e. a function whose first param is some value and its second param is proof of some proposition (in this case membership) about that value?</p>",
        "id": 505990725,
        "sender_full_name": "aron",
        "timestamp": 1742155166
    },
    {
        "content": "<p>yes but! make sure you say <code>(x : _) → ...</code> instead of <code>x → ...</code> because otherwise you treat <code>x</code> as a type instead of a name</p>",
        "id": 505990880,
        "sender_full_name": "Robin Arnez",
        "timestamp": 1742155251
    },
    {
        "content": "<p>I don't think it's something you can see on hovers yet. Hovers should show more explicit versions of syntax, so you can see what's going on in terms of fundamental Lean expressions. I'll add it to the list of things to look into.</p>",
        "id": 505990911,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1742155279
    },
    {
        "content": "<p>Ah yes good point. Ok thanks for clarifying! that's really helpful</p>",
        "id": 505990923,
        "sender_full_name": "aron",
        "timestamp": 1742155288
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"814082\">aron</span> has marked this topic as resolved.</p>",
        "id": 505990931,
        "sender_full_name": "Notification Bot",
        "timestamp": 1742155297
    },
    {
        "content": "<p>(Oh, it's already on my list!)</p>",
        "id": 505990955,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1742155318
    },
    {
        "content": "<p>yeah that would be really helpful actually! if I'd had that on hover, it would've demystified the otherwise magical-looking <code>∀</code> syntax for me and made it clear what's actually going on</p>",
        "id": 505991030,
        "sender_full_name": "aron",
        "timestamp": 1742155349
    },
    {
        "content": "<p>Answering the first version of your last message: I keep a long list of things that would be nice to fix about Lean (mostly from watching the Zulip), and every once in a while I go through and decide if it's the right time to tackle one, especially if it is relevant to the current mission of the Lean FRO.</p>",
        "id": 505991167,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1742155444
    }
]