[
    {
        "content": "<p>Hi everyone. I am a PhD student at the University of Technology Sydney. My major is programming language theory, and I found LEAN may be helpful in my work. After going through the introductions, I still have some questions:</p>\n<ol>\n<li>What is the status of the mathlib for LEAN4? Are we rewriting it in LEAN4, or are the former libraries simply suited for LEAN4?</li>\n<li>Things like partially ordered sets or domain theory are essential for program analysis. If there is no existing work on this in LEAN, maybe I can help.</li>\n</ol>",
        "id": 291280275,
        "sender_full_name": "Yingte Xu",
        "timestamp": 1659065704
    },
    {
        "content": "<p>to answer 1, I would look around the <a class=\"stream\" data-stream-id=\"287929\" href=\"/#narrow/stream/287929-mathlib4\">#mathlib4</a> channel where mathport is discussed. I believe the plan is to port mathlib to lean4, but that effort is not nearly done. Feel free to read the last <a href=\"https://leanprover-community.github.io/blog/posts/intro-to-mathport/\">mathport status report</a> for more context</p>",
        "id": 291280414,
        "sender_full_name": "Calvin Lee",
        "timestamp": 1659065957
    },
    {
        "content": "<p>Welcome! To answer question 2, mathlib for Lean 3 currently has a relatively large library on order theory, <a href=\"https://github.com/blanchette/logical_verification_2021/blob/main/lean/love10_denotational_semantics_demo.lean#L74\">which we adapted to prove the Knaster-Tarski theorem in the course Logical Verification</a>. The original statement in mathlib seems to be <a href=\"https://leanprover-community.github.io/mathlib_docs/find/fixed_points.function.fixed_points.complete_lattice\">docs#fixed_points.function.fixed_points.complete_lattice</a>.</p>",
        "id": 291308605,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1659093142
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"518552\">Yingte Xu</span> has marked this topic as resolved.</p>",
        "id": 291311311,
        "sender_full_name": "Notification Bot",
        "timestamp": 1659095342
    }
]