[
    {
        "content": "<p>I read the following blog about dependent type theory </p>\n<ul>\n<li><a href=\"https://www.ma.imperial.ac.uk/~buzzard/lean_together/source/appendix/type_theory.html\">https://www.ma.imperial.ac.uk/~buzzard/lean_together/source/appendix/type_theory.html</a></li>\n</ul>\n<p>As a newcomer to formal mathematics, I wanted to check my understanding - are the following correct?</p>\n<ol>\n<li>There are many ways to construct useful mathematical objects from a minimal set of axioms. Set Theory (ZF/ZFC) is the standard one people learn, and it indeed can be used to construct useful sets (eg integers, rationals) and things like functions.</li>\n<li>Another way is Dependent Type Theory (DTT). In this way DTT and Axiomatic Set Theory perform the same function - they allow us to create useful objects from a minimal set of assumptions and rules.</li>\n<li>ZFC Set Theory has several axioms - eg axiom of fusion, axiom of replacement, axion of regularity, axion of power set. However. DTT only has 3 axioms- to quote the blog \"there are three axioms enabling the user to construct new types from old, namely the axioms asserting the existence of function types, inductive types, and quotient types.\" These three are sufficient to build types like the integers, propositions, and objects like functions. </li>\n</ol>\n<p>That last one (3) is the one that surprised me - if it is true.</p>\n<p>Perhaps a more correct view is that:</p>\n<ul>\n<li>ZFC allows us to create many more kinds of objects than DTT</li>\n<li>But the objects that DTT allows us to create, and the rules it comes with are very convenient for doing things like proof verification - so DTT may be smaller in scope but it is better at the one thing it does.</li>\n</ul>",
        "id": 492925272,
        "sender_full_name": "rzeta0",
        "timestamp": 1736506805
    },
    {
        "content": "<p>There are only 3 axioms (for one meaning of the word axiom), but there is the whole \"Calculus of Inductive Constructions\" that is helping you build the objects you want, like the natural numbers.</p>",
        "id": 492928024,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1736507784
    },
    {
        "content": "<p>In the end, ZFC+universes and DTT+CIC+3-axioms have the same \"scope\".</p>",
        "id": 492928118,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1736507820
    },
    {
        "content": "<p>I'm not sure if you want to go down the rabbit hole of CIC. But if you want to understand the details of how set-theoretic foundations compare to Lean's foundations, then CIC plays a big role in that.</p>",
        "id": 492928237,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1736507875
    },
    {
        "content": "<p>This is one of the situations where mathematical words differ from common english usage. Type Theory has few “axioms” in a technical sense, but lots of “rules of inference”. Under the more usual, non-technical interpretation though, both are really kinds of “axioms”</p>",
        "id": 493019276,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1736540188
    },
    {
        "content": "<p>You might have better luck understanding this distinction if you look up Hilbert Calculus and Natural Deduction, which is going to be much easier than trying to do so by comparing ZFC and CIC.</p>",
        "id": 493019417,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1736540262
    },
    {
        "content": "<p>In any case, CIC is definitely not simpler than ZFC (I think you would be hard pressed to find a logician, even a type theorist, willing to say anything of the sort). It has better properties under some points of view, such as using it to build a proof assistant (though not others, such at its meta-theory being rather more complex)</p>",
        "id": 493019815,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1736540434
    },
    {
        "content": "<p>If you want to look at CIC written down in all of its splendour, you can look at it here: <a href=\"https://coq.inria.fr/doc/v8.9/refman/language/cic.html\">https://coq.inria.fr/doc/v8.9/refman/language/cic.html</a> but beware, you should wear sunglasses</p>",
        "id": 493020061,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1736540558
    },
    {
        "content": "<p>Thanks for the replies.</p>\n<p>Previously I was missing the idea that CIC is a key element of doing mathematics in DTT using those 3 axioms.</p>\n<p>I think diving into CIC is too advanced for me, but we have achieved what I wanted - to understand at a very high level the differences and similarities between ZFC-based maths and how maths is done in Lean+mathlib.</p>\n<p>Crucially, I wasn't aware that the scopes of ZFC-maths + DTT+CIC+3-axioms have the same scope.</p>",
        "id": 493120496,
        "sender_full_name": "rzeta0",
        "timestamp": 1736622679
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"724904\">rzeta0</span> has marked this topic as resolved.</p>",
        "id": 493120503,
        "sender_full_name": "Notification Bot",
        "timestamp": 1736622685
    }
]