[
    {
        "content": "<p>The book mentions that for a proposition <code>β</code>, <code>(x : α) → β</code> is a proposition, no matter which type universe <code>α</code> lives in.<br>\nAnd this distinguishes <code>Prop</code> from other types.<br>\nI understand that the above allows for \"higher order\" reasoning.. we can state claims about a property of the natural numbers.. and we can state claims about all properties of all Type0 elements.. etc</p>\n<p>I quote the book</p>\n<blockquote>\n<p>This reflects the interpretation of <code>Prop</code> as the type of propositions rather than data, and it is what makes <code>Prop</code> <em>impredicative</em>.</p>\n<p>The term \"predicative\" stems from foundational developments around the turn of the twentieth century, when logicians such as Poincaré and Russell blamed set-theoretic paradoxes on the \"vicious circles\" that arise when we define a property by quantifying over a collection that includes the very property being defined. Notice that if <code>α</code> is any type, we can form the type <code>α → Prop</code> of all predicates on <code>α</code> (the \"power type of <code>α</code>\"). The impredicativity of <code>Prop</code> means that we can form propositions that quantify over <code>α → Prop</code>. In particular, we can define predicates on <code>α</code> by quantifying over all predicates on <code>α</code>, which is exactly the type of circularity that was once considered problematic.</p>\n</blockquote>\n<p>I am looking for resources that elaborate more.. the historical development.. what paradoxes were blamed on \"vicious circles\"? why is this circularity not considered problematic here?</p>",
        "id": 517366035,
        "sender_full_name": "Ahmed Ameer",
        "timestamp": 1746973943
    },
    {
        "content": "<p>for example russel's paradox</p>",
        "id": 517370348,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1746977035
    },
    {
        "content": "<p>the clue there being that \"the set of sets which don't contain themselves\" references itself in the definition, which is a \"vicious circle\" of sorts</p>",
        "id": 517370468,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1746977111
    },
    {
        "content": "<p>First off, you can have \"higher order reasoning\" even without impredicativity, as is the case in Martin-Löf Type Theory (MLTT). <a href=\"https://agda.readthedocs.io/en/latest/getting-started/what-is-agda.html\">Agda</a> is a fairly popular proof assistant based on MLTT, as a concrete example. <a href=\"https://proofassistants.stackexchange.com/a/331\">Here</a> is a very good answer (as always) by Andrej Bauer which goes further into impredicativity, and searching further on proofassistant.stackexchange and mathoverflow you'll find more explanations.  Further than that there's a bunch of papers by Martin-Löf and Feferman you can read if you really want the deep dive, so those are the names to google. </p>\n<p>For the historical side, you can look at Part II.7 of the Princeton Companion to Mathematics (\"The Crisis of Foundations\"), in particular II.7.2.2 \"Impredicativity\", though I'd recommend the whole chapter to have some context. There's also has a \"further reading\" section at the end. If you can read french, Poincaré's original essays make for some really nice reading. </p>\n<p>In any case, as <span class=\"user-mention\" data-user-id=\"684366\">@Edward van de Meent</span> said, the key takeaway at the logic level is that various paradoxical constructions (Russel, Burali-Forti, Girard, ...) all have a common feature that they make an object by quantifying over a collection which already contained the object that they're trying to define (this is the impredicativity bit), and this can seem philosophically troublesome. On the practical side, since generally the more powerful you make your logic, the more likely things go wrong somewhere, not allowing impredicative definitions (which has to be made formal depending on what logical framework you are working in exactly) was/is seen as a way to make your logic safer.</p>",
        "id": 517372957,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1746978878
    },
    {
        "content": "<p>Then this gets tied into even more philosophical aspects about what is or isn't good style mathematics, which is largely a smokescreen for people to pick fights about what kind of mathematical questions they personally prefer to ask about mathematical objects...</p>",
        "id": 517373291,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1746979150
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"466290\">@Luigi Massacci</span> <span class=\"user-mention\" data-user-id=\"684366\">@Edward van de Meent</span> <br>\nThanks<br>\nand really great resources!</p>\n<p>My last question: why is this circularity not considered problematic here? the impredicativity in Lean<br>\nThe quote seems to suggest that it is not problematic here in Lean..</p>",
        "id": 517375545,
        "sender_full_name": "Ahmed Ameer",
        "timestamp": 1746980737
    },
    {
        "content": "<p>Well because here it doesn't lead to a contradiction</p>",
        "id": 517385039,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1746988290
    },
    {
        "content": "<p>In and of itself impredicativity doesn't cause a system to become inconsistent (it is after all a fairly ubiquitous style of reasoning, think about the definition of \" least upper bound\" or \"subgroup generated by\" ) it is however a key ingredient in those particular paradoxes</p>",
        "id": 517385244,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1746988442
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"466290\">Luigi Massacci</span> <a href=\"#narrow/channel/113489-new-members/topic/Looking.20for.20extra.20resources.20-.20TPiL.20chapter4/near/517385244\">said</a>:</p>\n<blockquote>\n<p>In and of itself impredicativity doesn't cause a system to become inconsistent (it is after all a fairly ubiquitous style of reasoning, think about the definition of \" least upper bound\" or \"subgroup generated by\" ) it is however a key ingredient in those particular paradoxes</p>\n</blockquote>\n<p>I have no problem with this<br>\nI see it prevalent in math.. I think impredicativity would lead to more natural/intuitive reasoning whereas predicativity may require certain tricks/workarounds?</p>\n<p><span class=\"user-mention silent\" data-user-id=\"466290\">Luigi Massacci</span> <a href=\"#narrow/channel/113489-new-members/topic/Looking.20for.20extra.20resources.20-.20TPiL.20chapter4/near/517385039\">said</a>:</p>\n<blockquote>\n<p>Well because here it doesn't lead to a contradiction</p>\n</blockquote>\n<p>What does Lean have to disallow these contradictions/paradoxes?<br>\nI read: \"Girard's paradox is the type-theoretic analogue of Russell's paradox in set theory\"<br>\njust looking for the simple general idea.. like in set theory (from wikipedia)</p>\n<blockquote>\n<p>ZFC does not assume that, for every property, there is a set of all things satisfying that property. Rather, it asserts that given any set X, any subset of X definable using first-order logic exists. The object R defined by Russell's paradox above cannot be constructed as a subset of any set X, and is therefore not a set in ZFC</p>\n</blockquote>",
        "id": 517390777,
        "sender_full_name": "Ahmed Ameer",
        "timestamp": 1746992783
    },
    {
        "content": "<p>Essentially the fact that <em>only</em> <code>Prop</code> is impredicative. All the other sorts aren't, and once you are in <code>Prop</code> you can't escape (with some minor but very restricted exceptions)</p>",
        "id": 517393256,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1746994894
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"902375\">Ahmed Ameer</span> has marked this topic as resolved.</p>",
        "id": 517426273,
        "sender_full_name": "Notification Bot",
        "timestamp": 1747024029
    }
]