[
    {
        "content": "<p>Hi, I’m new to Lean and I’m trying to clear up some confusion I have around which features are part of the kernel. I’ve played through the natural number game, I’ve read through a few blog posts and I’m partway through the Theorem Proving in Lean book.</p>\n<p>My confusion is this: I have seen distinctions made between “term-style” and “tactic-style” proofs, and also between (paraphrasing) “proofs the kernel can check” and “tools that produce proofs the kernel can check”. </p>\n<p>Are these two distinctions equivalent; i.e. are “term-style” proofs exactly verifiable as-is by the Lean kernel? </p>\n<p>And does this mean that when I run <code>#print theorem1</code> on a tactic-style proof, the output I get is a term-style proof that is directly verifiable by the kernel?</p>",
        "id": 482439392,
        "sender_full_name": "Harald Carlens",
        "timestamp": 1731603417
    },
    {
        "content": "<p>Term-style proofs aren't directly verifiable by the kernel — there are some features, like typeclass inference and implicit variable assignment that the kernel can't do</p>",
        "id": 482440955,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1731603828
    },
    {
        "content": "<p>Thanks! So is running <code>lean4export</code> the only way to get a kernel-verifiable proof? Or is there a way to do this from within an interactive Lean session e.g. in VS Code?</p>",
        "id": 482442414,
        "sender_full_name": "Harald Carlens",
        "timestamp": 1731604253
    },
    {
        "content": "<p>You don't really want to see the gigantic term the kernel checks. <code>set_option pp.all true </code> gives you an idea (before a print)</p>",
        "id": 482442422,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1731604255
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"747502\">Harald Carlens</span> has marked this topic as resolved.</p>",
        "id": 482442973,
        "sender_full_name": "Notification Bot",
        "timestamp": 1731604447
    }
]