[
    {
        "content": "<p>So far my only introduction to mathematics (outside of non-rigorous past botched attempts) was with Tao's Analysis. He starts with Peano axioms, then later builds ZFC, and mentions Peano could've been rebuilt on top of ZFC with Von Neumann. From that point on he's building rationals, Cauchy sequences, reals, and so on.</p>\n<p>In Lean, it seems like \"foundational\" primitives are different. I started reading a bit about <a href=\"https://golem.ph.utexas.edu/category/2013/01/from_set_theory_to_type_theory.html\">Set vs Type theory</a> as a foundation but found that article a bit hard to digest in detail.</p>\n<p>The reason I started reading about it at all is <a href=\"https://adam.math.hhu.de/#/g/leanprover-community/nng4/world/Algorithm/level/5\">because of the <code>succ_inj</code> exercise</a>. What do you <em>mean</em> by saying it's a Peano axiom but we're going to <em>prove</em> it? Obviously we're using some different foundational scaffolding. I think I'm kind of getting that dependent types encode some knowledge (that enables pattern matching) which makes some axioms \"fall out for free\" out of the model.</p>\n<p>But setting the \"we want a compiler\" part aside, I'm wondering how does this fit into the actual mathematics. I.e. if we were <em>not</em> building a proof checker, would it still be alluring to use dependent types as a foundational piece instead of Set theory and instead of having <code>succ_inj</code> being an axiom? Am I even correct to say that this is a Type theory-based approach?</p>\n<p>I guess I'm wondering if there's some text similar to Tao's rigorous (but minimal!) introduction that uses the same \"foundational philosophy\" (not sure what's the right term) as what Lean uses — so that I could read it as a primer on the chosen foundational primitives (without getting bogged down by the implementation details). And whether what Lean uses is even able to serve as a foundational piece, or if it's a product of some kind of compromise (as most computer things tend to be).</p>\n<p>Pardon the vague nature of the question — appreciate any pointers! Thanks :)</p>",
        "id": 497112319,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1738370191
    },
    {
        "content": "<p>So the following facts are foundation-agnostic: the reals are equivalence classes of Cauchy sequences of rationals, the rationals are the field of fractions of the integers, and the integers are the additive groupification of the naturals. But what are the naturals? They're a sufficiently primitive object that the answer to that question depends very much on your foundations. </p>\n<p>The first foundation I was taught was ZFC set theory, where 0 is the empty set, 1 is {0}, 2 is {0,1} and so on, and then it's an axiom that {0,1,2,3,...} is a set, and then you can prove Peano's axioms and the principles of induction and recursion.</p>\n<p>The next one I was taught was Peano's axioms, where you don't ever answer the question \"what actually <em>is</em> 0?\", you just postulate its existence, and the existence of the successor function, and then you postulate a few axioms (e.g. induction, succ injective, succ x isn't ever 0) and go on from there.</p>\n<p>The last one I was taught was Lean's version of the naturals, where you postulate the existence of 0 and the successor and a form of the axiom of recursion for Sort-valued motives. \"Sort u\" is a way in Lean of saying \"either the universe of true-false statements (<code>Prop</code>) or a universe of sets or types or whatever you want to call them -- however you want to say \"a collection of stuff\" in your theory (Lean calls it <code>Type</code> or <code>Type u</code> if you want to use universes). This recursion for Sort-valued motives is the principle of induction (when the motive is Prop-valued) and the principle of recursion (when it's Type-valued) but it's also strong enough (and I was very surprised by this) to prove the other two axioms (successor injective and succ x can't be 0).</p>",
        "id": 497113134,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738370796
    },
    {
        "content": "<p>if you don't mind a dive into the deep end, <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span>'s MS thesis on the Type Theory of Lean (technically Lean 3) has a ton of info on the axiomatic foundations of Lean: <a href=\"https://github.com/digama0/lean-type-theory/releases\">https://github.com/digama0/lean-type-theory/releases</a></p>\n<p>(I assume much of it holds true for Lean 4 but I can't say for sure)</p>",
        "id": 497113450,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1738371049
    },
    {
        "content": "<p>For me the thing which is most beautiful about this is that this means the entire definition can be encapsulated into</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"kn\">inductive</span><span class=\"w\"> </span><span class=\"n\">Nat</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"kt\">Type</span>\n<span class=\"bp\">|</span><span class=\"w\"> </span><span class=\"n\">zero</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">Nat</span>\n<span class=\"bp\">|</span><span class=\"w\"> </span><span class=\"n\">succ</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">Nat</span><span class=\"w\"> </span><span class=\"bp\">-&gt;</span><span class=\"w\"> </span><span class=\"n\">Nat</span>\n</code></pre></div>\n<p>in Lean (or indeed in any system which uses the calculus of inductive constructions). Behind the scenes this inductive construction set-up constructs a recursor, or eliminator, for the type automatically, and this recursor is exactly the principles of induction and recursion. </p>\n<p>Regarding \"how does this fit into the actual mathematics\", in my heavily prejudiced view as a mathematician, this nonsense has nothing to do with mathematics. Gauss and Euler and Riemann were all proving theorems about natural numbers and prime numbers without ever needing to know what the answer to the question \"what <em>is</em> 0?\" was, and in my mind this is substantial evidence that such a question is not mathematics but philosophy. All a mathematician needs to know is that Peano's axioms are true, not why they are true.</p>",
        "id": 497113464,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738371060
    },
    {
        "content": "<p>Ahh, I didn't realize that if you actually start with ZFC, you can derive Peano axioms from it. That makes sense in retrospect. Also see your point re: this being more of a \"meta\" question standing outside mathematics if the rest works the same regardless of the foundation.</p>\n<p>Re: Lean approach, I'll need to spend some time digesting this, but I think what you're saying is that these inductive definitions let us generalize between the processes of construction (when we want to do recursive calculations) and the process of induction (when we want to recursively prove things, like with an axiom schema). I guess this also means that logic itself is embedded deeper into this foundational approach because it seems to treat theorems and values on a similar level.</p>",
        "id": 497114299,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1738371673
    },
    {
        "content": "<p>Yeah the buzz phrases are \"Propositions as types\" and \"a proof is a program\"</p>",
        "id": 497114643,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1738371960
    },
    {
        "content": "<p>If you want to read a bit more about how logic and foundations are encoded in Lean's type theory, <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">Theorem Proving in Lean 4</a> might be a good place to start. Compared with \"Mathematics in Lean\", it spends a lot more time on logic before getting into \"real math\", but it could be a useful counterpart if you're interested in some of those details.</p>",
        "id": 497114929,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1738372162
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"418569\">Dan Abramov</span> has marked this topic as resolved.</p>",
        "id": 497121733,
        "sender_full_name": "Notification Bot",
        "timestamp": 1738377950
    }
]