[
    {
        "content": "<p>Hello! I recently started using Lean, switched over from Rocq, and I'm used to working in the CoqIDE that gives you a view of proof state on the screen as you work through a proof. I can see that this does exist in VSCode, but it's a little finnicky (at least for term-style proofs; I'm not sure if it's nicer for tactic-style proofs). Notably, if the proof is incomplete, I have to keep putting \"Sorry\" statements in, or the infoview just yells at me about errors. Also, since the proof state is based on your text cursor, it is often replaced by an error as soon as you start typing. If this is just a limitation of the language, that's fine, but is there an easier way to keep the proof state in view as you're writing it, or a setting that I didn't see?</p>",
        "id": 513225031,
        "sender_full_name": "Sara",
        "timestamp": 1745114093
    },
    {
        "content": "<p>If you move your cursor to a proof state you want to see, you can click the little pin icon or pause icon. The first saves the current state and continues to show updates below it, and the second pauses updating completely.</p>\n<p><a href=\"/user_uploads/3121/_g8dk1SenjIIAGaR78G3JfQX/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/_g8dk1SenjIIAGaR78G3JfQX/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"186x102\" src=\"/user_uploads/thumbnail/3121/_g8dk1SenjIIAGaR78G3JfQX/image.png/840x560.webp\"></a></div>",
        "id": 513226259,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1745115084
    },
    {
        "content": "<p>The language does assume that you have complete terms, filled in with <code>sorry</code>. (You can use <code>_</code> too, but that tends to give you \"could not synthesize placeholder\", and errors override displaying expected type information.)</p>\n<p>The tactic language makes that a little easier to deal with, since it's syntactically valid to have an incomplete tactic proof.</p>",
        "id": 513226346,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1745115148
    },
    {
        "content": "<p>Ok, that's basically what I needed, thanks.  It'll probably get easier too once I get out of formal logic exercises and am able to name my hypotheses in a coherent manner :D</p>",
        "id": 513226658,
        "sender_full_name": "Sara",
        "timestamp": 1745115411
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"900472\">Sara</span> has marked this topic as resolved.</p>",
        "id": 513228636,
        "sender_full_name": "Notification Bot",
        "timestamp": 1745117120
    },
    {
        "content": "<p>Are you using <code>_</code> to fill in holes? Then the errors are constrained to the holes.</p>",
        "id": 513308333,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1745184286
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113489-new-members/topic/.E2.9C.94.20clearer.20view.20of.20proof.20state.20in.20VSCode.3F/near/513308333\">said</a>:</p>\n<blockquote>\n<p>Are you using <code>_</code> to fill in holes? Then the errors are constrained to the holes.</p>\n</blockquote>\n<p>Sometimes they're not when having a hole makes the implicit type argument also fail to synthesize</p>",
        "id": 513309135,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1745184994
    },
    {
        "content": "<p>Yes, but not using them at all (which a newcomer might be doing) means that your errors are all over the place and it's awful, this is why I was conjecturing it.</p>",
        "id": 513310508,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1745185875
    }
]