[
    {
        "content": "<p>I'm still trying to absorb the basics of type theory .. this key question popped up:</p>\n<p><strong>Why aren't Propositions of type Bool?</strong></p>\n<p>Informally (I'm not formally trained) - I think of expressions as syntactically correct lego bricks, and propositions as things that can be true or false. </p>\n<p>I was watching this <a href=\"https://www.youtube.com/watch?v=bhgeoZpZ-54\">video</a> and didn't understand his explanation of why it is insufficient to have propositions as always true or false.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"bhgeoZpZ-54\" href=\"https://www.youtube.com/watch?v=bhgeoZpZ-54\"><img src=\"https://uploads.zulipusercontent.net/fe2f24cc0074b5dc03e4cab6bf44f6d802968abd/68747470733a2f2f692e7974696d672e636f6d2f76692f626867656f5a705a2d35342f64656661756c742e6a7067\"></a></div><p>Is it because some propositions are undecidable - in the sense of Russel's paradox?<br>\nI think this isn't the reason Lean wouldn't have <code>Prop</code> as <code>Bool</code> because I can't image mathematicians doing everyday proofs using undecidable propositions. </p>\n<p>Is there a more down-to-earth answer, something like \"first order logical statements, predicates(?) aren't immediately decidable because they depend on a variable\"? And for some values the propositions are true, for others false, and for yet others undecidable or even non-sensical?</p>",
        "id": 494247023,
        "sender_full_name": "rzeta0",
        "timestamp": 1737067648
    },
    {
        "content": "<p>Decidability will depend on using excluded middle, really what you might be saying is from every (p: Prop),  (h : p or not p) is occupied.</p>\n<p>Whilst Prop is not bool, it is often the point of a theorem to show that it reduces to True or to False. </p>\n<p>You could define α → Bool.</p>\n<p>But it won't be very useful, because that is always either True or False. It isnt a type that contains terms other than that, whereas Prop is a Type that contains terms which may or may not reduce to True or False -- and its up to you to prove that.</p>",
        "id": 494273344,
        "sender_full_name": "Abraham Solomon",
        "timestamp": 1737082664
    },
    {
        "content": "<p>Thanks Abraham, it is helpful how you explained that often we want to reduce a prop to true/false, but  that the type Prop must have elements richer than true/false in order to be useful.</p>",
        "id": 494274243,
        "sender_full_name": "rzeta0",
        "timestamp": 1737083231
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"724904\">rzeta0</span> <a href=\"#narrow/channel/113489-new-members/topic/why.20aren't.20Propositions.20of.20Type.20Bool.3F/near/494274243\">said</a>:</p>\n<blockquote>\n<p>Thanks Abraham, it is helpful how you explained that often we want to reduce a prop to true/false, but  that the type Prop must have elements richer than true/false in order to be useful.</p>\n</blockquote>\n<p>The last chapter of TPIL helped me personally, there are a few technical reasons too.</p>\n<p>Prop is actually a type universe, so Props are types, and a term of a Prop is its proof.</p>\n<p>Now, Prop is a special type universe , to use something called 'proof irrelevance'. Essentially it doesn't matter what the term of a type Prop is, any term will do. This is like every Prop being a set and its either occupied with a distinguished element * or not.</p>\n<p>This element is sort of like 'True' and a Prop type being occupied by any term is like it having a 'True' attached to it. False also has a special interpretation.</p>\n<p>This type universe is also special, because we want to use function arrows as implications. Meaning type Prop → Prop still lives in the Prop universe ( another prop : of one proposition implying another ).</p>\n<p>So yea, i guess in these ways it works a bit more intricately than Bool. Bool → Bool being Bool would need something else to be used as an actual Bool.</p>",
        "id": 494277074,
        "sender_full_name": "Abraham Solomon",
        "timestamp": 1737085057
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"724904\">rzeta0</span> has marked this topic as resolved.</p>",
        "id": 494341600,
        "sender_full_name": "Notification Bot",
        "timestamp": 1737114022
    },
    {
        "content": "<p>Thanks again - your ways of explaining has been helpful.</p>\n<p>If you're able to (if you have the patience and time) - I'm still struggling with the idea of \"function as proof\"</p>\n<p><a class=\"message-link\" href=\"/#narrow/channel/113489-new-members/topic/beginner.20question.20about.20proof.20by.20function/near/493977565\">#new members &gt; beginner question about proof by function @ 💬</a> </p>\n<p>Your thoughts would be very appreciated. Basically I can't see which types of function can be a proof because in general they can't all be.</p>",
        "id": 494341914,
        "sender_full_name": "rzeta0",
        "timestamp": 1737114137
    }
]