[
    {
        "content": "<p>I'm working through problems in Sipser's Intro to Theory of Computation, and being new to Lean found it painstaking to find the right tactics to prove some simple propositions, but then found out that by trivial greatly simplifies things. Just wondered if it is considered more idiomatic to be more explicit and avoid overusing trivial.</p>",
        "id": 508168702,
        "sender_full_name": "ta-32",
        "timestamp": 1742957900
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"889379\">ta-32</span> has marked this topic as resolved.</p>",
        "id": 508202995,
        "sender_full_name": "Notification Bot",
        "timestamp": 1742976012
    },
    {
        "content": "<p>Hi, I think it really depends on the overall goal. I need to start with an example. If the learner is trying to learn what a student would learn by taking a course in theory of computation, then, why not follow a course and do all the problems just as a student in the course would?</p>\n<p>It just so happens that the author has shared his lectures, along with lecture slides and assignments.<br>\n<a href=\"https://ocw.mit.edu/courses/18-404j-theory-of-computation-fall-2020/\">https://ocw.mit.edu/courses/18-404j-theory-of-computation-fall-2020/</a></p>\n<p>If that aligns with the overall goal, then I think there is a course design principle that could determine a requirement to guide your approach.</p>\n<p>Backward design<br>\n<a href=\"https://dltoolkit.mit.edu/best-practices/designing-a-course/\">https://dltoolkit.mit.edu/best-practices/designing-a-course/</a></p>\n<p>Starting with the goal, design backwards ensuring the dependencies are satisfied. At some point, within this dependency graph, there will be a learning goal at the granularity of </p>\n<p>\"understand problem 2.3 - inside an out - all of the ideas - down to first principles\"</p>\n<p>At that point, using a tactic which instantly solves the problem is just brain dead and completely defeats the entire point of the exercise. I could be wrong, but I think that this is the <strong>crux of your question?</strong></p>\n<p>More generally, \"First principles\" also depends on the course, and is different for every course, by that I mean, a first course on real analysis will probably not reduce every problem down to the foundations of esoterics. And, because each course has a different floor, it's clear that each course will need to weaken the proof environment and set a floor, where below: tactic automation runs unhindered, and above: where learners are required to reinvent the wheel.</p>\n<p>How To: Nerf automation so it's still helpful but doesn't help too much? There is at least one solution to this. Anyone can check the Mechanics of Proof code base, specifically this file:</p>\n<p><a href=\"https://github.com/hrmacbeth/math2001/blob/main/Library/Basic.lean\">https://github.com/hrmacbeth/math2001/blob/main/Library/Basic.lean</a></p>\n<p>Notice that tactics are modified or disabled.</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"kn\">macro</span><span class=\"w\"> </span><span class=\"s2\">\"linarith\"</span><span class=\"w\"> </span><span class=\"n\">linarithArgsRest</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">tactic</span><span class=\"w\"> </span><span class=\"bp\">=&gt;</span><span class=\"w\"> </span><span class=\"bp\">`</span><span class=\"o\">(</span><span class=\"n\">tactic</span><span class=\"w\"> </span><span class=\"bp\">|</span><span class=\"w\"> </span><span class=\"n\">fail</span><span class=\"w\"> </span><span class=\"s2\">\"linarith tactic disabled\"</span><span class=\"o\">)</span>\n</code></pre></div>\n<p>Weaker custom tactics were also developed for the course:<br>\n<a href=\"https://github.com/hrmacbeth/math2001/tree/main/Library/Tactic\">https://github.com/hrmacbeth/math2001/tree/main/Library/Tactic</a></p>",
        "id": 508352095,
        "sender_full_name": "Derek Rhodes",
        "timestamp": 1743013924
    },
    {
        "content": "<p>Thank you for the thoughtful and detailed response.</p>",
        "id": 508403632,
        "sender_full_name": "ta-32",
        "timestamp": 1743035835
    }
]