[
    {
        "content": "<p>I'm not really sure if it's bug or feature, but I just found that <code>\\sim</code> transforms into <code>∼</code>, which is different from <code>~</code>. I found this when I was trying to write <code>~[Filter.atBot]</code> and obtaining uninformative \"expected token\" error messages. I'm curious if <code>∼</code> is used somewhere, because <code>\\sim</code> is the way most people encode asymptotic equivalence in LaTeX.</p>",
        "id": 464431085,
        "sender_full_name": "jsodd",
        "timestamp": 1724345573
    },
    {
        "content": "<p>It looks like it's used in one place at least, in <code>Mathlib.ModelTheory.Order</code> as <code>FirstOrder.Language.BoundedFormula.not</code></p>",
        "id": 464431479,
        "sender_full_name": "Julian Berman",
        "timestamp": 1724345721
    },
    {
        "content": "<p>I think you should ask this in <a class=\"stream\" data-stream-id=\"287929\" href=\"/#narrow/stream/287929-mathlib4\">#mathlib4</a>  possibly.</p>",
        "id": 464432059,
        "sender_full_name": "Julian Berman",
        "timestamp": 1724345886
    },
    {
        "content": "<p>Maybe we should add <code>priority := 1</code> notations for these \"false friends\" that emit an error telling you want to type instead</p>",
        "id": 464437357,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1724346876
    },
    {
        "content": "<p>(the low priority would still allow downstream code to override the notation if it really wanted to)</p>",
        "id": 464437494,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1724346901
    },
    {
        "content": "<p>I think we should have a \"full\" unicode linter, e.g., one that uses a whitelist. Allowing all unicode is likely to cause headaches long-term (since unicode is such an untamable beast). I tried to argue for it in <a href=\"#narrow/stream/287929-mathlib4/topic/Whitelist.20for.20Unicode.3F/near/448721083\">this</a> discussion.</p>\n<p>If anyone is interested, I'd also try to help implement it, though one would probably need a lot of community opinions before implementing anything that has a chance of being adopted. It seemed as though my opinion that this is a good idea is a minority one, however.</p>",
        "id": 464480805,
        "sender_full_name": "Adomas Baliuka",
        "timestamp": 1724360641
    },
    {
        "content": "<p>An alternative would be for Lean itself to emit \"did you mean...\" messages for visually similar unicode characters if the one typed gives an error and an alternative does not</p>",
        "id": 464557107,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1724393897
    }
]