[
    {
        "content": "<p>This is a question that pertains to the 'lay of the land' of the math subjects for understanding Lean or to more conversation about books.</p>\n<p>--Where I'm coming from:<br>\nI had tried learning math in the somewhat 'mainstream'/classical way 'from scratch'/from the ground up by reading first textbooks in introductory mathematical logic, and then planning to read texts in other subjects in logic such as set theory, model theory, recursion theory, proof theory, etc and then finally moving on to subjects like algebra and analysis. In my search for texts there was a general consensus of which textbooks were very good to read for every one of these subjects that I googled. For example, Chang and Keisler for model theory, Odifreddi for recursion theory, Dummit and Foote for algebra, and Rudin for analysis. There are of course alternatives but some names pop up more than others.</p>\n<p>--What I'm looking for:<br>\nThen I realize I was on a completely wrong course of study and <strong>should instead be reading books that teach math in constructive logic and type theory</strong>. So I was wondering what the modern 'authoritative' list of math subjects from scratch (and in what order) are, or in other words <strong>what the 'dependency tree' of subjects looks like</strong>, leading to an understanding from which learning 'the ins and outs of' Lean would be a relatively simple matter.</p>\n<p>--Why:<br>\nThe reason I am asking is because the best book 'from the ground up' (in the 'right' perspective) that I've found so far (imo) is 25 years old and is from a chain of obscure bibliographical references: Avigad's Mathematical Logic and Computation -&gt; Harper's Practical Foundations for Programming Languages -&gt;  Taylor's Practical Foundations of Mathematics, the TOC of which is here: <a href=\"https://www.paultaylor.eu/~pt/prafm/\">https://www.paultaylor.eu/~pt/prafm/</a>. This book promotes the constructivist philosophical outlook. It essentially makes the statement that math [in a constructive type system] such as Lean's is the 'highest'/ideal way  or best foundation in which math should be taught and learned. It does this in a convincing way from a historical picture of math foundations. I also like that it has the 'dependency tree' laid out for you, the introductory subjects being ones like lambda calculus and category theory.</p>",
        "id": 433337933,
        "sender_full_name": "David Sprayberry",
        "timestamp": 1713199120
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"646630\">David Sprayberry</span> has marked this topic as resolved.</p>",
        "id": 433528203,
        "sender_full_name": "Notification Bot",
        "timestamp": 1713275705
    }
]