[
    {
        "content": "<p>I'm stuck on the level of the Set Theory Game mentioned above: <a href=\"https://adam.math.hhu.de/#/g/djvelleman/stg4/world/FamCombo/level/6\">https://adam.math.hhu.de/#/g/djvelleman/stg4/world/FamCombo/level/6</a> <br>\nI fail to see how to make the the hypothesis 'relevant' for the rest of the proof. I managed to prove some other set relations based on it, for example:<br>\n<a href=\"/user_uploads/3121/EpgjKnCcdY-tdbA_QSLaXI3b/image.png\">image.png</a><br>\nHowever, perhaps because I'm missing a sense of direction, I fail to make real inroads into proving the goal. <br>\nDoes anyone have a hint on how I should try to use the (original) hypothesis?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/EpgjKnCcdY-tdbA_QSLaXI3b/image.png\" title=\"image.png\"><img data-original-dimensions=\"480x308\" src=\"/user_uploads/thumbnail/3121/EpgjKnCcdY-tdbA_QSLaXI3b/image.png/840x560.webp\"></a></div>",
        "id": 462054898,
        "sender_full_name": "Thijs Vromen",
        "timestamp": 1723538695
    },
    {
        "content": "<p>There are some steps at the beginning of this one that you should do without thinking:</p>\n<ol>\n<li>Introduce an arbitrary <code>x</code> of type <code>U</code>.</li>\n<li>Assume <code>x ∈ ⋃₀ F ∩ ⋃₀ G</code>.</li>\n<li>Unpack the meaning of the assumption in step 2, and see what it tells you.</li>\n<li>Unpack the meaning of the goal at this point, which is <code>x ∈ ⋃₀ (F ∩ G)</code>, to see what you have to do to complete the proof.</li>\n</ol>\n<p>Have you done those steps?</p>\n<p>If not: Don't worry about how to make the hypothesis 'relevant'.  Do the steps above.</p>\n<p>If so, then you know that to complete the proof you need to come up with some <code>t ∈ F ∩ G</code> such that <code>x ∈ t</code>.  This is the tricky part.  You <em>almost</em> have what you need in the assumptions, but not quite.  <em>Now</em> is the time to think about how the hypothesis is relevant to completing the proof.</p>",
        "id": 462178960,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1723572747
    },
    {
        "content": "<p>Thank you for the reply!<br>\nDuring my 'first go' at the problem the steps you describe are indeed what I did. Just in case I missed something I re-did that just now (see picture: <br>\n<a href=\"/user_uploads/3121/6e7iaJyhzmgGDAbk5aGUZYHl/image.png\">image.png</a><br>\n).  <br>\nIt seems indeed like the assumptions are very close to what I need, but I fail to see how to use the hypothesis to provide the 'missing piece of the puzzle'. <br>\nPerhaps my problem stems from the fact that I don't see how to 'connect' the hypothesis to these rewritten terms in the assumption/goal. It feels to me like either the hypothesis needs more unpacking or I  would have to find matching terms in the unpacked version. Since I didn't manage to find a way to unpack the hypothesis I started to do all sorts of rewrites with the hypothesis &amp; unpacked assumption/goal (as shown in my previous message) to try to find the connection that I am currently not recognizing.<br>\nDo you have a hint what I am missing?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/6e7iaJyhzmgGDAbk5aGUZYHl/image.png\" title=\"image.png\"><img data-original-dimensions=\"480x183\" src=\"/user_uploads/thumbnail/3121/6e7iaJyhzmgGDAbk5aGUZYHl/image.png/840x560.webp\"></a></div>",
        "id": 463042226,
        "sender_full_name": "Thijs Vromen",
        "timestamp": 1723925336
    },
    {
        "content": "<p>On my phone, so have not verified formally. I think you have to use w as the witness. You know it's in F and contains x, so it suffices to show that it's also in G. Assume by contradiction that it's in G^c. Then x is in the LHS of h1 but not in the RHS. Qed</p>",
        "id": 463044537,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1723926425
    },
    {
        "content": "<p>To prove the goal, you have to figure out what to plug in for <code>t</code>.  You need something that is an element of both <code>F</code> and <code>G</code>, and that contains <code>x</code> as an element (what Ruben called a \"witness\" in his message).  Looking at your assumptions, it seems like <code>w</code> and <code>v</code> are likely choices (or perhaps some combination of them).  You know <code>w</code> is in <code>F</code> and <code>x</code> is in <code>w</code>, so if you could prove <code>w ∈ G</code> you could use <code>w</code> as the witness.  You know <code>v</code> is in <code>G</code> and <code>x</code> is in <code>v</code>, so if you could prove <code>v ∈ F</code> then you could use <code>v</code> as the witness.  So now is the time to look at <code>h1</code> and see if it would help you prove either of those.</p>",
        "id": 463048283,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1723928224
    },
    {
        "content": "<p>Notice that <code>h1</code> involves <code>F ∩ Gᶜ</code>, so you might be able to use it to reason about something that is in <code>F</code> but not <code>G</code>.  That suggests Ruben's strategy:  try to use proof by contradiction to prove <code>w ∈ G</code>, so that you can use <code>w</code> as the witness.</p>",
        "id": 463048845,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1723928457
    },
    {
        "content": "<p>Thank you both, I got it now! <br>\nI somehow didn't come up with attempting to prove  <code>w ∈ G</code>, instead of trying to prove the whole thing 'directly'. Feels a bit silly now but  I guess it's a good learning moment. (Special thanks to Dan Velleman for making the game, I'm having a lot of fun practicing mathematics/lean this summer vacation!)</p>",
        "id": 463145678,
        "sender_full_name": "Thijs Vromen",
        "timestamp": 1723977802
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"735367\">Thijs Vromen</span> has marked this topic as resolved.</p>",
        "id": 463145713,
        "sender_full_name": "Notification Bot",
        "timestamp": 1723977811
    }
]