[
    {
        "content": "<p>I've been using nvim for learning lean for the past few weeks and everything works pretty well overall, but about a week a ago I accidentally hit a few keys in the keyboard, and ever since then, every time I open nvim to work on a lean file, I get this message:</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>The `require('lspconfig')` \"framework\" is deprecated, use vim.lsp.config (see :help lspcon\nfig-nvim-0.11) instead.\nFeature will be removed in nvim-lspconfig v3.0.0\nPress ENTER or type command to continue\n</code></pre></div>\n<p>I just press ENTER and then I can use nvim without any problem, but it's still a bit annoying to get this message every time, so I would like to solve this problem. If you have any suggestion how to solve it, I would highly appreciate it.</p>",
        "id": 541791477,
        "sender_full_name": "Michael Novak",
        "timestamp": 1758966253
    },
    {
        "content": "<p>Have you followed the advice in the warning to use vim.lsp.config instead of require()? Based on the warning it seems like more of a neovim lsp configuration issue rather than a lean issue. I think the first step would just be to do what the warning says, right?</p>",
        "id": 541861875,
        "sender_full_name": "Rider Kirkpatrick",
        "timestamp": 1759034621
    },
    {
        "content": "<p>I just don't know how to do that exactly. How exactly, can I use vim.lsp.config instead of require()? What do I need to do? And what does it mean exactly, why do you think I get this message? Sorry if I'm asking too many questions and thank you for the response.</p>",
        "id": 541865593,
        "sender_full_name": "Michael Novak",
        "timestamp": 1759038133
    },
    {
        "content": "<p>Sorry, I thought I responded to this. This is <a href=\"https://github.com/Julian/lean.nvim/pull/428\">https://github.com/Julian/lean.nvim/pull/428</a> which is unfortunately still not mergeable because the upstream change is not a drop-in replacement.</p>",
        "id": 541901940,
        "sender_full_name": "Julian Berman",
        "timestamp": 1759074938
    },
    {
        "content": "<p>My best immediate advice just to make things less annoying would be to install and use <a href=\"https://github.com/rcarriga/nvim-notify\">https://github.com/rcarriga/nvim-notify</a> -- neovim's out of the box experience for warnings is terrible, which you've noticed as it interrupting your workflow and asking you to hit a key -- at least if you use notify then it will be some \"popup\" like thing which automatically disappears after a few seconds.</p>",
        "id": 541902146,
        "sender_full_name": "Julian Berman",
        "timestamp": 1759075114
    },
    {
        "content": "<p>I've spend quite a few hours today and yesterday trying to decide what the righter fix is -- and help is certainly welcome, that PR does the change, but all the test suite then fails for nuanced reasons having to do with when precisely LSP clients are started with the new interface relative to the old one. So it will take me a bit longer to decide what to do about this, especially given I am entertaining guests and don't have a ton of time to fix a silly upstream change.</p>",
        "id": 541902223,
        "sender_full_name": "Julian Berman",
        "timestamp": 1759075193
    },
    {
        "content": "<p>So -- another way if you're annoyed is \"downgrade lspconfig and the error will go away\" as well.</p>",
        "id": 541902254,
        "sender_full_name": "Julian Berman",
        "timestamp": 1759075212
    },
    {
        "content": "<p>Thank you very much for the response. First of all, I'm a bit glad that this is a known issue, because I thought that I did something wrong. Secondly, to be honest it's not that annoying for me, I don't mind getting this message every time I open nvim for a while until the bag is fixed. Is it fine to leave as it is for now? Of course I'm regularly updating the plugins with <code>:Lazy update</code> as you showed me a few weeks s ago (thanks again for that, it's very conviniant).</p>",
        "id": 541904585,
        "sender_full_name": "Michael Novak",
        "timestamp": 1759077458
    },
    {
        "content": "<p>Yes if it's only mildly annoying you just leave it, I hope to have it fixed soon.</p>",
        "id": 541905003,
        "sender_full_name": "Julian Berman",
        "timestamp": 1759077953
    }
]