[
    {
        "content": "<p>Hi, I'm working on a project in which I'm trying to formalize memglue, a cache coherence protocol, and the c11 memory model to prove that memglue upholds the c11 axioms. Currently, my c11 model relies on the old version of Rel, and I'm not sure whether it's worth rewriting everything to use the new Set version because the only benefit that is obvious to me is being able to reason about relations as Sets containing event pairs (e.g., can directly use set union to define relations formed from the union of other relations). On the other hand, if I were to use the new version of Rel, then I wouldn't be able to use Relation.Refl/TransGen directly anymore because Rel and Relation are now distinct types, which is problematic as I need to use those for some of the relations. I haven’t yet modified my code, so I’ve just been using the old definition along with custom instances of Union/Inter to make the notation less cumbersome. I was hoping to get some advice as to whether I should keep working with the old definition or if there are significant benefits to switching over to the new definition in terms of making it easier to prove the c11 axioms later. I couldn’t really understand the implementation notes for Rel and I’m sure that there are details I’m not seeing since I’m new to Lean and theorem proving, in general, so if someone could provide some guidance for my specific use case, that would be much appreciated. Thanks!<br>\n<a href=\"/user_uploads/3121/sMibsp8yQLGn7FbX8VtTaSXx/c11.lean\">c11.lean</a><br>\n<a href=\"/user_uploads/3121/0Unys-XOVf4Y8fFo18HjT0yy/memglueO.lean\">memglueO.lean</a></p>",
        "id": 530656671,
        "sender_full_name": "Angelina Chen",
        "timestamp": 1753395862
    },
    {
        "content": "<p>You can probably get by with <code>abbrev Rel' (A B : Type*) := A -&gt; B -&gt; Prop</code>, and the lattice notation should just work</p>",
        "id": 530664043,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1753400047
    },
    {
        "content": "<p>But I've posted a message in <a href=\"#narrow/channel/287929-mathlib4/topic/Changing.20.60Rel.60.20to.20.60Set.20.28.CE.B1.20.C3.97.20.CE.B2.29.60.2C.20to.20help.20uniform.20spaces/near/528531852\">#mathlib4 &gt; Changing &#96;Rel&#96; to &#96;Set (α × β)&#96;, to help uniform spaces @ 💬</a>  to suggest restoring at least the old <code>Rel</code> name to its former meaning</p>",
        "id": 530664069,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1753400065
    },
    {
        "content": "<p>Got it, I'll look into lattice notation, thanks so much!</p>",
        "id": 530701975,
        "sender_full_name": "Angelina Chen",
        "timestamp": 1753424989
    }
]