[
    {
        "content": "<p>Hey all! I don't have any projects or questions to share yet, but I wanted to make an introduction anyway. Doesn't seem to make sense to work in isolation with such an active community here!</p>\n<p>I'm Habeen, currently a CS PhD student with a math background (and a brief moment with academic music theory). I was lucky to find a professor at my instituion who's curious about Lean, as I've often thought theorem provers would be a great intersection of my mathematical and computational interests.</p>\n<p>I've worked through most of the Natural Number Game and started the Set Theory Game (although this game now looks to be taken off the website?); I now plan on reading through and understanding some of the IMO problem formalizations available in mathlib4.</p>\n<p>Let me know if you have any advice or would like to chat. Glad to be here!</p>",
        "id": 500741238,
        "sender_full_name": "Alex Habeen Chang",
        "timestamp": 1739998741
    },
    {
        "content": "<p>Hi! You'd be better off finding your own project rather than reading other people's. Think of a toy problem you want to solve and try and solve it; it doesn't matter if it's already been solved. Reading other people's code will only get you so far, and if the code is not written to be educational it might be actively confusing.</p>",
        "id": 500741951,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1739998987
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113489-new-members/topic/Alex.20Habeen.20Chang/near/500741951\">said</a>:</p>\n<blockquote>\n<p>Hi! You'd be better off finding your own project rather than reading other people's.</p>\n</blockquote>\n<p>Hello, and thanks for your work on Lean! Yes, I think I will soon need to get my own hands dirty with Lean. Luckily I have such a toy problem in mind from a different professor here...</p>",
        "id": 500743135,
        "sender_full_name": "Alex Habeen Chang",
        "timestamp": 1739999426
    }
]