[
    {
        "content": "<p>I see that i did not present myself to the community,<br>\nSo i though i may need to, even if that i started learning Lean at the end of last Year, but joined Zulip after searching for some answers more recently.<br>\nSo I'm a software architect in banking in Paris, I'm 47 and my name is Alfredo Moreira-Rosa.<br>\nI started lean-units library as i needed one for a small lab project, and thought i could find one here. I saw many attemps, but nothing at the level i needed for engineering.<br>\nI'm in the process to integrate some or all of it to PhysLean.<br>\nHopefully all will be merged, but we'll see how it goes.<br>\nI'm mostly interested in software part of Lean.<br>\nLean-units is some kind of a Trap i fall into <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span>, but after that i want to improve the https Client/Server status of Std Lean (not just http), as i see little progress on this side, and I need one for my lab project.<br>\nI'll may make announcement when lean-units gets integrated to PhysLean. <br>\nLean community, and PhysLean particularly is amazing, welcoming, always ready to help newcomers. So a Big thank you, especially to <span class=\"user-mention\" data-user-id=\"310045\">@Eric Wieser</span>and <span class=\"user-mention\" data-user-id=\"653351\">@Joseph Tooby-Smith</span>  that have given me good insights and help.<br>\nSo that's it. If you have any questions, i'll be happy to answer.</p>",
        "id": 544807207,
        "sender_full_name": "Alfredo Moreira-Rosa",
        "timestamp": 1760464061
    },
    {
        "content": "<p>And in case you are curious about lean-units, here's a link :<br>\n<a href=\"https://github.com/ecyrbe/lean-units\">https://github.com/ecyrbe/lean-units</a></p>",
        "id": 544807733,
        "sender_full_name": "Alfredo Moreira-Rosa",
        "timestamp": 1760464219
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"942100\">ecyrbe</span> <a href=\"#narrow/channel/113489-new-members/topic/Alfredo.20Moreira-Rosa/near/544807207\">said</a>:</p>\n<blockquote>\n<p>Lean-units is some kind of a Trap i fall into</p>\n</blockquote>\n<p>This whole area is full of traps! I fell in in 2017 and never really got out!</p>",
        "id": 545092112,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1760552355
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"942100\">@ecyrbe</span> if you're happy to announce your real name here, why not use it for your Zulip username? We don't demand it but we prefer it (especially for users who are interested in making useful contributions to the ecosystem, and my impression is that you are one of those users).</p>",
        "id": 545137071,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1760567269
    },
    {
        "content": "<p>Yes, fixed!</p>",
        "id": 545137364,
        "sender_full_name": "Alfredo Moreira-Rosa",
        "timestamp": 1760567435
    }
]