[
    {
        "content": "<p>When compilation errors occur, what determines when <code>lake build</code> stops? From what I’ve seen, it neither stops at the very first error nor continues compiling for as long as possible.</p>\n<p>Is there a way to configure <code>lake build</code> so that it doesn’t stop early: in other words, so that it attempts to compile as many files as possible?</p>",
        "id": 535256833,
        "sender_full_name": "Louis Cabarion",
        "timestamp": 1755676077
    },
    {
        "content": "<p>Is this not the default behavior?</p>",
        "id": 535257997,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1755676538
    },
    {
        "content": "<p>You probably need to specify the toolchain version you're using to receive better help.</p>",
        "id": 535275537,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1755682704
    },
    {
        "content": "<p>I think after an error is encountered in one file it might be possible to continue to compile files depending on it (after all an error in a file doesn't stop compilation of the rest of the file), but maybe the current restriction is that errored file doesn't generated an olean (not sure), and you very quickly get errors in downstream decls due to defeq issues or argument mismatches (a def with errors might pick up less arguments than intended). But both of these only happen for defs as far as I understand, so it should be okay to continue to compile other decls and files after a proof errors out.</p>",
        "id": 535280946,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1755684678
    },
    {
        "content": "<p>Can you clarify whether you want the build of <em>unrelated</em> files to continue despite errors (which it already does), or the build of <em>related</em> files?</p>",
        "id": 535302014,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1755692641
    },
    {
        "content": "<p>After some testing, I found that the behavior I asked about is already the default: <code>lake build</code> continues compiling unrelated files even if some fail. I had mistakenly assumed it would stop after a certain number of errors, as some other compilers do. Apologies for the confusion!</p>",
        "id": 535356314,
        "sender_full_name": "Louis Cabarion",
        "timestamp": 1755708948
    }
]