[
    {
        "content": "<p>Hi everyone,</p>\n<p>I'm Amogh, a recent PhD graduate from <em>The</em> Ohio State University. I was introduced to Lean and mathlib during the Lean3 days and had the opportunity to attend the Formalization of Mathematics workshop at SLMath in June 2023. I am now looking to actively contribute to mathlib4 and wanted to (re)introduce myself here. </p>\n<p>My research focuses on monoidal categories, specifically categorical groups (a.k.a. 2-groups). In my thesis, <strong>Coherence and Symmetrization for Categorical Groups</strong>, I gave a construction of the free categorical groups and showed multiple coherence results. I also <a href=\"https://github.com/parabamoghv/DashedMonoids\">formalized</a> a significant portion of this work in Lean 4, and I'm now interested in translating and extending that work into mathlib4.</p>\n<p>To start, I’m hoping to work on formalizing categorical groups, using the Baez–Lauda <a href=\"https://eudml.org/doc/124217\">paper</a> as a main reference. I wanted to know if there is already work happening in this direction, or if this sounds like something that would be useful to have in mathlib4. While I don’t work in TQFT myself, I’ve heard from others that these structures often show up there.</p>\n<p>I’m still new to contributing to mathlib4, so I will definitely need help as I get used to it. I have gone through the community guide for contributors. Is this the correct channel to ask workflow or lean questions? How does a typical workflow look?</p>\n<p>Excited to get to chat with many of you!!</p>\n<p>Thanks,<br>\nAmogh</p>",
        "id": 533831503,
        "sender_full_name": "Amogh",
        "timestamp": 1754930739
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"585803\">@Amogh</span> welcome, this is the correct channel, you typically want to ask around to gauge interest or get initial feedback before you spend a long time on a long PR, and typically PR's should be short (say around 200 lines) and focus on one thing at a time, that would be my advice.</p>\n<p>I hope most importantly that you have fun on this journey!</p>",
        "id": 533831761,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1754930853
    },
    {
        "content": "<p>Welcome! <span class=\"user-mention\" data-user-id=\"110087\">@Kim Morrison</span> is the canonical TQFT person, as you can see from their email <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 533832196,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1754931030
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> Yup, already messaged them.</p>",
        "id": 533833070,
        "sender_full_name": "Amogh",
        "timestamp": 1754931340
    }
]