[
    {
        "content": "<p>Hello!<br>\nI'm Amy, I'm a master's (part III) student at Cambridge, mostly interested in group theory<br>\nI've been somewhat aware of lean for a couple years now (originally through finding the natural numbers game), but as I've found myself with surprisingly little to do over this Christmas break, I thought I might take a deeper look at lean (and hopefully eventually add some more group theory to Mathlib)<br>\nI'm slowly working my way through <em>Functional Programming in Lean</em>, so we'll see where this goes</p>",
        "id": 562244228,
        "sender_full_name": "Amy Needham",
        "timestamp": 1765030064
    },
    {
        "content": "<p>Now would be a perfect time to do some of the basics in undergraduate representation theory! We have all the definitions but very few of the theorems.</p>",
        "id": 562246607,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765032912
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a> might be more suited for you than <a href=\"https://lean-lang.org/functional_programming_in_lean/\">#fpil</a>, given your background. Not that <a href=\"https://lean-lang.org/functional_programming_in_lean/\">#fpil</a> is by any means a bad thing to read, it's great and well-written. It just might not be the ideal on-ramp for you.</p>",
        "id": 562247231,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1765033617
    },
    {
        "content": "<p>If you are a mathematician who wants to know about what's going on under the hood then <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a> might be more appropriate than <a href=\"https://lean-lang.org/functional_programming_in_lean/\">#fpil</a></p>",
        "id": 562247793,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765034247
    },
    {
        "content": "<p>Ah!<br>\nThank you for the recommendation (both of book, and the note about representation theory - I'm a little surprised, but it's definitely something that sounds interesting to do)<br>\n!</p>",
        "id": 562251779,
        "sender_full_name": "Amy Needham",
        "timestamp": 1765039126
    },
    {
        "content": "<p>Definitions are difficult in formalization and it took the community a long time to decide what the exact definition of <code>Representation</code> should be, but we have finally decided. I'm thinking about continuous representations for the FLT project and am running into all sorts of holes. We got the definition of subrepresentation literally last week in <a href=\"https://github.com/leanprover-community/mathlib4/pull/31554\">#31554</a> (upstreamed from FLT) -- this is why I'm saying that it's a perfect time to start thinking about the basic theory. The next step is probably <code>IsIrreducibleRepresentation \\rho</code>, defined to mean <code>IsSimpleOrder (Subrepresentation \\rho)</code>, and then proofs of things like 1-dimensional representations are irreducible etc.</p>",
        "id": 562257734,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765045992
    },
    {
        "content": "<p>Kevin, can you point me to the discussion about <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Representation#doc\">docs#Representation</a> ? I looked there expecting to see something different based on your comments, but what I found is precisely what I expected. Is the issue that we were worried about <code>V →ₗ[k] V</code> having two different <code>Mul</code> instances and that we should use a type synonym instead?</p>",
        "id": 562269490,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1765060305
    },
    {
        "content": "<p>Here is the previous discussion. Basically the question was how much should we be bundling things.<br>\n<a class=\"message-link\" href=\"/#narrow/channel/116395-maths/topic/Representation.20Theory/near/498710886\">#maths &gt; Representation Theory @ 💬</a></p>",
        "id": 562269737,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1765060639
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"1004006\">@Amy Needham</span>, former Part III student here. If you're interested in formalising representation theory, I will soon start a project to formalise the Fourier theory of compact groups.</p>",
        "id": 562294735,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1765097009
    },
    {
        "content": "<p>(in fact, it'll be more general, but the greater generality isn't really famous)</p>",
        "id": 562294780,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1765097086
    },
    {
        "content": "<p>This breaks into two different questions -- compact connected groups (which needs analysis) and finite groups (which needs completely different techniques)</p>",
        "id": 562302400,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765106107
    }
]