[
    {
        "content": "<p>Hi everyone, I'm mainly working in classical harmonic analysis in Euclidean spaces and I've been interested in Lean for a while now, though unfortunately didn't get around to really work with it until very recently. Mainly as a learning exercise I've <a href=\"https://github.com/roos-j/lean-booleanfun\">started this project</a> formalizing some very basic analysis of Boolean functions following Ryan O'Donnell's book <a href=\"https://arxiv.org/pdf/2105.10386\">Analysis of Boolean functions</a>. The most interesting result formalized so far is probably Arrow's theorem (see Sec. 2.6 in the book). I know there are several formalizations of stronger formulations of Arrow's theorem already (even <a href=\"https://github.com/asouther4/lean-social-choice\">one using Lean</a>), but I couldn't find any existing formalizations of this Fourier-analytic approach (is there one?). Any comments or thoughts are welcome</p>",
        "id": 480723413,
        "sender_full_name": "Joris Roos",
        "timestamp": 1730814073
    },
    {
        "content": "<p>It's a welcome addition.</p>",
        "id": 480724189,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1730814302
    },
    {
        "content": "<p>I would suggest defining the Boolean fourier transform independently of any mathlib definitions first</p>",
        "id": 480724264,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1730814322
    },
    {
        "content": "<p>A lot of TCS content isn't available yet</p>",
        "id": 480724318,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1730814341
    },
    {
        "content": "<p>There is some Fourier transform of boolean functions in <a href=\"https://command-master.github.io/lean-bourgain/\">https://command-master.github.io/lean-bourgain/</a>, that might be useful</p>",
        "id": 480728356,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1730815463
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"690858\">Daniel Weber</span> <span class=\"user-mention\" data-user-id=\"466334\">@Shreyas Srinivas</span>  Thanks for the comments. Maybe I wasn't clear: I already have a FT for Boolean functions, I used it to formalize a Fourier-analytic proof of Arrow's theorem, see <a href=\"https://github.com/roos-j/lean-booleanfun\">https://github.com/roos-j/lean-booleanfun</a></p>",
        "id": 480736176,
        "sender_full_name": "Joris Roos",
        "timestamp": 1730817671
    },
    {
        "content": "<p>Hey Joris! Nice meeting you. I am the author of LeanAPAP, which is a dependency of Daniel's library linked above</p>",
        "id": 480754123,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1730822524
    },
    {
        "content": "<p>Hi Yaël, you too! I saw your very nice project. I suppose I could have used your discrete FT formalization, but for my purpose it was more convenient to do it from scratch; Boolean functions are just a very simple special case :)</p>",
        "id": 480773619,
        "sender_full_name": "Joris Roos",
        "timestamp": 1730829361
    }
]