[
    {
        "content": "<p>Hello all,</p>\n<p>my name is Angelo, and I am a mathematician at Universidad Complutense de Madrid in Spain. In the last months I got interested in Lean for formalizing math proofs, and after doing some of the math-oriented tutorials I decided I wanted to try writing some stuff myself and maybe contribute to Mathlib if I can.</p>\n<p>My area of expertise is mathematical physics (quantum spin and quantum information), but I do have a side interest in graph theory (and I did some work on chromatic polynomials), so I was hoping to start from there.</p>\n<p>I am glad to be here, and I hope to learn from what it seems to be a very nice and active community!</p>",
        "id": 455039995,
        "sender_full_name": "Angelo Lucia",
        "timestamp": 1722320803
    },
    {
        "content": "<p>One way to find a project is to start with a random basic theorem about eg chromatic polynomials and challenge yourself to formalise it. Clone mathlib and work in that repo in a scratch file and see how far you get! Ask in <a class=\"stream\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members\">#new members</a> if you're stuck. Formalisation is harder than it looks but very satisfying when it works :-)</p>",
        "id": 455040353,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1722320996
    },
    {
        "content": "<p>Hi! Always nice to see another quantum information theorist here! There's quite a bit going on in operator algebras also (see the <code>Mathlib.Analysis.CstarAlgebra</code> folder for example) that you might be interested in. I really to hope to be able to start formalizing the sort of work we do in the medium term!</p>",
        "id": 455122517,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1722345931
    },
    {
        "content": "<p>Hi! :) Yay, more of us!</p>\n<p>I've written down some quantum info topics in a repo at <a href=\"https://github.com/Timeroot/Lean-QuantumInfo/\">https://github.com/Timeroot/Lean-QuantumInfo/</a>, you might want to look. So far it's oriented pretty exclusively to finite dimensional stuff, and full of sorrys. See e.g. <a href=\"https://github.com/Timeroot/Lean-QuantumInfo/blob/main/QuantumInfo/Finite/CPTPMap.lean\">https://github.com/Timeroot/Lean-QuantumInfo/blob/main/QuantumInfo/Finite/CPTPMap.lean</a></p>",
        "id": 455996382,
        "sender_full_name": "Alex Meiburg",
        "timestamp": 1722620856
    }
]