[
    {
        "content": "<p>Is there any project that starts from an undergraduate perspective and then proves the theorem step by step?<br>\nBecause for those who are new to a certain field, if a low-point definition can be provided, they will be more motivated to learn.</p>",
        "id": 431673774,
        "sender_full_name": "chenjulang",
        "timestamp": 1712410237
    },
    {
        "content": "<p>Which field of study are you interested in? As an example of an undergrad project, this repo formalizes and proves properties of a certain model of computation from first principles: <a href=\"https://reservoir.lean-lang.org/@lf-lang/reactor_model\">https://reservoir.lean-lang.org/@lf-lang/reactor_model</a> (related paper: <a href=\"https://cfaed.tu-dresden.de/files/Images/people/chair-cc/publications/2310_Rossel_VSSTE.pdf\">https://cfaed.tu-dresden.de/files/Images/people/chair-cc/publications/2310_Rossel_VSSTE.pdf</a>)<br>\nBut that's a very computer sciency (and rather niche) topic.</p>",
        "id": 431682779,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1712417746
    },
    {
        "content": "<p>any fields would do.</p>",
        "id": 431687309,
        "sender_full_name": "chenjulang",
        "timestamp": 1712421699
    },
    {
        "content": "<p>I want to see projects that is independent from the mathlib4. I mean , definitions should have more easy or straightforward version. That should lead to a simpler proof somehow, right? And saves a lot of time for new users.Just take what they need and form the maths. Simple is beauty , Agree?</p>",
        "id": 431687702,
        "sender_full_name": "chenjulang",
        "timestamp": 1712422079
    },
    {
        "content": "<p>No, abstract proofs are very often simpler. And this is even more true in a proof assistant.</p>",
        "id": 431710902,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1712442898
    },
    {
        "content": "<p>Regarding simplicity of proofs, Patrick's comment is absolutely correct (although it is not uncommon that people start by somehow expecting the opposite).</p>\n<p>But simplicity is not the same as being easily approachable from an undergraduate background. So the original question on projects distinct from mathlib for pedagogical purposes is a very meaningful one.</p>\n<p>I would not require such projects to be <em>independent</em> of Mathlib, though. There is room for various formats, of course, but I believe a fruitful approach would be to build on Mathlib and thus get for free all of the things that are assumed common knowledge but never actually addressed in undergraduate courses. (A simple example could be doing calculus before defining real numbers --- it would certainly be convenient to take Mathlib's real numbers as well as a few other things.)</p>\n<p>In any case I don't have a great answer about existing projects of this type, but I think we would all welcome such resources.</p>\n<p>(Maybe worth mentioning here is the course/textbook <a href=\"https://hrmacbeth.github.io/math2001/\">The Mechanics of Proof</a>, which builds on Mathlib but deliberately offers the user a more undergraduate-appropriate interface.)</p>",
        "id": 431748743,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1712482140
    },
    {
        "content": "<p>(Should we have a Zulip linkifier to The Mechanics of Proof, btw?)</p>",
        "id": 431748933,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1712482233
    },
    {
        "content": "<p>Of course many components of <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a> are deliberately pedagogical, too, but it seems much more geared towards introducing the reader to Mathlib proper.</p>",
        "id": 431749427,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1712482506
    },
    {
        "content": "<p>Or can I ask another question? Any projects translate a textbook into lean step by step ? Like this one : <a href=\"https://github.com/martincmartin/linear_algebra_done_right\">https://github.com/martincmartin/linear_algebra_done_right</a></p>",
        "id": 431845527,
        "sender_full_name": "chenjulang",
        "timestamp": 1712546772
    }
]