[
    {
        "content": "<p>Today, to change the version of Lean to an old one, I ended up damaging the new version.</p>\n<p>Lean still doesn't have a simple installation package. Is there a guide for switching versions?</p>\n<p>I've found some steps:<br>\nChange the active toolchain, change the order of environment variables, change elan……(I cannot remember them all. Maybe if more people answer this question, we can have a doc.)</p>\n<p>I probably spent too much time on multiple \"lake build\". And it seems that lake build is completely unnecessary when switching versions. (Yet I don't know that.)</p>",
        "id": 503883264,
        "sender_full_name": "Nick_adfor",
        "timestamp": 1741292566
    },
    {
        "content": "<p>In your project, you change the version in the <code>lean-toolchain</code> file, and lake will use that version</p>",
        "id": 503885291,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1741293275
    },
    {
        "content": "<p>If you depend on other libraries, you might need to update them to match the new version, but otherwise that's all there is to it</p>",
        "id": 503885392,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1741293306
    },
    {
        "content": "<p>In fact I need a easy way to change my Mathlib version. I have downloaded two others' packages. One is 4.18.0-rc1, the other is 4.16.0. I have not checked the compatibility of the two version. Maybe the two packages can run both on 4.18.0-rc1 and 4.16.0, but still I want to find a easy way to change the Mathlib version. Lake build needs long time and I have no that patience to wait long every time l change the version.</p>\n<p>Lean-toolchain might be the only containing the version information. But lean-toolchains are everywhere (in plausible, in Qq, etc.) Is there a easy way to change them all? Can I just use two dependent folder containing two different version, so that if I open one of the folder, the Mathlib version changes to the corresponding?</p>",
        "id": 503954597,
        "sender_full_name": "Nick_adfor",
        "timestamp": 1741326884
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/stream/113489-new-members/topic/Ask.20for.20a.20guide.20for.20switching.20versions/near/503885392\">said</a>:</p>\n<blockquote>\n<p>If you depend on other libraries, you might need to update them to match the new version, but otherwise that's all there is to it</p>\n</blockquote>\n<p>Do you have any experience in version change?</p>",
        "id": 503963975,
        "sender_full_name": "Nick_adfor",
        "timestamp": 1741329400
    },
    {
        "content": "<p>In FLT (if I understand correctly) we offer tagged versions of the code base which run on each stable version of lean. Are you lucky enough to be in this situation?</p>",
        "id": 504009400,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1741331809
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113489-new-members/topic/Ask.20for.20a.20guide.20for.20switching.20versions/near/504009400\">said</a>:</p>\n<blockquote>\n<p>In FLT (if I understand correctly) we offer tagged versions of the code base which run on each stable version of lean. Are you lucky enough to be in this situation?</p>\n</blockquote>\n<p>Thank you professor! I can import two versions of FLT work to get two different version folder : )</p>",
        "id": 504049097,
        "sender_full_name": "Nick_adfor",
        "timestamp": 1741339800
    },
    {
        "content": "<p>I think it's useful to clear some terminology. Each Lean project (i.e. separate folders on disk) has it's own Lean version (defined in <code>lean-toolchain</code>) and a list of packages including their versions (defined in the <code>lakefile.lean</code> or <code>lakefile.toml</code> and then fixed in <code>lake-manifest.lean</code>). When you change the <code>lean-toolchain</code> of a project, you must ensure that the package versions are also compatible. In a <code>lakefile.lean</code> you can have a string like <code>require \"leanprover-community\" / \"mathlib\" @ \"v4.17.0\"</code> to specify a specific version. (in <code>.toml</code> it's done by adding a field <code>rev = \"v4.17.0\"</code> to the corresponding <code>[[require]]</code>)</p>\n<p>Normally, I personally recommend the <a href=\"https://leanprover-community.github.io/mathlib-manual/html-multi/Guides/Follow-Stable-Dependencies/#Mathlib-Manual--Guides--Follow-Stable-Dependencies\">following setup</a> for a package that follows stable releases of Lean and automatically finds the correct packages. (as Kevin mentioned, that requires all dependencies to define these version tags).</p>\n<p>If you do have further problems, you could share the <code>require</code> statements written in your <code>lakefile.lean</code> (or <code>.toml</code>). That would help ensuring your project is set up the best way possible.</p>",
        "id": 504060898,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1741343408
    }
]