[
    {
        "content": "<p>Hi everyone!</p>\n<p>I'm Romain Soulat, I work at Input Output Global on smart contract verification for the Cardano blockchain. With my team, we're trying to formalize as much as possible of the blockchain, the smart-contract VM, the languages, etc. in Lean 4 so that we can prove correctness properties of real-world smart contracts.</p>\n<p>As part of this effort, we’ve built an SMT backend for Lean 4 so that users (hopefully) don’t need to be formal verification experts to use the tool, and so that we can provide counterexamples to help developers debug faster. It’s available here:<br>\n<a href=\"https://github.com/input-output-hk/Lean-blaster\">https://github.com/input-output-hk/Lean-blaster</a></p>\n<p>We’re currently benchmarking it against existing automation such as <code>smt</code>, <code>auto</code>, <code>aesop</code>, <code>grind</code>, <code>hammer</code>, etc. So far, we’ve tried it on some of the Lean “games” (Natural Number Game, Set Theory Game, Intro to Logic).</p>\n<p>Are there any well-known or recommended benchmark suites we could compare against (for example, standard collections of Lean files or goals used to evaluate proof search/automation)? Any pointers or suggestions would be very welcome!</p>",
        "id": 556792200,
        "sender_full_name": "Romain Soulat",
        "timestamp": 1763375148
    },
    {
        "content": "<p>Does this perform proof reconstruction, or does it trust the SMT solver like some other formal verification languages do?</p>\n<p>A lot of people will test tactics by using TryAtEachStep, which runs the tactic after every tactic in mathlib</p>",
        "id": 556888523,
        "sender_full_name": "Niels Voss",
        "timestamp": 1763399692
    },
    {
        "content": "<p>Right now it trusts both the simplification &amp; normalization step and the smt solver. We’re working on building proof reconstruction for both.</p>",
        "id": 556889306,
        "sender_full_name": "Romain Soulat",
        "timestamp": 1763399927
    }
]