[
    {
        "content": "<p>I initially had some issues with lean4 constantly rebuilding my imports every single time I changed them at the top of my file, as in forcing me to sit down and wait as 1400 different modules got rebuilt. </p>\n<p>After futzing around with lake exe cache get seeming to have no result I came upon the following workflow:</p>\n<ol>\n<li>run lake +stable myProject math</li>\n<li>cd myProject &amp;&amp; lake exe cache get</li>\n</ol>\n<p>This at least stopped the immediate issues, but now after working on my project for a while I'm somewhat back to the status quo ante because now it still says \"Imports are out of date // restart file\" after a while.</p>\n<p>Is there a straightforward flag to set or something to stop this from happening so I don't have to haplessly wait for the build to finish before I can start filling in tactics again?</p>",
        "id": 494492638,
        "sender_full_name": "alcuin",
        "timestamp": 1737186920
    },
    {
        "content": "<p>If <code>lake exe cache get</code> seemingly does nothing, it's possibly because you have corrupted olean headers. One solution is to remove the incriminating file by hand. But it's annoying to try figuring out which one it is, so I usually do <code>rm -rf .lake</code> within my project folder <span aria-label=\"boom\" class=\"emoji emoji-1f4a5\" role=\"img\" title=\"boom\">:boom:</span></p>",
        "id": 494493197,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1737187355
    },
    {
        "content": "<p>Then I rerun <code>lake exe cache get</code> and things usually work</p>",
        "id": 494493241,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1737187388
    },
    {
        "content": "<p>Thank you, I had the same issue today.  Your solution worked.</p>",
        "id": 495350572,
        "sender_full_name": "Kent Van Vels",
        "timestamp": 1737570985
    },
    {
        "content": "<p>I just tried a  \"lake clean\" followed by \"lake exe cache get<br>\n and then \"lake build\".  That worked too.  I get nervous typing \"rm -rf\".</p>",
        "id": 495376256,
        "sender_full_name": "Kent Van Vels",
        "timestamp": 1737581032
    }
]