[
    {
        "content": "<p>I'm still new to the theory behind how an automated proof checker works - and I've been mulling some of the concepts in my head.</p>\n<p>I wanted to check a specific point.</p>\n<p><strong>By using propositions as types, we change the problem of proof verification from something more complex to one of checking for \"existence\".</strong></p>\n<p>That is, we find a value of the Proposition type. And if that proposition (proof statement) <strong>type is inhabited</strong>, we have one (of possibly many) proofs.</p>\n<p>The proof checker then checks the <strong>type</strong> of the proof, which is simpler than other kinds of proof checking (which I don't know about but assume are more complex like grammar checkers for DSLs, compilers for high level languages).</p>\n<p>Is this a correct way to think about it?</p>",
        "id": 509934897,
        "sender_full_name": "rzeta0",
        "timestamp": 1743685625
    },
    {
        "content": "<p>Checking proofs written in English or another natural language would be a tremendously difficult task for a computer, so in that sense Lean is reducing the extremely complex task of checking English proofs to simply type checking computer programs.</p>\n<p>But I'm not sure Lean's type checking is significantly easier than other types of formal proof checking. Formal deduction systems like natural deduction and the sequent calculus are relatively easy to check, and so are other proof systems used by non-propositons-as-types proof assistants like Metamath and Isabelle. I haven't studied any of those in detail, but I suspect they are comparable in difficulty to Lean's proof checking.</p>",
        "id": 510067370,
        "sender_full_name": "Niels Voss",
        "timestamp": 1743730888
    },
    {
        "content": "<p>i guess the motivation to use leans type system rather than those others is the <em>expressivity</em> that it has</p>",
        "id": 510127073,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1743756980
    },
    {
        "content": "<p>thanks for the replies.</p>\n<p>the comments about type-checking the proof has made me realise I was in error in thinking the problem is one of \"existence\", of finding an inhabitant of the proof objective's proposition type.</p>\n<p>thanks again for helping me correct my thinking</p>\n<p>(currently learning Haskell before I go back to the big theory book on type theory)</p>",
        "id": 510158220,
        "sender_full_name": "rzeta0",
        "timestamp": 1743766151
    },
    {
        "content": "<p>No, you were absolutely correct that Lean encodes the statement \"P is true\" as the problem of finding an inhabitant of the type P. I was just disagreeing with the statement that Lean is necessarily significantly simpler than other forms of formal proof checking.</p>",
        "id": 510294079,
        "sender_full_name": "Niels Voss",
        "timestamp": 1743802050
    }
]