[
    {
        "content": "<p>I had to ask another question, and for that I tried pasting my code <a href=\"https://live.lean-lang.org\">here</a> to edit before asking here, to create an MWE. However, code which was compiling properly on my device (which uses version 4.15) was generating errors (mostly with the <code>simp</code> tactic not closing goals). Is this supposed to be happening? If yes, how am I supposed to post MWEs? I doubt the code is any help if our infoviews don't agree on what it shows...</p>",
        "id": 511945991,
        "sender_full_name": "Aatman Supkar",
        "timestamp": 1744581206
    },
    {
        "content": "<p>I think unfortunately the answer is \"update to a newer Lean version\", at least in cases where you notice that the new version does something different</p>",
        "id": 511946210,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1744581380
    },
    {
        "content": "<p>( The fact that you checked your code did the same thing on the web editor before asking is great through!)</p>",
        "id": 511946224,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1744581393
    },
    {
        "content": "<p>So to ask for help here, should I migrate to 4.18? Also, if <code>simp</code> closes a goal in an earlier version of Lean, shouldn't it continue to do so in a later version? I have <code>simp</code> calls at the end of a proof which aren't closing goals either, and it just feels strange.</p>",
        "id": 511946346,
        "sender_full_name": "Aatman Supkar",
        "timestamp": 1744581490
    },
    {
        "content": "<p>Actually, the weirdest difference of them all is perhaps the fact that <code>import Mathlib.Order.CompleteLattice</code> is a perfectly valid import on my device, but not on the web. (It probably doesn't matter now because I found this import redundant just right now, but it's still bizzare to me.)</p>",
        "id": 511946818,
        "sender_full_name": "Aatman Supkar",
        "timestamp": 1744581864
    },
    {
        "content": "<p>That's not weird, people shuffle files around all the time (e.g. they break them into pieces). </p>\n<p>Yes, I'm involved in a big Lean project and I bump the version of mathlib which it depends on once a week. It's the only way to survive in this ecosystem.</p>",
        "id": 511947180,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1744582195
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib4/pull/23064\">here</a> is the PR which broke <code>Mathlib.Order.CompleteLattice</code> into <code>Mathlib.Order.CompleteLattice.{Defs/Basic/Lemmas}</code> last month.</p>",
        "id": 511947309,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1744582296
    },
    {
        "content": "<p>(In the very near future, if you're a new enough version of mathlib, you'll see a warning when importing a file that was renamed or deleted.)</p>",
        "id": 511948375,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1744583203
    }
]