[
    {
        "content": "<p>I had known what lean is for  about a year, but it never caught my interest until recently when I saw a popular science video <a href=\"https://www.youtube.com/watch?v=pQWFSj1CXeg&amp;t=52s&amp;pp=ygULdXAgYW5kIGF0b20%3D\">on the busy beaver problem</a>  though I understand that Coq and not lean was used,  I decided to come to this zulip because of a talk I saw on youtube with Terrence tao talking about proof asistants, I am a physicist by training (alreay checking some cool sutff out in the natural sciences channel), but will lkely not get into this, unless I see a reason and a supporting community to get some interaction, I was wondering if you guys know of anything like the busy beaver challenge where people are looking for volunteers to proof small sections of a bigger problem, or anything related where one can volunteer some time working on a problem that uses these<br>\n tools</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"pQWFSj1CXeg\" href=\"https://www.youtube.com/watch?v=pQWFSj1CXeg&amp;t=52s&amp;pp=ygULdXAgYW5kIGF0b20%3D\"><img src=\"https://uploads.zulipusercontent.net/d5ed332d058f292ccb12d2c8375b04f64a3be6ef/68747470733a2f2f692e7974696d672e636f6d2f76692f70515746536a31435865672f6d7164656661756c742e6a7067\"></a></div>",
        "id": 513433667,
        "sender_full_name": "Gerardo Jose Suarez",
        "timestamp": 1745254025
    },
    {
        "content": "<p>Maybe porting (copying statements and doing proofs yourself) some code from Coq to Lean would be a good exercise.</p>",
        "id": 513454412,
        "sender_full_name": "suhr",
        "timestamp": 1745262276
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"394485\">suhr</span> <a href=\"#narrow/stream/113489-new-members/topic/Collaborations.20looking.20for.20volunteers/near/513454412\">said</a>:</p>\n<blockquote>\n<p>Maybe porting (copying statements and doing proofs yourself) some code from Coq to Lean would be a good exercise.</p>\n</blockquote>\n<p>Indeed it is a good exercise, the reason I'm looking for such  a volunteer  task, is to have a goal to work on instead of just learning for the sake of learning, of course I would need to learn by doing this sort of stuff before, for now I'm just checking to see what the possibilities to use it are ( in this sort of online collaboration )</p>",
        "id": 513457237,
        "sender_full_name": "Gerardo Jose Suarez",
        "timestamp": 1745263553
    },
    {
        "content": "<p>often such things are announced in various proof assistant discussion forums like this one. one high-profile one that comes to mind is the <a href=\"https://imperialcollegelondon.github.io/FLT/\">Fermat's Last Theorem project</a>, though obviously that requires quite a bit of mathematics knowledge to contribute to.</p>\n<p>in the case of the Busy Beaver project, it is a bit unusual in that the actual formal proof is not the area that needed many hands to complete the work – it's not a typical collection of interlinked lemmas that contribute to more and more understanding of a mathematical object, but rather a software program engineered to be relatively easy to prove correct. as such it's not a good source of lemma-sized TODOs</p>\n<p>the aspect in which the Busy Beaver project was much more collaborative is actually finding the proof in the first place.</p>\n<p>the way I found the project is that I was looking for a fun project to do in Coq, and I remembered the busy beaver function, which felt like it would have the type of theory around it that I would consider neat and approachable</p>",
        "id": 513495697,
        "sender_full_name": "Maja Kądziołka",
        "timestamp": 1745285010
    },
    {
        "content": "<p>so, I would say that a good way of finding a project to contribute would be: find a piece of math that interests you and go from there</p>",
        "id": 513495858,
        "sender_full_name": "Maja Kądziołka",
        "timestamp": 1745285102
    },
    {
        "content": "<p>Did you ask in <a class=\"stream\" data-stream-id=\"479953\" href=\"/#narrow/channel/479953-PhysLean\">#PhysLean</a> ?</p>",
        "id": 513520481,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1745300128
    },
    {
        "content": "<p>You're absolutely right, that's always the best way to go! I was just thinking that this sort of busy beaver collaboration was popular, and was looking for something that I find interesting but at the same time had some people interested in it so that I could ask the community about the problem, get help I get stuck, etc ... I was sort of hoping there would be many people looking for counter examples of conjectures, or something like that when contributing would be easy</p>",
        "id": 513553539,
        "sender_full_name": "Gerardo Jose Suarez",
        "timestamp": 1745312006
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113489-new-members/topic/Collaborations.20looking.20for.20volunteers/near/513520481\">said</a>:</p>\n<blockquote>\n<p>Did you ask in <a class=\"stream\" data-stream-id=\"479953\" href=\"/#narrow/channel/479953-PhysLean\">#PhysLean</a> ?</p>\n</blockquote>\n<p>I didn't but found a course  on youtube mentioned on the channel which I just started to take :), probably will go there after it :)</p>",
        "id": 513554277,
        "sender_full_name": "Gerardo Jose Suarez",
        "timestamp": 1745312225
    },
    {
        "content": "<p>There is also the <a href=\"#narrow/stream/113486-announce/topic/The.20Toric.20project.3A.20Formalisation.20of.20toric.20varieties\">Toric</a> project if that’s up your alley</p>",
        "id": 513561209,
        "sender_full_name": "Michał Mrugała",
        "timestamp": 1745314148
    }
]