[
    {
        "content": "<p>Are there any examples of formalizing the theory of combinatorial optimization in Lean? In particular, are there any examples of formalizing results on approximation algorithms? If not, what are the difficulties?</p>",
        "id": 392500204,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1695382903
    },
    {
        "content": "<p>Are you interested in doing combinatorial optimization with complexity of algorithms being in the picture?</p>",
        "id": 392505221,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1695384820
    },
    {
        "content": "<p>First I should have probably asked if you want to implement stuff or prove stuff.</p>",
        "id": 392505365,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1695384865
    },
    {
        "content": "<p>I am interested not in the complexity of the algorithm, but in the implementation of concepts such as combinatorial problems, their feasible solutions, optimal solutions, and approximation rates, and whether the approximation rate of a particular algorithm can be proven.</p>",
        "id": 392507075,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1695385591
    },
    {
        "content": "<p>Unfortunately, I am not aware of any such effort in Lean.<br>\nIf you find something, let me know!<br>\nDo you have a particular project in mind you would like to work on?</p>",
        "id": 392655511,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1695453176
    },
    {
        "content": "<blockquote>\n<p>If you find something, let me know!</p>\n</blockquote>\n<p>Thanks for checking it out .... I understand.</p>\n<blockquote>\n<p>Do you have a particular project in mind you would like to work on?</p>\n</blockquote>\n<p>I think graph theory algorithms are difficult because of their data structure, and I think problems like the Bin Packing Problem have relatively few non-essential difficulties. I would like to start from such a problem.</p>",
        "id": 392826513,
        "sender_full_name": "Asei Inoue",
        "timestamp": 1695558087
    },
    {
        "content": "<p>FYI, I have just started with combinatorial optimization theory:<br>\n<a href=\"https://github.com/leanprover-community/mathlib4/pull/7404\">https://github.com/leanprover-community/mathlib4/pull/7404</a></p>\n<p>I define VCSP (general valued constraint satisfaction problems) which is a unifying framework that generalizes both decision problems and optimization problems.</p>\n<p>I don't have anything more at the moment, just the first definition.</p>",
        "id": 393724433,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1695908981
    },
    {
        "content": "<p>I added some more definitions. At this point, I should probably move it to the \"PR reviews\" stream.</p>",
        "id": 393806397,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1695935902
    }
]