[
    {
        "content": "<p>I am trying to understand the contribution process better. Suppose I write a proof for<br>\n<code>theorem toString_isNat (n : ℕ) : (toString n).isNat</code> (for the sake of discussion) that I think might be useful to others.</p>\n<ul>\n<li>How do I decide whether to contribute to lean4, Mathlib or something else?</li>\n<li>Do I just open a PR or do I start a discussion about it?</li>\n<li>How do I know where to put it inside the relevant repo?</li>\n</ul>\n<p>If I am asking the wrong questions, feel free help me reframe the questions. For instance, maybe the theorem toString_isNat would not be helpful to anyone. Then I would want to know how to know what would be helpful.</p>",
        "id": 561030191,
        "sender_full_name": "LordRatte",
        "timestamp": 1764534987
    },
    {
        "content": "<p>I shouldn't think that mathlib is interested in anything to do with strings, and many of the core Lean contributors are not reading this channel. You might want to ask in <a class=\"stream\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general\">#general</a> about plans for strings and how you might be able to help. You might also want to post your proof.</p>",
        "id": 561030642,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764535350
    },
    {
        "content": "<p>So as a rule of thumb would I ask in <a class=\"stream\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general\">#general</a> for other topics as well? Let's say the theorem wasn't about strings. Would I always start there if I don't know where the topic belongs?</p>",
        "id": 561031255,
        "sender_full_name": "LordRatte",
        "timestamp": 1764535858
    },
    {
        "content": "<p>Maybe someone more knowledgeable than me about the ecosystem around strings will see this discussion (maybe edit the title so that it mentions <code>toString_isNat</code>?) and will give you better advice. There are all kinds of basic repos like Std/Batteries which I don't know anything about and which might be the place for this lemma if it's not already there.</p>",
        "id": 561033040,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764537153
    },
    {
        "content": "<p>To Kevin, I think this is a general question, not necessarily about Strings but rather about the contribution process. Unfortunately, I am not much of a contributor, so I feel other people can advise better but my understanding is:</p>\n<ul>\n<li>Discuss it here on Zulip, either in <code>general</code>, or perhaps <code>mathlib</code> if you think your contribution belongs to Mathlib. Coordinate with others interested in similar questions.</li>\n<li>Figure out where it belongs -- is it mathlib? batteries? cslib? something else? Getting contributions to Lean Core is considered harder.</li>\n<li>Break it into pieces. As far as I understand, smaller pull requests can get merged easier.</li>\n<li>Link the pull requests with the relevant Zulip thread (both ways)</li>\n</ul>",
        "id": 561033057,
        "sender_full_name": "Mirek Olšák",
        "timestamp": 1764537168
    }
]