[
    {
        "content": "<p>I don't have a full <a href=\"https://leanprover-community.github.io/mwe.html\">#mwe</a>, but I thought I would ask about this in case its a common known issue.  </p>\n<p>The quote marks icon in the infoview which does a \"copy paste\" to to a comment in the buffer does not always copy correctly.  It will generate a comment in my buffer, but sometimes he body of the comment is empty, or contains just  some of characters from the message I'm trying to copy.  If I look at the windows-v clipboard history, I can see the desired text is not on the system clipboard, so I think the problem is with the \"copy\" not the \"paste\".  </p>\n<p>I have had the same message not copy, and then later in a new session it will copy, so I don't thik it's a deterministic problem related to the text being copied.  I had a notion that it might be related to the specific unicode characters being copied, but I haven't been able to find any pattern so far.</p>\n<p>Sometimes only part of the text gets copied.  From my current session: <br>\n<code>#eval foo</code> gives <code>unkown identifier: 'foo'</code> in the infoview but only <code>unknown idenfitier ''</code> in the copied comment block.   Similarly when I <br>\n copy the results of a <code>#print @myfunction</code> in my current session  it only copies the <code>:</code> of the function definition.</p>\n<p>Details about the system: </p>\n<ul>\n<li>Windows 11 Pro (22H2)</li>\n<li>VSCode version 1.78.1</li>\n<li>Lean (version 4.0.0-nightly-2023-03-14, commit 96aa021007cf, Release)</li>\n<li>elan 1.4.2 (4a1b1b918 2022-09-13)</li>\n</ul>\n<p>I can provide screenshots of my systems settings for copy/paste for the OS and VSCode if its useful, I didn't see any smoking guns there.</p>",
        "id": 357413086,
        "sender_full_name": "Ryan McCorvie",
        "timestamp": 1683756854
    },
    {
        "content": "<p>Thanks for mentioning it -- I think many of us individually know about this issue, but I'm not sure if it's come up on the Zulip yet.</p>\n<p>It'd definitely an annoying bug. What I usually do to work around it is select the text I want to copy myself.</p>",
        "id": 357413512,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1683757069
    },
    {
        "content": "<p>My guess has been it has to do with how MessageData is displayed in VS Code, but that's just speculation. The string parts of MessageData seem to always copy correctly, but then embedded expressions don't seem to copy.</p>",
        "id": 357413677,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1683757148
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span>   Thanks for that suggestion.  What mechanism do you use to copy?  When I right-click copy from the infoview it also fails to work for me sometimes.  I don't see the text copied onto the clipboard history.  I also sometimes have problems right-click copying text from the HTML pane where I am reading TPIL, so maybe its not an infoview problem.</p>",
        "id": 357414313,
        "sender_full_name": "Ryan McCorvie",
        "timestamp": 1683757444
    },
    {
        "content": "<p>I think I do Ctrl-C after selecting</p>",
        "id": 357414480,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1683757555
    },
    {
        "content": "<p>Hi, this is <a href=\"https://github.com/leanprover-community/vscode-lean4/pull/271\">vscode-lean4#271</a> . I bumped it to high priority so that either I or someone eventually gets around to fixing it.</p>",
        "id": 357431997,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1683767523
    }
]