[
    {
        "content": "<p>Hi, I wonder if the following result is in mathlib: <br>\nLet f:E-&gt;F be a smooth function between normed vector spaces, let F' be a subspace of F that contains the image of f. Then the corestriction of f, a function from E to F', is also smooth.</p>\n<p>In fact it should be an if and only if, but I only need the direction I stated. Also, I'm pretty sure that I can prove it by hand, but I'm lazy and would like to avoid reinventing the wheel.</p>\n<p>I read analysis.calculus.cont_diff but couldn't find that kind of result. I also don't see similar results for functions between manifolds.</p>",
        "id": 338130302,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1677409710
    },
    {
        "content": "<p>I don't think we have that lemma. I will prove it tonight if <span class=\"user-mention\" data-user-id=\"110050\">@Sebastien Gouezel</span> or <span class=\"user-mention\" data-user-id=\"214703\">@Yury G. Kudryashov</span> don't do it in the mean time.</p>",
        "id": 338151530,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1677419274
    },
    {
        "content": "<p>I don't think we have that, but it would definitely be a welcome addition to mathlib!</p>",
        "id": 338151555,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1677419282
    },
    {
        "content": "<p>Note that this result is very easy if <code>F'</code> is complemented, i.e., admits a closed supplement, because then the corestriction is the composition of <code>f</code> with the projection on <code>F'</code> with respect to the closed complement. But I think it should hold even without this assumption (because all the successive derivatives will takes values in <code>F'</code>, and can therefore also be corestricted).</p>",
        "id": 338151884,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1677419419
    },
    {
        "content": "<p>Thanks ! In my case, F' is obviously complemented (it is a closed hyperplane), so I'm happy that I did not start immediately trying to construct derivatives with values in F' before Sébastien pointed out that there is a shortcut in that case.<br>\nAlso, to be honest, I did not think about the case of functions differentiable on a subset of E (where derivatives are not necessarily unique), so I am not sure what should happen there.</p>\n<p>Related question: is the notion of submanifold in mathlib ? I tried to find that of immersions, but the only mentions I could find are in the section of the Whitney embedding theorem, and I didn't find a definition of immersions there.</p>",
        "id": 338158904,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1677422046
    },
    {
        "content": "<p>No, we have no submanifolds, immersions, submersions and so on. That's definitely on the agenda, but for after the port.</p>",
        "id": 338163363,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1677424029
    },
    {
        "content": "<p>Do you assume that <code>F'</code> is a closed subspace?</p>",
        "id": 338169602,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1677426471
    },
    {
        "content": "<p>Probably, I don't see how to make the proof work without that assumption. Good point.</p>",
        "id": 338170358,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1677426763
    },
    {
        "content": "<p>It's definitely wrong if you don't assume that <code>F'</code> is closed.</p>",
        "id": 338171333,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1677427233
    },
    {
        "content": "<p>It's also wrong for functions defined on subsets. Here is a silly example. Let <code>F'</code> be a subspace of <code>F</code> which is not complemented. Consider the function <code>f : F -&gt; F</code>which is the identity on <code>F'</code>, and <code>0</code> elsewhere. It is differentiable within <code>F'</code> (one can for instance take for differential the identity), but the corestriction is not differentiable within <code>F'</code>. Indeed, a derivative would be a linear map from <code>F</code> to <code>F'</code> equal to the identity on <code>F'</code>, i.e., a projection on <code>F'</code>. A kernel of this projection would be a complement to <code>F'</code>, contradiction.</p>",
        "id": 338172229,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1677427643
    },
    {
        "content": "<p>Example showing that <code>F'</code> needs to be closed. Let <code>f (z) = (1, z, z^2, ...)</code> from the complex unit disk to the space <code>F = l^1</code> of summable sequences. Let <code>F'</code> be the span of the values of <code>f</code>. Then <code>f</code> is differentiable as a function to <code>F</code> (it is even analytic), but its derivative at <code>0</code> is <code>(0, 1, 0, 0, ...)</code> which does not belong to <code>F'</code> (one can check that with Vandermonde determinants) so <code>f</code> is not differentiable as a function to <code>F'</code>.</p>",
        "id": 338172546,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1677427788
    },
    {
        "content": "<p>While hiking I also thought that assuming <code>F'</code> closed was probably necessary. Is there still anything that needs to be urgently proved?</p>",
        "id": 338182716,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1677432661
    },
    {
        "content": "<p>As far as I'm concerned nothing is urgent, because I can always use a continuous retraction on F' (which exists in my case) to get the result, as Sébastien suggested. I want to construct the retraction anyway for other reasons.</p>",
        "id": 338183753,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1677433109
    },
    {
        "content": "<p>Ok, good.</p>",
        "id": 338184091,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1677433245
    },
    {
        "content": "<p>Oh, there is nothing good about the code that I've been writing this afternoon, believe me... <span aria-label=\"face vomiting\" class=\"emoji emoji-1f92e\" role=\"img\" title=\"face vomiting\">:face_vomiting:</span></p>",
        "id": 338187532,
        "sender_full_name": "Sophie Morel",
        "timestamp": 1677435002
    },
    {
        "content": "<p>It is probably true for partial functions in terms of <code>cont_diff_within_at</code>.</p>",
        "id": 338216181,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1677455073
    }
]