[
    {
        "content": "<p>Hello everyone! I have been hanging around here for a while, but not actively posting. I am a PL and type theory researcher and postdoc at the University of Kent. I have a lot of experience using Rocq to formalize type theory papers, and I am learning my way around using Lean. Two public work in progress Lean projects I am working on are <a href=\"https://github.com/BinderDavid/veriflex\">https://github.com/BinderDavid/veriflex</a> , a verified lexer generator using Brzozowski derivatives, and <a href=\"https://github.com/BinderDavid/haskell-spec\">https://github.com/BinderDavid/haskell-spec</a> a specification of the Haskell 2010 type system based on a paper by Karl-Filip Faxen. <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span></p>",
        "id": 533149115,
        "sender_full_name": "David Binder",
        "timestamp": 1754500610
    },
    {
        "content": "<p><span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> What a great lastname you have!</p>",
        "id": 533149326,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1754500706
    },
    {
        "content": "<p>Haha, thanks :)</p>",
        "id": 533149380,
        "sender_full_name": "David Binder",
        "timestamp": 1754500734
    },
    {
        "content": "<p>Neat, I've thought it would be fun to implement a Brzozowski-derivative-based parser in Lean before.</p>\n<p>It would be cool if there were a way to apply a Futamura projection (i.e. partially evaluate) the lexer to specialize it to a particular regular expression, and get a recursive function. I know derivatives are a way to create a nondeterministic state machine, but maybe it's possible to avoid the state machine construction and use only program transformations.</p>",
        "id": 533151180,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1754501487
    },
    {
        "content": "<p>Yes, the performance without any sort of specialization is probably not good at the moment. My main objective is to try to implement a verified Haskell parser which can be simultaneously used as a specification. If I find the spare time I will try to implement a parser for indentation-sensitive context-free grammars (<a href=\"https://michaeldadams.org/papers/layout_parsing/\">https://michaeldadams.org/papers/layout_parsing/</a>) as well :)</p>",
        "id": 533152801,
        "sender_full_name": "David Binder",
        "timestamp": 1754502210
    }
]