[
    {
        "content": "<p>Hi all,</p>\n<p>Just introducing myself as suggested in the channel description.</p>\n<p>I'm David, based in London, and I'm in the final year of a Maths BSc (well, final two years because part-time). Areas of greatest interest to me so far are number theory and category theory. And Lean, obviously.</p>\n<p>I stumbled across Lean some time ago while listening to Kevin Buzzard on an old \"Joy of Why\" podcast. One very steep learning curve later, I'm now completely hooked.</p>\n<p>To get myself properly up to speed, and hopefully in a position to contribute to mathlib some day, I've been working my way through Lawvere &amp; Schanuel's <em>Conceptual Mathematics</em>, coding up the definitions, theorems, and exercises in Lean as I go. I'm a little over half way through. In case anyone's interested, the codebase can be found at <a href=\"https://github.com/davidkinkead/conceptual_mathematics\">https://github.com/davidkinkead/conceptual_mathematics</a> with the Verso output hosted at <a href=\"https://davidkinkead.github.io/conceptual_mathematics\">https://davidkinkead.github.io/conceptual_mathematics</a></p>\n<p>Looking forward to learning from everyone here. Zulip seems like an amazing resource!</p>",
        "id": 561981180,
        "sender_full_name": "David Kinkead",
        "timestamp": 1764885347
    },
    {
        "content": "<p>It's cool to see Verso being used like this!</p>",
        "id": 561983353,
        "sender_full_name": "David Renshaw",
        "timestamp": 1764886306
    },
    {
        "content": "<p>Verso's great! I've really enjoyed working with it.</p>",
        "id": 561985093,
        "sender_full_name": "David Kinkead",
        "timestamp": 1764887089
    },
    {
        "content": "<p>By the way, since you are interested in category theory, you might find this interesting as well: <a href=\"https://mikeshulman.github.io/catlog/catlog.pdf\">https://mikeshulman.github.io/catlog/catlog.pdf</a></p>",
        "id": 561985749,
        "sender_full_name": "suhr",
        "timestamp": 1764887414
    },
    {
        "content": "<p>You should come to Xena on Thursday 5-8pm at Imperial (last one of the year is a week today) if you're in London.</p>",
        "id": 561986125,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764887599
    },
    {
        "content": "<p>Thanks - I won't be able to make the one next week, I'm afraid, but I'd love to come along if you're running Xena again in the new year?</p>",
        "id": 561987620,
        "sender_full_name": "David Kinkead",
        "timestamp": 1764888327
    },
    {
        "content": "<p>It runs during Imperial's term dates (which you can Google)</p>",
        "id": 562033711,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764918801
    }
]