[
    {
        "content": "<p>A lot of chat on this server deals with formalization of existing mathematics, or a) look up the proof sketch in a journal (or your own notes), and then later b) attempt to formalize it in Lean.</p>\n<p>I am formalizing an argument, and at the same time thinking of ways of improving the argument , leading to new (or improved) results.  I want to know if this is happening to others (using Lean as a testbed for conjectures or proof attempts) where you try to formalize the (proof of a) result without knowing it in advance, but developing it as you go. Specifically, I want to know about successful workflows (where success does not have to be measured in terms of production rate of new results), and where  one does b) and then a), or does b) and a) together.</p>\n<p>Anyone have such examples to share?</p>",
        "id": 572559521,
        "sender_full_name": "J. J. Issai (project started by GRP)",
        "timestamp": 1770490846
    },
    {
        "content": "<p>I was annoyed about having to continually check that certain central algebras over the p-adic numbers were topological rings even though it was \"obvious\", so I asked about whether a module over a topological ring should inherit a canonical topology <a href=\"https://mathoverflow.net/questions/477757/topology-on-a-module-over-a-topological-ring\">on mathoverflow</a>, got an excellent answer from Will Sawin, coded it up into mathlib <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=IsModuleTopology#doc\">docs#IsModuleTopology</a> and now use it all the time in my ongoing formalization of FLT.</p>",
        "id": 572564257,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1770495003
    },
    {
        "content": "<p>@Kevin Buzzard : nice.  This is close to the situation I have in mind.  You saw a refactoring that would be useful if true (and it was \"obviously\" so),  and then \"looked at Will's notes\" and then coded up the formalization.  Granted this is in the middle of your project, so it looks like a) then b) then a) then b), so it could be considered a concurrent example.</p>\n<p>My situation, (which is a work-in-progress) is that I am formalizing an argument, then I see an optimization which I tend to formalize, then I come up with a conjecture which I formalize, then I use Lean (with AI assistance if I must) to try to prove the conjecture before I work it out on paper.  I am wondering if there are other examples like that. If so, how to work effectively to get and record results (which may be of interest but may never be Mathlib-worthy).</p>",
        "id": 572565353,
        "sender_full_name": "J. J. Issai (project started by GRP)",
        "timestamp": 1770496167
    },
    {
        "content": "<p>In the process of solving <a href=\"https://mathoverflow.net/q/497321\">a birthday problem</a>, I had a proof idea, but I did not check it rigorously. I was writing everything directly into Lean to confirm my arguments were valid, I didn't have a reference to follow. This lead to me having to at one point duplicate a definition in order to make the inequalities line up. And the whole time I wasn't completely convinced it would work, up until the moment I filled in the last <code>sorry</code>. <span class=\"user-mention silent\" data-user-id=\"459227\">Violeta Hernández</span> has since cleaned up my proof and posted it <a href=\"https://mathoverflow.net/a/497645\">on mathoverflow</a>, and it is also available in the <a href=\"https://github.com/vihdzp/combinatorial-games\">CGT repo</a> as <a href=\"https://vihdzp.github.io/combinatorial-games/find/?pattern=Surreal.birthday_toGame#doc\">CGT#Surreal.birthday_toGame</a>.</p>",
        "id": 572566169,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1770497146
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"816344\">@Aaron Liu</span>  Cool!  Did this lead to any more results or development beyond the birthday problem?  (e.g., what is the smallest class of forms one could use to characterize a birthday?)</p>",
        "id": 572566871,
        "sender_full_name": "J. J. Issai (project started by GRP)",
        "timestamp": 1770498004
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"930113\">J. J. Issai (project started by GRP)</span> <a href=\"#narrow/channel/113489-new-members/topic/Developing.20code.20and.20theory.20concurrently/near/572559521\">said</a>:</p>\n<blockquote>\n<p>I want to know if this is happening to others (using Lean as a testbed for conjectures or proof attempts) where you try to formalize the (proof of a) result without knowing it in advance, but developing it as you go. </p>\n</blockquote>\n<p>Yes. Whenever possible, I try to develop the proof by looking at the Infoview only.</p>",
        "id": 572621676,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770558170
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"930113\">J. J. Issai (project started by GRP)</span> <a href=\"#narrow/channel/113489-new-members/topic/Developing.20code.20and.20theory.20concurrently/near/572559521\">said</a>:</p>\n<blockquote>\n<p>Anyone have such examples to share?</p>\n</blockquote>\n<p>The last thing I worked on in Lean is the following.</p>\n<p>I took a proof of the Farkas-Bartl theorem<br>\n<a href=\"https://github.com/madvorak/duality/blob/2e7edafa9a5e9f087719b42cf54e3161fb02a85a/Duality/FarkasBartl.lean#L213\">https://github.com/madvorak/duality/blob/2e7edafa9a5e9f087719b42cf54e3161fb02a85a/Duality/FarkasBartl.lean#L213</a><br>\nand I reworked it into a proof of the Fredholm alternative<br>\n<a href=\"https://github.com/madvorak/duality/blob/2e7edafa9a5e9f087719b42cf54e3161fb02a85a/Duality/Fredholm.lean#L180\">https://github.com/madvorak/duality/blob/2e7edafa9a5e9f087719b42cf54e3161fb02a85a/Duality/Fredholm.lean#L180</a><br>\nwithout looking up its standard proof, without writing a single symbol on paper, only by examining the Infoview, judging what must be changed. It went really smoothly (though the resulting proof is not cleaned up yet; it is just a development branch, which isn't a part of my thesis or the paper that came out of it).</p>\n<p>PS: I already had a proof of a very special case of the Fredholm alternative before, but I wanted to prove the Fredholm alternative in generality.</p>\n<p>PPS: According to Wikipedia, what I proved is still not the most general version. Nevertheless, it is a huge step forward from the theorem I had before.</p>",
        "id": 572622118,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1770558528
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"930113\">J. J. Issai (project started by GRP)</span> <a href=\"#narrow/channel/113489-new-members/topic/Developing.20code.20and.20theory.20concurrently/near/572566871\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"816344\">Aaron Liu</span>  Cool!  Did this lead to any more results or development beyond the birthday problem?  (e.g., what is the smallest class of forms one could use to characterize a birthday?)</p>\n</blockquote>\n<p>I don't think so... We're still missing a lot of results about surreal number birthdays, but we're working on them!</p>",
        "id": 572654855,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1770589100
    },
    {
        "content": "<p>On the topic of combinatorial game theory, we've also been concurrently formalizing and developing the theory of nimbers (<a href=\"https://vihdzp.github.io/combinatorial-games/find/?pattern=Nimber#doc\">CGT#Nimber</a>). A friend of mine has an unpublished best upper bound for a 50 year old conjecture of Conway (finding the least algebraically closed nimber after ω^ω^ω), and one of the goals we're currently working on is to formalize her result. (And perhaps, in the meanwhile, find a full answer to this problem?)</p>",
        "id": 572654967,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1770589212
    },
    {
        "content": "<p>Lean has been particularly valuable in verifying arguments that I might have otherwise not had full faith in. And it's helped keep track of which hypotheses are needed where.</p>",
        "id": 572654979,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1770589237
    }
]