[
    {
        "content": "<p>Hi everybody</p>\n<p>When I was solving the formalising mathematics project (<a href=\"https://github.com/ImperialCollegeLondon/formalising-mathematics-2023\">https://github.com/ImperialCollegeLondon/formalising-mathematics-2023</a>), I saw that every exercise sheet started with \"import tactic\". I wanted to write similar exercise sheets so I started my own project with the guidelines from the official Lean page (<a href=\"https://leanprover-community.github.io/install/project.html\">https://leanprover-community.github.io/install/project.html</a>). When I did this, I was not able to import the tactic package, only packages starting with “mathlib.”. I compared my project to the projects that could import “tactic” and I saw that these projects all contained a folder called “_target”, whereas my project did not. Is there any possibility of starting your own project containing that folder “_target”? I would really appreciate it if that would be possible because I prefer the proofwriting style with the “tactic” package. Thanks to all of you in advance!<br>\nAll the best<br>\nMatt</p>\n<p>P.S. <span class=\"user-mention\" data-user-id=\"429541\">@Elif Sacikara (Alumni)</span>  would also like to know the answer to this.</p>",
        "id": 386861693,
        "sender_full_name": "Mattia Bottoni",
        "timestamp": 1692795247
    },
    {
        "content": "<p>We <em>very</em> recently went across a major backward-incompatible change of version in Lean. The project <a href=\"https://github.com/ImperialCollegeLondon/formalising-mathematics-2023\">https://github.com/ImperialCollegeLondon/formalising-mathematics-2023</a> is using Lean 3 which is fully obsolete. The instructions you followed are about Lean 4.</p>",
        "id": 386870377,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1692797709
    },
    {
        "content": "<p>We are well aware the current situation can be rather confusing for outsiders, and we are sorry about that.</p>",
        "id": 386870550,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1692797759
    },
    {
        "content": "<p>See <a href=\"https://leanprover-community.github.io/learn.html\">https://leanprover-community.github.io/learn.html</a> for links to current learning resources.</p>",
        "id": 386870713,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1692797802
    },
    {
        "content": "<p>Thank you very much for your fast reply!<br>\nThis helped a lot :)</p>",
        "id": 387221094,
        "sender_full_name": "Mattia Bottoni",
        "timestamp": 1692947094
    }
]