[
    {
        "content": "<p>Is it just me or is the lean-mode of emacs often not-so-responsive?</p>",
        "id": 339113242,
        "sender_full_name": "Julin S",
        "timestamp": 1677766960
    },
    {
        "content": "<p><code>lean --server</code> seems to take up quite a lot of RAM as well..</p>",
        "id": 339113424,
        "sender_full_name": "Julin S",
        "timestamp": 1677766980
    },
    {
        "content": "<p>Do you have a precompiled mathlib?</p>",
        "id": 339145268,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1677774079
    },
    {
        "content": "<p>This is not a question about finite fields so should go in its own thread. Have you compared with VS Code? Lean is sometimes not-so-responsive -- it's just thinking. My question is: are you sure this is an emacs issue rather than a lean issue? But this discussion should be taking place in another thread anyway.</p>",
        "id": 339145297,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1677774085
    },
    {
        "content": "<p>I had been using lean from emacs via the lean-mode.</p>\n<p>Quite often response is quite slow and sometimes hangs altogether.</p>\n<p>Usually, a check mark (✓) shows up when lean isn't busy thinking. But even the check mark is visisble, sometimes the goal won't change.</p>\n<p>I think I'm using a precompiled version of mathlib. Because I can see a bunch of .olean files. That means precompiled version, right?</p>\n<p>(Came from <a href=\"#narrow/stream/113489-new-members/topic/Finite.20fields.20in.20lean\">here</a>).</p>",
        "id": 339152311,
        "sender_full_name": "Julin S",
        "timestamp": 1677775746
    },
    {
        "content": "<p><del>Thanks. Made a new thread here: <a href=\"#narrow/stream/113489-new-members/topic/Does.20lean-mode.20hang.20often\">https://leanprover.zulipchat.com/#narrow/stream/113489-new-members/topic/Does.20lean-mode.20hang.20often</a> </del></p>",
        "id": 339152384,
        "sender_full_name": "Julin S",
        "timestamp": 1677775764
    },
    {
        "content": "<p>And.. uh.. I don't fancy using vscode.. So not sure if this is a problem there as well.</p>\n<p>The computer I'm on has got ample amount of RAM left over even when running lean. </p>\n<p>Although the lean process seem to be taking lot of RAM at least sometimes.</p>",
        "id": 339152504,
        "sender_full_name": "Julin S",
        "timestamp": 1677775790
    },
    {
        "content": "<p>5 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members/topic/Finite.20fields.20in.20lean\">#new members &gt; Finite fields in lean</a> by <span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span>.</p>",
        "id": 339153828,
        "sender_full_name": "Notification Bot",
        "timestamp": 1677776080
    },
    {
        "content": "<p>Some proofs can be slow. Maybe you just wrote a slow proof. Can you give a <a href=\"https://leanprover-community.github.io/mwe.html\">#mwe</a> of the problem? This might be nothing to do with emacs and might just be Lean being slow. There is <code>set_option profiler true</code> -- if this is reporting large times then it's nothing to do with emacs.</p>",
        "id": 339180268,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1677782815
    },
    {
        "content": "<p>I personally have problems with <code>lean-mode</code> for the last month or two. Very often I have to reload file dependencies(without changing imported files!) to get correct type checking and syntax highlighting, emacs sometimes refuses to type check newly written stuff. Restarting the whole <code>lean-mode</code> helps sometimes too. Occasionally, I have to restart emacs altogether as the performance gets really bad.</p>\n<p>I was unable to figure out what is the problem :( but I'm definitely not running out of memory.</p>",
        "id": 339718140,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1678033077
    }
]