[
    {
        "content": "<p>I wonder if the following contradict the code of conduct here? I certainly don't think it helps encourage newcomers.</p>\n<p><a href=\"/user_uploads/3121/jUJlj98liHTfXKz69zfn-1Ea/Screenshot-2024-06-11-at-16.46.42.png\">Screenshot-2024-06-11-at-16.46.42.png</a><br>\n<a href=\"/user_uploads/3121/eOe9v0xp7fQ2Hj2Af0fuEZLq/Screenshot-2024-06-11-at-16.46.32.png\">Screenshot-2024-06-11-at-16.46.32.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/jUJlj98liHTfXKz69zfn-1Ea/Screenshot-2024-06-11-at-16.46.42.png\" title=\"Screenshot-2024-06-11-at-16.46.42.png\"><img src=\"/user_uploads/3121/jUJlj98liHTfXKz69zfn-1Ea/Screenshot-2024-06-11-at-16.46.42.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/3121/eOe9v0xp7fQ2Hj2Af0fuEZLq/Screenshot-2024-06-11-at-16.46.32.png\" title=\"Screenshot-2024-06-11-at-16.46.32.png\"><img src=\"/user_uploads/3121/eOe9v0xp7fQ2Hj2Af0fuEZLq/Screenshot-2024-06-11-at-16.46.32.png\"></a></div>",
        "id": 444037193,
        "sender_full_name": "rzeta0",
        "timestamp": 1718121009
    },
    {
        "content": "<p>The trolling/snark on the second message reminds me of IRC in the '90s. I'm glad the internet has (mostly) evolved since then.</p>",
        "id": 444039035,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1718121492
    },
    {
        "content": "<p>I really don’t understand the comment on the message about Lyx. Lyx is probably great for beginners but I don’t know any professional user of TeX that uses anything like Lyx. The fact that Lyx is a very inefficient way to write TeX code is only a fact, there is no trolling. I don’t think the contributors to Lyx would deny that. Their goal is not to make an efficient TeX editor, it is to make a very accessible TeX editor.</p>",
        "id": 444043637,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1718122561
    },
    {
        "content": "<p>But I may be wrong. Maybe someone will tell me they have been using Lyx to write math papers for years, and I will have learned something.</p>",
        "id": 444044515,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1718122701
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"724904\">@rzeta0</span> just write your tutorials and be happy :)<br>\nIf you get something wrong, those who care enough will let you know. It's not like you're doing surgery on someone.</p>\n<p>We find all sorts of tutorials on the internet. Good ones, bad ones, exceptionally good ones, mistaken ones and even evil ones. People bounce on learning sources everyday. If they fail to apply what you have to tell, they will find other sources, or ask here.</p>\n<p>In the worst case scenario, really, those tutorials will serve nobody but yourself, which is already good enough of a motivation.</p>\n<p>Further, if it's about theorem proving, it's really hard to get something really wrong if you get the kernel to accept your proofs in the end.</p>",
        "id": 444053070,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1718124833
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/113489-new-members/topic/encouraging.20beginners/near/444043637\">said</a>:</p>\n<blockquote>\n<p>I really don’t understand the comment on the message about Lyx. Lyx is probably great for beginners but I don’t know any professional user of TeX that uses anything like Lyx. The fact that Lyx is a very inefficient way to write TeX code is only a fact, there is no trolling. I don’t think the contributors to Lyx would deny that. Their goal is not to make an efficient TeX editor, it is to make a very accessible TeX editor.</p>\n</blockquote>\n<p>Maybe \"trolling\" is the wrong word, I'll concede that. But I still think this style of direct criticism on tangential topics (especially when it comes to the stereotypical subject of text editor choices, which is why I originally referred to it as \"trolling\") is reminiscent of IRC in the '90s. I can't exactly describe what I mean by that, but I think my main point is that \"IRC style\" didn't fully embrace the fact that text communication lacks tone/facial cues. Without those, negative-sounding remarks (especially unsolicited advice and/or advice on tangential matters) can come across as mean, even if you mean well. To be clear, I'm not accusing you of bad faith: I 100% believe you weren't being mean and that the comment was meant to be constructive. I also understand there's an extra level of nuance in this situation, as you know a decent number of Lean users in real life and those people can imagine/infer the appropriate friendly facial expression you'd use.</p>\n<p>(About the particular example being discussed, I personally can't imagine myself using LyX as efficiently as I use my text editor, so I understand your point. But I can imagine scenarios where LyX is good enough and learning something else is not worth it. For this reason, I personally feel I lack context to provide advice/criticism in this matter. In general, I'm very skeptical that the amount of time I spent configuring my emacs was a net productivity increase in my life, so I am very sympathetic to people who don't enter these kinds of rabbit holes. I just do it because I can't avoid it, and honestly my life would probably be a lot simpler if I could.)</p>",
        "id": 444057551,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1718126074
    },
    {
        "content": "<p>Side note about LyX: it's its own document processor with its own document model and file format. It's not meant to be a TeX editor, though it can export LaTeX, since it's designed to use LaTeX to create the finished PDFs.</p>\n<p>I once experimented with it to write a very short paper. It was an interesting experience, and I don't remember running into any inefficiencies beyond those from needing to learn a new tool, but for various reasons I've stuck with editing LaTeX in Emacs.</p>",
        "id": 444059542,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1718126623
    },
    {
        "content": "<p>Kyle, the inefficiency mostly comes from equations. Anyway I now see this comment that I thought was innocuous wasn’t, so I apologize for making it.</p>",
        "id": 444087580,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1718135952
    }
]