[
    {
        "content": "<p>Hi, I am new to Lean!</p>\n<p>I am interested in, for my Master's thesis, either designing a <em>very</em> lightweight Lean GUI or making my own proof assistant from scratch, which is why I ask: If I wanted to learn about the theory behind proof assistants where would I start?</p>",
        "id": 543022192,
        "sender_full_name": "Ender",
        "timestamp": 1759522114
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"972445\">Ender</span> <a href=\"#narrow/channel/113489-new-members/topic/Ender/near/543022192\">said</a>:</p>\n<blockquote>\n<p>Hi, I am new to Lean!</p>\n<p>I am interested in, for my Master's thesis, either designing a <em>very</em> lightweight Lean GUI or making my own proof assistant from scratch, which is why I ask: If I wanted to learn about the theory behind proof assistants where would I start?</p>\n</blockquote>\n<p>Welcome! You might want to check out The Type Theory of Lean by Mario Carneiro.</p>",
        "id": 543022775,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1759522406
    },
    {
        "content": "<p>Hi, I recommend that if you want to learn the basic type theory that makes Lean work, that you check out <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a>. If instead you want to learn the metamathematics that lean is built upon, then you can check out The Type Theory of Lean, as Kenny Lau mentioned. There's also the book Type Checking in Lean 4 (<a href=\"https://ammkrn.github.io/type_checking_in_lean4/\">https://ammkrn.github.io/type_checking_in_lean4/</a>) which gives a description of how the typechecker works.</p>\n<p>I'm not sure what you mean by making a GUI for Lean, but depending on what you want to do, you can check out the proofwidgets system, which lets you make any sort of react or html+javascript object in Lean's infoview that can interact with Lean code. An example would be a rubik's cube where if you rotate it, it modifies your code. Lean's metaprogramming features are quite powerful, so if you have a specific idea in mind you might want to mention it here so that people can give you guidance as to what tools you can use to save time.</p>",
        "id": 543034244,
        "sender_full_name": "Niels Voss",
        "timestamp": 1759528568
    },
    {
        "content": "<p>I wrote a toy proof assistant that drew aspects from Lean and Coq. I used type theory of lean as a reference as well as <a href=\"https://rocq-prover.org/doc/V8.18.0/refman/language/core/index.html\">this</a> Coq documentation</p>",
        "id": 543050694,
        "sender_full_name": "Tanner Duve",
        "timestamp": 1759543457
    },
    {
        "content": "<p>Hi! I'd love to have a lightweight GUI library for Lean!</p>",
        "id": 543158217,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1759666409
    }
]