[
    {
        "content": "<p>Hey all, I have a question on the creation of a project which depends on both the mathlib library and the sphere-eversion project. In the lakefile.lean file, I have added that the project requires these two git repos as follows:</p>\n<p>require mathlib from git \"https://github.com/leanprover-community/mathlib4\"@\"master\"<br>\nrequire SphereEversion from git \"https://github.com/leanprover-community/sphere-eversion\"@\"master\"</p>\n<p>Both packages seem to have made it correctly into my .lake/packages folder. However, when I try to import them and restart the server, I get some different errors that make me believe that my Mathlib version might be a version ahead of the sphere-eversion project, although I am not sure if that is indeed the issue. </p>\n<p>Some of the errors are:</p>\n<ul>\n<li>It imports Mathlib.Analysis.NormedSpace.AddTorsorBases instead of Mathlib.Analysis.Normed.Affine.AddTorsorBases</li>\n<li>failed rewrite in SphereEversion.ToMathlib.Analysis.Calculus.AffineMap.lean in the mapsTo_homothety_ball. </li>\n<li>failed use of nice_atlas_domain in stdLocalisationData in SphereEversion.Global.LocalisationData.lean<br>\nAnd a selection of type issues.</li>\n</ul>\n<p>My plan was to use this combination of libraries to work on a differential topology project within lean. Since I am quite new with lean and its ways, I am not sure if this is a known problem, if I am just being a little stupid or if it is just a case of fixing the errors locally to get it working. Either way, I hope someone has a possible answer. If any more information is needed, don't hesitate to ask. </p>\n<p>Thanks, Sam</p>",
        "id": 473077738,
        "sender_full_name": "Sam Lindauer",
        "timestamp": 1727434276
    },
    {
        "content": "<p>Indeed, mathlib's <code>master</code> branch and sphere-eversion's <code>master</code> branch use different Lean versions. (Check the <code>lean-toolchain</code> file to determine which version is used.)</p>",
        "id": 473084903,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1727436307
    },
    {
        "content": "<p>I have an in-progress branch upgrading sphere eversion to current mathlib (but won't have time this week to finish it).</p>",
        "id": 473085047,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1727436348
    },
    {
        "content": "<p>That said: sphere eversion already imports mathlib - so if I understood correctly, you just need to require sphere-eversion (and not mathlib). In other words, I presume the correct fix is to <em>not</em> require mathlib.<br>\n<span class=\"user-mention\" data-user-id=\"385895\">@Jon Eugster</span> I know you know about lakefile details: can you confirms this (don't require transitive dependencies) is correct?</p>",
        "id": 473085304,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1727436420
    },
    {
        "content": "<p>Taking a step back: it's great to hear that you want to work on differential topology! What particular goal would you work towards?</p>",
        "id": 473085465,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1727436453
    },
    {
        "content": "<blockquote>\n<p>this (don't require transitive dependencies) is correct?</p>\n</blockquote>\n<p>Yes</p>",
        "id": 473088246,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1727437385
    },
    {
        "content": "<p>Removing Mathlib from the requirements indeed works! Thanks so much!</p>",
        "id": 473095976,
        "sender_full_name": "Sam Lindauer",
        "timestamp": 1727439695
    },
    {
        "content": "<p>I have just started my master thesis and am currently getting familiar with how Lean works (I have worked through a couple of chapters in mathematics_in_lean). I am not yet completely clear on the formalization goal of the thesis as a whole yet, but as a start for now, the goal is to try to formalize the Whitney-Graustein Theorem in a stand-alone project.</p>",
        "id": 473099030,
        "sender_full_name": "Sam Lindauer",
        "timestamp": 1727440306
    },
    {
        "content": "<p>Indeed, <code>lake</code> might get confused with transitive deps.</p>\n<p>You <em>can</em> add the transitive dependencies to the lakefile but then you have to be super careful to use the right versions. Sphere eversion seems to use a random version of Mathlib at commit <a href=\"https://github.com/leanprover-community/mathlib4/commits/2df7d9446f22706562263d8b55076dc073e10d02\"><code>2df7d9</code></a> (<a href=\"https://github.com/leanprover-community/sphere-eversion/blob/d2a0d3557cb7ec297c0b560bd69ce86dd766c692/lake-manifest.json#L68\">see it's lake-manifest</a>) which isn't even a stable release, but somewhere a day after the <code>v4.10.0</code> release of mathlib...</p>\n<p>So I think the following would work too:</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">require</span><span class=\"w\"> </span><span class=\"n\">mathlib</span><span class=\"w\"> </span><span class=\"k\">from</span><span class=\"w\"> </span><span class=\"n\">git</span><span class=\"w\"> </span><span class=\"s2\">\"https://github.com/leanprover-community/mathlib4\"</span><span class=\"bp\">@</span><span class=\"s2\">\"2df7d9446f22706562263d8b55076dc073e10d02\"</span>\n<span class=\"n\">require</span><span class=\"w\"> </span><span class=\"n\">SphereEversion</span><span class=\"w\"> </span><span class=\"k\">from</span><span class=\"w\"> </span><span class=\"n\">git</span><span class=\"w\"> </span><span class=\"s2\">\"https://github.com/leanprover-community/sphere-eversion\"</span><span class=\"bp\">@</span><span class=\"s2\">\"master\"</span>\n</code></pre></div>\n<p>but as said, it's superfluous to include the <code>require mathlib</code> and doomed to break the next time anything gets updated.</p>\n<p><span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> I think you could add a rev to the sphere eversion's <code>lakefile.toml</code> then at least it would use one of the tagged releases of mathlib:</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"o\">[[</span><span class=\"n\">require</span><span class=\"o\">]]</span>\n<span class=\"n\">name</span><span class=\"w\"> </span><span class=\"bp\">=</span><span class=\"w\"> </span><span class=\"s2\">\"mathlib\"</span>\n<span class=\"n\">scope</span><span class=\"w\"> </span><span class=\"bp\">=</span><span class=\"w\"> </span><span class=\"s2\">\"leanprover-community\"</span>\n<span class=\"n\">rev</span><span class=\"w\"> </span><span class=\"bp\">=</span><span class=\"w\"> </span><span class=\"s2\">\"v4.11.0\"</span>\n</code></pre></div>\n<p>I think ideally almost all projects requiring mathlib as a dependency would not use \"master\" but any tagged release of mathlib, making it easier to combine different projects.</p>",
        "id": 473102801,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1727441491
    },
    {
        "content": "<p>That makes sense, thanks!</p>",
        "id": 473103848,
        "sender_full_name": "Sam Lindauer",
        "timestamp": 1727441798
    },
    {
        "content": "<p>Sure, adding a revision to sphere-eversion's lakefile is a good idea. I'll do so when I have time (not before next week).</p>",
        "id": 473113134,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1727444308
    },
    {
        "content": "<p>Do you have an eventual goal with your project? Just enjoy a fun master's thesis, formalise a new result, contribute something to mathlib? (To be clear: all three are fine!)</p>\n<p>I vaguely remember a student (of <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> <span class=\"user-mention\" data-user-id=\"111080\">@Floris van Doorn</span>?) working in a similar direction as the Whitney-Graustein theorem. (Can you confirm, or am I misremembering?) In case your goal were \"contribute to mathlib\", it would be useful to take note of previous formalisations. (These might well be not at mathlib level yet - so this is not an argument to not work on this result. But it could be useful to see if they learned certain things on the way.)</p>",
        "id": 473310378,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1727511807
    },
    {
        "content": "<p>I can confirm the intended fix to your lakefile issue is to require only the sphere eversion repository and not Mathlib.</p>",
        "id": 473320648,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1727516301
    },
    {
        "content": "<p>I also confirm that Whitney-Graustein is a nice target. One important thing to understand is there are two completely separate tasks. One is to prove the h-principle for circle immersions into the plane. You can either deduce it from the sphere eversion project (which proves a much more general result) or write an elementary proof. The elementary proof from <a href=\"https://archive.org/details/makingwavesaguid0000levy\">Making waves</a> was the topic of a student project at CMU last year but was never completed.</p>",
        "id": 473321109,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1727516552
    },
    {
        "content": "<p>The second independent task is to understand the homotopy obstruction. This is essentially equivalent to computing the fundamental group of the circle. I lost track of the status of this computation in Mathlib. Covering space theory and fundamental groups is a somewhat cursed area of Mathlib. Periodically someone announces they will work on it, some work is done but never PRed, or it is PRed but the process stops in the middle. There is no deep reason what this should stay that way however. You can be the one breaking the curse (after carefully checking the current status).</p>",
        "id": 473321201,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1727516618
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span>  I think the eventual goal is to work on some new results in much less generality than what Mathlib asks. We have a few possibilities in mind: building on top of the assumption that differential forms exist and try to work on Symplectic or Contact manifolds, having a look at the formalisation of differential forms themselves and looking at the formalisation of the holonomic approx. thm for 1-jets  provided by <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span>  and Mélanie Theillière. We haven't chosen a specific path yet though.</p>\n<p>I will be working under supervision of Johan Commelin and Álvaro del pino Gomez.</p>",
        "id": 473644443,
        "sender_full_name": "Sam Lindauer",
        "timestamp": 1727684975
    },
    {
        "content": "<p>I don’t think the current state of Mathlib allows to work on differential form, unless Yury really prioritizes this (he seemed to have resumed work on it).</p>",
        "id": 473657913,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1727687950
    },
    {
        "content": "<p>One option we considered is to hand-roll differential forms in a rather specific setting of smooth manifolds over $\\R$. So no worrying about other fields or structure groupoids, etc...</p>",
        "id": 473740632,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1727704646
    },
    {
        "content": "<p>This wouldn't end up in mathlib, but it might still give some input for how a mathlib formalization should proceed.</p>",
        "id": 473740882,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1727704682
    },
    {
        "content": "<p>Why do you think this would make things simpler?</p>",
        "id": 473741060,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1727704708
    },
    {
        "content": "<p>because I don't know what the correct conditions on a general structure groupoid are to get a sensible theory of differential forms</p>",
        "id": 473742153,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1727704833
    },
    {
        "content": "<p>but I do know that differential forms are sometimes considered on manifolds with boundaries etc...</p>",
        "id": 473742356,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1727704863
    },
    {
        "content": "<p>I haven't thought about differential forms yet (and am not sure if I can commit time to it) - but let me say I would be excited to see (or review) work towards symplectic geometry!</p>",
        "id": 474285013,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1727872667
    }
]