[
    {
        "content": "<p>I've been playing with the different parts of Mathlib but one issue has been slowing down my learning considerably.</p>\n<p>Sometimes I think I need to import a certain part of Mathlib and when I try to do that, it takes a veeeeery long time. The thing is I am not even sure I need this part of the library, I am just testing.</p>\n<p>For instance, now I am trying to use the notation <code>∑</code> and I am not sure which part of Mathlib I need. I saw a file in <em>Mathematics in Lean</em> that uses <code>∑</code> and they do a <code>import Mathlib.Tactic</code>. So I tried to do that. I've been waiting for more than 1 hour now for VSCode to finish importing that...</p>\n<ol>\n<li>Is this normal?</li>\n<li>Any tips on how to speed up the learning process?</li>\n</ol>",
        "id": 560232803,
        "sender_full_name": "Luiz Kazuo Takei",
        "timestamp": 1764098133
    },
    {
        "content": "<p>have you run <code>lake exe cache get</code> to get the precompiled files of mathlib?</p>",
        "id": 560237816,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1764099830
    },
    {
        "content": "<p>That's not normal, unless you're on a very low-powered computer</p>",
        "id": 560237819,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1764099832
    },
    {
        "content": "<p>so, I actually had similar experience when I used the latest version of mathlib4 in my configuration for the project . I think the reason is that the pre-compiled 'cache' will definitely end up outdated so it will either slow down to download new ones or to use the code and compile it on the fly which is also slow. </p>\n<p>but when I switched my project configuration to a concrete version of mathlib4 (in that case it was <code>\"v4.15.0\"</code>) I ended up with very fast imports, server restarts, compiles.</p>",
        "id": 560241837,
        "sender_full_name": "Mohamed Talaat Harb",
        "timestamp": 1764100953
    },
    {
        "content": "<p>Are you not downloading mathlib cache with <code>lake exe cache get</code>? You shouldn't be compiling mathlib yourself, that takes an hour. We already compiled it for you.</p>",
        "id": 560245913,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764101973
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"110064\">@Kenny Lau</span> and <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>.</p>\n<p>How often should I run <code>exe cache get</code>? For instance, if I change the imports of a file, do I need to run that again?</p>",
        "id": 560247373,
        "sender_full_name": "Luiz Kazuo Takei",
        "timestamp": 1764102527
    },
    {
        "content": "<p>are you editing mathlib?</p>",
        "id": 560247443,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1764102555
    },
    {
        "content": "<p>if you're editing mathlib for a PR, then every time you publish the edit, github will automatically make a compiled version after half an hour, and then you can run <code>lake exe cache get</code> to get the updated compiled version;</p>\n<p>otherwise, you shouldn't be editing mathlib at all</p>",
        "id": 560247585,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1764102609
    },
    {
        "content": "<p>Thanks for the tip <span class=\"user-mention\" data-user-id=\"1001077\">@Mohamed Talaat Harb</span>!</p>\n<p>From what I saw, this can be done in <code>lean-toolchain</code>. Is that correct?</p>\n<p>In my case, it has this: <code>leanprover/lean4:v4.25.0-rc2</code>.</p>",
        "id": 560247779,
        "sender_full_name": "Luiz Kazuo Takei",
        "timestamp": 1764102685
    },
    {
        "content": "<p>if this is an external project depending on mathlib then you only need to run <code>lake exe cache get</code> once (or every time you update the mathlib version)</p>",
        "id": 560247961,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1764102774
    },
    {
        "content": "<p>No, you don't want to touch <code>lean-toolchain</code> on your own</p>",
        "id": 560248354,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1764102944
    },
    {
        "content": "<p>Again, it depends on whether you're making changes inside mathlib or in a project that depends on mathlib</p>",
        "id": 560248413,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1764102966
    },
    {
        "content": "<p>I am not touching Mathlib. I am just importing it.</p>",
        "id": 560249233,
        "sender_full_name": "Luiz Kazuo Takei",
        "timestamp": 1764103298
    },
    {
        "content": "<p>Then you only run <code>lake exe cache get</code> once.</p>",
        "id": 560249649,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764103467
    },
    {
        "content": "<p>(Unless you've run <code>lake update</code>, but don't do that before you know what it does :))</p>",
        "id": 560249856,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1764103551
    }
]