[
    {
        "content": "<p>I have just downloaded Lean4 and am trying to go through the <a href=\"https://leanprover-community.github.io/mathematics_in_lean/C01_Introduction.html#getting-started\">Mathematics in Lean</a> tutorial.  However, when I started trying to do the tutorial I ran into a problem which was that the documentation uses the fancy \\mathbb N but then the editor vscode said that it wasn't in scope. It seemed that when I changed it to <code>Nat</code> it worked. Does anyone know what's going on here?</p>",
        "id": 424161595,
        "sender_full_name": "E. M. Eisner",
        "timestamp": 1709269802
    },
    {
        "content": "<p>Have you tried adding an import to the top, like <code>import Mathlib</code>?</p>",
        "id": 424161924,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1709270147
    },
    {
        "content": "<p>nope! will try! (don't think that the tutorial told me to do that)</p>",
        "id": 424162181,
        "sender_full_name": "E. M. Eisner",
        "timestamp": 1709270393
    },
    {
        "content": "<p>There shouldn’t be any need to add any import. What is the file that has this issue?</p>",
        "id": 424294226,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1709314008
    },
    {
        "content": "<p>I get the feeling that <span class=\"user-mention\" data-user-id=\"696116\">@E. M. Eisner</span> has created a new blank file</p>",
        "id": 424324001,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1709326382
    },
    {
        "content": "<p>Ah, this would indeed explain everything. This is no what is recommended to read the book. You may need to read again the setup explanations at the very beginning.</p>",
        "id": 424325061,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1709326892
    },
    {
        "content": "<p>No that is not what happened. I was in the very first file with <code>#eval \"Hello, World!\"</code> in it... I just added the first couple examples from section 1.2 of the book and got an error from the fancy \\mathbb N</p>",
        "id": 424365881,
        "sender_full_name": "E. M. Eisner",
        "timestamp": 1709356245
    },
    {
        "content": "<p>Ah, that's the issue then. You're meant to open the file <code>S02_Overview.lean</code> instead of adding the examples from that section to <code>S01_Getting_Started.lean</code>. The \"Getting Started\" file has no imports, which is why it didn't work. <code>S02_Overview.lean</code> has the appropriate imports at the top.</p>",
        "id": 424367725,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1709358082
    },
    {
        "content": "<p>Each section of the book has its Lean file. Nothing will work if you edit the wrong file.</p>",
        "id": 424426676,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1709398393
    },
    {
        "content": "<p>okay well i missed that instruction i guess - thanks for letting me know!</p>",
        "id": 424440157,
        "sender_full_name": "E. M. Eisner",
        "timestamp": 1709408593
    }
]