[
    {
        "content": "<p>I'm using Lean4 to do Advent of Code this year, and I've come across a situation where <code>Option.flatMap</code> (signature of <code>{α β : Type} (f : α → Option β) (o : Option α) : Option β</code>) would be useful. This is a thing in other programming languages (ie Java has its <code>Optional#flatMap</code>) and is analogous to <code>List.flatMap</code>, same as <code>Option.map</code> is analogous to <code>List.map</code> (when list lengths are max 1). I've written my own as you can do, but I think its something that should be in base Lean. What is the process around that, and if I was to make such a PR is there anything else that would need to be added (ie docs, proofs to go along with it, ect). This is a very basic thing so wasn't sure about the whole starting an RFC for it on the GitHub (and that said to ask about it here too anyway).</p>",
        "id": 562847978,
        "sender_full_name": "ChiefArug",
        "timestamp": 1765335537
    },
    {
        "content": "<p>This exists as <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Option.bind#doc\">docs#Option.bind</a>, there's a preference for using the names that have come to be associated with the monad typeclass.</p>",
        "id": 562849106,
        "sender_full_name": "Chris Bailey",
        "timestamp": 1765336074
    },
    {
        "content": "<p>Lean is mature enough that if you're unable to find things of this nature, it's more likely to be a naming thing than a missing implementation.</p>",
        "id": 562849397,
        "sender_full_name": "Chris Bailey",
        "timestamp": 1765336245
    },
    {
        "content": "<p>Ah, thank you. I had tried looking for things around <code>Option.map</code> that had the signature I wanted but didn't manage to find that (looks like it uses the funny match function definition syntax that I still need to wrap my head around).</p>",
        "id": 562849980,
        "sender_full_name": "ChiefArug",
        "timestamp": 1765336566
    }
]