[
    {
        "content": "<p>A recurring problem that I'm having as a new person trying to learn is that I will frequently search for something, or be clicking links somewhere, and I'll end up on a page that's about Lean 3. Only, it's totally non-obvious, and sometimes it doesn't even say \"3\" anywhere -- just plain \"Lean\" or \"mathlib\". I have to be fairly paranoid to not accidentally spend twenty minutes reading something obsolete. And even when I've identified that I'm on a Lean 3 resource, it's often hard to figure out what the Lean 4 equivalent is.</p>",
        "id": 396142546,
        "sender_full_name": "Alex Altair",
        "timestamp": 1697047990
    },
    {
        "content": "<p>Here's a detailed example: the Mathlib documentation.</p>\n<p>Let's say I do a google search and get dropped on a random page like <a href=\"https://leanprover-community.github.io/mathlib_docs/linear_algebra/projection.html#linear_map.range_eq_of_proj\">this</a>. The first thing I notice is that the URL has no \"3\" in it. There <em>is</em> a 3 in the top bar, but it doesn't exactly draw attention. Let's say I notice it and then want to go to the Mathlib4 version. It would be super great if I could just click something and be automatically taken there, but I don't see anything like that. Another thing I sometimes try is whether the URL has a quick modification. If there was a \"3\" in the URL, I would try changing it to a 4. There isn't, but I have figured out that the Mathlib4 doc URLs have a <code>mathlib4_docs</code> in them, so I try editing the <code>mathlib_docs</code> of the example URL to <code>mathlib4_docs</code>. Alas, that gives me a 404. And the 404 page doesn't even have the side bar for me to try to manually nagivate to the equivalent linear algebra page. So, then I just try to google search \"lean 4 range_eq_of_proj\". This actually brings me back to the lean 3 doc page. Nothing above the fold is a lean 4 doc link. Okay, so... I guess I can try to search from the Mathlib4 docs homepage? Fortunately <a href=\"https://leanprover-community.github.io/mathlib4_docs/\">https://leanprover-community.github.io/mathlib4_docs/</a> is a valid URL (although the home page just says \"This was built using Lean 4 at commit a62d2fd4979671b76b8ab13ccbe4fdf410ec0d9d\" and is mostly empty, which makes me think I'm not supposed to be on this page). I paste the name into the search bar, which brings up one result, which... isn't what I'm looking for. Then I try using the sidebar to manually find LinAlg and \"Projection\", and then control-f for <code>range_eq_of_proj</code>, which does finally work.</p>",
        "id": 396142586,
        "sender_full_name": "Alex Altair",
        "timestamp": 1697048009
    },
    {
        "content": "<p>Comparing the URLS for the Mathlib3 and 4 versions of this page, they are different in multiple minor ways, but in ways that seem like they could be linked between with a script.</p>",
        "id": 396142604,
        "sender_full_name": "Alex Altair",
        "timestamp": 1697048020
    },
    {
        "content": "<p>So my main suggestions for this use case are;</p>\n<p>1) <strong>Put a big, colored banner at the top of the Mathlib3 docs</strong> that tell you it's deprecated and you probably want the Mathlib4 docs<br>\n2) Then also <strong>put a link to said Mathlib4 docs</strong>, to whatever level of drill-down is practical. (Even just a link to the main page would be helpful.)<br>\n3) It would help if we could <strong>get the Lean3 stuff to stop being at the top of google searches</strong>, and instead have it be the Lean4 stuff. I don't know anything about SEO but I assuming something could be done here.</p>",
        "id": 396142635,
        "sender_full_name": "Alex Altair",
        "timestamp": 1697048035
    },
    {
        "content": "<p>Separately, it also seems somewhat odd to me that the Mathlib docs don't have a clear link to the homepage. I can't click the big word \"Documentation\" nor the medium words \"General documentation\" instead it's the tiny word \"index\" below that</p>",
        "id": 396143109,
        "sender_full_name": "Alex Altair",
        "timestamp": 1697048243
    },
    {
        "content": "<p>Also the thing in the title bar that says e.g. \"Mathlib.LinearAlgebra.Projection\" looks like it should be some breadcrumbs where I could click \"LinearAlgebra\" to get to the main page for linalg, but it's not; instead I have to manually go through the sidebar tree to find Mathlib.LinearAlgebra.Basic\" (and I have to know it's the \"Basic\" file that serves as a home page)</p>",
        "id": 396143444,
        "sender_full_name": "Alex Altair",
        "timestamp": 1697048392
    },
    {
        "content": "<p>Here's another example; AFAICT <a href=\"https://lean-lang.org/reference/tactics.html\">this resource</a> nowhere indicates that it's about Lean3, but the syntax in the examples seem to be Lean3</p>",
        "id": 396144809,
        "sender_full_name": "Alex Altair",
        "timestamp": 1697048997
    },
    {
        "content": "<p>Flagging <a href=\"https://lean-lang.org/reference/\">https://lean-lang.org/reference/</a> is for <span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span>. The <a href=\"https://leanprover-community.github.io/mathlib_docs/\">https://leanprover-community.github.io/mathlib_docs/</a> issue will be tackled by mathlib maintainers.</p>",
        "id": 396148676,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1697050562
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"644656\">Alex Altair</span> <a href=\"#narrow/stream/113489-new-members/topic/Feedback.3A.20have.20Lean.203.20stuff.20point.20to.20Lean.204.20equivalent/near/396143444\">said</a>:</p>\n<blockquote>\n<p>Also the thing in the title bar that says e.g. \"Mathlib.LinearAlgebra.Projection\" looks like it should be some breadcrumbs where I could click \"LinearAlgebra\" to get to the main page for linalg, but it's not; instead I have to manually go through the sidebar tree to find Mathlib.LinearAlgebra.Basic\" (and I have to know it's the \"Basic\" file that serves as a home page)</p>\n</blockquote>\n<p>That specific criticism is hard to act on given that there's no \"main page for linalg\" and in general no \"main page for folder X\". The <code>.Basic</code> files are usually the most basic ones across their folder but they do not always exist and sometimes are not so basic.</p>",
        "id": 396157686,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1697054730
    },
    {
        "content": "<p>We could certainly create one file per folder (at least the big common ones) whose sole purpose is to provide documentation for the folder and point to useful resources. I could stand behind that.</p>",
        "id": 396157906,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1697054826
    },
    {
        "content": "<p>One thing that would be very valuable, but requires some time to set up, is to have the <code>#align</code> information in mathlib4 presented in the mathlib3 docs, so that every declaration in the mathlib docs has a \"go to lean 4 version \" link</p>",
        "id": 396158328,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1697055043
    },
    {
        "content": "<p>In particular, the missing pieces here are:</p>\n<ul>\n<li>Export the align data in a way that the mathlib3 doc-gen (python code) can read it; a json dictionary would suffice</li>\n<li>Implement permalinks in doc-gen4. We had these in doc-gen3, but it's no long possible to link to definition if you don't also know which file its in</li>\n<li>Work out how to expose the latest #align output in CI to the doc-gen CI (github releases? A secret url in the mathlib4 docs that the mathlib3 docs CI fetches?)</li>\n</ul>",
        "id": 396158532,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1697055146
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/stream/113489-new-members/topic/Feedback.3A.20have.20Lean.203.20stuff.20point.20to.20Lean.204.20equivalent/near/396158328\">said</a>:</p>\n<blockquote>\n<p>One thing that would be very valuable, but requires some time to set up, is to have the <code>#align</code> information in mathlib4 presented in the mathlib3 docs, so that every declaration in the mathlib docs has a \"go to lean 4 version \" link</p>\n</blockquote>\n<p>This sounds like a lot of work compared to putting a huge red banner on every mathlib3 doc page telling people they shouldn't be reading it.</p>",
        "id": 396158603,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1697055187
    },
    {
        "content": "<p>Yes, but this doesn't help people who searched google for <code>mathlib has_deriv_at_sin</code> and only got offered the lean3 docs</p>",
        "id": 396158747,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1697055253
    },
    {
        "content": "<p>Perhaps adding <code>link rel=\"canonical\"s</code> all over helps there.</p>",
        "id": 396160414,
        "sender_full_name": "Julian Berman",
        "timestamp": 1697056149
    },
    {
        "content": "<p>(Also wanna note that I have generally been having a great time learning Lean, everything is so much more functional and pleasant than I expected! I can tell that everyone has been putting tons of work into not just the port, but all aspects of the software)</p>",
        "id": 396162843,
        "sender_full_name": "Alex Altair",
        "timestamp": 1697057377
    },
    {
        "content": "<p>Re \"I blind googled and found mathlib3 docs\" -- why not just bookmark the mathlib 4 docs and search them instead?</p>",
        "id": 396228786,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1697094891
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>  Partly because  I don't know enough to know where what I'm looking for is, but also, there are a whole bunch of other great resources that I might want to see results from</p>",
        "id": 396330880,
        "sender_full_name": "Alex Altair",
        "timestamp": 1697130383
    },
    {
        "content": "<p>I can probably list on one hand the great resources in Lean 4 right now. <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a> , <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a> , #nng4 (is that even a thing?), and the docs <a href=\"https://leanprover-community.github.io/mathlib4_docs/\">https://leanprover-community.github.io/mathlib4_docs/</a></p>",
        "id": 396339458,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1697133715
    },
    {
        "content": "<p>Kevin, you forgot <a href=\"https://leanprover.github.io/functional_programming_in_lean/\">#fpil</a></p>",
        "id": 396381532,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1697153421
    },
    {
        "content": "<p>(There's also a lot of blog posts, mastodon posts, youtube video descriptions, any resources people write in the future that I don't know about -- I'm definitely going to keep googling stuff!)</p>",
        "id": 396384429,
        "sender_full_name": "Alex Altair",
        "timestamp": 1697155220
    },
    {
        "content": "<p>Yes, future you should of course Google. I'm just suggesting that present you might want to consider just looking at the currently very finite list of resources.</p>\n<p>As well as the functional programming book that Jireh mentioned there's also the lean 4 reference manual and the metaprogramming book, these are good lean 4 references to add to my list above</p>",
        "id": 396440647,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1697181443
    },
    {
        "content": "<p>So we're now on two hands</p>",
        "id": 396440706,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1697181465
    }
]