[
    {
        "content": "<p>For regular theorems and definitions, whenever I am curious, I can ctrl+click on the name to look at the implementation detail and verify my understanding. This however doesn't seem to work well for class implementations and operators, as ctrl+click only leads to the class definition, or the notation definition. The \"Instances\" section in the doc provides a great help (with some additional clicking), but it becomes difficult for some instances. </p>\n<p>For example, recently I wanted to verify how \\le and \\subset are implemented for <code>Multisets</code> (and there is a key difference between the two that I want to be 100% sure I understand correctly). However, the implementation for \\le is so big: it is an entire hierarchy of classes (LE, Preorder, PartialOrder...) and the doc only list the implementation on the one according to how the code was written, which in this case can be found in PartialOrder but not in LE. </p>\n<p>Sometimes this is made even more difficult if the class is not implemented for the specific type I am working at, but has a blanket implementation applicable to all types satisfying certain other classes. It might not have a guessable name to search for.</p>\n<p>How do you work around with this kind of problem?</p>",
        "id": 515409173,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1746051333
    },
    {
        "content": "<p>I do <code>#synth</code> and <code>set_option pp.explicit true</code> so I can look at the output without clicking through</p>",
        "id": 515409686,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1746051603
    },
    {
        "content": "<p>That's a good way. Thanks!</p>",
        "id": 515410035,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1746051777
    },
    {
        "content": "<p>For mathematical content, there ought to be characterization lemmas somewhere in the library, since you're generally not supposed to expand definitions, but rewrite.</p>\n<p>For example, here I searched for 'Multiset.le_iff' in the <a href=\"https://leanprover-community.github.io/mathlib4_docs\">mathlib docs</a> and found <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Multiset.le_iff_count#doc\">docs#Multiset.le_iff_count</a></p>\n<p>Similarly, I searched for 'Multiset.subset_iff' and found the exact match <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Multiset.subset_iff#doc\">docs#Multiset.subset_iff</a></p>\n<p>These make the difference between the two very clear. There's also <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Multiset.subset_of_le#doc\">docs#Multiset.subset_of_le</a> nearby to show a logical relationship between them.</p>",
        "id": 515410219,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1746051869
    }
]