[
    {
        "content": "<p>Hi everyone,</p>\n<p>Given that the Stacks Project is well organized and serves as a comprehensive, encyclopedic resource in commutative algebra and algebraic geometry, what do you think about organizing a group of motivated students to formalize certain sections in the Stacks Project?</p>\n<p>There are 10-20 motivated students at Peking University, who already have some basic experience in formalizing exercises of abstract algebra. The teachers can teach them commutative algebra before they begin formalizing.</p>\n<p>Since we are most interested in algebra, maybe beginning with \"Chapter 9: Fields\" is a good start and then we can try to progress towards \"Chapter 10: Commutative Algebra\". A (maybe stubborn) working method is to check one by one whether a theorem in the Stacks Project is already formalized in mathlib. If yes, we add the corresponding Stacks Project tag to the comments of the formal theorem (or its formal variant). If not, we try to formalize and add this theorem into Mathlib. If the theorem is too early to be formalized yet, we may leave it as a TODO.</p>\n<p>I hold the belief that \"every theorem in the stacks project should be formalized (possibly in a variant form) into Mathlib\". Do you have any suggestions and comments on this project? Thank you!</p>",
        "id": 455770691,
        "sender_full_name": "Jiang Jiedong",
        "timestamp": 1722552869
    },
    {
        "content": "<p>Sounds like a good idea. The correspondence between stacks and mathlib is a nice thing to have . The Commutative algebra section is quite large though, you might want to limit the scope and focus on a selection of results.</p>",
        "id": 455893198,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1722594044
    },
    {
        "content": "<p>Searching for \"stacks\" in the source code, you'll find quite a few references. Not sure if there's overlap with what you were looking at</p>",
        "id": 455910460,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1722597777
    },
    {
        "content": "<p>That's great!</p>",
        "id": 456012818,
        "sender_full_name": "Shujian Yan",
        "timestamp": 1722625003
    },
    {
        "content": "<p>There is also this (deprecated) project: <a href=\"https://github.com/kbuzzard/lean-stacks-project\">https://github.com/kbuzzard/lean-stacks-project</a></p>",
        "id": 456014072,
        "sender_full_name": "Nick Decroos",
        "timestamp": 1722625289
    },
    {
        "content": "<p>Is it possible to have an AI for such thing ^^</p>",
        "id": 456017912,
        "sender_full_name": "Shujian Yan",
        "timestamp": 1722625903
    },
    {
        "content": "<p>If you can tell us what you mean by that, we can try to answer :)</p>",
        "id": 456018527,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1722626011
    },
    {
        "content": "<p>An wonderful AI that automaticly translate contents in the Stacks Project to lean code ^^</p>",
        "id": 456019674,
        "sender_full_name": "Shujian Yan",
        "timestamp": 1722626204
    },
    {
        "content": "<p>\"Possible\" is a very strong word. But from looking at it, it seems like largely a traditional math textbook, if already formatted nicely and with accessible LaTeX source code, so at least you don't have to do OCR</p>",
        "id": 456046559,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1722634857
    },
    {
        "content": "<p>That said, the proofs are going to be a real pain. The statements of theorems and definitions are probably easier to do automatically, but the proofs are going to involve filling in a lot of steps most authors consider \"trivial\" or \"obvious\"</p>",
        "id": 456046831,
        "sender_full_name": "Robert Maxton",
        "timestamp": 1722634920
    },
    {
        "content": "<p>For a trivial thing, we may let AI prove it or simply leave it with a \"sorry\" and then manually solve it later. Since the compiler can check for errors in the translated code, we can leverage the diagnostic to guide AI in correcting the code iteratively. ^^</p>",
        "id": 456092994,
        "sender_full_name": "Shujian Yan",
        "timestamp": 1722656417
    },
    {
        "content": "<p>A few people have mentioned Stacks as the next big challenge in auto-formalization, where the idea is that AI systems would start to formalize stacks and get better as it gets feedback, both human feedback and automatic feedback via RL from trying to prove theorems and make definitions type check, etc.  It is certainly a stretch goal, but not an unrealistic one for a group with a lot of motivation (and people and resources).</p>",
        "id": 456158719,
        "sender_full_name": "Jason Rute",
        "timestamp": 1722691206
    },
    {
        "content": "<p>I think the more likely path towards formalized stacks results is writing the lean yourself</p>",
        "id": 456159099,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1722691371
    },
    {
        "content": "<p>Probably.  But what is the most likely path to building good auto-formalization?  <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>  It depends on what your goal is.</p>",
        "id": 456159347,
        "sender_full_name": "Jason Rute",
        "timestamp": 1722691470
    },
    {
        "content": "<p>Also, it isn’t unrealistic to think that an AI could at least do some simple grunt work at this point.  I don’t think we have really stress tested what we can do with LLM based auto-formalization.</p>",
        "id": 456159857,
        "sender_full_name": "Jason Rute",
        "timestamp": 1722691675
    }
]