[
    {
        "content": "<p>Hello,</p>\n<p>To prove Kaplansky's criterion (i.e. an integral domain is a UFD if and only if every nonzero prime ideal contains a prime element), I have coded and used the following result: given two elements a, b of an integral domain, if a * b can be written as a product of prime elements, then a can be written as a product of a unit and prime elements (please see in the attached screenshot). </p>\n<p>I have also created a separate file (<a href=\"https://github.com/riccardobrasca/kaplanski4/blob/master/Kaplanski4/Absorbing.lean\">https://github.com/riccardobrasca/kaplanski4/blob/master/Kaplanski4/Absorbing.lean</a>) which generalizes this result (the generalization is called ProdProperty) and proves some basic statements related to it. Therefore, I was wondering whether to open a PR for both the file containing the proof of Kaplansky's criterion and the API or only for the file with Kaplansky's criterion. Could I please have your opinion on this matter? </p>\n<p>As I did not know how to name the generalization, I have temporarily called it ProdProperty but could you please suggest me a name for it?</p>\n<p><a href=\"/user_uploads/3121/sO0V_bGoQXXqrDsLSO3Nwbt3/result.png\">result.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/sO0V_bGoQXXqrDsLSO3Nwbt3/result.png\" title=\"result.png\"><img src=\"/user_uploads/3121/sO0V_bGoQXXqrDsLSO3Nwbt3/result.png\"></a></div>",
        "id": 390739489,
        "sender_full_name": "Emilie Uthaiwat",
        "timestamp": 1694616167
    },
    {
        "content": "<p>Especially in your first PRs, it is easier for everybody to have several small PRs rather than one big.</p>",
        "id": 390739886,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1694616298
    },
    {
        "content": "<p>I can open 2 PRs then. Thank you! Do you have any suggestions concerning the name of the generalization (please see in the attached screenshot)? <br>\n<a href=\"/user_uploads/3121/4yUuupTW-o5hZftV9jFA4_yh/property.png\">property.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/4yUuupTW-o5hZftV9jFA4_yh/property.png\" title=\"property.png\"><img src=\"/user_uploads/3121/4yUuupTW-o5hZftV9jFA4_yh/property.png\"></a></div>",
        "id": 390742270,
        "sender_full_name": "Emilie Uthaiwat",
        "timestamp": 1694616987
    },
    {
        "content": "<p>Emilie's question is rather if we should give a name to this property (for a general submonoid <code>S</code>) and develop a little API or prove directly that the submonoid generated by the primes satisfies it. To prove this theorem we don't need anything beside the definition, and we are not sure it is a useful notion for someone else (the more natural property <code>x * y ∈ S → x ∈ S ∧ y ∈ S</code> is not what we want).</p>",
        "id": 390742360,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1694617018
    },
    {
        "content": "<p>I am tempted to not define it, but I cannot be sure without saying how convenient it is to have the definition and some API.</p>",
        "id": 390744017,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1694617484
    },
    {
        "content": "<p>Perhaps, I can just open 2 PRs. In the worst case, the API will never be used for any other result than Kaplansky's criterion.</p>",
        "id": 390746700,
        "sender_full_name": "Emilie Uthaiwat",
        "timestamp": 1694618257
    }
]