[
    {
        "content": "<p>(Not sure if this is the right channel for this question; I am thinking maybe it is because the question clearly demonstrates I am not - yet - proficient enough with searching Mathlib documentation)</p>\n<p>Background: I have a colleague with whom I often discuss various mathematical topics over lunch; today, for some reason we discussed theorems about free monoids. And at some point, I said \"let's see what Mathlib knows about free monoids\", took out my laptop and made a quick search.</p>\n<p>I quickly found <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=FreeMonoid#doc\">docs#FreeMonoid</a>, but this is the description of the free monoid generated by some type (and understandably, even to me, it is \"just\" the type of lists over the same type, with concatenation as multiplication); but what I was looking for was a way to state that a given monoid is free, or that it is freely generated by some collection of monoid elements; something like <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=IsFreeGroup#doc\">docs#IsFreeGroup</a> but for monoids instead of groups.</p>\n<p>Does something like this exist in Mathlib? (If not, then very likely the theorems we were discussing are not in there either; of course I tried to search for IsFreeMonoid, but the fact that I did not find anything is just proof that, if it exists, the name is somewhat different )</p>",
        "id": 541677934,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1758895947
    },
    {
        "content": "<p>No we don't have this</p>",
        "id": 541683691,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1758897463
    },
    {
        "content": "<p>OK, thanks. Is it because it's not interesting enough, or just because nobody had the time/energy/willingness to work on it? Or maybe it's difficult to integrate properly with the rest of the library?</p>",
        "id": 541684571,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1758897700
    },
    {
        "content": "<p>probably some combination of the three</p>",
        "id": 541689052,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1758898788
    },
    {
        "content": "<p>I just did a search of all the predicates mentioning monoids and checked all the results and none of them were \"is free monoid\"</p>",
        "id": 541689288,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1758898844
    }
]