[
    {
        "content": "<p>Hi is there now a BNF file for lean? I checked <a href=\"https://github.com/leanprover/lean4/blob/master/doc/lexical_structure.md#identifiers\">https://github.com/leanprover/lean4/blob/master/doc/lexical_structure.md#identifiers</a> but it seems not a full specification</p>",
        "id": 448506320,
        "sender_full_name": "Shanghe Chen",
        "timestamp": 1719898747
    },
    {
        "content": "<p>There is not</p>",
        "id": 448507391,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1719899430
    },
    {
        "content": "<p>Thanks!  I am trying to develop some basic functionality in Intellij Idea in which highlighting may require this for generating the ast. Yeah I will try if get ast from lsp/sematicsTokens work or not</p>",
        "id": 448510596,
        "sender_full_name": "Shanghe Chen",
        "timestamp": 1719900632
    },
    {
        "content": "<p>Lean's syntax can be arbitrarily extended by the user. To the point that people can (and have!) embedded DSLs for html and json inside Lean.<br>\nFor this reason, syntax highlighting is usually left to the Lean server, and it gives highlighting instructions to the editor via LSP.</p>",
        "id": 448511134,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1719900918
    },
    {
        "content": "<p>Yeah it’s definitely the correct way but IJ does still not support semantic highlighting from lsp yet. Maybe I will Ieave it alone first and try <a href=\"https://github.com/leanprover/Lean.tmbundle\">Lean.tmbundle</a> for basic highlighting</p>",
        "id": 448512232,
        "sender_full_name": "Shanghe Chen",
        "timestamp": 1719901234
    },
    {
        "content": "<p>The VS Code extension uses the following TextMate grammar as a fall-back when the server has not provided any semantic tokens yet: <a href=\"https://github.com/leanprover/vscode-lean4/tree/master/vscode-lean4/syntaxes\">https://github.com/leanprover/vscode-lean4/tree/master/vscode-lean4/syntaxes</a></p>",
        "id": 448532580,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1719907642
    },
    {
        "content": "<p>It's worth pointing out that the semantic token request is <em>by far</em> the strangest request in our language server and that we actively violate the LSP spec to make it work for us, so there's a chance that you will run into issues here.</p>\n<p>The core problem is that <a href=\"https://github.com/microsoft/vscode/issues/105870\">VS Code has no support for LSP's result streaming mechanism</a>, but we cannot wait with responding to the semantic tokens request until the full file has been processed, as that may take minutes.<br>\nTo work around this, when the client requests the semantic tokens for the full file, we instead only provide it with the semantic tokens up to the current point of elaboration. Unfortunately, now the client thinks that it knows all the semantic tokens, so it will not request the semantic tokens again for a while. <br>\nTo make the client re-request the semantic tokens, we send a <a href=\"https://microsoft.github.io/language-server-protocol/specifications/lsp/3.17/specification/#semanticTokens_refreshRequest\">workspace/semanticTokens/refresh</a> server to client request every couple of seconds so that the client re-requests the set of semantic tokens for the current point of elaboration in the file.</p>\n<p>This is a really bad hack, but there's not much we can do about it at this point. I have some ideas to improve this and I also want to see if I can perhaps hack the VS Code client to make it support some limited form of result streaming, but that's for another day.</p>",
        "id": 448534534,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1719908252
    },
    {
        "content": "<p>Thanks for pointing this out! Yeah the hard part about semantic highlighting seems to be doing it incrementally. Also the textmate file is very nice too! I am thinking if it’s possible to highlight variable names using it, currently it seems only keywords/comments/notations are recognized using the textmate rules (using the old Lean.tmlanguage file)<br>\n<a href=\"/user_uploads/3121/Skploq4XPfn3Wf_fvZ0TDVi8/30E04DDD-94D1-4CE6-A32B-56366B20A3B0.jpg\">30E04DDD-94D1-4CE6-A32B-56366B20A3B0.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/Skploq4XPfn3Wf_fvZ0TDVi8/30E04DDD-94D1-4CE6-A32B-56366B20A3B0.jpg\" title=\"30E04DDD-94D1-4CE6-A32B-56366B20A3B0.jpg\"><img src=\"/user_uploads/3121/Skploq4XPfn3Wf_fvZ0TDVi8/30E04DDD-94D1-4CE6-A32B-56366B20A3B0.jpg\"></a></div>",
        "id": 448555172,
        "sender_full_name": "Shanghe Chen",
        "timestamp": 1719913135
    }
]