[
    {
        "content": "<p>Hi!<br>\nI'm new and currently going through the Mathlib3 tutorial. I'm beginning a Master's thesis on formalizing Model Theory in Lean, with the goal of helping to formalize basic definitions and theorems. It seems that most of what has been done in Model Theory in Lean3 has not been ported to Lean4 for the moment. Since I will work on that project part time for the next 12 months, should I begin right away by doing everything in Lean4? That would probably mean that I should begin by helping to port the rest of Model Theory.</p>",
        "id": 352114643,
        "sender_full_name": "Gabin Kolly",
        "timestamp": 1682278240
    },
    {
        "content": "<p>Do you know about <a href=\"https://flypitch.github.io/\">Flypitch</a>? This hasn't been ported.</p>",
        "id": 352115114,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1682278612
    },
    {
        "content": "<p>The main statement of flypitch (independence of CH) hasn’t been moved to Mathlib as far as I know. But a lot of the basic model theory already has. It seems that the mathlib port will be done in a few months. Personally, I think that focusing on lean4 is the right choice, and porting model theory from mathlib3 to mathlib4 would be a great place to start.</p>",
        "id": 352117382,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1682280082
    },
    {
        "content": "<p>There's also this project done by an Imperial student: <a href=\"https://github.com/Jlh18/ModelTheoryInLean8/\">https://github.com/Jlh18/ModelTheoryInLean8/</a> . It proves Ax-Grothendieck in Lean 3.</p>",
        "id": 352125561,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1682286948
    },
    {
        "content": "<p>Thank you for the pointers!<br>\nIs there a reason why frypitch has not been moved to Mathlib? Is it just because of the work needed to adapt everything to the mathlib style? I haven't found something on what is accepted in Mathlib (would a proof of the independence of CH be accepted, or is it too specific?)</p>",
        "id": 352335077,
        "sender_full_name": "Gabin Kolly",
        "timestamp": 1682355632
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"111080\">@Floris van Doorn</span>, this is a question for you.</p>",
        "id": 352335243,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1682355678
    },
    {
        "content": "<p>I've seen some mentions of flypitch in mathlib - not sure if they were a sign of the work slowly getting merged or it was new code inspired by it</p>",
        "id": 352344814,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1682358378
    },
    {
        "content": "<p>Some code has moved to mathlib, yeah, but it's a slow process.</p>",
        "id": 352344889,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1682358402
    },
    {
        "content": "<p>The code in Flypitch indeed did not follow the mathlib style, and we used various shortcuts and temporary hacks in our proofs.<br>\nAs Adam said, a lot of the basic model theory was ported to mathlib (and improved!) by <span class=\"user-mention\" data-user-id=\"302826\">@Aaron Anderson</span>.</p>",
        "id": 352345034,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1682358449
    },
    {
        "content": "<p>The model theory code in mathlib is new code inspired by flypitch, improving some of the pain points, and making some definitions more generally applicable.</p>",
        "id": 352345249,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1682358516
    },
    {
        "content": "<p>In particular, that code is just my attempt to beat the quickest path (using a ton of flypitch work) towards the kind of model theory I do research on.</p>",
        "id": 352351190,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1682360199
    },
    {
        "content": "<p>I haven't added much in a while, but I have a lot of thoughts for how to move forward, which I'd be happy to discuss!</p>",
        "id": 352353462,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1682360876
    }
]