[
    {
        "content": "<p>Is there a web page or blog post that gives a big picture and general details about how to install and use libraries? I'd also be interested in overview documentation on <code>lake</code>.  There are lots of great resources for newbies at <a href=\"https://lean-lang.org/documentation\">https://lean-lang.org/documentation</a> and <a href=\"https://leanprover-community.github.io/learn.html\">https://leanprover-community.github.io/learn.html</a>.  <code>lake</code> is easy to use to get started on a project even if you don't understand everything it sets up, and the default lake help info at the command line is somewhat useful.  </p>\n<p>But I haven't found any source that answers questions like the following.  That doesn't mean the information isn't there somewhere, but I've looked quite a bit and have had trouble finding it.  I think I know the answers to most of the following questions, now, but I was guessing, and I'm not sure.</p>\n<p>Since there <em>is</em> some documentation on using libraries linked from the main Lean website, maybe it would help if I mentioned some of the questions I have, to clarify what was missing from the materials I did find.  The rest of this post contains those questions (mostly answered for myself, at this point, but with some difficulty).</p>\n<hr>\n<p>The std4 README says:</p>\n<blockquote>\n<p>To use std4 in your project, add the following to your lakefile.lean:<br>\nrequire std from git \"<a href=\"https://github.com/leanprover/std4\">https://github.com/leanprover/std4</a>\" @ \"main\"</p>\n</blockquote>\n<p>I have done that, but what does it do?  After I examine a source file in a Lean-enabled editor (I'm using lean.nvim) from a directory containing such a lakefile.lean, is std4 installed on my system? Where is it?   I eventually found that in .lake/packages under the project directory that <code>lake</code> created.</p>\n<p>My next question was where I need to be implement the instructions in the <a href=\"https://github.com/leanprover/std4?tab=readme-ov-file#documentation\">std4 README</a> for generating std4's docs?  It looks like the right place to be is .lake/project/std/.lake, but this was not obvious.</p>\n<p>Then should I just use the index.html that's under build then?  Is there any way to access documentation on specific functions and data structures via LSP?</p>\n<p>I also wasn't sure about the exact syntax for naming a module in an <code>import</code> statement.  I think I've figured out that for std4 or mathlib4, it should be e.g. <code>Mathlib.Data.Vector</code>, i.e. the full path displayed at the top of the documentation page for a module.</p>\n<p>Thanks!</p>",
        "id": 425542834,
        "sender_full_name": "mars0i",
        "timestamp": 1709912320
    }
]