[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113489-new-members/topic/Lean.203.20or.204.3F/near/394490716\">said</a>:</p>\n<blockquote>\n<p>Because there is no more <code>begin/end</code> it's apparently now far too confusing to have party hats, because they sometimes appear when you're not done. The issue is with the <code>end</code>, which is no longer there. If you are happy to use a <code>by/tada</code> block like we used to use <code>begin/end</code> blocks then you can use this code written by Mario:</p>\n<p><div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"kn\">import</span><span class=\"w\"> </span><span class=\"n\">Lean</span>\n<span class=\"kn\">open</span><span class=\"w\"> </span><span class=\"n\">Lean</span><span class=\"w\"> </span><span class=\"n\">Elab</span><span class=\"w\"> </span><span class=\"n\">Tactic</span>\n\n<span class=\"kn\">elab</span><span class=\"w\"> </span><span class=\"s2\">\"tada\"</span><span class=\"w\"> </span><span class=\"o\">:</span><span class=\"w\"> </span><span class=\"n\">tactic</span><span class=\"w\"> </span><span class=\"bp\">=&gt;</span><span class=\"w\"> </span><span class=\"k\">do</span>\n<span class=\"w\">  </span><span class=\"k\">let</span><span class=\"w\"> </span><span class=\"n\">gs</span><span class=\"w\"> </span><span class=\"bp\">←</span><span class=\"w\"> </span><span class=\"n\">getUnsolvedGoals</span>\n<span class=\"w\">  </span><span class=\"k\">if</span><span class=\"w\"> </span><span class=\"n\">gs</span><span class=\"bp\">.</span><span class=\"n\">isEmpty</span><span class=\"w\"> </span><span class=\"k\">then</span>\n<span class=\"w\">    </span><span class=\"n\">logInfo</span><span class=\"w\"> </span><span class=\"s2\">\"Goals accomplished 🎉\"</span>\n<span class=\"w\">  </span><span class=\"k\">else</span>\n<span class=\"w\">    </span><span class=\"n\">Term</span><span class=\"bp\">.</span><span class=\"n\">reportUnsolvedGoals</span><span class=\"w\"> </span><span class=\"n\">gs</span>\n<span class=\"w\">    </span><span class=\"n\">throwAbortTactic</span>\n</code></pre></div><br>\n</p>\n</blockquote>\n<p>I suggest that we add this to batteries or mathlib. Maybe as <code>qed</code> tactic.<br>\nI'm also fine if we lint against it appearing in mathlib.</p>\n<p>But recently I've had several requests/complaints that the lack of \"Your are done with your proof, all is good now\" feedback is really confusing for beginners/students. It is also a clear step back from Lean 3 in UX.</p>\n<p>At the moment, the snippet above is using <code>logInfo</code>.</p>\n<ul>\n<li>This creates a blue squiggly line, which might still be perceived as \"I need to fix this noisy output\".</li>\n<li>It als means that <code>No goals</code> is still visible in the infoview. Is it possible to have it use widgets to overwrite the <code>No goals</code> in instead?</li>\n</ul>",
        "id": 489619293,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1734497611
    },
    {
        "content": "<p>I can definitely see how this would improve UX. But arguably, teaching newcomers that they should always put <code>tada</code> at the end of their proof and then later telling them that it is banned in mathlib seems a bit strange. I think it might be best to avoid misleading newcomers by telling them that <code>by</code> and <code>tada</code> always come in pairs, when they actually might not. If we are to introduce this, I still suggest we be honest that <code>tada</code> is a tactic, and not lie by saying it is part of the language's syntax.</p>\n<p>I'm not necessarily opposed to this, I just think we should decide carefully if we actually want <code>tada</code>. (Also, isn't <code>tada</code> functionally equivalent to <code>done</code>?)</p>",
        "id": 489622230,
        "sender_full_name": "Niels Voss",
        "timestamp": 1734499519
    },
    {
        "content": "<p>As an alternative suggestion, maybe we could put the message inline instead of the infoview. I use a VSCode plugin called <a href=\"https://marketplace.visualstudio.com/items?itemName=usernamehw.errorlens\">Error Lens</a> which displays info right next to the code.<br>\n<a href=\"/user_uploads/3121/G76DBePh86Az90XcmOCmpGg7/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/G76DBePh86Az90XcmOCmpGg7/image.png\" title=\"image.png\"><img data-original-dimensions=\"718x184\" src=\"/user_uploads/thumbnail/3121/G76DBePh86Az90XcmOCmpGg7/image.png/840x560.webp\"></a></div><p>I'm wondering if we could maybe do the same thing and put a <code>🎉</code> or something after a finished proof. It could look something like this (ignore the <code>#eval s</code> please):<br>\n<a href=\"/user_uploads/3121/r7sdBPMtMHgd8PxZPWSCdsfi/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/r7sdBPMtMHgd8PxZPWSCdsfi/image.png\" title=\"image.png\"><img data-original-dimensions=\"782x138\" src=\"/user_uploads/thumbnail/3121/r7sdBPMtMHgd8PxZPWSCdsfi/image.png/840x560.webp\"></a></div><p>To be clear, I'm not suggesting we hook onto Error Lens; I'm just using it as an example to show that such a thing is possible. Also, this would probably need to be configurable, since I would imagine some people wouldn't like this.</p>",
        "id": 489623508,
        "sender_full_name": "Niels Voss",
        "timestamp": 1734500487
    },
    {
        "content": "<p><span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span> has the undesirable side effect of encouraging the user to take a break from using Lean. (Hey, I'm done!)</p>",
        "id": 489626884,
        "sender_full_name": "Bjørn Kjos-Hanssen",
        "timestamp": 1734502495
    },
    {
        "content": "<p>I would really like that Mathlib (or Batteries) allowed the user to type something like <code>open newbie</code> and that allowed for all sorts of newcomer-friendlyness (like turning off auto-implicit, the <code>tada</code> (which I rather call <code>qed</code> as suggested above...). The <code>open newbie</code> line would remind the user that they are working in learning mode, and one could even have a <code>open newbie-transition</code> that would suggest the appropriate changes when these tactics or extra syntax are being used. Would that make sense?</p>",
        "id": 489699091,
        "sender_full_name": "Marc Masdeu",
        "timestamp": 1734508637
    },
    {
        "content": "<p>I have mixed feelings about this. On one hand, there's definitely some UX improvements that might not be appropriate for more experienced users. But on the other hand, I don't think telling new users that the first thing they should write is <code>open newbie</code> is a very good first look.</p>\n<p>What are some of the issues that you think would bother beginners but not experienced users? If it's just two issues (autoImplicit and an unsatisfying <code>by</code> block end) then maybe those two issues should be resolved individually (I am of the opinion that <code>autoImplicit</code> should be off for everyone by default, or at least restricted to single letter terms in <code>Sort _</code>, but that's a topic for a different thread).</p>",
        "id": 489701591,
        "sender_full_name": "Niels Voss",
        "timestamp": 1734509683
    },
    {
        "content": "<p>The thing is, I've never seen any other language have something like a beginner only mode. Some languages do have special modes (like javascript's <code>use strict</code>), but these are specialized modes for the use case, not the type of user. If you imagine the <code>open newbie</code> as being something that primarily makes the language stricter, then it should be called <code>open strict</code>. If it primarily prints out more diagnostic information, it should be called <code>open verbose</code>. But in any case, adding language features usually has a cost, and this is true for Lean in spite of its metaprogramming capabilities.</p>",
        "id": 489702990,
        "sender_full_name": "Niels Voss",
        "timestamp": 1734510244
    },
    {
        "content": "<p>I see. Maybe an alternative would be that lake included a config file by default, with some editable options with comments on what their effect is. For instance, you would see the autoImplicit line turned on by default (as is now, but with a comment saying that if you change this then it will avoid some newcomer's errors). It could have additional verbosity turned off by default as well, and so on. The advantage I see in something like this is that one would be able to discover and experiment with all these features that are sometimes buried inside zulip conversations.</p>",
        "id": 489703386,
        "sender_full_name": "Marc Masdeu",
        "timestamp": 1734510418
    },
    {
        "content": "<p>I think that's a much better option. What are some of the options, besides autoImplicit, that would be included in such a config? (I also don't know if Lean should be moving in the direction of having a bunch of flags to control language behavior (this kind of thing has led other languages to fragment into dialects), but that's just my opinion.)</p>",
        "id": 489704440,
        "sender_full_name": "Niels Voss",
        "timestamp": 1734510803
    },
    {
        "content": "<p>I would leave it to experts to figure out what sort hackery can be accomplished with such flags. The moment you allow it, I am sure that people will come up with powerful ideas. I don't see how the problem of fragmentation into dialects could occur, as long as Mathlib imposes its own set of flags. Code submitted to Mathlib would have to adhere to that.</p>",
        "id": 489705048,
        "sender_full_name": "Marc Masdeu",
        "timestamp": 1734511003
    },
    {
        "content": "<p>Maybe not necessarily fragmentation (so long as we don't introduce any flags that require the same flag to be enabled downstream, like e.g. agda's --cubical flag), but in an extreme case it would mean a large portion of Zulip messages would need to start by posting a list of what options are enabled in the current context.</p>",
        "id": 489705959,
        "sender_full_name": "Niels Voss",
        "timestamp": 1734511341
    },
    {
        "content": "<p>As for the topic of this thread, I'm not sure having a flag to require <code>qed</code> at the bottom of every <code>by</code> block would be the best idea, but I can see its appeal (as long as it doesn't apply to one-liners like <code>have : ...  := by linarith</code>)</p>",
        "id": 489706273,
        "sender_full_name": "Niels Voss",
        "timestamp": 1734511473
    },
    {
        "content": "<p>Just my two cents: firstly, I think someone who doesn't have a programming background and doesn't have a clue what's doing on won't even understand the difference between \"this is a tactic\" and \"this is part of the syntax\". Secondly, I actively teach newbies that \"by...done\" is the syntax and have them code with the done at the end, when they're learning</p>",
        "id": 489706511,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1734511579
    },
    {
        "content": "<p>Do you think a specialized <code>qed</code> or <code>tada</code> tactic is needed, or is <code>done</code> good enough?</p>",
        "id": 489706996,
        "sender_full_name": "Niels Voss",
        "timestamp": 1734511760
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"521331\">Niels Voss</span> <a href=\"#narrow/channel/113489-new-members/topic/goals.20accomplished/near/489706996\">said</a>:</p>\n<blockquote>\n<p>Do you think a specialized <code>qed</code> or <code>tada</code> tactic is needed, or is <code>done</code> good enough?</p>\n</blockquote>\n<p>(Although the question was not probably directed to me) I would be happy with the <code>done</code> tactic as is, if the blue squiggly line could be removed.</p>",
        "id": 489707645,
        "sender_full_name": "Marc Masdeu",
        "timestamp": 1734511978
    },
    {
        "content": "<p>I think that if we can repurpose <code>done</code> to put the emoji there, that would be excellent.</p>",
        "id": 489711800,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1734513378
    },
    {
        "content": "<p>We have ideas for a better visual indication of unsolved goals in the VSCode extension, but they require some more infrastructure under the hood to be really good (flicker-free etc.). It’s the dual of <code>tada</code> in that you’ll get a visible indication that there is work to be done, than an indication that all is done, but I expect i will improve UX here noticably. I am somewhat optimistic that we’ll see it within the next year, barring unexpected technical issues.</p>",
        "id": 489712811,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1734513684
    },
    {
        "content": "<blockquote>\n<p>It’s the dual of <code>tada</code> in that you’ll get a visible indication that there is work to be done, than an indication that all is done</p>\n</blockquote>\n<p>Isn't that exactly the problem though? Lean is all about reporting success by just not saying anything, but if you are a newcomer you may not be used to this workflow and would prefer some positive indication that everything is done</p>",
        "id": 489742483,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1734523528
    },
    {
        "content": "<p>You have to have at least a bit of trust in the system that if errors exist they will be reported and e.g. your extension isn't simply unloaded</p>",
        "id": 489742610,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1734523565
    },
    {
        "content": "<p>That’s true, and I think we also considered some positive overall per-declaration indication, and it would be able to use the same infrastructure, I assume. We’ll see how pressing it is when at least the “open goals” indication is no longer easy to miss.</p>",
        "id": 489789350,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1734537423
    },
    {
        "content": "<p>This is <a href=\"https://github.com/leanprover/lean4/pull/4190\">lean#4190</a> (superseding <a href=\"https://github.com/leanprover/lean4/pull/1970\">lean#1970</a>)<br>\nThe difficulty is to figure out the difference between \"you are done with this part, but the proof is not done\" and \"you are completely done with this proof\".<br>\nIf you're happy to show a <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span> in both cases, then that is trivial to implement.</p>",
        "id": 489799532,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1734540238
    },
    {
        "content": "<p>I think we can still offer <code>qed</code> for people who like a visual clue in their source and infoview that the proof is over.<br>\nI think having this tactic is harmless, and people won't have much trouble understanding that the tactic is optional, and that mathlib style excludes it.</p>",
        "id": 489805208,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1734542009
    },
    {
        "content": "<p>I've been using <code>by {</code>and <code>}</code> as my <code>begin</code>/<code>end</code> blocks when teaching Lean, mostly so that the error is on the closing brace instead of the (more easily missable) <code>by</code>. I don't mind also having a <code>qed</code> like this, of course.</p>",
        "id": 489856214,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1734562885
    },
    {
        "content": "<p>Oh that's also a nice idea!</p>",
        "id": 489857536,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1734563495
    }
]