[
    {
        "content": "<p>Hey, I'm trying to get started with Lean and mathlib, but I can't seem to get \"Hello, World\" working. I think it's some sort of 403 error when it attempts to download the dependency, but I don't know how to tell because all the set-up resources say to use the VSCode UI which doesn't give obvious feedback rather than command-line tools (Despite being a fan and regular user of VSCode, I'm a bit perplexed by the decision to bake it into the main setting-up tutorial)</p>",
        "id": 410940763,
        "sender_full_name": "David Spies",
        "timestamp": 1704247279
    },
    {
        "content": "<p>Oof, thanks<br>\nIs there somewhere I can check the current status/for updates?</p>",
        "id": 410941037,
        "sender_full_name": "David Spies",
        "timestamp": 1704247421
    },
    {
        "content": "<p>also, <a href=\"https://live.lean-lang.org\">https://live.lean-lang.org</a> is functional if you just want something to play around with</p>",
        "id": 410941924,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1704247814
    },
    {
        "content": "<p>Hello, <br>\nI'm Adam Millar. <br>\nI did a little bit of LEAN ~5 years ago with Mario and Jeremy as a masters' student at CMU. <br>\nI am .... very ... rusty, but I am trying to return to the world of LEAN, most likely from a pedagogical perspective to help undergraduate math and computer science students see the connections between Logic, Proof-Based Math, and Computer Science. <br>\n.... does anyone have a suggestion on where to begin?</p>",
        "id": 422689720,
        "sender_full_name": "Adam Millar",
        "timestamp": 1708543702
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/teaching/index.html\">https://leanprover-community.github.io/teaching/index.html</a></p>",
        "id": 422690405,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1708543997
    },
    {
        "content": "<p>Depending on how rusty you are, you may or may not notice that now (almost) everyone is using Lean 4, instead of Lean 3.</p>",
        "id": 422690660,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1708544104
    }
]