[
    {
        "content": "<p>Hello everyone.  Nice to see this is such a big and active group.  </p>\n<p>I'm an engineer (nano, chemical engineering, surface physics) by trade, but I do math and programming as a hobby. I am very new to formal proofs however, and am looking forward to learning that while at the same time learning Lean.   The last few years, I have been working on the Collatz conjecture (because it is honestly very fun and educational) and I finally got to the point where my requirements were exceeding my memory limits.  So I looked into getting GMP for working with very large integers, and to my pleasant surprise I saw that it is implemented within lean.   And here I am.  </p>\n<p>I am curious how well Lean is suited to data manipulation and visualization.  I currently use IgorPro by Wavemetrics to crunch numbers and investigate the many patterns within the Collatz tree.  But that only gets me so far before I hit floating point errors...  As it stands, I can barely understand what the type logic is doing when looking at Lean code, so I will definitely be doing a lot of tutorials the next few weeks.</p>",
        "id": 422016885,
        "sender_full_name": "Ian Allen",
        "timestamp": 1708181409
    },
    {
        "content": "<p>Hi! Some papers to read:</p>\n<p>Buzzard, K.: What is the point of computers? A question for pure mathematicians, Proc. Int. Cong. Math. 2022, Vol. 2, pp. 578–608. <a href=\"https://doi.org/10.4171/icm2022/166\">https://doi.org/10.4171/icm2022/166</a> </p>\n<p>Kontorovich, A.: Foreword to: Special Issue on Interactive Theorem Provers, Experimental Mathematics, Volume 31, Issue 2 (2022). <a href=\"https://doi.org/10.1080/10586458.2022.2088982\">https://doi.org/10.1080/10586458.2022.2088982</a></p>",
        "id": 422029168,
        "sender_full_name": "Yagub Aliyev",
        "timestamp": 1708190752
    },
    {
        "content": "<p>Thank you, Yagub.  I wonder what Buzzard thinks now with the rapid advance of machine learning, regarding his 2021 remarks about what we should expect from computers, and what they would be incapable of.</p>",
        "id": 422040097,
        "sender_full_name": "Ian Allen",
        "timestamp": 1708201346
    },
    {
        "content": "<p>You can ask them (start typing \"@Kevin...\")</p>",
        "id": 422040249,
        "sender_full_name": "Richard Copley",
        "timestamp": 1708201519
    },
    {
        "content": "<p><span aria-label=\"astonished\" class=\"emoji emoji-1f632\" role=\"img\" title=\"astonished\">:astonished:</span> haha thats great! might just do that when im done reading it all.</p>",
        "id": 422041024,
        "sender_full_name": "Ian Allen",
        "timestamp": 1708202306
    },
    {
        "content": "<p>Welcome, Ian, from a fellow chemical engineer! You may enjoy our recent paper on using Lean in chemistry applications, while introducing interactive theorem proving to a non-math / non-CS audience (the code examples are in Lean 3, though, you’ll want to learn Lean 4, now):<br>\n<a href=\"https://pubs.rsc.org/en/content/articlelanding/2024/dd/d3dd00077j\">https://pubs.rsc.org/en/content/articlelanding/2024/dd/d3dd00077j</a></p>",
        "id": 422161915,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1708319160
    },
    {
        "content": "<p>Cool, Tyler.  I imagine some of my colleagues will want to read it as well, thanks!</p>",
        "id": 422481040,
        "sender_full_name": "Ian Allen",
        "timestamp": 1708455147
    }
]