[
    {
        "content": "<p>Specifically, in the reference <a href=\"https://lean-lang.org/reference/declarations.html#inductive-types\">here</a>, I think when it says <code>so long as it does not refer to any nonrecursive arguments</code>, it should be <code>so long as it does not refer to any *recursive* arguments</code>. Similarly, I believe <code>is a telescope which does not refer to foo or any nonrecursive arguments</code> should also say recursive arguments. Please let me know if I'm mistaken on this because I'm quite confused if what it currently says is indeed correct!</p>",
        "id": 400690683,
        "sender_full_name": "ast-ral",
        "timestamp": 1699346529
    },
    {
        "content": "<p>Just to point out, that is a reference for Lean 3.  Lean is now on Lean 4 which is significant different (especially at the level of a reference manual).  There is no reference manual (yet?) for Lean 4, but there is <a href=\"https://lean-lang.org/documentation/\">plenty of documentation</a>.  That being said, I think how inductive works should be the same, so your question is still valid.</p>",
        "id": 400784661,
        "sender_full_name": "Jason Rute",
        "timestamp": 1699377504
    },
    {
        "content": "<p>And yes, I think you are correct.  Both bullets should say “does not refer to <em>recursive arguments</em>”.</p>",
        "id": 400785266,
        "sender_full_name": "Jason Rute",
        "timestamp": 1699377763
    },
    {
        "content": "<p>I think <a href=\"https://lean-lang.org/reference\">https://lean-lang.org/reference</a> should probably be renamed to <code>https://lean-lang.org/lean3/reference</code> or something obvious, and the page titles changed? cc <span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span>, since this might be something you have the power to fix</p>",
        "id": 400788163,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1699378998
    },
    {
        "content": "<p>Yes, there should be a big banner on each page of the Lean 3 reference manual saying this is about an obsolete version of Lean, hopefully with a link to an updated version.</p>",
        "id": 400788467,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1699379132
    },
    {
        "content": "<p>Excellent, thank you for double checking that for me! Thanks as well for pointing out the documentation was out of date, I found it through a search engine so I had no clue that it wasn't current. Will stick to sources from the page you linked in the future.</p>",
        "id": 400835159,
        "sender_full_name": "ast-ral",
        "timestamp": 1699401002
    }
]