[
    {
        "content": "<p>Hi everyone! I am a new--comer to Lean with particular interest in spectral graph theory and extremal graph theory. I am very bad at writing Lean code and currently have to rely on Aristotle and other tools to help me complete proofs. I recently used Aristotle to prove Nosal's theorem, an upper bound on the spectral radius of triangle-free graphs. May I ask what I should do?</p>",
        "id": 562541562,
        "sender_full_name": "Koishi Chan",
        "timestamp": 1765221359
    },
    {
        "content": "<p>Unfortunately AI-generated proofs are typically 10 times the size of proofs which are acceptable for Lean's maths library. Dare I ask how many lines it was? If you want to contribute to mathlib then the code has to be idiomatic and AI-generated code rarely is, so it's difficult to make progress here.</p>",
        "id": 562542786,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765221827
    },
    {
        "content": "<p>Hi Prof. Buzzard, thank you so much for the pointer! I understand that my lack of familiarity means I will not be able contribute to mathlib in the short term, and I am content with just seeing the proof pass the lean typechecker for now and (possibly) posting it to a separate github repo. The proof of the theorem I mentioned is about 320 lines, though the theorem is really simple. May I ask what is the best resource to learn the \"idiomatic\" style of the Lean repo?</p>",
        "id": 562546496,
        "sender_full_name": "Koishi Chan",
        "timestamp": 1765223274
    },
    {
        "content": "<p>Try to write some proofs without using any AI assistance :-) Maybe <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a> is a good place to start?</p>",
        "id": 562549278,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765224473
    },
    {
        "content": "<p>Hi, if you happen to publish it on GitHub and want somebody to collaborate on understanding and simplifying the proof please ping me here it in DM. <br>\nI would love to try to tackle this effort as a refactor challenge along with you.</p>",
        "id": 562695249,
        "sender_full_name": "Reuven Peleg",
        "timestamp": 1765289659
    },
    {
        "content": "<p>Hello. I am an idris2 user. I have been wanting to try lean. I would like to know which llms can help me</p>",
        "id": 562757340,
        "sender_full_name": "Diego Antonio Rosario Palomino",
        "timestamp": 1765302879
    },
    {
        "content": "<p>It's surprised that I've never noticed that AI-generated code is 10 times the size of proofs which are acceptable for Lean's maths library as Prof. Buzzard said :( Maybe the more work we should do is really cutting the lines</p>",
        "id": 566041123,
        "sender_full_name": "Nick Adfor",
        "timestamp": 1767348556
    },
    {
        "content": "<p>The number of lines really is the most minor concern, though. More important is making sure that more general substeps are extracted into lemmas that end up in the most appropriate location with sensible names, and that existing results are reused rather than reproved from scratch, for example</p>",
        "id": 566043322,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767350193
    },
    {
        "content": "<p>Reading code generated by llm is surely a very bad idea to learn Lean. I've nothing against using llm, but if you want to learn use the various resources you can find <a href=\"https://leanprover-community.github.io/learn.html\">here</a>. Once you are able to start probing things by yourself you can use aristotle, or anything else, to help you with annoying proofs</p>",
        "id": 566043389,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1767350247
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/channel/113489-new-members/topic/Hello.20world.20.3A.29/near/566043322\">said</a>:</p>\n<blockquote>\n<p>The number of lines really is the most minor concern, though. More important is making sure that more general substeps are extracted into lemmas that end up in the most appropriate location with sensible names, and that existing results are reused rather than reproved from scratch, for example</p>\n</blockquote>\n<p>And especially those sub-steps being appropriately tagged with tactics IMO, I think that's a big step of shortening AI proofs, and one that requires a good amount of nuance.</p>",
        "id": 566043908,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1767350614
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"130384\">Riccardo Brasca</span> <a href=\"#narrow/channel/113489-new-members/topic/Hello.20world.20.3A.29/near/566043389\">said</a>:</p>\n<blockquote>\n<p>to lean Lean</p>\n</blockquote>\n<p>Probably \"learn\" :)</p>",
        "id": 566047775,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1767353368
    }
]