[
    {
        "content": "<p>Hi everyone, <br>\nI've been learning lean by (slowly) reading through Mathematics in Lean. I've already finished the natural number game. What I'm curious about is how much Lean I actually need to know to understand/contribute to Mathlib. There seems to be a scary amount of type theory behind it, and I don't think I actually understand any of it. So how much type theory (and just other lean stuff) do you need to know to get Mathlib?</p>",
        "id": 538557842,
        "sender_full_name": "Stephen Zhou",
        "timestamp": 1757470923
    },
    {
        "content": "<p>If you also know the area of math you plan to contribute to well I think this is enough (in particular if you could do most of the exercises in MIL). You don't need to know type theory (although a little bit of \"naive\" type theory can help)</p>",
        "id": 538558699,
        "sender_full_name": "David Ledvinka",
        "timestamp": 1757471703
    },
    {
        "content": "<p>I would also say it requires more type theory and lean knowledge to come up with proper definitions than to prove theorems, so for first contributions I think it would be easier to prove something which doesn't require new definitions.</p>",
        "id": 538558898,
        "sender_full_name": "David Ledvinka",
        "timestamp": 1757471835
    },
    {
        "content": "<p>there is no set prerequisite that applies to all of mathlib in my opinion.</p>\n<p>i think type theory is actually much less relevant than “tricks of the trade” like searching, IDE usage, and usage of tactics / commands for experimenting / debugging. but you don’t need to be particularly deft to start contributing. if you work on an area that exists in mathlib you can look at the surrounding code and learn from it. see also <a href=\"https://leanprover-community.github.io/contribute/index.html\">https://leanprover-community.github.io/contribute/index.html</a></p>",
        "id": 538559061,
        "sender_full_name": "Lawrence Wu (llllvvuu)",
        "timestamp": 1757471983
    },
    {
        "content": "<p>FWIW I read <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a> (which is not at all scary and indeed taught me what little type theory I know) and that's about all the type theory I know,  it's certainly enough to get you proving theorems. You don't have to know any serious type theory to use mathlib, just like you don't have to know any serious set theory to prove theorems on paper</p>",
        "id": 538590785,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1757491867
    },
    {
        "content": "<p>I think if you want to progress to metaprogramming, it helps to understand <a href=\"https://lean-lang.org/functional_programming_in_lean/\">#fpil</a> </p>\n<p>Otherwise you don’t need very deep foundational knowledge. It helps to know what a typeclass is and why lean is getting stuck with inferring meta variables when you are debugging your proofs and such. But usually <a href=\"https://lean-lang.org/functional_programming_in_lean/\">#fpil</a> and <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a> will teach you enough. Nothing replaces the process of learning by doing, getting stuck on errors and asking around or debugging.</p>",
        "id": 538665034,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1757514071
    },
    {
        "content": "<p>You can contribute to mathlib and prove theorems in lean without having the first clue about metaprogramming. Metaprogramming is what you need to know to <em>write</em> tactics. You don't need to know any metaprogramming if all you want to do is use them.</p>",
        "id": 538697710,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1757522655
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20much.20lean.20is.20necessary.20for.20Mathlib.3F/near/538697710\">said</a>:</p>\n<blockquote>\n<p>You don't need to know any metaprogramming if all you want to do is use them.</p>\n</blockquote>\n<p>I largely agree. I don't fully agree because, just like in regular software engineering, any API can be abstracted to the extent of its documentation and to how faithfully it matches the implementation (accounting for bugs, TODOs etc).</p>\n<p>The norm for mathlib tactics is well-written documentation and decent test coverage. But hiccups may still occur, in which case knowing some metaprogramming <em>may</em> help. Or just ask here on Zulip.</p>",
        "id": 538709078,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1757526731
    }
]