[
    {
        "content": "<p>I followed the instructions of mathlib4 and used <code>make</code> to build mathlib4 and made a new project with mathlib4 as a dependency with <code>lake new project math</code> but it seems I still cannot import anything from mathlib4 in VS code. <code>import Mathlib.Data.Real.Basic</code> gives <code>unknown package 'Mathlib'</code>.  I can't find any documentation that seems to point to what I'm missing.</p>",
        "id": 327153841,
        "sender_full_name": "debord",
        "timestamp": 1676066289
    },
    {
        "content": "<p>In case it helps, here is an example project that successfully imports mathlib4: <a href=\"https://github.com/dwrensha/math-puzzles-in-lean4\">https://github.com/dwrensha/math-puzzles-in-lean4</a></p>",
        "id": 327158423,
        "sender_full_name": "David Renshaw",
        "timestamp": 1676068291
    },
    {
        "content": "<p>I cloned this and am still getting <code>unknown package 'Mathlib'</code> so clearly something is misconfigured on my end. I thought it had to do with the fact that I have VS installed from a Flatpak and it was trying to search for mathlib4 only in the Flatpak sandbox, but running one of your files in terminal outside of the Flatpak environment still gives <code>Bulgaria1998Q8.lean:1:0: error: unknown package 'Mathlib'</code>.</p>\n<p>Edit: I'm also getting this still in the mathlib4 source code itself. Seems like using <code>make</code> in the mathlib4 directory didn't even build anything.</p>",
        "id": 327159558,
        "sender_full_name": "debord",
        "timestamp": 1676068750
    },
    {
        "content": "<p><code>lake build</code> in the project root is what I do</p>",
        "id": 327161019,
        "sender_full_name": "David Renshaw",
        "timestamp": 1676069458
    },
    {
        "content": "<p>Okay, that built a bunch of mathlib stuff again, and seemingly did nothing. Still my output in VS code is <code>unknown package 'Mathlib'</code>, and trying to run one of the .lean files gives the same thing. Am I even doing this right? What exactly is building the files even doing?</p>",
        "id": 327164348,
        "sender_full_name": "debord",
        "timestamp": 1676071145
    },
    {
        "content": "<p>have you tried closing and reopening vscode?</p>",
        "id": 327164755,
        "sender_full_name": "David Renshaw",
        "timestamp": 1676071371
    },
    {
        "content": "<p>Yes, of course. Did not work.</p>",
        "id": 327164834,
        "sender_full_name": "debord",
        "timestamp": 1676071421
    },
    {
        "content": "<p>is it possible that vscode is trying to use lean 3 instead of lean 4?</p>",
        "id": 327164962,
        "sender_full_name": "David Renshaw",
        "timestamp": 1676071482
    },
    {
        "content": "<p>I have the lean4 extension installed. I shouldn't have lean 3 anything on my machine as far as I'm aware.<br>\nEdit: Does anyone know of a way to get more verbose error output?</p>",
        "id": 327165032,
        "sender_full_name": "debord",
        "timestamp": 1676071521
    },
    {
        "content": "<p>Figured it out. It seems it has something to do with this 'workspaces' thing in VS. I had everything just in a 'lean' workspace with the various folders in it. When I closed that workspace and then opened <em>just</em> the math-puzzles-in-lean4 folder as its own workspace, it works and detects Mathlib without errors.</p>",
        "id": 327167131,
        "sender_full_name": "debord",
        "timestamp": 1676072680
    }
]