[
    {
        "content": "<h1>Real Analysis | The countability of the rational numbers. | Michael Penn</h1>\n<p><a href=\"https://www.youtube.com/watch?v=ja94Pn89i3I\">https://www.youtube.com/watch?v=ja94Pn89i3I</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"ja94Pn89i3I\" href=\"https://www.youtube.com/watch?v=ja94Pn89i3I\"><img src=\"https://uploads.zulipusercontent.net/204e3209b4eb3b77017457dfd5f0eb8c897b9a20/68747470733a2f2f692e7974696d672e636f6d2f76692f6a613934506e38396933492f64656661756c742e6a7067\"></a></div><p>I'm an experienced C++ programmer, familiar with some formal mathematics (0th-2nd order logic, ZFC, and PA), and I'm learning real analysis. I thought it would be interesting to translate my pen-and-paper math into a program that demonstrates the proof (since, thanks to Curry-Howard, programming = proofs).</p>\n<p>Am I still too early for this? Is Lean4 a reasonable language to use for this purpose? Will this complex real analysis proof take months to complete solo?</p>\n<p>It seems that Lean4 proofs are quite verbose, and maybe trying to translate pen-and-paper proofs to programs is a mistake...</p>",
        "id": 452862285,
        "sender_full_name": "Adamthecoder",
        "timestamp": 1721493558
    },
    {
        "content": "<p>Translating proofs to program is the whole goal of formalization, isn't it? For example the theorem you want is <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Rat.instEncodable#doc\">docs#Rat.instEncodable</a> (of course you can try to reprove it by yourself!).</p>",
        "id": 452862737,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1721493844
    },
    {
        "content": "<p>On how difficult it is, it really depends on which proof you want to formalize (I have to admit I didn't watch the video), but if you have a precise pen and paper proof it is a good way to learn some Lean!</p>",
        "id": 452862784,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1721493881
    },
    {
        "content": "<p>From my very limited experience with Lean 4, formalizing this proof seems reasonable - I am sure it is possible to write the whole proof in a few hours, if one is fluent with syntax. Learning said syntax may take some time, but I don't think it will be too long, and you probably won't need much more than learning resourses from <a href=\"https://lean-lang.org/documentation/\">documentation page</a>.</p>",
        "id": 452869165,
        "sender_full_name": "Maxim Kalentsov",
        "timestamp": 1721497321
    }
]