[
    {
        "content": "<p>I presented to some professors  and students in my math school today,  who have no exposure to any topics about theorem proving or lean.  </p>\n<p>It was about Lean 4, ITP and AI, mentioning aristotle and the Gauss autoformaliser with PNT.</p>\n<p>I encountered one obstacle I really didn't know how to push back against, I was asked who is in charge of mathlib / what is the hierarchy.  Others joined the discussion saying its an open source project, and i showed how PRs work and are reviewed ( to the extent of my knowledge ).</p>\n<p>But that wasn't really enough , I encountered  \"I might not care about some open source software having a bug but if its meant to be for verifying validity of math\" and \"How is consensus actually reached?\".  </p>\n<p>There was also a lot of scepticism about even the feasibility of such a system ever being able to contain enough math to be useful in research, and that professors don't really have the time to learn such a complicated language much less want to spend time formalising well established maths, and whether it will ever be usable enough for day to day research.</p>\n<p>Any ideas?</p>",
        "id": 554016091,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1762412339
    },
    {
        "content": "<p>You'll learn that trying to convince people is useless.<br>\nUse a different approach. Inform people, do presentations of your work, explain what you do with lean and what you gained (like a lot) and let people interrested join you on your journey. <br>\nIf you are perseverant, and people see it's not just a fad, you'll gain interrest.<br>\nThe sceptics may become less skeptics over time, but you need to let them mature their decisions.<br>\nThis is  my experience with decades of technology adoptions behind me.</p>",
        "id": 554044810,
        "sender_full_name": "Alfredo Moreira-Rosa",
        "timestamp": 1762422740
    },
    {
        "content": "<p>Governance of open source projects is an interesting topic, and answers are usually complex. Some projects adopt a \"BDFL\" (i.e., one person with final decision authority on all questions). Other projects try for a more distributed model, with e.g. a core team making final decisions --- and often creating sub-teams for particular areas. Such projects include the Rust compiler and mathlib.</p>\n<p>In the case of mathlib, the maintainers kind of have the final say --- but there are subteams on e.g. moderation issues, CI details, and the reviewers group also helps to spread the work. The maintainers are a large group (around 30 people), and deciding in such groups can be interesting. We're aiming for consensus - i.e., discuss a question, try to understand each other's point of view and try to find a solution that takes all points and concerns into account.</p>",
        "id": 554066819,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762429052
    },
    {
        "content": "<p>In short:</p>\n<ul>\n<li>there is no one person making all the decisions: while such a model is tempting, I personally believe more distributed models can generate better outcomes (and allow any individual to move on from the project)</li>\n<li>the maintainers team comes close to the \"one group making final decisions\"</li>\n<li>we aim for decisions by consensus, if possible</li>\n</ul>",
        "id": 554067009,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762429117
    },
    {
        "content": "<p>Does that answer your question about governance? If not, can you clarify what you would really like to know?</p>",
        "id": 554067288,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762429196
    },
    {
        "content": "<p>Regarding feasibility: I consider the long list of advanced formalisation projects proof enough that almost any piece of mathematics can be formalised, given enough time and interest. The challenge is not <em>if</em> it is possible, but how <em>ergonomic</em> it is.<br>\nPersonally, I'm sometimes impressed by Lean, and in other places there are still ways to go. Good documentation, finding the right abstraction, more powerful tactics, etc. will all help. This takes work, but it's getting better: we can make it better together!</p>",
        "id": 554067735,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762429333
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"634338\">Michael Rothgang</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554067288\">said</a>:</p>\n<blockquote>\n<p>Does that answer your question about governance? If not, can you clarify what you would really like to know?</p>\n</blockquote>\n<p>Thanks that was helpful, I personally never even thought about that so I just wasn't sure how to answer it. I mostly just said that it should be the same as always: definitions taken and cited from a reputable source and the disagreements would be mostly about implementation.  </p>\n<p>But I guess their underlying question was if there is a disagreement, how is a final decision settled on, and if there was some explicit hierarchy, so now I understand it a lot more.</p>",
        "id": 554069960,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1762430069
    },
    {
        "content": "<p>It is a completely valid criticism that many professors do not have enough time to learn Lean (or it's reasonable to say that it's not a useful time investment). I try to encourage professors to work together with a Master/PhD student: tell them to learn Lean, and then to formalize a result in the area of the professor (and let the student explain Lean to the professor).</p>\n<p>Can Mathlib contain enough math to be useful in research? It currently already does in various areas. Already a few research papers from this decade have been formalized. This is mostly in combinatorics (search for the cap-set problem, polynomial Freiman-Rusza conjecture, exponential improvement in upper bound for Ramsey number, and more), but the Carleson project was a formalization from harmonic analysis (and this announcement from today is relevant: <a class=\"stream-topic\" data-stream-id=\"113486\" href=\"/#narrow/channel/113486-announce/topic/ERC.20grant.3A.20Harmonic.20Analysis.20and.20Lean.20Formalization/with/554060097\">#announce &gt; ERC grant: Harmonic Analysis and Lean Formalization</a>). In other areas (e.g. number theory, differential geometry), the answer is that currently we are far behind the cutting edge research. In that case, you can ask them to come back in 1-5 years (unless they want to help reach the frontier more quickly, of course!).</p>",
        "id": 554078257,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1762432593
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"773147\">Yan Yablonovskiy 🇺🇦</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554016091\">said</a>:</p>\n<blockquote>\n<p>I might not care about some open source software having a bug but if its meant to be for verifying validity of math</p>\n</blockquote>\n<p>I think this sort of misunderstands what a \"bug\" in mathlib looks like.<br>\nIn order of likelihood, I would say the bugs are:</p>\n<ul>\n<li>One of the \"tactics\" fails where it is supposed to succeed. This is annoying, but has no effect on correctness, and forces the user to do things more manually.</li>\n<li>One of the tactics produces a proof that is invalid. This is caught by the Lean kernel, so is not a soundness risk.</li>\n<li>One of the definitions in mathlib is subtly the wrong thing; for instance, perhaps <code>Foo R</code> is the right thing when <code>R</code> is commutative, but is somehow the wrong generalization when <code>R</code> is not. This would usually become obvious while trying to write the proof for the general case.</li>\n<li>Someone inserts a malicious instance to make <code>2 + 2 = 5</code>. This would be very hard to introduce accidentally, and should be caught in review.</li>\n</ul>",
        "id": 554078368,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1762432628
    },
    {
        "content": "<p>Note that \"mathlib thinks X is proved but the proof is invalid\" is not a plausible bug; at worst it's \"mathlib definitely proves <code>X'</code> but I the human misread it as <code>X</code>\".</p>",
        "id": 554078572,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1762432698
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554078572\">said</a>:</p>\n<blockquote>\n<p>Note that \"mathlib thinks X is proved but the proof is invalid\" is not a plausible bug; at worst it's \"mathlib definitely proves <code>X'</code> but I the human misread it as <code>X</code>\".</p>\n</blockquote>\n<p>Yea I basically said you can't prove something that's wrong, but maybe something that isn't as useful as you thought. </p>\n<p><span class=\"user-mention silent\" data-user-id=\"111080\">Floris van Doorn</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554078257\">said</a>:</p>\n<blockquote>\n<p>Can Mathlib contain enough math to be useful in research? It currently already does in various areas. Already a few research papers from this decade have been formalized. </p>\n</blockquote>\n<p>Fair enough,  I think a large concern or point of focus was if its automation/interactivity has the utility to speed up research output in their day to day yet.  I guess it would be more motivating to learn it if it does.</p>",
        "id": 554081300,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1762433562
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"773147\">Yan Yablonovskiy 🇺🇦</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554081300\">said</a>:</p>\n<blockquote>\n<p>Fair enough,  I think a large concern or point of focus was if its automation/interactivity has the utility to speed up research output in their day to day yet.  I guess it would be more motivating to learn it if it does.</p>\n</blockquote>\n<p>I think the initial goal of Lean is not too speed up the research output of professors (but one day it might - especially if combined with AI tools). <br>\nAnother promising application is to verify a difficult proof that is hard to understand, especially if the author has lingering doubts about the correctness, which was the case in the Liquid Tensor Experiment formalization of a key result in condensed mathematics.</p>",
        "id": 554083920,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1762434310
    },
    {
        "content": "<p>Yan, are you aware of <a href=\"https://leanprover-community.github.io/teams.html\">https://leanprover-community.github.io/teams.html</a>? It tries to answer some of those governance questions.</p>",
        "id": 554097131,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1762437716
    },
    {
        "content": "<p>But note it’s not the full picture because there are strong interactions with <a href=\"https://lean-fro.org/\">https://lean-fro.org/</a> and now also with <a href=\"https://mathlib-initiative.org/\">https://mathlib-initiative.org/</a>.</p>",
        "id": 554097350,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1762437767
    },
    {
        "content": "<p>Those two organization have no decision power over Mathlib, but of course we need very close cooperation.</p>",
        "id": 554097484,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1762437798
    },
    {
        "content": "<p>About the motivations, my personal answer is still pretty much <a href=\"https://www.imo.universite-paris-saclay.fr/~patrick.massot/files/exposition/why_formalize.pdf\">https://www.imo.universite-paris-saclay.fr/~patrick.massot/files/exposition/why_formalize.pdf</a></p>",
        "id": 554097637,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1762437835
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"111080\">Floris van Doorn</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554083920\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"773147\">Yan Yablonovskiy 🇺🇦</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554081300\">said</a>:</p>\n<blockquote>\n<p>Fair enough,  I think a large concern or point of focus was if its automation/interactivity has the utility to speed up research output in their day to day yet.  I guess it would be more motivating to learn it if it does.</p>\n</blockquote>\n<p>I think the initial goal of Lean is not too speed up the research output of professors (but one day it might - especially if combined with AI tools). <br>\nAnother promising application is to verify a difficult proof that is hard to understand, especially if the author has lingering doubts about the correctness, which was the case in the Liquid Tensor Experiment formalization of a key result in condensed mathematics.</p>\n</blockquote>\n<p>Someday I'd like to see the classification on finite simple groups in lean, it seems like a quintessential example of a proof which is too large for any one person to check. And of course, there <em>have</em> been gaps found in the past. The scope of such an effort would put FLT to shame though, so maybe it's just wishful thinking.</p>",
        "id": 554171849,
        "sender_full_name": "Ryan Smith",
        "timestamp": 1762456837
    },
    {
        "content": "<p>Perhaps a more achievable goal would be to add the <em>statement</em> to mathlib :)</p>",
        "id": 554175757,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1762458051
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554175757\">said</a>:</p>\n<blockquote>\n<p>Perhaps a more achievable goal would be to add the <em>statement</em> to mathlib :)</p>\n</blockquote>\n<p>This is not at all science fiction. Even the fact that the groups in the list are simple is something we can do in the future. The work of <span class=\"user-mention\" data-user-id=\"130609\">@Antoine Chambert-Loir</span> is in this direction.</p>",
        "id": 554180568,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1762459685
    },
    {
        "content": "<p>(A statement of the CFSG has been written in Lean 3, for the formal abstracts project. Making it self-contained, i.e. proving the necessary theorems to define all the sporadic groups, would be additional effort - but that should be doable and would definitely be worthwhile.)</p>",
        "id": 554202104,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1762468846
    },
    {
        "content": "<p>(My goal is to define the groups that appear in the classification and to prove that they are indeed simple. I'll start with SL, but I wish to do it more geometrically than what is allowed for by mathlib for the moment, hence the recent bunch of PRs to define the special linear group of a module, and transvections. I don't want neither to just prove what I need but also to have the definitions and intermediate results done properly. The second step will by the symplectic groups. The case of orthogonal groups is trickier.)</p>",
        "id": 554206385,
        "sender_full_name": "Antoine Chambert-Loir",
        "timestamp": 1762471108
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"111080\">Floris van Doorn</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554083920\">said</a>:</p>\n<blockquote>\n<p>Another promising application is to verify a difficult proof that is hard to understand, especially if the author has lingering doubts about the correctness, which was the case in the Liquid Tensor Experiment formalization of a key result in condensed mathematics.</p>\n</blockquote>\n<p>I think being sure of a result, can speed up research output in some sense, and the ecosystem already helps collaboration . It is just seems like such a high barrier of entry to people before that potential net speed up,  though retrospectively I should have emphasised that more.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554097131\">said</a>:</p>\n<blockquote>\n<p>Yan, are you aware of <a href=\"https://leanprover-community.github.io/teams.html\">https://leanprover-community.github.io/teams.html</a>? It tries to answer some of those governance questions.</p>\n</blockquote>\n<p>No I wasn't aware of some of those links , and that exposition article is also very helpful, thanks a lot! </p>\n<p>And thank you to everyone else for your responses <span aria-label=\"pray\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"pray\">:pray:</span></p>",
        "id": 554223231,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1762480093
    },
    {
        "content": "<p>Here is a story that indicates why formal math and mathlib is even more important these days. </p>\n<p>In May I was at AIM and working with collaborators on describing the Serre functor for some particular algebro-geometric category (details not important yet). Through a relationship called mirror symmetry, we could transfer the question to symplectic geometry. One of the collaborators mentioned that we could adapt an argument in his paper slightly to describe the Serre functor/bimodule. </p>\n<p>This happens all the time in math. I have an argument where I realize that pieces can slightly tweaked to produce a different, new statement. I see this argument as a trivial modification of the hard work I already did and at best leave the details to the reader. </p>\n<p>I thought it would be a good chance to test GPT 5 Pro on its assistance capabilities. Generating details for something like this would be pretty nice. <a href=\"https://www.matthewrobertballard.com/assets/pdf/gps.pdf\">Here</a> is the result. </p>\n<p>Is this correct or not? If not, what is the error? I'll come back in a couple hours with the answer. </p>\n<p>LLMs are very good at approximating truth and less good at exact truth. At the same time, we are getting more and more Marty McFly moments like <a class=\"message-link\" href=\"/#narrow/channel/219941-Machine-Learning-for-Theorem-Proving/topic/AlphaEvolve/near/554207920\">#Machine Learning for Theorem Proving &gt; AlphaEvolve @ 💬</a> So there is honest insight. </p>\n<p>When the frontier models can generate highly approximated research level mathematics always and deep insight sometimes, are you going to spend all your time wading through the outputs to figure out which is which? Is that what you want to become a serious part of your job as a researcher? </p>\n<p>Much better to leverage a framework where you are assured of correctness and can focus on insight.</p>",
        "id": 554326413,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1762523335
    },
    {
        "content": "<p>I'm not a mathematician and my experience may be useless for those who choose to study mathematics as a focused field in itself. But a few years ago I was pretty shocked to realize that I couldn't even convince myself that addition is commutative. Thanks to formalization (in Lean) I was able to mitigate that source of ignorance in my own reasoning <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>\n<p>I guess this rewarding experience varies in depth, depending on one's level of expertise. For me it was commutativity of addition. For others, it might be something way more relevant.</p>",
        "id": 554340824,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1762526993
    },
    {
        "content": "<blockquote>\n<p>Is this correct or not? If not, what is the error? I'll come back in a couple hours with the answer. </p>\n</blockquote>\n<p>In one interpretation, everything it said was true. The references existed and said what the model claimed they do. </p>\n<p>However, like with problematic human generated proofs, the issue was in what was not said. The Kuo-Li results are not sufficiently general (cotangent bundles only). </p>\n<p>So it got reasonably close but didn't do the job. </p>\n<p>It took 10-15 minutes to generate the response but that time will be down to 10-15 seconds pretty soon. We will be bombarded with convincing but wrong mathematical arguments. I can think of few stronger arguments for investing in trust.</p>",
        "id": 554380982,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1762537305
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306577\">Matthew Ballard</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554380982\">said</a>:</p>\n<blockquote>\n<p>We will be bombarded with convincing but wrong mathematical arguments. I can think of few stronger arguments for investing in trust.</p>\n</blockquote>\n<p>I hope, <a href=\"https://aristotle.harmonic.fun/\">Aristotle</a> will bombard us by verified mathematical proofs. At least, I'm working on it.</p>",
        "id": 554449703,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1762575720
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554175757\">said</a>:</p>\n<blockquote>\n<p>Perhaps a more achievable goal would be to add the <em>statement</em> to mathlib :)</p>\n</blockquote>\n<p>Just defining the monster group, and proving that's a group with given size should be fun <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 554488566,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1762613881
    },
    {
        "content": "<p>I suppose for the right audience, one could try to draw an analogy between error-correcting codes and formalisation where one regards an AI as a noisy communication channel. Without error-correction, modern electronic communication could not work.</p>",
        "id": 554494914,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1762620036
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"952891\">Ryan Smith</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554171849\">said</a>:</p>\n<blockquote>\n<p>Someday I'd like to see the classification on finite simple groups in lean</p>\n</blockquote>\n<p>First, I'd like to see the classification of finite simple groups on paper. The GLS project is in the home stretch but there are still several volumes to go. I asked Ron Solomon earlier this year and he was hesitant to give a prediction, since previous predictions have been wrong, but he's hoping it will be done by the end of 2026.</p>\n<p>If people are serious about formalizing CFSG, then probably the place to start is to formalize the results that the GLS project calls \"background results.\" There are a lot more of these than most people realize, even if we treat Aschbacher-Smith as part of the CFSG rather than a \"background result.\"</p>",
        "id": 554597490,
        "sender_full_name": "Timothy Chow",
        "timestamp": 1762728421
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/channel/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554078368\">said</a>:</p>\n<blockquote>\n<ul>\n<li>One of the definitions in mathlib is subtly the wrong thing</li>\n</ul>\n</blockquote>\n<p>This may not be a big deal now, but I feel sure that it will become a significant issue once mathlib scales up by two or three orders of magnitude. Making sure that a definition means what humans think it means is the one thing that cannot be fully automated.</p>\n<p>Over in the <a href=\"#narrow/channel/270676-lean4/topic/Flyspecking.20Flyspeck/near/553366459\">Flyspecking Flyspeck</a> discussion, I've been learning that upgrades to mathlib routinely break working code. Of course this doesn't mean that anything is \"incorrect\" in a strong sense, but I regard it as an early warning sign of how misunderstandings of what has actually been proved can creep into the corpus.</p>\n<p>Also, missing from your list is that there could be a bug in one of the libraries (e.g., GMP) that Lean trusts. It's still a low-probability event that such a bug could cause a wrong theorem to be proved, but over time, the temptation will grow stronger to add more and more stuff to the trusted code base. For example, highly computational proofs will probably not be fully checkable in the same way that run-of-the-mill proofs can. See <a href=\"#narrow/channel/113488-general/topic/dreams.20of.20big.20projects/near/547451049\">Vasilii Nesterov's comment</a>. I seem to recall seeing a T-shirt that said that everything you had to trust about HOL Light was printed on that T-shirt. That may have been an exaggeration, but as I understand it, nothing remotely resembling such a claim can be made for Lean, and it's only going to get worse in the future.</p>",
        "id": 554599199,
        "sender_full_name": "Timothy Chow",
        "timestamp": 1762730026
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"478409\">Timothy Chow</span> <a href=\"#narrow/stream/113489-new-members/topic/How.20to.20convince.20of.20mathlibs.20utility.3F/near/554599199\">said</a>:</p>\n<blockquote>\n<p>Over in the <a href=\"#narrow/channel/270676-lean4/topic/Flyspecking.20Flyspeck/near/553366459\">Flyspecking Flyspeck</a> discussion, I've been learning that upgrades to mathlib routinely break working code. Of course this doesn't mean that anything is \"incorrect\" in a strong sense, but I regard it as an early warning sign of how misunderstandings of what has actually been proved can creep into the corpus.</p>\n</blockquote>\n<p>This does highlight a risk in overassuming the assurance provided by a formal proof. If your final result is formal there is no possibility of incorrectly combining two previously formalized proofs with incompatible definitions (e.g from different mathlib versions), but this can indeed happen if you attempt to combine these formal proofs in an informal setting.</p>\n<p>Of course, this failure mode is not unique to formal systems.</p>",
        "id": 554602804,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1762733628
    }
]