[
    {
        "content": "<p>How does <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=RCLike.toDecidableEq#doc\">docs#RCLike.toDecidableEq</a> work? I thought RCLike fields would be very not <code>DecidableEq</code></p>",
        "id": 539195051,
        "sender_full_name": "Lawrence Wu (llllvvuu)",
        "timestamp": 1757731986
    },
    {
        "content": "<p>the instances for <code>Real</code> and <code>Complex</code> use the classical decidability</p>",
        "id": 539195593,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1757732453
    },
    {
        "content": "<p>The fact that this instance is here at all is an indication to me that something is surely wrong, but it's been there for ages and I don't hear the analysts complaining about it so if they're happy then that's great</p>",
        "id": 539254301,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1757752405
    },
    {
        "content": "<p>Could it be because some order theory (maybe LinearOrder) has some decidable stuff in it still, so lean doesn't go nuts when you do a case split on x&lt;= y or x&gt;y? And then you have to deal with the fact that you can't always use the classical instance because what if the base is the rationals, so you have to use the instance that typeclass inference finds.</p>",
        "id": 539254355,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1757752454
    },
    {
        "content": "<p>This is by design, we deliberately add non-computable instances for things we know can never be computable</p>",
        "id": 539255016,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1757753022
    },
    {
        "content": "<p>Otherwise users reach for <code>open scoped Classical</code> which will shoot them in the foot at the same time, add a <code>Decidable</code> hypothesis which can never be satisfied, and/or complain on Zulip about how annoying decidable is.</p>",
        "id": 539255147,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1757753135
    },
    {
        "content": "<p>I don't think there are any downsides to having the RCLike / Real / Complex instances, though I guess those aren't immune to Zulip complaints either :)</p>",
        "id": 539255194,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1757753196
    },
    {
        "content": "<p>Yeah I guess this sounds like a good compromise.</p>",
        "id": 539255238,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1757753237
    },
    {
        "content": "<p>I suppose the philosophy is that because lean/mathlib attempts to offer a computable functionality for computable types, this computable stuff becomes embedded in our system. So every concrete type should have exactly one instance of decidable equality, decidable LE if there's an LE etc, otherwise it won't be usable. So presumably the p-adic numbers should have a non-computable DecidableEQ instance for the same reason.</p>",
        "id": 539255555,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1757753552
    }
]