[
    {
        "content": "<p>Hey am new to lean - I've been playing natural number game but lost progress when I cleared my cookies. I just want to play it on my terminal - this would also get me used to having my own dev environment for writing lean. I cloned the repo here <a href=\"https://github.com/ImperialCollegeLondon/natural_number_game/tree/master\">https://github.com/ImperialCollegeLondon/natural_number_game/tree/master</a> but there's a lot of other files for the website. Was wondering if anyone has played without the browser on their machine, and what files were needed and not needed. thanks!</p>",
        "id": 412186148,
        "sender_full_name": "Claire Wang",
        "timestamp": 1704906764
    },
    {
        "content": "<p>That looks like the Lean 3 version of the game. But whether you use Lean 3 or Lean 4 <a href=\"https://github.com/leanprover-community/NNG4\">https://github.com/leanprover-community/NNG4</a>, one issue will be that all of the levels are fully solved in the source code.</p>",
        "id": 412191172,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1704908598
    },
    {
        "content": "<p>would it be of much trouble to have a version of nng that one can clone and play from cli, without solutions in the level code but a separate file of solutions that can be used to test solutions? i also don't mind helping out if it seems worthwhile to do</p>",
        "id": 412192867,
        "sender_full_name": "Claire Wang",
        "timestamp": 1704909318
    },
    {
        "content": "<p>I think the only issue with playing in VS Code is simply that all the solutions are there already, and you'll have to move between words manually by opening files. But if you write some code which just strips out all the proofs in <code>NNG4/Game/Levels/*/*.lean</code>(there is a unique proof in each of those files) then there's no reason you can't just fill in the solutions again, although you will lose all the hints.</p>",
        "id": 412195598,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1704910458
    },
    {
        "content": "<p>It would be nice to have something in GameMaker that autogenerated such a thing. I assume it must have enough of the metadata to do so given it's doing it to generate the web page</p>",
        "id": 412196255,
        "sender_full_name": "Julian Berman",
        "timestamp": 1704910742
    },
    {
        "content": "<p>(But I haven't looked -- I do remember wanting the same thing though when trying to play one of the other games)</p>",
        "id": 412196338,
        "sender_full_name": "Julian Berman",
        "timestamp": 1704910776
    },
    {
        "content": "<p>There are instructions here for running a game locally:<br>\n<a href=\"https://github.com/leanprover-community/lean4game/blob/main/doc/running_locally.md\">https://github.com/leanprover-community/lean4game/blob/main/doc/running_locally.md</a><br>\nI have been doing this on a mac (using the VSCode Dev Containers approach).</p>",
        "id": 412424957,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1705008851
    },
    {
        "content": "<p>Well, maybe that's not what you're looking for--you'd still be playing the game in a browser, but without using the internet.</p>",
        "id": 412426137,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1705009361
    }
]