[
    {
        "content": "<p>Hi, all! I'm just getting started with Lean and trying to work through the \"Mathematics in Lean\" exercises. I've followed the recommended setup instructions, but my Lean infoview seems to always indicate that my imports are out of date and must be rebuilt.</p>\n<p>If I click \"Restart File\" and wait ~2 hours it will finish building and the problem goes away. But if I close and reopen VS Code the problem returns. I've tried using the command \"lake exe cache get\" which seems to complete successfully, but has no effect on the error message. I've tried both running the command from VS Code and then restarting VS Code, and from Git Bash while VS Code is not open and then launching VS Code. In both cases the error persists.</p>\n<p>Any suggestions?</p>",
        "id": 462807607,
        "sender_full_name": "Matthew Bouyack",
        "timestamp": 1723821464
    },
    {
        "content": "<p>The <code>cache get</code> command should fix that. I need to step out, but probably someone can help debug</p>",
        "id": 462816780,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1723824494
    },
    {
        "content": "<p>But you're definitely not expected to build mathlib yourself</p>",
        "id": 462816815,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1723824512
    },
    {
        "content": "<p>sometimes running <code>rm -rf .lake</code> then a fresh <code>lake exe cache get</code> solves some issues. </p>\n<p>Also if you have a branch, tracking the master's head and rebasing your change might be a good idea (I dont know if it is but I do as I dont know how that cache works exactly ...)</p>",
        "id": 462851766,
        "sender_full_name": "Nicolas Rolland",
        "timestamp": 1723839891
    },
    {
        "content": "<p>Thanks! I'll try that the next time I need to restart VS Code or my computer. For now everything seems to be working (after taking the time to do a full local build).</p>",
        "id": 462858503,
        "sender_full_name": "Matthew Bouyack",
        "timestamp": 1723843567
    },
    {
        "content": "<p>I imagine that as long as the version of mathlib doesn't change, you'll be able to keep using the build you have right now (unless you remove <code>.lake</code>)</p>",
        "id": 462859659,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1723844233
    },
    {
        "content": "<p>For me, <code>lake exe cache get</code> usually works like a charm, but sometimes doesn't (then I see lots of rebuilding). In these cases, I often close vs code, ensure all lean processes are stopped, and run <code>lake exe cache get!</code>.<br>\nThis will re-download the entire cache, so use sparingly - but sometimes, having a really big hammer helps.</p>",
        "id": 462863631,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1723846544
    }
]