[
    {
        "content": "<p>When I put <code>import Mathlib.Tactic</code> at the top of <code>Mathlib.Algebra.Order.Field.Basic</code> I am getting errors where virtually all of the files contents are saying <code>'BLAH' has already been declared/aligned</code>.  I haven't been able to figure out why this is causing issues and wondering if there are some files in Mathlib that you just can't use <code>import Mathlib.Tactic</code>?  I suspect it might be some sort of import cycle issue?  If so, how does one verify that this is the case?</p>\n<p>I am on commit <code>ea02b9e2f48c3b5d2d9bd8208f25276ad4af7915</code>.</p>",
        "id": 409044667,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1703033827
    },
    {
        "content": "<p>Indeed I think that in all files in mathlib you can't put <code>import Mathlib.Tactic</code>, with the one exception being <code>Mathlib.lean</code>. The point of that file is to make teaching and writing other projects easier. If there is any tactic which uses ordered fields then it will definitely cause an inport loop.</p>",
        "id": 409047607,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1703034526
    },
    {
        "content": "<p>So how does one get the tactics like <code>rw?</code> and <code>apply?</code> in this file?  Reason I even put <code>import Mathlib.Tactic</code> at the top was because these showed up as <code>unknown tactic</code> when trying to use them.  Usually within Mathlib I have access to the main tactics but I noticed in this file I don't.</p>",
        "id": 409047990,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1703034625
    },
    {
        "content": "<p>You don't want those tactics imported in that file because you can't use those tactics in mathlib files.</p>",
        "id": 409048133,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1703034668
    },
    {
        "content": "<p>Just make a scratch file, import whatever you like there, finish your proofs and then move them into the mathlib file.</p>",
        "id": 409048448,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1703034753
    },
    {
        "content": "<p>You can also import the file defining the tactics.</p>",
        "id": 409048597,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1703034796
    },
    {
        "content": "<p>But you might want to remove the import when you're done, if you do it that way. Right click on the tactic in a scratch file to find out where it's defined.</p>",
        "id": 409048704,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1703034829
    },
    {
        "content": "<p>I am able to access tactics such as <code>apply?</code> in other Mathlib files and was surprised not to see them in this file, which led to the import attempt.  How is it that this file doesn't have <code>apply?</code> but say <code>Mathlib.GroupTheory.PresentedGroup</code> does?  I would suspect that this is set somewhere.</p>",
        "id": 409049868,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1703035143
    },
    {
        "content": "<p>Take a look at <code>Mathlib.Tactic.Common</code>, and the comment <del>at the top</del> near the bottom of it.</p>",
        "id": 409054577,
        "sender_full_name": "Richard Copley",
        "timestamp": 1703036484
    },
    {
        "content": "<p>You can go to a file where a tactic work and Ctrl-click the tactic name.</p>",
        "id": 409069070,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1703039939
    }
]