[
    {
        "content": "<p>When I develop a Lean project that uses mathlib as the background mathematical theory, should I simply <code>import Mathlib</code> or find out which parts of mathlib I need and import only them?  For the latter option, is there an automatic way to find out what I need?</p>",
        "id": 518961900,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1747605283
    },
    {
        "content": "<p>I would strongly recommend the latter: you can use the <code>#min_imports</code> command to find which imports you need. (Put it at the end of the file and replace <code>import Mathlib</code> by what it suggests. Sometimes, imports can be reduced even further, but the output is a reasonable start.)</p>",
        "id": 518962451,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1747605804
    },
    {
        "content": "<p>If you need to add an import to an existing file, you can either decide to split your file anyway, or you temporarily add <code>import Mathlib</code> and use <code>#min_imports</code> again.</p>",
        "id": 518962491,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1747605842
    },
    {
        "content": "<p><code>import Mathlib</code> can be useful for prototyping. But if you intend to polish your code further, I'd minimise imports as one of the steps.</p>",
        "id": 518962584,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1747605940
    },
    {
        "content": "<p>I don't think I'd agree with that; I think until you're contributing to mathlib, precise imports are just going to trip you up.</p>",
        "id": 518963076,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1747606386
    },
    {
        "content": "<p>Advantages of <code>import Mathlib</code>:</p>\n<ul>\n<li>Your imports won't break when you update lean; <code>Mathlib.Foo</code> moves to <code>Mathlib.Bar</code> all the time, but the top level import never changes</li>\n<li>The theorem / instance / tactic extension you need is guaranteed to be imported, making tactics like <code>simp</code> and <code>norm_num</code> more powerful.</li>\n</ul>",
        "id": 518963170,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1747606458
    },
    {
        "content": "<p>Disadvantages of <code>import Mathlib</code>:</p>\n<ul>\n<li><code>exact?</code> is slower (it is seaching more things)</li>\n<li>You might run into notation clashes that mathlib developers had never noticed. If this happens, report them and we'll try to fix them!</li>\n</ul>",
        "id": 518963217,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1747606510
    },
    {
        "content": "<p>Another disadvantage: it will take longer to start processing your own code</p>",
        "id": 518965870,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1747609143
    },
    {
        "content": "<p>On a fast system that should only be a few seconds though</p>",
        "id": 518970408,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1747613485
    },
    {
        "content": "<p>Another advantage: if you follow the naming convention then you are less likely to write a theorem or definition which is already there. And whilst <code>exact?</code> is slower, it's also better. </p>\n<p>A disadvantage if you're using the blueprint software: the more mathlib you import the longer Ci takes. In fact in practice the CI timing bottleneck for blueprint projects in my experience is the large amount of time it takes to create the essentially unused bespoke mathlib docs which go with it.</p>",
        "id": 518989263,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747627469
    },
    {
        "content": "<p>Counterpoint to one advantage: with module deprecations, renaming files should give you nice warnings that you can patch easily. (You have to still do it, though.)</p>",
        "id": 519012412,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1747638297
    },
    {
        "content": "<p>Another disadvantage (only applies for people with slow internet): If you import only a small part of Mathlib, it is sometimes faster to just build that part than to download the entire cache after updating Mathlib.</p>",
        "id": 519017962,
        "sender_full_name": "Christian Krause",
        "timestamp": 1747639897
    },
    {
        "content": "<p>This looks like, unless you are running on a slow computer, importing the whole of Mathlib is better at least while working on the code. At last, something I'm doing right!</p>",
        "id": 519019875,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1747640365
    },
    {
        "content": "<p>I tried <code>import Mathlib</code> on one of my Lean files.  \"Restart File\" does take longer, perhaps by 5 or 6 seconds.  Since that doesn't seem excessive, I'll give it a try.  I'm using an M1 MacBook Air with 16GB of memory.</p>",
        "id": 519189445,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1747678927
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113489-new-members/topic/Importing.20mathlib.20vs.20importing.20part.20of.20mathlib/near/518989263\">said</a>:</p>\n<blockquote>\n<p>the CI timing bottleneck for blueprint projects in my experience is the large amount of time it takes to create the essentially unused bespoke mathlib docs which go with it.</p>\n</blockquote>\n<p>Use of GitHub caching makes this not relevant, you can cache all the generated mathlib docs.</p>",
        "id": 519198991,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1747681573
    },
    {
        "content": "<p>LeanAPAP has a compatible setup for this I believe; or at least, I successfully derived a working one from it</p>",
        "id": 519199115,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1747681614
    },
    {
        "content": "<p>The only real lag is when I bump mathlib, which we're doing quite a bit in FLT</p>",
        "id": 519223093,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747688450
    },
    {
        "content": "<p>Indeed you're out of luck there unless we start globally publishing a docs cache!</p>",
        "id": 519230469,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1747690876
    }
]