[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"902878\">Zack Weinberg</span> <a href=\"#narrow/channel/113489-new-members/topic/Beginner.20question.3A.20proofs.20involving.20Nat-.3EInt.20conversions/near/516740062\">said</a>:</p>\n<blockquote>\n<p>Any/all advice would be appreciated, <em>except</em> please don't tell me I should use mathlib, because I <em>can't</em> use mathlib, because of <a href=\"https://github.com/leanprover-community/ProofWidgets4/pull/115\">ProofWidgets4#115</a>.</p>\n</blockquote>\n<p>I think you should use mathlib :). By which I mean, I think you should ask for help with the issue you linked, because it sounds like an issue with your installation not with proofwidgets</p>",
        "id": 516743846,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1746643104
    },
    {
        "content": "<p>You should not be using your distro's version of Lean. This causes no end of problems. You might not like this but that's a fact. Lean's ecosystem is not suitable for installation via a distro. Lean updates several times a month; mathlib updates several times a day. Distros simply cannot keep up. <code>elan</code>, Lean's package manager, solves this problem. Your distro's package manager does not. Different Lean packages use different versions of Lean and of mathlib and your local ecosystem needs something which can install an arbitrary lean/mathlib combination at any point. <code>elan</code> is that thing. A fixed binary coming from a distro is the exact opposite of this, so you cannot get anyone else's code working (e.g. proofwidgets in your case). Note everyone else's response to your issue -- \"it's working fine for me\".</p>",
        "id": 516772195,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1746654962
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"674423\">@jthulhu</span> you were recently asking for examples of problems caused by distributing Lean via a distro's package manager. See <a href=\"https://github.com/leanprover-community/ProofWidgets4/issues/115\">https://github.com/leanprover-community/ProofWidgets4/issues/115</a> and the above thread (someone failing to do something basic because they have given up getting the maths library working and are now in even worse trouble trying to work around this) because they installed Lean via a distro. You are contributing to this mess.</p>",
        "id": 516772617,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1746655139
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"902878\">@Zack Weinberg</span> I would be interested to know which distro is shipping a Lean package which has caused you all these problems. I would also recommend that you pointed whoever uploaded that package oto your distro, to this thread.</p>",
        "id": 516772926,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1746655270
    },
    {
        "content": "<p>One day the ecosystem will settle down, but that day is not today.</p>",
        "id": 516773295,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1746655449
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113489-new-members/topic/Beginner.20question.3A.20proofs.20involving.20Nat-.3EInt.20conversions/near/516772617\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"674423\">jthulhu</span> you were recently asking for examples of problems caused by distributing Lean via a distro's package manager. See <a href=\"https://github.com/leanprover-community/ProofWidgets4/issues/115\">https://github.com/leanprover-community/ProofWidgets4/issues/115</a> and the above thread (someone failing to do something basic because they have given up getting the maths library working and are now in even worse trouble trying to work around this) because they installed Lean via a distro. You are contributing to this mess.</p>\n</blockquote>\n<p>I get the frustration, but distro packaging isn’t the problem — it’s a normal and reasonable way people install software on Linux. Blaming users for using their system package manager doesn’t help. If Lean builds from distros break mathlib or Lake, maybe we should detect that at build or runtime (e.g., via a <code>LEAN_FROM_DISTRO</code> flag) and give users a clearer message. People won’t stop asking for distro packages — and they shouldn’t. Let’s focus on making the failure mode better instead of shaming users for trusting their systems. </p>\n<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113489-new-members/topic/Beginner.20question.3A.20proofs.20involving.20Nat-.3EInt.20conversions/near/516772926\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"902878\">Zack Weinberg</span> I would be interested to know which distro is shipping a Lean package which has caused you all these problems. I would also recommend that you pointed whoever uploaded that package oto your distro, to this thread.</p>\n</blockquote>\n<p>Well, from what I usually see from Zack, it's most likely NixOS where we ship multiple versions of Lean in-tree. There's usecases for NixOS users where <code>elan</code> doesn't work and will not work.</p>",
        "id": 516843603,
        "sender_full_name": "Ryan Lahfa",
        "timestamp": 1746694303
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"262143\">Ryan Lahfa</span> <a href=\"#narrow/channel/113489-new-members/topic/Beginner.20question.3A.20proofs.20involving.20Nat-.3EInt.20conversions/near/516843603\">said</a>:</p>\n<blockquote>\n<p>If Lean builds from distros break mathlib or Lake, maybe we should detect that at build or runtime (e.g., via a <code>LEAN_FROM_DISTRO</code> flag) and give users a clearer message. People won’t stop asking for distro packages — and they shouldn’t. Let’s focus on making the failure mode better instead of shaming users for trusting their systems.</p>\n</blockquote>\n<p>I don't blame the users, I blame the distros and package maintainers that ignore the community here and package lean despite explicit instructions not to do so for the distro, resulting in problems that we have to clean up later</p>",
        "id": 516902168,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1746712559
    },
    {
        "content": "<p>Having heard from the packagers in other threads, I'm now wondering if there is a middle ground which is not \"tell the distros to not do this\" and is closer to \"tell the distros to do it properly\".</p>",
        "id": 516923972,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1746718153
    },
    {
        "content": "<p>The \"do it properly\" is essentially to offer packaging <code>elan</code>, and some do (e.g. homebrew), but the middle disappears once the discussion turns to packaging a fixed Lean version. Personally I understand Lean's viewpoint but as a user I very much appreciate distros fighting the good fight here a bit. Ultimately as a user, I <em>do</em> personally want my installs going via my package manager, not a language specific package manager. And I do not see distros in general listening to us (now the Lean community) saying \"don't package this\" -- this was the experience with Homebrew as well where they were happy to package elan but not happy to <em>not</em> package <code>lean</code>. And yes this creates burden on languages (and their communities) which want to manage the installation and user experience themselves, Lean not being the first to have these kinds of issues, and yes it creates extra work and frustration on all sides when new users run into issues. I blame no one in the equation, but I don't think it's realistic that distros will <em>stop</em> packaging fixed versions, part of their job is to be a trust root for users who do not want to trust each communities' build processes or peculiarities. In the long run I think as the language stabilizes everyone gets less frustrated.</p>",
        "id": 516927881,
        "sender_full_name": "Julian Berman",
        "timestamp": 1746719175
    },
    {
        "content": "<p>Maybe the first step here is that <code>info: no Elan detected; you will need to manually restart Lake</code> should just be an error if <code>lean --version</code> doesn't match the toolchain version</p>",
        "id": 516928260,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1746719289
    },
    {
        "content": "<p>In this case I'm actually using Gentoo, and it looks to me like nobody has been bothered to update their packaging of Lean in Quite Some Time.  They have lean 4.11 and 4.14 and nothing newer, and no packages of either mathlib or elan.  I switched to installing via elan and, indeed, i can install mathlib into a project now.</p>\n<p>However, I feel that I should not have had to do that. Actually I'd like to make a much stronger statement:  Ultimately, what I'm trying to do with Lean is to prove the equivalence of two functions (taken from a more conventional programming language, but both are proper mathematical functions).  The pencil-and-paper proof requires nothing more than grade-school algebra on inequalities.  IMNSHO, for a short proof that you could assign as homework in grade school algebra I shouldn't need mathlib, I shouldn't need an \"up to date\" version of Lean, and, last but not least, I shouldn't need anything like a \"project\".</p>\n<p>In my ideal world I would ship <code>my_function_equivalence.lean</code> next to <code>my_function_both_versions.c</code>, <em>without any further ceremony than that</em>, and whoever receives a copy should be able to run <code>lean my_function_equivalence.lean</code>, again no more ceremony than that, using <em>whatever version of Lean 4 they happen to have</em>, to confirm that the proof within was valid.</p>",
        "id": 517164441,
        "sender_full_name": "Zack Weinberg",
        "timestamp": 1746814173
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"902878\">Zack Weinberg</span> <a href=\"#narrow/channel/113489-new-members/topic/Beginner.20question.3A.20proofs.20involving.20Nat-.3EInt.20conversions/near/517164441\">said</a>:</p>\n<blockquote>\n<p>using <em>whatever version of Lean 4 they happen to have</em>,</p>\n</blockquote>\n<p>Lean doesn't have nearly strong enough backwards compatibility guarantees for this to work, nor is having them a priority at this point in its life.</p>",
        "id": 517166402,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1746815009
    },
    {
        "content": "<p>12 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"113489\" href=\"/#narrow/channel/113489-new-members/topic/Beginner.20question.3A.20proofs.20involving.20Nat-.3EInt.20conversions/with/516740062\">#new members &gt; Beginner question: proofs involving Nat-&gt;Int conversions</a> by <span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span>.</p>",
        "id": 517166634,
        "sender_full_name": "Notification Bot",
        "timestamp": 1746815100
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"902878\">Zack Weinberg</span> <a href=\"#narrow/channel/113489-new-members/topic/Installing.20lean.20from.20a.20linux.20distro/near/517164441\">said</a>:</p>\n<blockquote>\n<p>IMNSHO, for a short proof that you could assign as homework in grade school algebra I shouldn't need mathlib</p>\n</blockquote>\n<p>I think the rational numbers are part of most grade school algebra, but <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Rat#doc\">docs#Rat</a> is not part of Lean itself</p>",
        "id": 517166875,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1746815186
    }
]