[
    {
        "content": "<p>Hi all, just wanted to introduce myself. James Usevitch, Assistant professor at BYU, background is in control theory and autonomous systems. Myself and one of my graduate students are interested in how Lean / Mathlib can be used to formalize theoretical results underpinning control theory, dynamical systems, and robotics.</p>\n<p>What efforts are currently underway to apply or extend Mathlib to these areas? There seems to be a few components related to ODEs for <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Analysis/ODE/Gronwall.html\">Grönwall's inequality</a>, <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Analysis/ODE/PicardLindelof.html\">Lipschitz continuity, and the Picard-Lindelöf theorem</a>. There also appears to be a conversation from a few months back about <a href=\"#narrow/channel/287929-mathlib4/topic/.E2.9C.94.20Lyapunov's.20second.20method.20for.20stability.20formalization\">formalizing Lyapunov stability</a>, although it's unclear what came from that.</p>",
        "id": 483081896,
        "sender_full_name": "James Usevitch",
        "timestamp": 1731951326
    },
    {
        "content": "<p>A <a href=\"#narrow/channel/113488-general/topic/Control.20theory.20for.20LTI.20systems/near/343697476\">slightly older thread</a> that might be of interest</p>",
        "id": 483083543,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1731951805
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"310045\">@Eric Wieser</span> Thanks for the link--that was helpful to read. Are you aware of whether any organized efforts came from this? It sounded like you had interest in this direction at the time.</p>",
        "id": 483113484,
        "sender_full_name": "James Usevitch",
        "timestamp": 1731960520
    },
    {
        "content": "<p>I was never involved in any further organization, nor do I have much time to pursue the direction; but I remain interested!</p>",
        "id": 483119348,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1731962523
    }
]