[
    {
        "content": "<p>I should've probably done this before necro'ing a two-year old thread, but better late than never.<br>\nI'm Tom (he/him) and working as a research associate (if there are any fellow Wissenschaftliche Mitarbeiter around, please help me find a good translation – I seem to have introduced myself wrongly for quite some time) at the Theoretical CS deparment at the University of Potsdam, Germany. I've been interested in using proof assistants for teaching and was infected with Lean last summer at the Proof Assistants for Teaching summer school in France. I would be very excited to be able to contribute something to this community and was wondering if, when I have a suggestion for a question in mind, I should just blurt it out or leave it to the pros. I've been unable to find an etiquette guide upon a cursory search, so any pointers would be appreciated as well. :)</p>",
        "id": 435246855,
        "sender_full_name": "Tom Kranz",
        "timestamp": 1713982313
    },
    {
        "content": "<p>Blurt it out! We have a <code>good-first-issue</code> label on the mathlib repo: <a href=\"https://github.com/leanprover-community/mathlib4/labels/good%20first%20issue\">https://github.com/leanprover-community/mathlib4/labels/good%20first%20issue</a>. Feel free to pick up anything from there</p>",
        "id": 435247351,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1713982468
    },
    {
        "content": "<p>... and here are a few more on the old repo: <a href=\"https://github.com/leanprover-community/mathlib/labels/good-first-project\">https://github.com/leanprover-community/mathlib/labels/good-first-project</a></p>",
        "id": 435247451,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1713982503
    },
    {
        "content": "<p>Great, I've added my two cents to a Zulip thread now – exciting stuff! The Turing machine composition looks enticing, but I think I'll stick to the Regular expression equivalence and really dig into what y'all have done before, first.</p>",
        "id": 435250437,
        "sender_full_name": "Tom Kranz",
        "timestamp": 1713983586
    },
    {
        "content": "<p>Oh and maybe on my background: I've helped with teaching <em>Intro to automata theory and formal languages</em> for five years now (eight if you count my assistant time) and have dabbled in institutions (describing the mappings between logics) for my Master's thesis. Not really any research experience, though.</p>",
        "id": 435251417,
        "sender_full_name": "Tom Kranz",
        "timestamp": 1713983983
    }
]