[
    {
        "content": "<p>Hi everyone!</p>\n<p>My name is Wolfgang Schmaltz. I am a researcher in sympletic geometry, polyfold theory, and Gromov-Witten theory.</p>\n<p>To tell you all a bit about my mathematical background...</p>\n<p>To varying degrees, sympletic geometry has had issues with the rigor in its foundations (you could check <a href=\"https://www.quantamagazine.org/the-fight-to-fix-symplectic-geometry-20170209/\">this article</a> for a general overview of one such situation).</p>\n<p>I became interested in polyfold theory, developed by Hofer, Wysocki, and Zehnder. It was designed to give a firm foundation to the study of J-holomorphic curve moduli spaces and to give well-defined invariants of symplectic manifolds. I used polyfold theory to give a complete proof of the Gromov-Witten axioms (see <a href=\"https://wolfgangschmaltz.com/mathematics.html\">here</a> for an overview of my research).</p>\n<p>Given my interest in rigorous mathematics, it has been very interesting to start learning about and using lean! I am especially impressed with the technical groundwork and tooling which make it possible to get real time feedback on the proof writing process. I am also impressed by the community adoption and support in developing mathlib.</p>\n<p>Kudos to everyone involved :)</p>",
        "id": 571550956,
        "sender_full_name": "Wolfgang Schmaltz",
        "timestamp": 1770079062
    },
    {
        "content": "<p>Hi and welcome! As a (former?) symplectic geometer myself (did my PhD with Chris Wendl, and moved to Bonn for a postdoc in formalisation), I'm extremely happy to see more people interested in both symplectic geometry and formalisation. There are many things to do in symplectic geometry, so more help is certainly welcome.</p>\n<p>I have been loosely following your polyfold work for a while, getting towards the point where we could even state some of this in Lean will take a while, but would be a great milestone. My personal medium-term target is defining J-holomorphic curves and perhaps a basic results such as Gromov's non-squeezing theorem, with everything this includes.</p>",
        "id": 571781342,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1770159110
    },
    {
        "content": "<p>Differential geometry in mathlib is at an interesting point, where many exciting developments are <em>just</em> around the corner, but not included in mathlib yet. I hope this will change a bit in the next few months. In the mean-time, I'm always happy to brainstorm ideas for useful targets towards symplectic geometry.</p>",
        "id": 571781577,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1770159195
    }
]