[
    {
        "content": "<p>Hey there! I'm currently at the Odyssey conference on theoretical AI alignment, and had a good conversation about Lean with <span class=\"user-mention\" data-user-id=\"337670\">@Alok Singh</span>. My background is in symplectic geometry - I just finished my PhD in May at USC (now I work at MATS, an AI safety mentorship program). I first joined this zulip 2 or 3 years ago, when I thought I might have time to contribute to symplectic geometry in Mathlib. Unfortunately, I didn't end up making any contributions. I just wanted to reach out and see if now is the time to jump in. Is anybody here thinking about symplectic stuff?</p>",
        "id": 536861108,
        "sender_full_name": "Jonathan Michala",
        "timestamp": 1756501123
    },
    {
        "content": "<p>Hi and welcome! I'm a symplectic geometer by training; I completed my PhD (about equivariant pseudo-holomorphic curves) last September. Now, I'm a postdoc and have the privilege to work on mathlib. My dream and medium-term goal is to formalise the foundations of symplectic geometry: we'll get there, but there remains some work to do.</p>",
        "id": 536863007,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756502152
    },
    {
        "content": "<p>As far as I know we still don't have the definition of symplectic manifold? Do we even have a definition of 2-form??</p>",
        "id": 536863035,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1756502170
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> also has a background in symplectic geometry (he might say differential topology)</p>",
        "id": 536863058,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756502187
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> wrote a sneaky definition of symplectic manifolds: it's not mathlib-ready yet, but the pieces are slowly lining up. If you allow slight cheating, you can write the definition of 2-form today.</p>",
        "id": 536863135,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756502240
    },
    {
        "content": "<p>The proper way is to define n-forms, which Sam Lindauer has been working on (with lots of help by Yury Kudryshov and advised by Johan Commelin). They made a lot of progress (<a href=\"https://github.com/urkud/DeRhamCohomology\">https://github.com/urkud/DeRhamCohomology</a>), but there's also quite a bit of work remaining --- and all of this needs to get merged into mathlib.</p>",
        "id": 536863214,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756502298
    },
    {
        "content": "<p>This recent message of mine <a class=\"message-link\" href=\"/#narrow/channel/113489-new-members/topic/Bennett.20Chow/near/533436314\">#new members &gt; Bennett Chow @ 💬</a> has the current state of differential geometry in mathlib: there is a lot already present, and lots of opportunities to contribute further.</p>",
        "id": 536863573,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756502561
    },
    {
        "content": "<p>In short: I'm always very happy about new faces who are interested in differential geometry. If you have questions about doing that in Lean, don't hesitate to ask! And if you're looking for some project, but need an idea, I have more project ideas than time - so am happy to suggest something (or to collaborate on a project, which is usually more fun than doing things alone)!</p>",
        "id": 536863726,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756502690
    },
    {
        "content": "<p>One symplectic project that could be fun would be to define almost complex structures, and formalise Sévennec's proof that the space of tame almost complex structures is contractible. (It's probably easiest to restrict to tame ones, and over a single point, i.e. on a vector space --- one difficulty at a time.)<br>\nYou probably need to define the weak topology on C^k maps between manifolds, though --- I believe mathlib has the compact-open topology (for continuous maps), but nothing for higher smoothness.</p>",
        "id": 536864015,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756502919
    },
    {
        "content": "<p>Thanks for the reply <span class=\"user-mention\" data-user-id=\"634338\">@Michael Rothgang</span> ! Would be great to chat more at some point. I'll take a look at the n-form github and the Bennett Chow thread. The almost complex structure project sounds cool!</p>",
        "id": 536882215,
        "sender_full_name": "Jonathan Michala",
        "timestamp": 1756521197
    }
]