[
    {
        "content": "<p>Hello,</p>\n<p>I'm a PhD student at Rice University studying arithmetic geometry. I don't expect to be doing much formalization as part of my graduate research, but I am interested in making some contributions in my spare time. I am most of the way through the Mathematics in Lean book, and also have some experience with Coq and Haskell.</p>\n<p>Has there been any work done on formalizing the Lindemann-Weierstrass theorem, either inside or outside of mathlib? The mathlib website claims that it has not been formalized yet. If it hasn't, I was considering  formalizing the proof given in Jacobson's Basic Algebra I.</p>",
        "id": 379312916,
        "sender_full_name": "Isaiah Mindich",
        "timestamp": 1690495921
    },
    {
        "content": "<p>No this has not been done yet in Lean, although it was done in Coq a few years ago <a href=\"https://link.springer.com/chapter/10.1007/978-3-319-66107-0_5\">https://link.springer.com/chapter/10.1007/978-3-319-66107-0_5</a> and was also done in Isabelle/HOL very recently <a href=\"https://www.isa-afp.org/browser_info/current/AFP/Hermite_Lindemann/document.pdf\">https://www.isa-afp.org/browser_info/current/AFP/Hermite_Lindemann/document.pdf</a> . </p>\n<p>If you are interested in arithmetic geometry, why not formalise some arithmetic geometry instead? Nothing has been done before in any theorem prover other than what we have (basic Hartshorne ch2 stuff)</p>",
        "id": 379313975,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1690496368
    },
    {
        "content": "<p>On the other hand, we have all the prerequisites for L-W (multivariable polynomials, complex analysis) so it's certainly a feasible project.</p>",
        "id": 379316011,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1690497370
    },
    {
        "content": "<p>That's a good point about arithmetic geometry. I was thinking of the Lindemann-Weierstrass theorem mostly because it is a fairly self contained result that, as you mentioned, does not depend on anything that hasn't been formalized yet. But I am also certainly interested in the ongoing effort to formalize scheme theory. My main concern is that my time is limited and I don't want to block somebody else's work.</p>",
        "id": 379316128,
        "sender_full_name": "Isaiah Mindich",
        "timestamp": 1690497438
    },
    {
        "content": "<p>Algebraic geometry is just worked on collaboratively by a bunch of people, this is an open source project and people just come and go, I don't get the impression that people can block other people's work.</p>",
        "id": 379317899,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1690498341
    },
    {
        "content": "<p>The best way to avoid blocking people, while still having people use your work, is to try and split it into small pieces. That way if you disappear half way through, then half your work ends up in mathlib, rather than ending up with a single half-complete PR that gets abandoned.</p>",
        "id": 379319404,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1690499059
    },
    {
        "content": "<p>In that case I'll take a look at the AG stuff in mathlib and see if there's anything I might want to work on. (I still might attempt L-W, as I'm trying to teach myself some transcendental number theory on the side)</p>",
        "id": 379319570,
        "sender_full_name": "Isaiah Mindich",
        "timestamp": 1690499152
    },
    {
        "content": "<p>yeah don't let me discourage you from L-W -- there is plenty to do all over the place and you should do what you think will be most fun :-)</p>",
        "id": 379319890,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1690499298
    },
    {
        "content": "<p>Are the AG versions of dimension and codimension (and basic results about them) formalized? I see that there are very general definitions of Krull dimension, height, etc for preorders, but I didn't see any of that stuff applied to schemes. I also couldn't find anything in Topology, which is where other properties like Noetherianness are.</p>",
        "id": 379322332,
        "sender_full_name": "Isaiah Mindich",
        "timestamp": 1690500669
    },
    {
        "content": "<p>Re L-W, this was mostly done in lean3: <a href=\"#narrow/stream/116395-maths/topic/Lindemann-Weierstrass.20theorem.20almost.20done\">https://leanprover.zulipchat.com/#narrow/stream/116395-maths/topic/Lindemann-Weierstrass.20theorem.20almost.20done</a></p>",
        "id": 379348880,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1690513701
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"636245\">@Isaiah Mindich</span> <span aria-label=\"up\" class=\"emoji emoji-2b06\" role=\"img\" title=\"up\">:up:</span></p>",
        "id": 379357256,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1690518672
    },
    {
        "content": "<p>I'd be happy to port that work if that's helpful. I think there's a missing part about symmetric polynomials</p>",
        "id": 379358901,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1690519871
    },
    {
        "content": "<p>Thanks, but I don't know much free time I'll have once the fall semester starts, so I would not recommend porting it unless you know someone has serious plans to finish it. I'm also still not sure if I want to work on that or something from AG/commutative algebra. It might be interesting to formalize some basic results about dimension (in the \"chains of irreducible closed subsets\" sense). There doesn't seem to be that much related to that in mathlib, and it would give me a chance to learn about how Lean deals with topological spaces.</p>",
        "id": 379371315,
        "sender_full_name": "Isaiah Mindich",
        "timestamp": 1690525388
    },
    {
        "content": "<p>Well, I'd like it to end up in mathlib regardless of whether you'll work on it :)</p>",
        "id": 379372498,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1690525798
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"636245\">Isaiah Mindich</span> <a href=\"#narrow/stream/113489-new-members/topic/Isaiah.20Mindich/near/379322332\">said</a>:</p>\n<blockquote>\n<p>Are the AG versions of dimension and codimension (and basic results about them) formalized? I see that there are very general definitions of Krull dimension, height, etc for preorders, but I didn't see any of that stuff applied to schemes. I also couldn't find anything in Topology, which is where other properties like Noetherianness are.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"382349\">@Calvin Lee</span> and I are working on more specific definitions/theroems about height, dimension, and dimension theory, as well as other odds and ends in commutative algebra. We have this <a href=\"https://jjgarzella.github.io/adjunction-formula-blueprint/index.html\">blueprint</a> outlining what we're doing which is a little... disorganized right now, but there are certainly small-ish self-contained things that can be done, if you're interested don't hesitate to reach out to one of us.</p>",
        "id": 379653026,
        "sender_full_name": "Jack J Garzella",
        "timestamp": 1690585302
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"566592\">@FMLJohn</span> you might want to talk to these people about Krull dimension!</p>",
        "id": 382631426,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1691415276
    }
]