[
    {
        "content": "<p>Hi everyone! <br>\nJust wanna introduce myself and why I'm interested in Lean.<br>\nI am a MSc math student at University Augsburg (Germany). <br>\nI'm new to Lean, but have had some exposure (~20h) to proof assistants &amp; program verification in general before. I hope to use Lean in my master's thesis.</p>\n<p>My thesis topic is in the area of symplectic geometry. Concretely: I use computational and data science methods to form conjectures about on what 4d polytopes Viterbo's conjecture is true and false. There's been a recent simple counterexample (<a href=\"https://arxiv.org/abs/2405.16513\">https://arxiv.org/abs/2405.16513</a> ) after 20y, which inspired this thesis topic.</p>\n<p>Right now I'm looking into how to use Lean to work faster when ensuring that my algorithms are reliable. They've grown in complexity over the last 4 weeks and I spend more time on finding and fixing bugs and logical errors than I'd like. I've long used AI assistants in my work (GPT-5 atm via Codex CLI), for both software development and mathematical reasoning.</p>\n<p>The \"plan\" is to use AI to accelerate the synchronization between  </p>\n<ol>\n<li>high-level research project management  </li>\n<li>human-written sketches of research questions, proofs, algorithms   </li>\n<li>detailed elaboration and specifications that resolve low-level questions  </li>\n<li>formalization of conjectures, theorems and proofs (using Lean)  </li>\n<li>high performance computing in (mixed) Rust/Torch/Python/C++</li>\n</ol>\n<p>I generally had good experiences so far on the software engineering side with using AI assistants for 2&lt;-&gt;3&lt;-&gt;5 workflows. Since GPT-5 I also use them on the math side. The correspondence 3-&gt;5 between a detailed algorithm specification to AI-written code is quite robust and nearly a free action.</p>\n<p>Concretely, GPT-5 and I right now struggle to implement an actually correct algorithm to check Viterbo's conjecture on a given polytope, because it's easy to overlook/gloss over when a lemma isn't stated in a form that's actually true for all relevant cases (for all relevant polytopes), or that an algorithm step does not actually fulfill the requirements of the lemmas we'd like. My guess is that I'd work faster if I got a better fast signal for when the specification of an algorithm isn't sound. Switching from Python to Rust's type system was already useful in a bunch of places here, as GPT-5 works slightly more autonomously in Rust than in Python and could identify bugs/errors in the specification more often.</p>\n<p>My guess therefore is that letting GPT-5 formalize the algorithms in Lean will provide an additional valuable signal, more so than if the formalization happened just on paper without proof assistance + formal verification.<br>\nThe correspondence of Lean to Rust code seems again like a free action, for the same reasons that the correspondence from detailed specifications to Rust code so far was robustly handled by GPT-5.</p>\n<p>Besides working on my thesis, I maintain an active interest and background in other areas of pure math, computational physics, deep learning, technical ASI alignment, anti-ASI governance, and applications of AGI assistants (e.g. in my thesis as mentioned above).</p>\n<p>Thanks to the Lean community by the way for all the great resources when learning Lean! Not sure who precisely has been impactful here, but it is a joy to read the docs, read example code, and use Lean in vscode.</p>",
        "id": 555588269,
        "sender_full_name": "Jörn Stöhler",
        "timestamp": 1763127172
    }
]