[
    {
        "content": "<p>I've been here a while but still feel a little too anonymous; hopefully this will help.</p>\n<p>I'll call myself a \"rogue academic\". A couple of years ago I was a <a href=\"http://www.jalexstark.com\" title=\"http://www.jalexstark.com\">grad student</a> proving theorems about quantum computing. I left because academia is slow. Now I have a job that offers a particularly good package of pay + free time (especially in the WFH era), and I use that to work on Lean stuff. (and also some pure maths and some non-maths science) Despite working in industry, I'm not a very good software engineer <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span> (by the way if you are interested in a job or summer internship, I am excited to get you to interview with my employer)</p>\n<p>I'm generally excited about creating / improving pipelines for young people to get into formalization. Codewars is in my opinion the most exciting thing that's happened here in the past couple of months. (though the improvement of the toolchains is a close second) <span class=\"user-mention\" data-user-id=\"261068\">@ROCKY KAMEN-RUBIO</span> is on my payroll as a \"student\", and I have also made a positive number of private grants to people I've met on this server. I'm thinking about how to teach a class and/or advise some students this summer at <a href=\"https://www.mathcamp.org/\" title=\"https://www.mathcamp.org/\">Mathcamp</a> (a camp for high schoolers with a competitive proof-based entrance exam) I'm involved with. (When I was a student at Mathcamp, <span class=\"user-mention\" data-user-id=\"242660\">@Julian Gilbey</span> got me interested in LaTeX)</p>\n<p>Over the next couple of years, I'm excited to formalize complexity theory in general (a la Arora and Barak) and <a href=\"https://www.scottaaronson.com/blog/?p=4512\" title=\"https://www.scottaaronson.com/blog/?p=4512\">MIP*=RE</a> in particular. In the former, my current narrow goal is to prove lemmas about the <code>is_O</code> relation on runtimes of algorithms. In the latter, my current goal is to clarify the paper proof by characterizing some of its constructions as limits in an appropriate category.</p>",
        "id": 196173971,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1588595680
    },
    {
        "content": "<p>Hey Jalex! Thanks for the introduction! I've seen a lot of posts by you here, but I still learnt something new (-;</p>",
        "id": 196174472,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1588595988
    },
    {
        "content": "<p>For your online mathcamp, you should probably think about improving the natural number game. There is a lot of engineering work to do in this direction.</p>",
        "id": 196176124,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1588597047
    },
    {
        "content": "<p>do we have a concrete list of issues? (maybe they're in the \"lean game maker\" github project?)</p>",
        "id": 196176403,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1588597228
    },
    {
        "content": "<p>I remembered discussing stuff with Kevin, but this is probably not public. Let me search</p>",
        "id": 196176458,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1588597269
    },
    {
        "content": "<p>I think the main issue is: because people kept asking questions, Kevin kept adding written explanations. As a result, the game now contains way too many sentences, especially for young people who want to do things or watch videos but not reading.</p>",
        "id": 196176760,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1588597432
    },
    {
        "content": "<p>Two obvious fixes to try are: add video explanations or use something like <a href=\"http://ninodezign.com/25-free-jquery-plugins-for-doing-guided-tours-through-a-website/\" title=\"http://ninodezign.com/25-free-jquery-plugins-for-doing-guided-tours-through-a-website/\">http://ninodezign.com/25-free-jquery-plugins-for-doing-guided-tours-through-a-website/</a></p>",
        "id": 196176821,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1588597452
    },
    {
        "content": "<p>If you have even more time then you can try to uncouple the game from the browser. It should be easier to write the game once and have people playing it either online or locally. A local version can have full Lean speed (by using a locally installed Lean, not compiled in WebAssembly) and either run in a browser or in a dedicated interface (for instance using my prototype Qt client).</p>",
        "id": 196177073,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1588597584
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/113489-new-members/topic/Jalex.20Stark.20(introduction)/near/196176760\" title=\"#narrow/stream/113489-new-members/topic/Jalex.20Stark.20(introduction)/near/196176760\">said</a>:</p>\n<blockquote>\n<p>I think the main issue is: because people kept asking questions, Kevin kept adding written explanations. As a result, the game now contains way too many sentences, especially for young people who want to do things or watch videos but not reading.</p>\n</blockquote>\n<p>hmm interesting. I think this is not so much a problem with this specific audience (who are generally happy to read textbooks) but definitely seems worthwhile for the broader audience</p>",
        "id": 196177140,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1588597618
    },
    {
        "content": "<p>Currently even if you have a full Lean toolchain installed you still can't enjoy both the interface and the local Lean speed</p>",
        "id": 196177157,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1588597628
    },
    {
        "content": "<p>I think you are already too old to see the issue.</p>",
        "id": 196177192,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1588597648
    }
]