[
    {
        "content": "<p>Hello everyone!</p>\n<p>This is me, Kalle Kytölä <code>:= by refl</code>.</p>\n<p>I consider myself a mathematical physicist --- which could of course mean just about anything... So more specifically I work on certain two-dimensional statistical physics models and related conformal field theories. To a mathematician that might still not be particularly informative, so as a good first approximation what I do is probability theory and representation theory.</p>\n<p>I am not yet a complete beginner at formalization, but I (might) aspire to become one.</p>",
        "id": 232683522,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1617234836
    },
    {
        "content": "<p>I think there's something about this stuff in general, but I specifically got hooked by the Natural Number Game and the super helpful atmosphere here on this Zulip chat.</p>\n<p>Btw, for those fortunate enough to have the <a href=\"http://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game/\">NNG</a> ahead of them --- don't wait, it's amazing! One part of it just completely blew my mind (in a good way). Overall, it is just a really well designed puzzle game, and absolutely impeccably and insightfully narrated! I think it should be nominated for a ... well I don't know if there are prizes in that category, but it is the best natural number game I ever saw. Thank you so much, Kevin Buzzard and Mohammad Pedramfar!</p>\n<p>Looking for a sequel to the NNG, I also did half of <a href=\"https://github.com/ImperialCollegeLondon/formalising-mathematics\">Kevin Buzzard's course</a> so far. I look forward to a few more spare moments to look at the rest of it.</p>\n<p>Inspired by those, I finally did my first own attempts at formalizing something I thought should be sufficiently easy. And well, I was wrong.</p>",
        "id": 232683771,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1617234997
    },
    {
        "content": "<p>(Part of my mathematical background is in topological phases --- e.g. modular tensor categories, fusion categories, etc, so not-so-far from what you do. I'd be really excited to see some more physically-motivated maths coming to Lean!)</p>",
        "id": 232683796,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1617235029
    },
    {
        "content": "<p>Yeah, not that far from the topics!</p>\n<p>I hope to finish some work in the near future about braided tensor category structure of a (certain) category of modules of a generic Virasoro vertex operator algebra (not the rational VOAs of the minimal models, but slightly more badly behaved ones). And a dream would be to formalize something to that direction, but I'll probably start from something else <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span>.</p>\n<p>Still, much of what I do is probability, which is quite different <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>.</p>",
        "id": 232684362,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1617235390
    },
    {
        "content": "<p>Welcome! I was once a condensed matter theorist, and while I never worked with CFTs directly in my research, I did learn enough about them to be fascinated by their \"magic\". I think your research topics are closely related to those of <span class=\"user-mention\" data-user-id=\"242586\">@Vincent Beffara</span>, who was hanging out here a bit (though sadly he hasn't been active in about a year; hopefully this ping is not unwelcome).</p>\n<p>As far as I know, we only have a very small amount of probability theory in mathlib at the moment. Maybe <span class=\"user-mention\" data-user-id=\"350992\">@Rémy Degenne</span>, <span class=\"user-mention\" data-user-id=\"247798\">@Martin Zinkevich</span> and <span class=\"user-mention\" data-user-id=\"111080\">@Floris van Doorn</span> can say a bit about what's there and what's to come?</p>",
        "id": 232686694,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1617237172
    },
    {
        "content": "<p>Is <span class=\"user-mention\" data-user-id=\"242586\">@Vincent Beffara</span> here?!? Wow. Hi!</p>\n<p>Because among the people I imagined might have an interest in trying to formalize similar things, he was actually the first who came to my mind (and he is certainly more competent with computers than I am). But I never talked with him about this yet <span aria-label=\"speechless\" class=\"emoji emoji-1f636\" role=\"img\" title=\"speechless\">:speechless:</span>.</p>\n<p>Thanks for pointing out, superb!</p>",
        "id": 232687057,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1617237426
    }
]