[
    {
        "content": "<p>Hi all,<br>\nI'm a software engineer who'd like to experiment with Lean, eventually as part of a round-trip workflow involving formal specification, automated testing, and LLM-generated code. To begin with, I want to learn some Lean by hand. I have followed the Mathematics in Lean tutorial far enough to have VS Code set up, the tools installed, and have worked through a few examples.</p>\n<p>My target domain is not mathematical in that sense, and I'd like to able to explore Lean under my own power. Thus far I've found only tutorials which assume that I want to contribute to an existing project (in fact: Mathematics in Lean), or am following an academic course where some environment has been made available. I've not found what I'd really like, which is a tutorial or guide to starting a brand new Lean project with the command-line tools. </p>\n<p>Functional Programming in Lean begins \"It is best if you read this book with Lean open in your editor…\" indeed yes. But, how do I get to that point?</p>\n<p>What am I missing?</p>",
        "id": 576289577,
        "sender_full_name": "Keith Braithwaite",
        "timestamp": 1772206465
    },
    {
        "content": "<p><a href=\"https://lean-lang.org/install/\">https://lean-lang.org/install/</a></p>",
        "id": 576291005,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1772206863
    },
    {
        "content": "<p>Thanks, but as I said, that I've done. I've been able to work through some examples in the Mathematics in Lean tutorial.</p>",
        "id": 576291790,
        "sender_full_name": "Keith Braithwaite",
        "timestamp": 1772207063
    },
    {
        "content": "<p>Sorry, I (mis)read too fast.<br>\nTo start a new project, use <code>lake new ...</code></p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>λ lake new --help\nCreate a Lean package in a new directory\n\nUSAGE:\n  lake [+&lt;lean-version&gt;] new &lt;name&gt; [&lt;template&gt;][.&lt;language&gt;]\n\nIf you are using Lake through Elan (which is standard), you can create a\npackage with a specific Lean version via the `+` option.\n\nThe initial configuration and starter files are based on the template:\n\n  std                   library and executable; default\n  exe                   executable only\n  lib                   library only\n  math-lax              library only with a Mathlib dependency\n  math                  library with Mathlib standards for linting and workflows\n\nTemplates can be suffixed with `.lean` or `.toml` to produce a Lean or TOML\nversion of the configuration file, respectively. The default is TOML.\n</code></pre></div>",
        "id": 576292636,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1772207269
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 576292989,
        "sender_full_name": "Keith Braithwaite",
        "timestamp": 1772207358
    },
    {
        "content": "<p>And if I do that and put <code>#eval 1+2</code> in a file as per Functional Programming's exercise 1.1 and the info view in VS Code says</p>\n<blockquote>\n<p>error: workspace directory not found: .</p>\n</blockquote>\n<p>what do I do to fix that?</p>",
        "id": 576296711,
        "sender_full_name": "Keith Braithwaite",
        "timestamp": 1772208266
    },
    {
        "content": "<p>Did you \"open folder\" in VS Code and open the root directory of the repository (with the <code>lakefile.toml</code> etc files in)?</p>",
        "id": 576297023,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1772208352
    },
    {
        "content": "<p>Ah, no, I did not. VS Code noticed the new folder and opened it itself. I see that manually opening it has some side-effects.</p>",
        "id": 576297603,
        "sender_full_name": "Keith Braithwaite",
        "timestamp": 1772208505
    },
    {
        "content": "<p>OK, looks as if I'm in business! Thanks both.</p>",
        "id": 576298039,
        "sender_full_name": "Keith Braithwaite",
        "timestamp": 1772208618
    }
]