[
    {
        "content": "<p>The description of this area says to introduce oneself with a thread that has my name as the topic name. I am very new to Zulip, so I am not sure, but I don't see this type of thread at all when scrolling through the threads in \"new members\". Is this still correct to do?</p>",
        "id": 544679545,
        "sender_full_name": "Keith J. Bauer",
        "timestamp": 1760427711
    },
    {
        "content": "<p>It is fine. Can you tell us more about yourself?What sort of formalization questions interest you?</p>",
        "id": 544681444,
        "sender_full_name": "Scott Carnahan",
        "timestamp": 1760428329
    },
    {
        "content": "<p>Hey Keith! <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span></p>",
        "id": 544686256,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1760429849
    },
    {
        "content": "<p>Hi Keith <span aria-label=\"octopus\" class=\"emoji emoji-1f419\" role=\"img\" title=\"octopus\">:octopus:</span></p>",
        "id": 544689046,
        "sender_full_name": "Rida Hamadani",
        "timestamp": 1760430720
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"630477\">Scott Carnahan</span> <a href=\"#narrow/channel/113489-new-members/topic/Keith.20J.2E.20Bauer/near/544681444\">said</a>:</p>\n<blockquote>\n<p>It is fine. Can you tell us more about yourself?What sort of formalization questions interest you?</p>\n</blockquote>\n<p>Hi Scott. I'm an undergraduate student at University of California, Irvine. I'm currently interested in contributing to Lean's database of theorems. I have yet to look too much into the process of contributing because I am still somewhat new to Lean; to practice, I have been coming up with small theorems to practice formalizing. (i.e. I have practiced using Lean by proving that every commutative monoid induces its divisibility preorder, or that lex order on N^N is a linear order, etc.; nothing new mathematically nor to Lean (I assume) but good practice nonetheless.)</p>\n<p>I'm currently working with Professor Isaac Goldbring, who has written a book on ultrafilters, so one thing I am interested in is what has been done with ultrafilters in Lean so far. Based on skimming mathlib, it seems basic things like their uses in topology and Los theorem are implemented, but I'm not sure how to find a comprehensive list of what has been done and what would be desired. Something Goldbring suggested to me was to look into whether Feferman-Vaught, the generalization of Los to reduced products, has been formalized yet, or to look into results relating to Ramsey cardinals, although I forget the exact details of the latter.</p>\n<p>Additionally, this may be too ambitious, but I'm interested in what continuous logic has been formalized. (Goldbring is also very invested in continuous logic.) I say it may be too ambitious because if nothing at all has been done in this area, then it may be a lot of work for me to have to contribute even the very basics of something like that. But I don't know what I don't know, which is why I write here, to learn what is reasonable to expect.</p>\n<p>Anyway, I hope to become well-acquainted with the Lean community in the coming months. My ultimate goal is to satisfy a requirement for undergraduate research from my school's honor's program (where I would ultimately write up the results of my efforts after 6 months) but otherwise my goal is to have fun proving cool theorems in Lean and contribute something to the community.</p>",
        "id": 544897445,
        "sender_full_name": "Keith J. Bauer",
        "timestamp": 1760514279
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/channel/113489-new-members/topic/Keith.20J.2E.20Bauer/near/544686256\">said</a>:</p>\n<blockquote>\n<p>Hey Keith! <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span></p>\n</blockquote>\n<p>Hi Yaël, I recognize you from Discord. I recall you mentioned you'd be around if I needed help with Lean, so maybe I will reach out to you on Discord more in that regard.</p>",
        "id": 544897854,
        "sender_full_name": "Keith J. Bauer",
        "timestamp": 1760514420
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"580947\">Rida Hamadani</span> <a href=\"#narrow/channel/113489-new-members/topic/Keith.20J.2E.20Bauer/near/544689046\">said</a>:</p>\n<blockquote>\n<p>Hi Keith <span aria-label=\"octopus\" class=\"emoji emoji-1f419\" role=\"img\" title=\"octopus\">:octopus:</span></p>\n</blockquote>\n<p>Hi Rida, you were the one who ultimately got me interested in Lean, I'm glad to see you here as well. :)</p>",
        "id": 544897918,
        "sender_full_name": "Keith J. Bauer",
        "timestamp": 1760514450
    },
    {
        "content": "<p>Of the projects you've suggested, I think the Feferman-Vaught project is most likely to produce good results in the timeframe you have - I've said more about my recommendations for that on the thread for that topic.</p>",
        "id": 547487619,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1761656519
    },
    {
        "content": "<p>Another thing that you could consider, specifically using ultrafilters, is Arrow's theorem. Someone has formalized Arrow's theorem in Lean before: <a href=\"https://github.com/asouther4/lean-social-choice/\">https://github.com/asouther4/lean-social-choice/</a> , but they didn't use ultrafilters.</p>",
        "id": 547487999,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1761656621
    },
    {
        "content": "<p>I forgot to respond here, but I think I will ultimately pursue Feferman-Vaught. From what you've said, I do agree.</p>",
        "id": 548315172,
        "sender_full_name": "Keith J. Bauer",
        "timestamp": 1762009869
    },
    {
        "content": "<p>I appreciate your detailed feedback.</p>",
        "id": 548315277,
        "sender_full_name": "Keith J. Bauer",
        "timestamp": 1762009961
    }
]