[
    {
        "content": "<p>I'm curious to hear from folks who are learning Lean outside of academia. How did you come about it? What are you learning it for? Does anyone pay you to do it, or is it for fun?</p>\n<p>Not 100% sure if these types of broad questions are on-topic, pardon if not!</p>\n<p>Personally I'm learning it \"for fun\". I know a lot of people with academic background are learning it because it's relevant to their research, which makes sense. But I'm curious to hear more from \"outliers\", like what's drawing you in, do you hope to do it more \"seriously\", etc.</p>\n<p>Thanks!</p>",
        "id": 529182835,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1752710352
    },
    {
        "content": "<p>I am a math enthusiast learning it for fun. I do software engineering for job, and I was intrigued when I learned math can also be done on a computer like programming (and has already grown into a large library). I hope I can do it more seriously, though I still struggle reading a lot of high level stuff, lean code or math itself, so there is still a long way to go</p>",
        "id": 529183880,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1752711117
    },
    {
        "content": "<p>Hello! As a curious programmer I know a lot of cool computer things. Lean is not the first language with dependent types I learned (and I heard about dependent types long long ago), but my familiarity with dependent types was surface-level before I dived deeper.</p>\n<p>I also like cool math and want it to be more accessible. So I hope to continue writing my book (I wish I had more time for it).</p>",
        "id": 529184421,
        "sender_full_name": "suhr",
        "timestamp": 1752711591
    },
    {
        "content": "<p>I first tried Rocq but, being a programmer, I really disliked the syntax. Then I tried Lean and it made a lot of sense to me.</p>\n<p>At first, I just wanted to understand this \"math via types\" thing a colleague I had in college was doing. But the community was transitioning from Lean 3 to Lean 4 and I got to enjoy it as a powerful programming language.</p>\n<p>Nowadays I am paid to program in Lean and Rust, my two preferred languages. We're developing <a href=\"https://github.com/argumentcomputer/ix\">ix</a>.</p>",
        "id": 529184494,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1752711655
    },
    {
        "content": "<p>Heh, a fellow Rust programmer.</p>",
        "id": 529184545,
        "sender_full_name": "suhr",
        "timestamp": 1752711713
    },
    {
        "content": "<p>Oh, I also came from Rust</p>",
        "id": 529184565,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1752711729
    },
    {
        "content": "<p><span aria-label=\"rolling on the floor laughing\" class=\"emoji emoji-1f923\" role=\"img\" title=\"rolling on the floor laughing\">:rolling_on_the_floor_laughing:</span> There must be a secret Rust-&gt;Lean pipeline</p>",
        "id": 529184580,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1752711747
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"926839\">@ralfj</span> said that Rust programmers already know separation logic. So it makes sense that I now occasionally contribute to iris-lean...</p>",
        "id": 529184659,
        "sender_full_name": "suhr",
        "timestamp": 1752711833
    },
    {
        "content": "<p>I'm definitely in the \"fun rather than for work or research\" bucket as well. I initially encountered Lean (like many did) from a video Kevin did a few years ago (actually 5 years ago now!). My interests have mostly revolved around \"hm, I think I'm a good programmer, and I did undergrad math 10+ years ago, that means I can parlay my programming skills back to learn more math via Lean, right? Right??\" (spoiler: mm not so much. Or it's still quite a challenge!) I'd say I've have nearly no interest in it as a programming language as opposed to theorem proving which I'd never encountered elsewhere in my years in the software ecosystem(s). It's still just as fun as always to hang around Everest base camp and every so often try to meander up a path.</p>",
        "id": 529190223,
        "sender_full_name": "Julian Berman",
        "timestamp": 1752717237
    },
    {
        "content": "<p>I'm a software engineer and I've been intrigued by dependent types for a while – but I really got into it when I wanted to experiment with more exotic type systems. Especially when I started to get serious about trying to implement type systems myself. I'm still working on implementing and proving some properties of simpler type systems first. But once that's done I'm hoping to move on to implementing some of my own type system ideas I've had</p>",
        "id": 529245980,
        "sender_full_name": "aron",
        "timestamp": 1752747257
    },
    {
        "content": "<p>I'm a high school student with some programming experience (rust <span aria-label=\"crab\" class=\"emoji emoji-1f980\" role=\"img\" title=\"crab\">:crab:</span>) and I wanted to get a bit into math (by formaliting banach tarski in lean). At first i thought \"I know programming, lean can't be that different/difficult\"  (Spoiler: it was). But in the following two years I learnt a lot about math (especially that i dont know anything) and I enjoy using lean very much. You could say that lean lead me to the decision to study math and physics next winter semester <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span>.</p>",
        "id": 529256189,
        "sender_full_name": "Christian Krause",
        "timestamp": 1752751122
    },
    {
        "content": "<p>I'm a high school student that got into Lean through Haskell, and I had very much fun with it as a game, using it to improve my proof writing. Then I found out I could <em>learn</em> math by reading mathlib, and that was fun too, and I learned a lot. Then I got interested in metaprogramming, so I learned that too. Lean is so much fun!</p>",
        "id": 529264909,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1752754127
    },
    {
        "content": "<p>I went into doing IT for academia after I finished my doctorate (in 2004) - partly because it gave me a way to continue dabbling in mathematics in my spare time. In the early years I managed to co-author a couple of peer reviewed papers, but more recently there hasn't been anyone I check my work with and I haven't got the several weeks of contiguous time it would take me to assemble my notes into a paper. I've always been a fan of LaTeX for typesetting, but also been disappointed that it has no understanding of what I'm writing and will quite happily beautifully typeset complete nonsense.</p>\n<p>I spent about three years trying to get into Isabelle. I'm usually quite happy as an autodidactic, but the learning curve was just too steep, and the documentation required a deeper knowledge of both computer science and mathematical philosophy than I had as a practitioner of IT and maths. </p>\n<p>Then during a sleepless night during the pandemic I started watching the \"Lean for the Curious Mathematician\" videos on you tube and started playing the natural numbers game and found that this was a learning curve I could manage. Mathlib's GitHub PR-based approach to also worked much better for me than trying to write papers.</p>\n<p>For me the attractions of Lean / Mathlib are:</p>\n<ul>\n<li>An independent check that I've not made a silly mathematical mistake</li>\n<li>A better structured way of organising my ideas than writing in notebooks (by now I have about 20 a4-sized handwritten notebooks, with almost no indexing...)</li>\n<li>Easier for a time-constrained person to make small, incremental improvements to a shared body of knowledge over several years</li>\n</ul>\n<p>One unexpected benefit has been that it's caused me to learn about all sorts of mathematical ideas which I hadn't previously been exposed to (lattice ordered groups for example).</p>",
        "id": 529523893,
        "sender_full_name": "Christopher Hoskin",
        "timestamp": 1752871162
    },
    {
        "content": "<p>Thanks Christopher for all this insider information! I assume I have reviewed most of your PRs to mathlib, yet I never knew how you got there</p>",
        "id": 529529398,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1752874760
    },
    {
        "content": "<p>I found Lean through a friend back in a 2021 (who funnily enough also introduced me to Rust). I found a contribution niche within Mathlib and I've happily stuck to it since.</p>",
        "id": 529530873,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1752876024
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/channel/113489-new-members/topic/Lean.20outside.20of.20academia/near/529529398\">said</a>:</p>\n<blockquote>\n<p>Thanks Christopher for all this insider information! I assume I have reviewed most of your PRs to mathlib, yet I never knew how you got there</p>\n</blockquote>\n<p>And I'm very grateful for all the hours of review that you and <span class=\"user-mention\" data-user-id=\"310045\">@Eric Wieser</span>  in particular have given me!</p>",
        "id": 529556287,
        "sender_full_name": "Christopher Hoskin",
        "timestamp": 1752906650
    },
    {
        "content": "<p>I've always liked math and programming. I was trained as mathematician but flunked out of academia after the first post-doc. Luckily, I knew enough programming to get a software eng job and have been doing that for the last 15 years. Playing with Lean gives me a good opportunity to reconnect with the math world that I have left behind (but still have feeling towards), while bringing some of my more recent software experience. Basically, it offers me an integration of the two main things I have spend many hours of my life working on.</p>\n<p>Also, I like playing logic puzzle games, and writing proofs in Lean, tickles my brain the same way as doing logic puzzles, much more than doing the same on pen-and-paper. So not in a particular rush to do \"serious\" instead of \"unserious\" things with it. </p>\n<blockquote>\n<p>Does anyone pay you to do it, or is it for fun?</p>\n</blockquote>\n<p>All fun. If there was money in math, I might have stuck around longer :) . Curious about your experience with real-world engineering, but from what I have seen working in  FAANGs (which is writing code in service of making money) they don't need provably correct software (some caveats in cryptography etc), because that software interacts with the real world and one can't even define \"correct\" to prove it so.</p>",
        "id": 529612725,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1752959364
    },
    {
        "content": "<p>I think one day I stumbled upon a metamath proof and I was blown away that I could browse every proof and every inference down to its definitions and axioms. I think I had the vague idea that formal proofs exist but I didn't know that everything could be explained down to the axioms. That day was very fun as I browsed how certain mathematical theorems/definitions are presented formally. I usually just yoink the proofs here to port them to metamath. However a few ago I started to be way more serious with lean and started digging into the system way deeper.</p>\n<p>The fun thing is is that I learned so much through the side project formalisation. One notable fact, that I previously never even registered is that the universal property of quotients is way nicer than I thought. In prosa it's described as the triangle commutes, which is an unfortunate description as it hides the most important property which is an equality. In general I learned that equality does not get the respect that it deserves. Using metamath/lean made me aware how often we unconsciously use equality.</p>",
        "id": 533643014,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1754822605
    }
]