[
    {
        "content": "<p>Every math lean project I am working on takes 6GB because of mathlib and ~/.elan is 20GB because of old versions of the lean toolchain, that projects might or might not need. So I am slowly running out of diskspace on my M2. How do other folks manage this (other than work on fewer lean math projects)?</p>\n<p>Mathlib will surely grow 2x in 1-2 years, and I am not sure hdd manifacturers can keep up :)</p>",
        "id": 540559730,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1758343604
    },
    {
        "content": "<p>Is there a good reason to set up multiple Lean projects when just playing around? I tend to have things I try to prove, on various largely unrelated topics, and at the moment I just have a single project and any number of unrelated files in there. I don't have particular requirements (if I find out my version of Mathlib is sufficiently out of date that I don't have access to some theorems that I read about in the online documentation, I'll simply update).</p>\n<p>I suppose multiple projects become meaningful if you're collaborating with different people - especially if you're going to contribute to Mathlib - but I'm clearly not there yet; mostly, trying to learn by doing (i.e. exercises that were not set up for me by someone else).</p>",
        "id": 540573779,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1758361769
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"488971\">Rado Kirov</span> <a href=\"#narrow/channel/113489-new-members/topic/lean.20projects.20taking.20a.20lot.20of.20hdd.20space/near/540559730\">said</a>:</p>\n<blockquote>\n<p>Every math lean project I am working on takes 6GB because of mathlib and ~/.elan is 20GB because of old versions of the lean toolchain, that projects might or might not need. So I am slowly running out of diskspace on my M2. How do other folks manage this (other than work on fewer lean math projects)?</p>\n</blockquote>\n<p>You can use <code>elan toolchain gc</code> to gc toolchains that are not used in any project on your machine anymore. Regarding the caches across multiple mathlib projects we hope to bring a solution for shared project caches in the near-ish future.</p>\n<blockquote>\n<p>Mathlib will surely grow 2x in 1-2 years, and I am not sure hdd manifacturers can keep up :)</p>\n</blockquote>\n<p>Terrabyte sized storage (I assume you are actually talking about SSDs and not HDDs here) is quite cheap nowadays, I would imagine mathlib can easily do at least 10x before we run into any issues.</p>",
        "id": 540575373,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1758363818
    },
    {
        "content": "<p>That said, it might be good if we could reduce the sizes a bit</p>",
        "id": 540576106,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1758364649
    },
    {
        "content": "<p>If your disk is using a filesystem that can do deduplication such as btrfs or zfs, you might be able to use that to reduce disk usage of multiple identical copies of mathlib. I haven't tried that out to see if it would work though since I haven't had any problems yet with Lean using too much disk space.</p>",
        "id": 540622002,
        "sender_full_name": "Anthony Wang",
        "timestamp": 1758415342
    },
    {
        "content": "<p>I (a) sometimes delete <code>~/.cache/mathlib</code> and (b) sometimes delete <code>.lake</code> in projects which I am not using regularly</p>",
        "id": 540669798,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1758473689
    }
]