[
    {
        "content": "<p>I hadn't used <code>lake new</code> or <code>lake init</code> in a while; today I made a new to explore some ideas.  It appears that <code>lake</code> v. 5.0.0-6d22e0e automatically puts a CI config file in .github/workflows, causing github to send me a series of emails about failed CI runs.  I contributed to repos that use CI, and it's a good thing for those repos, but I've never set it up myself and know very little about it.  I certainly don't want it for this new repo at this time.</p>\n<p>The last time I used <code>lake new</code> or <code>lake init</code> perhaps it was different version?  Or github has changed its default operation, but the last Lean repo I created before today doesn't have a .github directory.   (I know that github has been telling me about upcoming changes that I didn't understand and didn't care about, as far as I could tell.  Maybe this is one of them.)</p>\n<p>I deleted lean_action_ci.yml from .github/workflows and committed the change.  Is that the right thing to do?  Could that create trouble?  Are there other changes I should make?  Is there an option I should pass to <code>lake</code> to tell it not to set up CI?</p>",
        "id": 487147538,
        "sender_full_name": "mars0i",
        "timestamp": 1733799696
    },
    {
        "content": "<p>I think you can just keep that file and disable the workflow on GitHub.</p>\n<p>To my knowledge, I think that workflow only build the project when push or pull request. If you are contributing to a public project, this would be helpful to let others know your code can compile.</p>",
        "id": 487232994,
        "sender_full_name": "Yicheng Tao",
        "timestamp": 1733832631
    },
    {
        "content": "<p>You may find more information in <a href=\"https://github.com/leanprover/lean-action\">https://github.com/leanprover/lean-action</a>.</p>",
        "id": 487233158,
        "sender_full_name": "Yicheng Tao",
        "timestamp": 1733832690
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"646276\">@Yicheng Tao</span>.  I didn't know anything about workflows or <code>lean-action</code>.  Those pointers are extremely helpful.   I found the github docs page for disabling workflows, but oddly, there are no workflows listed in my repo.  <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span>  Anyway, I can figure out now what I want to do.  (This is for a private, exploratory project, and there's no good reason for me to use CI.)</p>",
        "id": 487323477,
        "sender_full_name": "mars0i",
        "timestamp": 1733857765
    },
    {
        "content": "<p>Ah, the reason there were no workflows was that I'd deleted the <code>lake init</code>-provided .yml file.  Makes sense.  Disabled it.</p>",
        "id": 487324584,
        "sender_full_name": "mars0i",
        "timestamp": 1733858183
    }
]