[
    {
        "content": "<p>Hey everyone, I stumbled upon Lean and was wondering, are many people using it for general programming tasks? I get the feeling most are utilizing it for theorem proving based on the docs but I was thinking about trying it out since it looks like a very interesting language. Any reasons not to give it an attempt? Thanks in advance!</p>",
        "id": 485532852,
        "sender_full_name": "mdioc",
        "timestamp": 1733105015
    },
    {
        "content": "<p>Lean is definitely intended (and does) function as a general purpose programming language. There are plenty of people around who use it as such, although you are correct that there is also a very large theorem proving community too.</p>",
        "id": 485537574,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1733108798
    },
    {
        "content": "<p>I don't think there are currently many people using Lean for general programming tasks. I want to try it in the future.</p>",
        "id": 485540385,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1733111090
    },
    {
        "content": "<p>I think Lean has roughly the same capabilities as Haskell in terms of general purpose programming, except Lean has also the ability to prove properties of your programs. There's definitely a lot of interest in this, but Lean 4 is still very young. Right now, most of the stuff written in Lean is intended to help the theorem proving community, although there's no reason you couldn't write a general purpose program in it. If you are interested in this, I recommend the book <a href=\"https://lean-lang.org/functional_programming_in_lean/\">Functional Programming in Lean 4</a>.</p>\n<p>Some major projects written in Lean itself are:</p>\n<ul>\n<li>The Lean compiler and Lean package manager (<code>lake</code>) itself. Lean is a self-hosting compiler.</li>\n<li><a href=\"https://github.com/leanprover/verso\">Verso</a>, a documentation authoring tool. I don't know much about this, but I think it turns Lean into a literate programming environment.</li>\n<li>A <a href=\"https://github.com/kmill/lean4-raytracer\">ray tracer</a>.</li>\n<li>The tactics used by the theorem proving community are metaprograms written in Lean itself.</li>\n<li>Not sure if you would consider this general purpose, but there is <a href=\"https://github.com/lecopivo/SciLean\">SciLean</a> for scientific computing.</li>\n</ul>",
        "id": 485546902,
        "sender_full_name": "Niels Voss",
        "timestamp": 1733116189
    },
    {
        "content": "<p>Doesn't Amazon use it for Cedar?</p>",
        "id": 485572744,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1733129504
    },
    {
        "content": "<p>Amazon has an implementation of Cedar in Lean but it is used as a target for differential fuzzing against the production version written in Rust. So while indeed fully functional it is not what is used productively.</p>",
        "id": 485573959,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1733129969
    },
    {
        "content": "<p>Excellent, thank you for the input everyone. I think I will give Lean a try on some small tasks and see how it goes.  Verso also looks pretty neat.</p>",
        "id": 485699165,
        "sender_full_name": "mdioc",
        "timestamp": 1733169558
    },
    {
        "content": "<p>In case you're interested, there were a few people doing Advent of Code in Lean last year (<a href=\"#narrow/channel/113488-general/topic/Advent.20of.20Code.3F/near/405279074\">thread</a>)</p>\n<p><a href=\"https://github.com/dupuisf/aoc2023\">https://github.com/dupuisf/aoc2023</a><br>\n<a href=\"https://github.com/arthur-adjedj/AOC/tree/master\">https://github.com/arthur-adjedj/AOC/tree/master</a><br>\n<a href=\"https://github.com/kmill/kmill-aoc2023\">https://github.com/kmill/kmill-aoc2023</a><br>\n<a href=\"https://github.com/adomani/advents\">https://github.com/adomani/advents</a></p>",
        "id": 485699880,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1733169843
    },
    {
        "content": "<p>there also are some this year, and posting it in the discord</p>",
        "id": 485700312,
        "sender_full_name": "Edward van de Meent",
        "timestamp": 1733170014
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"521331\">Niels Voss</span> <a href=\"#narrow/channel/113489-new-members/topic/Lean.20as.20general.20purpose.20language.3F/near/485546902\">said</a>:</p>\n<blockquote>\n<p>I think Lean has roughly the same capabilities as Haskell in terms of general purpose programming, except Lean has also the ability to prove properties of your programs.</p>\n</blockquote>\n<p>It's also got a very flexible built-in metaprogramming interface — for a small example application of it, in my AoC solution I set up a little system where my <code>main</code> function compiles a command line processor that dispatches to each days' solutions. It's something that you could whip up easily in Python with decorators, but I'm able to do this with a compiled language.</p>\n<p>There are examples elsewhere of making mini-DSLs that you can embed inside the language. Even <code>do</code> notation, something that seems very core to Lean, could have been a user library(!).</p>\n<p>It's all the fun of Lisp, but with syntax and types :-)</p>",
        "id": 485701286,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1733170420
    },
    {
        "content": "<p>That is a great explanation. To be honest, I am not certain I could really utilize even a fraction of what Lean can do but there is no better time to learn than now! I went ahead and started AoC as well just for fun. Will see how far I get <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> I did find a few others that are doing AoC as well and I am reading over some other code to get an idea how to approach these problems in Lean. The Parsers seem really amazing</p>",
        "id": 485704086,
        "sender_full_name": "mdioc",
        "timestamp": 1733171641
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/channel/113489-new-members/topic/Lean.20as.20general.20purpose.20language.3F/near/485699880\">said</a>:</p>\n<blockquote>\n<p>In case you're interested, there were a few people doing Advent of Code in Lean last year (<a href=\"#narrow/channel/113488-general/topic/Advent.20of.20Code.3F/near/405279074\">thread</a>)</p>\n</blockquote>\n<p>Also this year in my case: <a href=\"https://github.com/dupuisf/aoc24\">https://github.com/dupuisf/aoc24</a>.</p>",
        "id": 485704337,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1733171742
    },
    {
        "content": "<p>Thanks for all the info. Decided to go for it and I managed to get day 1 done while looking to some others for inspiration. Learning functional programming is pretty challenging so any feedback is welcome! <a href=\"https://github.com/mdioc/aoc2024\">https://github.com/mdioc/aoc2024</a></p>",
        "id": 485749634,
        "sender_full_name": "mdioc",
        "timestamp": 1733198923
    },
    {
        "content": "<p>I'm solving AOC this year for the first time in Lean :)</p>\n<p><a href=\"https://github.com/mfornet/advent-of-code-2024\">https://github.com/mfornet/advent-of-code-2024</a></p>",
        "id": 485826230,
        "sender_full_name": "Marcelo Fornet",
        "timestamp": 1733225747
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/channel/113489-new-members/topic/Lean.20as.20general.20purpose.20language.3F/near/485701286\">said</a>:</p>\n<blockquote>\n<p>It's all the fun of Lisp, but with syntax and types :-)</p>\n</blockquote>\n<p>This should be the Lean-as-a-programming-language tag line :-)</p>",
        "id": 485856392,
        "sender_full_name": "Yuri",
        "timestamp": 1733233648
    },
    {
        "content": "<p>I feel that tag line is true of basically every functional programming language except for Lisp.</p>",
        "id": 486193470,
        "sender_full_name": "Jason Rute",
        "timestamp": 1733353202
    },
    {
        "content": "<p>That's far from my own experience <span class=\"user-mention\" data-user-id=\"115715\">@Jason Rute</span> — what functional languages embrace metaprogramming as a core feature? (I haven't had a chance to use it, but Julia comes to mind as a possibility.)</p>",
        "id": 486194347,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1733353673
    },
    {
        "content": "<p>racket is the only other language I can think of that could be described as \"embracing metaprogramming\"</p>",
        "id": 486277207,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1733396292
    },
    {
        "content": "<p>but unfortunately even though it has syntax (that's kind of the whole point), it's still lisp-styled in the wild, in documentation, etc</p>",
        "id": 486277689,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1733396436
    },
    {
        "content": "<p>It reminds me of a scifi shapeshifter that goes around looking like a blob instead of a person because they have no particular reason to take a form</p>",
        "id": 486277990,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1733396525
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> I probably misunderstood what you meant by “syntax” then.  (As for your metaprogramming question, maybe Scala 3. But again, I didn’t realize you meant syntax as in metaprogramming?)</p>",
        "id": 486278781,
        "sender_full_name": "Jason Rute",
        "timestamp": 1733396783
    },
    {
        "content": "<p>I think the metaprogramming part is coming from \"all the fun of lisp\"</p>",
        "id": 486279322,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1733396980
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/113489-new-members/topic/Lean.20as.20general.20purpose.20language.3F/near/486277990\">said</a>:</p>\n<blockquote>\n<p>It reminds me of a scifi shapeshifter that goes around looking like a blob instead of a person because they have no particular reason to take a form</p>\n</blockquote>\n<p>I have to start using this metaphor <span aria-label=\"rolling on the floor laughing\" class=\"emoji emoji-1f923\" role=\"img\" title=\"rolling on the floor laughing\">:rolling_on_the_floor_laughing:</span></p>",
        "id": 486309183,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1733406551
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> I didn't mention Racket because it's \"what if we started with Scheme and then went all-in on doing Lisp metaprogramming correctly\". It's already too much of a Lisp, but it's diverged enough that it's worth mentioning.</p>\n<p><span class=\"user-mention\" data-user-id=\"115715\">@Jason Rute</span> I'm not understanding what you're saying (what's \"syntax as in metaprogramming\"?). Maybe if your experience of Lisp is Scheme rather than Common Lisp what I'm saying doesn't make much sense, but, if you look at Lean closely, you notice that Lean.Syntax is essentially s-expressions, and it's a Lisp-with-a-surface-syntax like Dylan (which is actually a language that Sebastian looked at during the design of Lean 4). Both Lean and Common Lisp are extensible at a number of levels, but what I like about Lean is that you have access to a rich type theory to support more sophisticated metaprograms than you would ever dare to try writing in Common Lisp. I tend to feel you have a lot of freedom like in Common Lisp (\"it's all the fun of Lisp\"), and these two sorts of things are what I had in mind when I said it had syntax and types.</p>",
        "id": 486361550,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1733420624
    }
]