[
    {
        "content": "<p>Has there been any consideration of adding Lean 4 to <a href=\"https://exercism.org\">Exercism</a>? It seems like a structured and interactive platform like Exercism could be an excellent way for us to learn, practice, and collaborate on Lean 4 used as a programming language. NNG already covers the theorem proving aspect of Lean excellently!</p>\n<p>For those unfamiliar, Exercism is a non-profit, open-source platform offering coding exercises across various languages, supported by a mentoring system where learners receive feedback from experienced practitioners. For more details see <a href=\"https://en.wikipedia.org/wiki/Exercism\">https://en.wikipedia.org/wiki/Exercism</a> and <a href=\"https://exercism.org\">https://exercism.org</a>.</p>",
        "id": 426443407,
        "sender_full_name": "Isak Colboubrani",
        "timestamp": 1710372587
    },
    {
        "content": "<p>I believe as with many learning resources like this it's very much a question of funding and time.</p>\n<p>I doubt that anybody would complain if somebody came along with enough time or resources to make something like that happen!</p>\n<p>For example, NNG for Lean 4 is where it is because the university HHU and the German government (through <a href=\"https://stiftung-hochschullehre.de/\">Stiftung Innovation in der Hochschullehre</a>) put quite some resources into it - and because of Kevin, who I believe also always got tons of support from Imperial College and grants from the UK government (?)</p>",
        "id": 426447948,
        "sender_full_name": "Jon Eugster",
        "timestamp": 1710376126
    },
    {
        "content": "<p>Is this any different to <a href=\"https://www.codewars.com/\">codewars</a>? Someone put in a lot of effort to get Lean 3 supported there.</p>",
        "id": 426448618,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1710376790
    },
    {
        "content": "<p>+1 on getting a Lean (4) track in Exercism!</p>\n<p>What sets Exercism apart from platforms like codewars is the opportunity to get feedback from mentors for your implementations. Of course this requires a few people from the community to be willing to mentor solutions on the Lean track. I find this way of feedback incredible valuable from a student point of view because it can make you aware of features that you did not even know existed and it's a great way to learn interactively. (I've also done some mentoring work on the Crystal track, which is a great way to deeply learn a language as well.)</p>\n<p>That said, reading a bit through <a href=\"https://exercism.org/docs/building/tracks/new\">https://exercism.org/docs/building/tracks/new</a>, there are quite a few todos for setting up a new track. This also requires implementing a couple of standard exercises that exist on all tracks of Exercism.<br>\nIn this way, an initial version of a Lean track would naturally emphasize the functional programming aspect rather than the interactive theorem proving aspect of Lean. This might be a valuable addition to existing resources like the Lean Games (e.g. NNG). Of course, apart from the standard exercises, any kind of exercise could likely be added if the exercism community is fine with that. This would potentially allow to dig deeper also into the theorem proving aspect.</p>\n<p>I was tempted to just start building this track but I have the habit of starting too many projects at once so I'm not sure how much time I could really invest here, also because the track needs to be maintained in the long run.<br>\nIf there are 1 or 2 people around who would like to share the effort in the long run (and ideally have some experience with Exercism from a student or mentor or maintainer point of view), I would be happy to initiate the first steps. (First of all, we would need to ask the Exercism community if they want such a track at all.)</p>\n<p>Let me know what you think! :)</p>",
        "id": 474208769,
        "sender_full_name": "Lukas Gerlach",
        "timestamp": 1727851926
    },
    {
        "content": "<p>A lot of \"mentoring\" happens here, on Zulip: could questions be redirected here?</p>",
        "id": 474209885,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727852199
    },
    {
        "content": "<p>I guess putting links or letting people know that they can ask their questions here is always possible :)<br>\nOne other point of mentoring is that people sometimes do not have very concrete questions but just submit a solution to an exercise and then want to know what can be done better or more idiomatic. I'm not aware to what extent this also happens in Zulip. If people already use Zulip heavily for this kind of \"code review\" then maybe the use of an Exercism track is limited (apart from reaching people not knowing about Lean yet).</p>",
        "id": 474210976,
        "sender_full_name": "Lukas Gerlach",
        "timestamp": 1727852441
    },
    {
        "content": "<p>I would say that a lot of this happens on Zulip.  I also think that drawing on more people would be great, though!</p>",
        "id": 474211532,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1727852566
    },
    {
        "content": "<p>Good to know, thank you! Then I'm not sure if it's really worth the effort...<br>\nI'll wait for a few more opinions :)</p>",
        "id": 474211985,
        "sender_full_name": "Lukas Gerlach",
        "timestamp": 1727852659
    }
]