[
    {
        "content": "<p>Hello, I am a PhD student in theoretical computer science working on computational complexity, and I’m interested in formalizing a circuit complexity lower bound result which was achieved through an elegant reduction to a combinatorial problem involving the sunflower lemma.</p>\n<p>I have searched for existing results on circuit complexity in Lean, as well as more general resources related to the sunflowers, but haven’t found anything. From what I can tell, this community has a few threads from a couple of months ago discussing complexity results, but I’m not sure if there has been any concrete progress since then. Could someone with more expertise confirm whether this is accurate or point me to any useful resources related to Lean and complexity, or Lean and sunflower-lemma type results, so I can get a better sense of where to begin? I’m new to Lean but have experience with Coq. Thank you very much for your time (and very grateful for this Zulip community).</p>",
        "id": 477845720,
        "sender_full_name": "Gülce Kardes",
        "timestamp": 1729379360
    },
    {
        "content": "<p>There is really nothing much in circuit complexity.</p>",
        "id": 477846184,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729379862
    },
    {
        "content": "<p>You could formalise the sunflower lemma independently though</p>",
        "id": 477846242,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729379891
    },
    {
        "content": "<p>There aren't many theoretical computer scientists from algorithms and complexity in the community in general for now. I hope this changes.</p>",
        "id": 477846285,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729379950
    },
    {
        "content": "<p>EDIT  : The Isabelle AFP has a recent proof of the sunflower lemma: <a href=\"https://www.isa-afp.org/entries/Sunflowers.html\">https://www.isa-afp.org/entries/Sunflowers.html</a></p>",
        "id": 477846401,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1729380060
    },
    {
        "content": "<p>We already tried formalising the (improved) sunflower lemma two years ago and it failed because of holes in the write-up we were following. I think these have been patched since, so it's definitely something you could try!</p>",
        "id": 477874809,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1729409357
    }
]