[
    {
        "content": "<p>Hey all,</p>\n<p>I will be amongst people doing a 10 min student talk at the Australian Mathematical Sciences Institute summer school , <a href=\"https://ss.amsi.org.au/participant-talks-abstracts/\">https://ss.amsi.org.au/participant-talks-abstracts/</a> . </p>\n<p>The abstract is very minimal and the title could be a bit problematic from a pedantic point of view given lean is only one potential aspect of the 'univalent foundation' of mathematics.</p>\n<p>My goal is to proselytise about lean to larger and wider audience than just at my school, to help that ITPs are not commonly used in Australia.</p>\n<p>10 minutes is a very short time though, any advice of the most effective way to intrigue an audience in that tiny time frame? </p>\n<p>Currently abstract and title can be changed, and I figured this aspect of  the recent Erdos problem hype would be a good way to market it.</p>",
        "id": 565107735,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1766473751
    },
    {
        "content": "<p>Is talking about univalent foundations something you must do? My impression is that univalence and HoTT are quite far from mathematical mainstream, and that Lean and mathlib offer enough to talk about without including them.</p>",
        "id": 565121685,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1766481025
    },
    {
        "content": "<p>I don't have a 10 minutes introduction to Lean in my drawer, but I can share what I do in 30 minutes' time: the first half <a href=\"https://www.math.uni-bonn.de/people/rothgang/slides_Potsdam2025.pdf\">https://www.math.uni-bonn.de/people/rothgang/slides_Potsdam2025.pdf</a> is an intro to Lean.</p>",
        "id": 565121850,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1766481103
    },
    {
        "content": "<p>My selection of examples is certainly biased (to a more advanced audience), but worked well so far.</p>",
        "id": 565121949,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1766481141
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"634338\">Michael Rothgang</span> <a href=\"#narrow/channel/113489-new-members/topic/Lean.204.20talk.20of.20a.20ten.20minute.20duration.3F/near/565121850\">said</a>:</p>\n<blockquote>\n<p>I don't have a 10 minutes introduction to Lean in my drawer, but I can share what I do in 30 minutes' time: the first half <a href=\"https://www.math.uni-bonn.de/people/rothgang/slides_Potsdam2025.pdf\">https://www.math.uni-bonn.de/people/rothgang/slides_Potsdam2025.pdf</a> is an intro to Lean.</p>\n</blockquote>\n<p>Thanks so much for this! And fair point on univalent foundations, I will probably deemphasize it and make it a small point as a part of an obligatory disclaimer that Lean 4 is not the <em>only</em> way to do ITP .</p>",
        "id": 565158821,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1766497468
    },
    {
        "content": "<p>Lean is incompatible with HoTT. So if you really want to talk about HoTT, you need a different proof assistant.</p>",
        "id": 565167138,
        "sender_full_name": "suhr",
        "timestamp": 1766500782
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"394485\">suhr</span> <a href=\"#narrow/channel/113489-new-members/topic/Lean.204.20talk.20of.20a.20ten.20minute.20duration.3F/near/565167138\">said</a>:</p>\n<blockquote>\n<p>Lean is incompatible with HoTT. So if you really want to talk about HoTT, you need a different proof assistant.</p>\n</blockquote>\n<p>It is true that there are incompatible foundations, but there are still interesting projects at the intersection of Lean and HoTT! Off the top of my head, there is <a href=\"https://github.com/sinhp/HoTTLean\">HoTTLean</a> that is aiming to make an embedded proof mode that interprets into the natural model in Lean, and <a href=\"https://www.jonmsterling.com/sterling-2025-hottest/\">Jon Sterling currently implementing a new proof assistant</a> for HoTT in Lean. </p>\n<p>So while it is true that directly doing HoTT in Lean is problematic, I think there is a pretty interesting story about the power of Lean in terms of metaprogramming and as a programming language and how this can interact with type theories that would normally be considered out of scope, especially given the previous support for HoTT.</p>\n<p>All that said, given the apparent audience and time constraints, I agree with Michael that this is likely not a great fit for this particular talk.</p>",
        "id": 565169146,
        "sender_full_name": "Chris Henson",
        "timestamp": 1766501635
    }
]