[
    {
        "content": "<p>I noticed that almost all job postings in the <a class=\"stream\" data-stream-id=\"284757\" href=\"/#narrow/channel/284757-job-postings\">#job postings</a> channel require academic background or is just contracting work.</p>\n<p>I'm an engineer with 15 years experience in a few languages. I enjoy maths and most of what I know comes from self study. I've never published a paper before (although I would love to contribute to one some day). Mathematically logic comes naturally to me but there is certainly a lot I still have to learn.</p>\n<p>Is there a place for someone like me in the full-time Lean job market? And if so, where do I connect with my potential future employers?</p>",
        "id": 560949841,
        "sender_full_name": "LordRatte",
        "timestamp": 1764455301
    },
    {
        "content": "<p>Sounds like you are in a similar place as I am. I don't have any answers for you about how to get a job in Lean. Just want to post my support. I am also an software engineer. I am learning Lean4 on the side as a hobby. Very intrigued by using it for formalizing mathematical theorems.</p>",
        "id": 560954512,
        "sender_full_name": "Code Apprentice",
        "timestamp": 1764460631
    },
    {
        "content": "<p>Honestly, the answer is probably “very few” if you exclude those dataset creating contractual roles. You still need to be deep into math or formal verification or the internals of theorem provers + their theory  to be able to make meaningful contributions. There might be a few roles focussed on tooling and engineering support, but those seem rare and only exist at places like the Lean FRO itself or the mathlib initiative.</p>",
        "id": 560954996,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1764461080
    },
    {
        "content": "<p>People do pick up ITPs and use them as stepping stones to get deep into the topics I mentioned, even if they are from outside academia.</p>",
        "id": 560955049,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1764461124
    },
    {
        "content": "<p>But it takes extraordinary effort to make the kind of contributions that stand out. The few people I know who did that eventually started PhDs.</p>",
        "id": 560955150,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1764461215
    },
    {
        "content": "<p>That being said, lean is still short on the libraries front for doing system tasks. It doesn’t have a web framework for example. It doesn’t have a great CAS system built in it. There are experimental projects for writing numerical algorithms (Scilean) but they are still a WIP. So maybe there is still a bunch to be done on the software libraries side of lean. I just don’t know too many employers paying for this to happen other than the FRO.</p>",
        "id": 560955337,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1764461402
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"466334\">@Shreyas Srinivas</span> I see. Very few is what I was expecting to hear but I thought it would at least be worth asking.</p>",
        "id": 560971751,
        "sender_full_name": "LordRatte",
        "timestamp": 1764482168
    },
    {
        "content": "<p>I've been on both sides of hiring quite a bit over nearly 20 years and my advice is that a job ad is always a description of the dream applicant.</p>\n<p>Of course you shouldn't waste people's time with highly speculative applications, but if you really do have good relevant skills and knowledge but don't tick some box (e.g., PhD) then this should not stop you from applying.</p>",
        "id": 560992061,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1764502795
    },
    {
        "content": "<p>If you want to beef up your CV then I would start contributing to the open source projects out there in your area e.g. perhaps CSLib or Mathlib? Certainly when I was hiring recently I was looking for public examples of competent Lean code written by applicants.</p>",
        "id": 560992600,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764503350
    },
    {
        "content": "<p>IME (purely anecdotal from the industry; in academia, which is still a majority of Lean jobs, it's different):<br>\nIt's more often than not the case that we hire 'someone we know of' from the community - so participating (e.g. contributing to open source, published Lean work, etc.) is borderline necessary. PhD. has nothing to do with the job requirements; it just so happens most people do have one, but that's because they're more likely to have participated in the community.</p>\n<p>Most industrial Lean-adjacent players I meet are the same - they're not explicitly looking for people with a phd. so don't let this deter you at all, unless you're fishing for an academic position.</p>",
        "id": 561009687,
        "sender_full_name": "František Silváši 🦉",
        "timestamp": 1764517739
    },
    {
        "content": "<p>This is helpful feedback all around. Thank you all.</p>",
        "id": 561021181,
        "sender_full_name": "LordRatte",
        "timestamp": 1764527372
    }
]