[
    {
        "content": "<p>Hi, is there a way to contribute to the <a href=\"http://lean-lang.org\">lean-lang.org</a> website? There are many important resources which are hard to find and which should be linked on the main website imo, like the <a href=\"https://leanprover-community.github.io/mathlib4_docs/\">mathlib documentation</a>, <a href=\"https://reservoir.lean-lang.org/\">reservoir</a> and <a href=\"https://loogle.lean-lang.org/\">loogle</a>.</p>\n<p>I also think the link style should be changed to something more readable, the unhovered line is almost transparent and makes it really hard to see where the links are.</p>\n<p>Another thing which would be nice to have is an RSS feed for publications and blog posts.</p>",
        "id": 438171430,
        "sender_full_name": "corrededCrustacean",
        "timestamp": 1715505712
    },
    {
        "content": "<p>Not sure if the mathlib documentation should be linked from the FRO website because mathlib is not managed by the FRO, it's managed by leanprover-community. The other points I agree on though.</p>",
        "id": 438180725,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1715515837
    },
    {
        "content": "<p>Right, by mathlib I meant the standard library more specifically, I was confused by the fact that they're together on the lean community website.</p>",
        "id": 438189705,
        "sender_full_name": "corrededCrustacean",
        "timestamp": 1715525367
    },
    {
        "content": "<p>There are plans do redesign that whole website, I don’t think that isolated contributions would be productive at this point. But thanks for proposing to help!</p>",
        "id": 438190252,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1715525863
    },
    {
        "content": "<p>It's possible that a contribution of an RSS generator to verso (the tool which generates the blog) would be appreciated, but <span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span> is the person to ask there. Perhaps opening a feature request on the repo is a reasonable step?</p>",
        "id": 438190617,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1715526177
    },
    {
        "content": "<p>I missed the RSS bit, that may be welcome indeed.</p>",
        "id": 438190850,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1715526364
    },
    {
        "content": "<p>cool, I will look at it!</p>",
        "id": 438191010,
        "sender_full_name": "corrededCrustacean",
        "timestamp": 1715526522
    },
    {
        "content": "<p>RSS generator is planned, but it's prioritized under various other tasks (like supporting a revised user's manual). My only concern with incoming RSS code is that I'd spend much more time managing the PR than it would take just writing the code - RSS/Atom include lots of XML complexity to get right, and the existing codebase is still poorly documented and rapidly evolving. But RSS is definitely on the roadmap, and if code arrives that I'm happy to support and maintain forever without requiring tons of mentorship on the way, then it'd be good :⁠-⁠)</p>",
        "id": 438191037,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1715526556
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"717530\">@corrededCrustacean</span> !</p>",
        "id": 438191062,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1715526597
    },
    {
        "content": "<p>RE the graphics - we've got a redesign on the way, and the website repo is private (so we can do things like prepare a PR about something like a hiring announcement), so CSS tweaks there are probably better dealt with through patience.</p>",
        "id": 438191167,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1715526680
    }
]