[
    {
        "content": "<p>Hi!<br>\nIn this blog post <a href=\"https://lean-lang.org/blog/2024-3-21-quasiquotation-with-binders-a-lean-metaprogramming-example/\">Quasiquotation with Binders: A Lean Metaprogramming Example</a>, David mentions at the end:</p>\n<blockquote>\n<p>An upcoming post will demonstrate some techniques for associating more information with bound variables, moving from a macro-based implementation to an <em>elaborator</em>, which uses the compiler's API to translate terms directly to Lean's core type theory.</p>\n</blockquote>\n<p>I think this is precisely what I'll need to do for my DSL, but it seems that upcoming post does not exist (yet?), so I'm looking for examples of how to do this. So far I've been following <a href=\"https://leanprover-community.github.io/lean4-metaprogramming-book/main/08_dsls.html\">Embedding DSLs By Elaboration - Metaprogramming in Lean 4</a>, but while that book shows how to do binders with macros, the elaborated DSL doesn't have binders. I've also seen <a href=\"https://docs.lean-lang.org/lean4/doc/examples/phoas.lean.html\">Parametric Higher-Order Abstract Syntax - Lean Documentation Overview</a>, but I'm not sure whether that is what I need.</p>\n<p>So, essentially I am looking for examples and/or tutorials on  elaborators of DSLs that have bindings. Any pointers are much appreciated! Maybe a small DSL that uses this technique would suffice to learn by example, but I couldn't find one yet.</p>",
        "id": 527149592,
        "sender_full_name": "Nate Sandy",
        "timestamp": 1751623842
    },
    {
        "content": "<p>Maybe it's worth looking at Lean's own binder elaboration, which is all in src/Lean/Elab/Binders.lean</p>\n<p>The key parts are <code>withLocalDecl</code> for adding variables to the local context, <code>addLocalVarInfo</code> for registering syntax responsible for the local variable, and, elsewhere, functions to create foralls/lambdas/lets (<code>mkForallFVars</code>, <code>mkLambdaFVars</code>, <code>mkLetFVars</code>), closing the expressions.</p>",
        "id": 527286199,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1751726878
    },
    {
        "content": "<p>Thanks for the pointers Kyle!</p>\n<p>I also realized that the Metaprogramming book has some information about binders, that I initially missed: <a href=\"https://leanprover-community.github.io/lean4-metaprogramming-book/main/04_metam.html?highlight=mklam#lambdas-and-foralls\">https://leanprover-community.github.io/lean4-metaprogramming-book/main/04_metam.html?highlight=mklam#lambdas-and-foralls</a></p>\n<p>I'll also look into Lean's elaboration, it definitely helps to know what functions to search for. I think with this I can continue for now :)</p>",
        "id": 527338050,
        "sender_full_name": "Nate Sandy",
        "timestamp": 1751797325
    }
]