[
    {
        "content": "<p>Hi everyone!<br>\nI’ve been learning Lean 4 through the available tutorials and Theorem Proving in Lean 4 book, but I’m interested in finding a more structured or guided way to learn — ideally an online course, university offering, or cohort-style program that I could join.<br>\nDoes anyone know of:<br>\nCurrent or upcoming Lean 4 courses (open enrollment or academic)<br>\nAny study groups, bootcamps, or guided learning initiatives<br>\nOr other structured programs where I could apply and learn interactively<br>\nSelf-paced resources are great, but I’d really like to follow a clear curriculum and get feedback or discuss with peers.<br>\nThanks a lot for any pointers or links!</p>",
        "id": 555562309,
        "sender_full_name": "Mikus Vanags",
        "timestamp": 1763118913
    },
    {
        "content": "<p>What's your background? Professor of mathematics? Computer science undergraduate? Your question is unanswerable right now. What do you want to learn?</p>",
        "id": 555588895,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1763127330
    },
    {
        "content": "<p>Do you want to understand how Lean works under the hood, in detail? Do you want to learn how to use Lean? For math proofs,  software verification or as a programming language? Help us help you :-)</p>",
        "id": 555600377,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1763130296
    },
    {
        "content": "<p>Thanks for the reply!</p>\n<p>I have a PhD in Information Technologies and work professionally as a .NET developer. I recently received funding for my postdoctoral project, <strong>“KatLang: Enhancing a Higher-Order Domain-Specific Language for Problem Solving and Educational Assessment in Mathematics and Physics.”</strong></p>\n<p>The goal is to advance the concept behind KatLang <a href=\"https://katlang.org/\">https://katlang.org</a> and build web tools that let users define math and physics tests whose evaluation can be automated. The project officially starts on <strong>March 1, 2026</strong>.</p>\n<p>My PhD research focused on abstractions in functional and logic programming (thesis: <a href=\"https://1drv.ms/w/c/d7aa8d71b9867c20/ESB8hrlxjaoggNfkBAAAAAABJqSJLk2MOsjl_L-eykn5dg?e=m49ryj\">https://1drv.ms/w/c/d7aa8d71b9867c20/ESB8hrlxjaoggNfkBAAAAAABJqSJLk2MOsjl_L-eykn5dg?e=m49ryj</a> ).</p>\n<p>Even with that background, I’ve found proof assistants quite challenging to grasp. So far, my best progress has been working through the <a href=\"https://adam.math.hhu.de/#/g/leanprover-community/nng4\">https://adam.math.hhu.de/#/g/leanprover-community/nng4</a> , but I still feel like I understand almost nothing.</p>\n<p>My main goal with <strong>Lean 4</strong> is to explore how to formally describe <strong>KatLang’s semantics and properties</strong>, and to see what theoretical insights we can derive from that. Conceptually, I think of KatLang as a way of <em>decomposing the lambda abstraction</em> and reassembling it into something more expressive—a kind of “mathematical algorithm” abstraction that can combine several functions rather than just return a single value.</p>\n<p>Over the past few days, I’ve been searching for <strong>Lean 4 online courses</strong> I could apply to, but haven’t had much luck yet. If anyone knows of opportunities—or is interested in collaboration - I’d be very happy to connect.</p>\n<p>I’d love to understand how Lean really works inside, but I’m not there yet.</p>",
        "id": 555608253,
        "sender_full_name": "Mikus Vanags",
        "timestamp": 1763132094
    },
    {
        "content": "<p>Hi Mikus, I am looking for people who are interested to learn Lean together. See</p>\n<p><a class=\"message-link\" href=\"/#narrow/channel/113489-new-members/topic/New.20to.20Lean.3B.20Wanna.20form.20a.20small.20study.20group/near/558853242\">#new members &gt; New to Lean; Wanna form a small study group @ 💬</a></p>",
        "id": 558853362,
        "sender_full_name": "CY Fung",
        "timestamp": 1763858553
    },
    {
        "content": "<p>There is a <a href=\"https://leanprover-community.github.io/teaching/courses.html\">list</a> here if you didnt know yet.</p>",
        "id": 558868528,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1763877472
    }
]