[
    {
        "content": "<p>Hi, I was looking for some theorems the proofs of which I could contribute to mathlib4. To clarify, I am not very good at various abstract branches of mathematics; I take more interest in numerical analysis, real analysis and some information theory. Any chance someone would have pointers/suggestions for what I could contribute and where would I begin?</p>",
        "id": 410429700,
        "sender_full_name": "Kamila Szewczyk",
        "timestamp": 1703854453
    },
    {
        "content": "<p>I think the usual advice that experts here give is to pick some attainable (or even slightly beyond attainable) project for something that you know well, try to formalize it, and if you run into missing things, to contribute those.</p>\n<p>Another avenue is the undergraduates file (<a href=\"https://github.com/leanprover-community/mathlib4/blob/master/docs/undergrad.yaml\">https://github.com/leanprover-community/mathlib4/blob/master/docs/undergrad.yaml</a>) where wherever you see an empty string there may be something at the undergraduate mathematics level which is missing (though sometimes the file isn't fully up to date so it's best to ask when you see something specific you're interested in).</p>\n<p>And a third possibility is someone who knows the fields you mentioned to drive by with specific recommendations. And just because I see it, I <em>think</em> some work on information theory was being done in the <a class=\"stream\" data-stream-id=\"412902\" href=\"/#narrow/stream/412902-Polynomial-Freiman-Ruzsa-conjecture\">#Polynomial Freiman-Ruzsa conjecture</a> stream where there was a need for some results on entropy -- I only followed from afar, and am definitely not an expert myself, not to mention that I think the definitions are being done in quite abstract / generalized ways -- but maybe that's yet another thing you might find yourself interested in.</p>",
        "id": 410437620,
        "sender_full_name": "Julian Berman",
        "timestamp": 1703860002
    },
    {
        "content": "<p>(Also welcome!)</p>",
        "id": 410437656,
        "sender_full_name": "Julian Berman",
        "timestamp": 1703860025
    }
]