[
    {
        "content": "<p>Hi everyone, I'm Mike Stillman, an author of the Macaulay2 computer algebra system.  I am interested in lean4, and possibly connections between lean and Macaulay2.</p>",
        "id": 505508193,
        "sender_full_name": "Michael Stillman",
        "timestamp": 1741893832
    },
    {
        "content": "<p>I just wanted to introduce myself as well --- Anton Leykin.<br>\nIn far (or near) future, I'm interested in creating a Macaulay2 (M2) interface to lean in order to formalize results of certain computations. It would be interesting to see how large  the intersection of the M2 and lean communities is. (So far we talked to <span class=\"user-mention\" data-user-id=\"321459\">@Damiano Testa</span> and <span class=\"user-mention\" data-user-id=\"306577\">@Matthew Ballard</span>.)</p>",
        "id": 505509495,
        "sender_full_name": "Anton L.",
        "timestamp": 1741894224
    },
    {
        "content": "<p>Great, you'll want to check out <a class=\"stream\" data-stream-id=\"482893\" href=\"/#narrow/channel/482893-Computer-algebra\">#Computer algebra</a> (which I think hasn't had much activity yet but maybe will see some more motion now). This has been a topic of random discussions for many years but it hasn't really reached critical mass yet.</p>",
        "id": 505509774,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1741894316
    },
    {
        "content": "<p>From our side I think we want to have either connections to the system to get certificates for come kinds of formal computations (an example of this is that we currently use sagemath to compute Gröbner bases for the <code>polyrith</code> tactic), or to get CAS algorithms reimplemented in a proof producing or verified-correct way in Lean (which is difficult to do without contacts who work on the unverified version of the algorithm).</p>",
        "id": 505510461,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1741894536
    }
]