[
    {
        "content": "<p>Hi,</p>\n<p>I'd like to make an attempt at learning the basics of LEAN. (My background is in MacOS app development in Objective-C, with about 10 years experience, but I've been away from coding on a daily basis for about 8 years and my math background is not very strong.) I attempted to start getting an environment set-up using the instructions at:</p>\n<p><a href=\"http://url\">https://leanprover-community.github.io/install/macos_details.html</a></p>\n<p>Specifically, I downloaded elan-x86_64-apple-darwin.tar.gz and ran the elan-init tool. It output:</p>\n<blockquote>\n<p><strong>info:</strong> syncing channel updates for 'stable'<br>\n<strong>info:</strong> latest update on stable, lean version v4.11.0<br>\n<strong>info:</strong> downloading component 'lean'</p>\n<p>Total: 194.6 MiB Speed: 540.8 KiB/s<br>\n<strong>info:</strong> installing component 'lean'<br>\n<strong>info:</strong> default toolchain set to 'stable'</p>\n<p><strong>stable installed</strong> - Lean (version 4.11.0, x86_64-apple-darwin22.6.0, commit ec3042d94bd1, Release)<br>\n<strong>Elan is installed now. Great!</strong></p>\n</blockquote>\n<p>Being a Mac developer my code editor has always been Xcode, but given it was suggested to use VS Code I did the blasphemous thing the instructions said to do and installed VS Code, and added the Lean4 extension. When creating a test file and entering \"#eval 1+1\" its successfully shows a value of 2 in a tooltip when I hover over the line as indicated in the install instructions page linked above.</p>\n<p>Assuming I now had a successfully set-up environment I copied a snippit of LEAN code into the test file. The first line was \"<code>import Mathlib.NumberTheory.LucasLehmer</code>\" and the import statement was unlined in red with the following error in the tooltip:</p>\n<blockquote>\n<p>unknown module prefix 'Mathlib'</p>\n<p>No directory 'Mathlib' or file 'Mathlib.olean' in the search path entries:</p>\n<p>/Users/my_username/.elan/toolchains/stable/lib/leanLean 4</p>\n</blockquote>\n<p>Looking into the specified directory I do not see a MathLib library, so that would presumably explain the issue. Is this a separate download? Should it have been installed by the elan-init? Can I just download the MathLib from the URL below and drop it into the specified directory, or does the precise version need to match / sync with the build of LEAN4 that is installed?</p>\n<p><a href=\"http://url\">https://github.com/leanprover-community/mathlib4/</a></p>\n<p>Thanks.</p>\n<p>P.S. Is there really any hard requirement to use VS Code? What is the basis of that requirement? Isn't this all just being passed to Clang? I can do that natively in Xcode. If anyone can point me to the source for whatever the Lean tie-ins are with VS Code (this leanprover extension) I'd love to take a look at that and see if it would be reasonable to re-create for Xcode integration.</p>",
        "id": 467698181,
        "sender_full_name": "North Eastern Ohio Mac Developer",
        "timestamp": 1725501740
    },
    {
        "content": "<p>To use mathlib you need to create a new Lean project with mathlib as a dependency. See <a href=\"https://leanprover-community.github.io/install/project.html\">https://leanprover-community.github.io/install/project.html</a> . And yes there's a hard requirement to use an editor which is Lean-aware, and VS Code is a good example (emacs and vim are the two other possibilities, although there is more support for vim than emacs here; VS Code is by far the most popular).</p>",
        "id": 467700463,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1725502722
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> Thanks. I was able to clone the mathematics_in_lean.git repo mentioned on the link you provided. And I see it imports MathLib. I'll examine these files, and try working through some of the exercises.</p>\n<p>If you or anyone else can point it out, I'm still interested in where the code lives for this leanprover extension / integration with VS Code. Hopefully I can study how that works, and re-create the functionality in Xcode so I can rid my machine of this foul Microsoft product as quickly as possible.</p>",
        "id": 467704226,
        "sender_full_name": "North Eastern Ohio Mac Developer",
        "timestamp": 1725504395
    },
    {
        "content": "<p>I'm also a bit confused where the mathematics_in_lean project is pulling MathLib from. There still doesn't appear to be any MathLib in the toolchains/stable sub-directories on my system, and yet VS Code doesn't complain about the \"import MathLib\" when it is in a file inside the mathematics_in_lean directory, but it does complain when the same file is outside the mathematics_in_lean directory. And I don't see any MathLib inside any location inside the mathematics_in_lean directory either (like a local search path instead of a system search path). Very odd behavior.</p>",
        "id": 467704875,
        "sender_full_name": "North Eastern Ohio Mac Developer",
        "timestamp": 1725504754
    },
    {
        "content": "<p>VScode lean extension repo: <a href=\"https://github.com/leanprover/vscode-lean4\">https://github.com/leanprover/vscode-lean4</a><br>\nLike Kevin says, you do not need to use vscode, check out <a href=\"https://github.com/Julian/lean.nvim/\">https://github.com/Julian/lean.nvim/</a> and <a href=\"https://github.com/leanprover-community/lean4-mode\">https://github.com/leanprover-community/lean4-mode</a>. But feel free to write an extension for your favorite editor, I'm sure many others will benefit from it!<br>\nLean is being imported to <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a> because it is required in the <code>lakefile.lean</code> file, if you have already ran <code>lake exe get cache</code> (or a similar command) it should be present at the path <code>.lake/packages/mathlib</code>.</p>",
        "id": 467715115,
        "sender_full_name": "Rida Hamadani",
        "timestamp": 1725510229
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"750796\">North Eastern Ohio Mac Developer</span> <a href=\"#narrow/stream/113489-new-members/topic/MacOS.20Install.20Help/near/467704226\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> Thanks. I was able to clone the mathematics_in_lean.git repo mentioned on the link you provided. And I see it imports MathLib. I'll examine these files, and try working through some of the exercises.</p>\n<p>If you or anyone else can point it out, I'm still interested in where the code lives for this leanprover extension / integration with VS Code. Hopefully I can study how that works, and re-create the functionality in Xcode so I can rid my machine of this foul Microsoft product as quickly as possible.</p>\n</blockquote>\n<p>If you're curious about what features are provided by the Lean 4 VS Code extension (together with the Lean language server), you can read the manual: <a href=\"https://github.com/leanprover/vscode-lean4/blob/master/vscode-lean4/manual/manual.md\">https://github.com/leanprover/vscode-lean4/blob/master/vscode-lean4/manual/manual.md</a>. The most important features that are basically essential for working with Lean are described in the first five subsections of \"Interacting with Lean files\".</p>",
        "id": 467758678,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1725524457
    }
]