[
    {
        "content": "<p>According to: <a href=\"https://leanprover-community.github.io/contribute/index.html\">https://leanprover-community.github.io/contribute/index.html</a>, I'm advised to ask for write access to the Mathlib repo in preparation for any contributions I will make. At the moment, I have some small additions regarding Lists (lemmas about permutations) that would be better placed in the lean4 repo. Is the process the same? Or should I create my own fork and submit pull requests from there?</p>\n<p>Edit: My github username is <code>cmcl</code></p>",
        "id": 471608136,
        "sender_full_name": "Craig McLaughlin",
        "timestamp": 1726805816
    },
    {
        "content": "<p>The process for the lean4 repo is not the same. Can you specify what small additions you are interested to make regarding <code>List</code>? Knowing what they are could help us direct you better (either pointing you to API that already exists, or telling you how to interact with the lean4 repo appropriately).</p>",
        "id": 471614193,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1726807666
    },
    {
        "content": "<p>One lemma I had in mind (from my own need in a personal project):  I wish to decompose <code>List.filter p l</code> assumptions such that there exists <code>l1</code> and <code>l2</code> where <code>l1 ++ l2</code> is a permutation of <code>l</code> and <code>p</code> is true of all <code>l1</code> and <code>not . p</code> is true of all <code>l2</code>. (It only occurred to me today that Perm was recently moved into lean4 from Batteries).</p>",
        "id": 471615323,
        "sender_full_name": "Craig McLaughlin",
        "timestamp": 1726808009
    },
    {
        "content": "<p>Of course, I am happy to fork and submit a pull request as well if write access to lean4 is more tightly controlled.</p>",
        "id": 471615484,
        "sender_full_name": "Craig McLaughlin",
        "timestamp": 1726808061
    },
    {
        "content": "<p>Lean 4 has very different standards than Mathlib, and contributing to it is much harder. If you're a beginner, I'm 99% confident you should be contributing to Mathilb instead.</p>",
        "id": 471910387,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1726910003
    },
    {
        "content": "<p>Regarding your example, you might be looking for <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=List.partition#doc\">docs#List.partition</a></p>",
        "id": 471926512,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1726916971
    }
]