[
    {
        "content": "<p>Hi--</p>\n<p>I don't think I see an answer to this question in the <a href=\"https://leanprover-community.github.io/contribute/index.html\">\"how to contribute to mathlib\" docs</a> though I may well have missed it.</p>\n<p>After making a PR in August, I didn't touch my fork for for a while. I just now set upstream on the fork to the \"actual mathlib\", and merged the current mathlib with the branch on my fork. Now the build artifacts for my on-disk fork are out of date and need to be rebuilt, but this seems to be a big compile job.</p>\n<p><code>lake exe cache get</code> did something, but didn't seem to put my fork in a working state.</p>\n<p>And <code>lake build</code> seems like it'll take a while.</p>\n<p>Is there some better way to proceed? Maybe I shouldn't do this merge? Or perhaps I've just made a silly mistake? </p>\n<p>(I'm pretty sure this difficulty has nothing to do with my PR, which just added a single fairly short file...)</p>\n<p>Thanks for any advice!</p>",
        "id": 544646588,
        "sender_full_name": "George McNinch",
        "timestamp": 1760408643
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"486215\">George McNinch</span> <a href=\"#narrow/channel/113489-new-members/topic/mathlib.20PR.20workflow.28.3F.29.20question.28s.29/near/544646588\">said</a>:</p>\n<blockquote>\n<p><code>lake exe cache get</code> did something, but didn't seem to put my fork in a working state.</p>\n</blockquote>\n<p>What did it do? Maybe if you run <code>lake clean</code> first and then <code>lake exe cache get</code> it'll work?</p>",
        "id": 544646846,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1760408825
    },
    {
        "content": "<p>Actually, sorry. Now it does look like <code>lake exe cache get</code> did work, apparently. </p>\n<p>(A few minutes ago, I was pretty sure I saw reports of build-jobs running in the VSCode InfoView when I opened \"my file\" in the fork. But now I don't see them.)</p>\n<p>Sorry for the false-alarm!</p>\n<p>(<code>lake clean</code> is a good suggestion though.)</p>",
        "id": 544647387,
        "sender_full_name": "George McNinch",
        "timestamp": 1760409306
    },
    {
        "content": "<p>I'm working on several PRs simultaneously using different git branches.<br>\nEach time I switch to a different branch I need to download the cache again (lake exe cache get), or otherwise to wait for mathlib to compile locally.<br>\nIs there a way to avoid this?</p>",
        "id": 563499874,
        "sender_full_name": "Yuval Filmus",
        "timestamp": 1765553039
    },
    {
        "content": "<p>When you switch to a branch you've already used, <code>lake exe cache get</code> should normally not need to download anything from the network, as the files are already cached on your computer, and it should only unpack them. Isn't it what you see?</p>",
        "id": 563500555,
        "sender_full_name": "Sébastien Gouëzel",
        "timestamp": 1765553216
    },
    {
        "content": "<p>You can download only the cache needed for the file you are working on. In VSCode you can click on the forall symbol, then go to Project Actions... -&gt; Fetch Mathlib build cache for current imports. <code>lake exe cache get &lt;file&gt;</code> also works I think.</p>",
        "id": 563500889,
        "sender_full_name": "Etienne Marion",
        "timestamp": 1765553296
    }
]