[
    {
        "content": "<p>Dear Lean/Mathlib community,</p>\n<p>I am a mathematician from a representation theory / non-commutative harmonic analysis background.  I am a complete novice to formal theorem provers, but do have experience (and formal training as an undergraduate) in using traditional procedural programming languages.  I became interested in Lean and mathlib after seeing that people have been formalizing modern mathematical analysis in it.  </p>\n<p>From what I have read, this community appears to have grown quite a bit in size over the past four or five years, and I am somewhat curious as to whether there is still \"room\" for more people to join and actively work on extending the library.  I am particularly curious as to whether anyone is working on, say, formalizing the general results from harmonic analysis on locally-compact groups or perhaps something like the Plancherel Theorem for semisimple Lie groups.  And, if not, does this sound like a goal worth attempting?</p>\n<p>Maybe these are naïve questions on my part.  I offer my apologies in advance.</p>\n<p>Sincerely,<br>\nMatthew Dawson<br>\nCONAHCYT Research Fellow<br>\nCentro de Investigación en Mathematics (CIMAT)<br>\nMérida, Yucatán, México</p>",
        "id": 469813243,
        "sender_full_name": "Matthew Dawson",
        "timestamp": 1726190819
    },
    {
        "content": "<p>P.S. I am currently working through \"Theorem Proving in Lean 4\".  So for sure I will almost certainly not make any meaningful contribution of any kind for quite some time (if ever!).</p>",
        "id": 469813599,
        "sender_full_name": "Matthew Dawson",
        "timestamp": 1726191071
    },
    {
        "content": "<p>I'm not part of the Mathlib community--I'm interested in Lean for other reasons--and no doubt you'll get more specific answers about your areas of interest.  I hope I am not speaking out of turn, but I've seen enough know that there definitely is room for more people to contribute to Mathlib.</p>",
        "id": 469825255,
        "sender_full_name": "mars0i",
        "timestamp": 1726196237
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"755236\">@Matthew Dawson</span> Welcome! There's definitely room for more people. We have Lie groups, but not yet semisimple ones. What other resources have you been using besides <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a>? Do you know about <a href=\"https://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game/\">#nng</a> and <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a>?</p>",
        "id": 469841089,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1726199893
    },
    {
        "content": "<p>Thanks very much for your kind replies, <span class=\"user-mention\" data-user-id=\"617444\">@mars0i</span> and <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span>.  </p>\n<p>As far as the other resources, I am aware of Mathematics in Lean and my plan had been to work through it after finishing Theorem Proving in Lean.  But maybe I should do both at the same time?  I was not aware of the Natural number Game, which I will definitely check out!</p>",
        "id": 470011312,
        "sender_full_name": "Matthew Dawson",
        "timestamp": 1726245497
    },
    {
        "content": "<p>We need the trace formula so we can get cyclic base change for GL(2) so we can prove Fermat's Last Theorem! So definitely more harmonic analysis people needed :-)</p>",
        "id": 470049829,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1726261968
    }
]