[
    {
        "content": "<p>I am a little confused in Level 7/11 in \\leq World of the Natural Number Game. The instruction says \"use `cases h with hx hy'\" and it goes through there. But if you try it on Lean 4 Web or a local installation, it returns \"Alternative 'inl' has not been provided\". What is going on? <br>\nI have been using \"rcases h with hx | hy\" in this situation, and I can adjust. However, I plan to ask my students to try this game and would like to minimize the confusion. </p>\n<p>Thank you in advance!</p>",
        "id": 534822775,
        "sender_full_name": "Tetsuya Ishiu",
        "timestamp": 1755436170
    },
    {
        "content": "<p>the syntax changed to <code>cases'</code></p>",
        "id": 534822921,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1755436354
    },
    {
        "content": "<p>why would there be confusion if your students use the NNG website?</p>",
        "id": 534822953,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1755436385
    },
    {
        "content": "<p>I had to import Mathlib.Tactic.Cases, but cases' worked after that. I think beginners are confused every time what they learned did not work in the real environment. So, I would like to be ready to fill these small differences.</p>",
        "id": 534823452,
        "sender_full_name": "Tetsuya Ishiu",
        "timestamp": 1755436943
    },
    {
        "content": "<p>Yes sorry for this, a few tactics behave slightly differently in NNG. Another one is that <code>rw</code> in NNG is like <code>rewrite</code> in Lean as opposed to <code>rw</code>, which also tries <code>rfl</code> after the rewrite (and thus confuses beginners whose goals are randomly closed too early).</p>",
        "id": 535579942,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1755811025
    },
    {
        "content": "<p>That is totally fine. It is a great learning tool, and the confusion can be minimized by a little guidance.</p>",
        "id": 535596491,
        "sender_full_name": "Tetsuya Ishiu",
        "timestamp": 1755822393
    }
]