[
    {
        "content": "<p>Hi all, <br>\nTentatively thinking about getting some local people together to try to simultaneously learn Lean and formalise something fun. Wondering if Neron models might be a suitable topic? I'm thinking of Neron models of abelian schemes over generic points of DVRs (maybe with perfect residue fields). <br>\nI seem to remember that schemes have been formalised, if the notion of smooth morphism has also been formalised then that's most of what one needs for the definition, though I can imagine setting this up correctly will already be work. To prove existence one needs blowups, no idea if anything has been done about this. </p>\n<p>It could be that this has already been done, or that it's vastly too ambitious. Or that I should do my homework properly before posting here - either way, please let me know!</p>",
        "id": 561738981,
        "sender_full_name": "David Holmes",
        "timestamp": 1764790937
    },
    {
        "content": "<p>Hello! We are definitely able to write down a definition, and it might be a fun exercise to write it down. But to prove anything about it might need substantial more work.</p>",
        "id": 561770527,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1764805660
    },
    {
        "content": "<p>Jacobians might also be an interesting target</p>",
        "id": 561771909,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764806562
    },
    {
        "content": "<p>I am interested in implementing regular models, following Tim's code (<a href=\"https://people.maths.bris.ac.uk/~matyd/newton/\">https://people.maths.bris.ac.uk/~matyd/newton/</a>). I am using Aristotle from Harmonic and the lack of such things have been an obstructio for my work.</p>",
        "id": 561775601,
        "sender_full_name": "Bartosz Naskręcki",
        "timestamp": 1764808986
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"439483\">@Andrew Yang</span> Happy to hear writing out a definition might be a reasonable exercise. I guess there are various basic checks one can then think about (uniqueness, descent, separatedness, quasi-compactness...), and see how things are going before deciding whether to try to actually prove the general existence result. <br>\n<span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> Jacobians sound fun, cut I have a vague impression that things involving any significant amount of category theory tend to be painful in Lean? I guess in any case one should start with Hilb or Quot (unless one wants to go via Artin's axioms and algebraic spaces, but I'd guess that would be harder?)<br>\n<span class=\"user-mention\" data-user-id=\"321214\">@Bartosz Naskręcki</span> Sounds as if you are proposing proving resolution of singularities for arithmetic surfaces? Naively I'd guess that is hard...</p>",
        "id": 561816291,
        "sender_full_name": "David Holmes",
        "timestamp": 1764836191
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"321214\">Bartosz Naskręcki</span> <a href=\"#narrow/channel/113489-new-members/topic/Neron.20models.20in.20Lean/near/561775601\">said</a>:</p>\n<blockquote>\n<p>I am interested in implementing regular models, following Tim's code (<a href=\"https://people.maths.bris.ac.uk/~matyd/newton/\">https://people.maths.bris.ac.uk/~matyd/newton/</a>). I am using Aristotle from Harmonic and the lack of such things have been an obstructio for my work.</p>\n</blockquote>\n<p>Just out of curiosity, have you been exposed to a regular Lean course, or have you tried to formalize things on your own, or do you only rely on Aristotle? And when you speak about \"your work\" do you mean \"your <em>formalisation</em> work\" or something else?</p>",
        "id": 562035265,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1764919622
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"300245\">Filippo A. E. Nuccio</span> <a href=\"#narrow/channel/113489-new-members/topic/Neron.20models.20in.20Lean/near/562035265\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"321214\">Bartosz Naskręcki</span> <a href=\"#narrow/channel/113489-new-members/topic/Neron.20models.20in.20Lean/near/561775601\">said</a>:</p>\n<blockquote>\n<p>I am interested in implementing regular models, following Tim's code (<a href=\"https://people.maths.bris.ac.uk/~matyd/newton/\">https://people.maths.bris.ac.uk/~matyd/newton/</a>). I am using Aristotle from Harmonic and the lack of such things have been an obstructio for my work.</p>\n</blockquote>\n<p>Just out of curiosity, have you been exposed to a regular Lean course, or have you tried to formalize things on your own, or do you only rely on Aristotle? And when you speak about \"your work\" do you mean \"your <em>formalisation</em> work\" or something else?</p>\n</blockquote>\n<p>I was and I have worked on some small projects in Lean just for myself. But now with the advent of auto-formalization engines I see that one of the very hard obstructions to practically use them in one's particular idea is the lack of formalization of very simple concepts. Aristotle when asked to compute Kodaira type for an elliptic curve is really trying to invent Tate algorithm from scratch. This is super inefficient and makes the output code sometimes work but horribly inefficient.</p>",
        "id": 562131755,
        "sender_full_name": "Bartosz Naskręcki",
        "timestamp": 1764949650
    },
    {
        "content": "<p>In my mind a huge impending bottleneck in getting formalization to be a part of AI doing mathematics is the fact that there is an extremely long list of missing but actively-used-in-modern-research definitions in mathlib (which is streets ahead of the other maths libraries in most areas of modern research, so it's basically equivalent to claim that there's a long list of missing definitions in the union of all formalized libraries). We accelerated fast through undergraduate mathematics because although it needed some thought there was still a broad base of people who could formalize it. But the number of Lean experts who could formalize Tate's algorithm is -- what -- at most 20 people? And these people are typically professors busy teaching courses and not being rewarded for their formalization work, or PhD students working hard on other projects etc. As the work on AI solving Erdos problems recently indicates -- \"if you build it, they will come\". But we have to build it. And without it we run the risk of unverified AI slop becoming the norm.</p>",
        "id": 562133978,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1764950203
    }
]