[
    {
        "content": "<p>Hi everyone! I'm new to Lean and to this community. I've been working independently on formalizing two results connecting polyhedral geometry, number theory, and group theory. Both compile without \"sorry\" or custom axioms, but I have no formal training in theorem proving and I'm genuinely unsure whether I've made subtle errors in my definitions or proof structure. I'd really appreciate experienced eyes telling me if I've done this correctly.</p>\n<p>The two results:<br>\n<strong>1. Every prime is a forbidden harmonic.</strong> A forbidden harmonic degree of a rotation group G is a frequency ℓ admitting no G-invariant spherical harmonic. I prove that every prime is a forbidden degree of some finite rotation group (constructively, via hyperoctahedral groups B_n). The forbidden sets nest — Forb(T) ⊂ Forb(O) ⊂ Forb(I) — and the icosahedral group sits at the top, capturing all primes up to 29 = |I|/2 − 1. I prove the icosahedron is the unique Coxeter-derived rotation group (in any dimension) achieving maximal Molien saturation, and that the geometric obstruction forces supersingularity for the same ten primes through a triangle group bridge connecting Klein's j-function to the modular form spaces. At p = 37, the icosahedral structure can no longer saturate the modular form space, and the correspondence breaks.</p>\n<p>Paper: <a href=\"https://doi.org/10.5281/zenodo.18696119\">https://doi.org/10.5281/zenodo.18696119</a> Lean source: <a href=\"https://github.com/SteamPunkPhysics/Primes-as-Forbidden-Harmonics\">https://github.com/SteamPunkPhysics/Primes-as-Forbidden-Harmonics</a> Lean code DOI: <a href=\"https://doi.org/10.5281/zenodo.18695616\">https://doi.org/10.5281/zenodo.18695616</a></p>\n<p><strong>2. The unique forward-closed polyhedral loop.</strong> Starting from the tetrahedron, there is exactly one closed forward cycle through regular and semi-regular polyhedra using only rectification, dualization, stellation, continuous deformation, and subset extraction — no operation reversed. The path reaches the rhombic hexecontahedron (60-face saturation of the icosahedral group) and returns to the origin entirely through forward operations. Closure is forced by the identity φ⁸ + φ⁻⁸ = 47, with the fractional parts summing to exactly unity.</p>\n<p>Paper: <a href=\"https://doi.org/10.5281/zenodo.18616732\">https://doi.org/10.5281/zenodo.18616732</a> Lean source: <a href=\"https://github.com/SteamPunkPhysics/Polyhedral-Loop-Lean\">https://github.com/SteamPunkPhysics/Polyhedral-Loop-Lean</a> Lean code DOI: <a href=\"https://doi.org/10.5281/zenodo.18616695\">https://doi.org/10.5281/zenodo.18616695</a></p>\n<p>Any feedback is welcome — whether it's \"your definition doesn't capture what you think it does,\" \"this step is wrong,\" or just \"your Lean style needs work.\" I'm here to learn. Thanks!</p>",
        "id": 574704111,
        "sender_full_name": "Shiva Meucci",
        "timestamp": 1771500291
    },
    {
        "content": "<p>I looked at your first project.<br>\nGood news: Your project compiles and the main result depends on standard axioms only.<br>\nBad news: Your main result, after unfolding definitions, says:<br>\n<code>{2, 3, 5, 7, 11, 13, 17, 19, 23, 29} = {2, 3, 5, 7, 11, 13, 17, 19, 23, 29}</code><br>\nThere is literally no mathematical content in your main result.<br>\nIt begs the question: What's the point?</p>",
        "id": 574755401,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1771514429
    },
    {
        "content": "<p>Ack! Yes, thanks.</p>\n<p><strong>Where the Real Content Lives (and Why It Doesn't Count)</strong></p>\n<p>The project <em>does</em> contain real work:</p>\n<ul>\n<li>Individual proofs that each degree satisfies <code>IsForbiddenDegree</code> (actual semigroup arithmetic)</li>\n<li>The \"|Forb(G)| = |G|/4\" counting theorem</li>\n<li>The 7+4+4 decomposition, icosahedral uniqueness, etc.</li>\n</ul>\n<p>But these are <strong>side theorems that don't feed into \"main_theorem\"</strong>. The main theorem doesn't <em>depend</em> on the fact that the elements of \"forbI\" were proven forbidden — it just compares two pre-written lists.</p>\n<p>Okay. Yeah, that was dumb.</p>\n<p><strong>What Needs to Change</strong></p>\n<p>The formalization needs to be restructured so that \"forbI\" is <strong>computed from the predicate</strong>, not hardcoded</p>\n<p>The fundamental issue: the definitions that should be <em>theorems</em> are being treated as <em>definitions</em>. The supersingular primes are hardcoded as \"sspList\", the forbidden sets are hardcoded as \"forbI\". The mathematical content is in <em>why</em> those are the right sets, and that's exactly what's missing from the proof chain.</p>\n<p>Thanks so much for your help!!! (Geez this is a mess without another set of eyes. You can twiddle till compile and end up accomplishing nothing)</p>",
        "id": 574844635,
        "sender_full_name": "Shiva Meucci",
        "timestamp": 1771546320
    },
    {
        "content": "<p>Are you using an LLM to write your comments here?</p>",
        "id": 574844949,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1771546550
    },
    {
        "content": "<p>I use them to help me edit longer content and write more clearly. Is that a problem? Though honestly, since I've been writing articles for 20 years, there's not much of a difference between my style and an LLM. (people like me are who they got their style from after all)</p>\n<p>I hope you don't need me to typo, run-on, avoid punctuation, and poorly capitalize to feel human warmth. <br>\n(incidentally, I overuse parenthetical statements and don't use LLMs for short form communication like this)</p>",
        "id": 574855808,
        "sender_full_name": "Shiva Meucci",
        "timestamp": 1771554374
    },
    {
        "content": "<p>Or did you just want to point out you're better than me both morally and intellectually for not using new tools? </p>\n<p>I also can't use a slide rule and I'm sure you can, so I bow to your superiority, humbly beg your forgiveness, and still ask that you continue to provide guidance regardless of my unworthiness. :P</p>\n<p>Seriously though, I really do appreciate the help.</p>",
        "id": 574856110,
        "sender_full_name": "Shiva Meucci",
        "timestamp": 1771554656
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"1031284\">Shiva Meucci</span> <a href=\"#narrow/channel/113489-new-members/topic/New.20to.20Lean.20.E2.80.94.20did.20I.20formalize.20these.20proofs.20correctly.3F/near/574844635\">said</a>:</p>\n<blockquote>\n<p>Ack! Yes, thanks.</p>\n<p><strong>Where the Real Content Lives (and Why It Doesn't Count)</strong></p>\n<p>The project <em>does</em> contain real work:</p>\n<ul>\n<li>Individual proofs that each degree satisfies <code>IsForbiddenDegree</code> (actual semigroup arithmetic)</li>\n<li>The \"|Forb(G)| = |G|/4\" counting theorem</li>\n<li>The 7+4+4 decomposition, icosahedral uniqueness, etc.</li>\n</ul>\n<p>But these are <strong>side theorems that don't feed into \"main_theorem\"</strong>. The main theorem doesn't <em>depend</em> on the fact that the elements of \"forbI\" were proven forbidden — it just compares two pre-written lists.</p>\n<p>Okay. Yeah, that was dumb.</p>\n<p><strong>What Needs to Change</strong></p>\n<p>The formalization needs to be restructured so that \"forbI\" is <strong>computed from the predicate</strong>, not hardcoded</p>\n<p>The fundamental issue: the definitions that should be <em>theorems</em> are being treated as <em>definitions</em>. The supersingular primes are hardcoded as \"sspList\", the forbidden sets are hardcoded as \"forbI\". The mathematical content is in <em>why</em> those are the right sets, and that's exactly what's missing from the proof chain.</p>\n<p>Thanks so much for your help!!! (Geez this is a mess without another set of eyes. You can twiddle till compile and end up accomplishing nothing)</p>\n</blockquote>\n<p>To clarify,  you are standing by this being written by you and not an LLM? </p>\n<p>There is not necessarily a value judgement regarding using LLMs , no one is saying they are better or worse for it. But it is good to clarify and not ideal to obscure it, and in back and forth conversation it is respectful for the others to know that.</p>\n<p>I will also add LLM messages that border on being a middleman between the poster and their LLM are heavily discouraged here AFAIK. There is a spectrum on their use.</p>",
        "id": 574856500,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1771554987
    },
    {
        "content": "<p>Look. I'm 50. Is the robot emoji thing supposed to intimate I'm not real? I have a hard enough time dealing with all the weird chat tools, having the slightest idea what the right internet etiquette is, no less the sub-community etiquette and ten billion different hieroglyphics kids use to communicate. Can you just cut me some slack?</p>\n<p>I literally just found out I have a 70% blockage in my heart and I'd like to not stress over people being mean to me for no reason. Is that asking too much?</p>\n<p>And to Yan, no, that's a lot longer and more complex than just a conversation comment. It's an attempt to communicate complex ideas at the edge and beyond my personal abilities.</p>\n<p>Can I not be at the business end of a witch hunt within three posts in a new place?</p>\n<p>Why is my blood pressure through the roof right now just for the sin of daring to ask for help? How much do you need to shame me to feel satisfied? What is the exact amount of pain you need to inflict to let up and move forward?</p>",
        "id": 574856717,
        "sender_full_name": "Shiva Meucci",
        "timestamp": 1771555184
    },
    {
        "content": "<p>PS: Even the quoted section that was LLM edited was also human edited, transformed, and added to. ...just so you know I never just blindly interpose an LLM between me and other people. (but I am a prolific writer and writing things like \"ur\" is viscerally revolting to me)</p>",
        "id": 574858301,
        "sender_full_name": "Shiva Meucci",
        "timestamp": 1771556738
    },
    {
        "content": "<p>...oh, and thanks for removing the robot emoji from my third post. Sticking a robot on every post I was making felt particularly mocking.</p>",
        "id": 574869044,
        "sender_full_name": "Shiva Meucci",
        "timestamp": 1771564982
    },
    {
        "content": "<p>I can't speak for others, but from my perspective this community has had a lot of AI-generated/assisted content recently, and it can often feel like engaging with these posts has an energy imbalance — I like teaching people, but it doesn't feel great if people take what I say, copy it into an LLM, then reply with what it says, even if it's edited. It becomes impossible to tell if the person in the loop is learning anything if it's all being filtered through an LLM.</p>\n<p>I'm not saying this is what you're doing <span class=\"user-mention\" data-user-id=\"1031284\">@Shiva Meucci</span> — I'm just trying to give context that's hard to see as an individual among a rising sea of other AI users — please stick around, follow what's going on here, learn what you can from the community! Please don't take it personally if people here need some \"proof of work\" so to speak, that the time and attention is aiding a real person's learning efforts.</p>\n<p>How I've seen people use <span aria-label=\"robot\" class=\"emoji emoji-1f916\" role=\"img\" title=\"robot\">:robot:</span> is \"this looks AI generated\", not \"this is user isn't human\" (though we've seen a number of almost-surely non-human users!). I'll say this: I can recognize the ChatGPT style from my own overuse of it, and there's something unfocused and nonspecific about how it speaks about technical things that has been bugging me more and more. If I want to be bugged, I think I'd rather go and drink from the unfiltered source itself :-)</p>",
        "id": 574876624,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1771570616
    },
    {
        "content": "<p>Thanks so much for the explanation <span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span>. I can understand the issue of spam. (We all do)</p>\n<p>The question I have is this, though: As I said. I'm an older man. I learned C way back and a few other ancillary languages. I've had to put up with some python now that it's ubiquotous. I've learned a million little tools for all the various one-man-show things I have to do. I learned the whole field of neuroscience because my wife was doing her bachelors and I went to all the classes. I'm now in a production mode.</p>\n<p>Does it make sense for your community to reject my attempt to use this incredible contribution to the world called \"lean\" because I simply cannot add learning another language to my plate and ever accomplish my goals which are tangential to (but aligned with) the goals of the community?</p>\n<p><strong>Is it valueless</strong> for someone to help me build out a proof into the lean language instead of publishing it without lean? If I am possibly able to augment a History-of-Physics program with a mathematical proof in a way that could change our perspective on historical interpretations of physics - thus opening cracks through which new light can shine on the weird disconnects in today's program -  but then I \"merely\" use lean to show that it works while never <em>learning</em> lean and never intending to learn it, have I abused the trust or work of those in the community supporting and even creating this fabulous system for verification? </p>\n<p>(and is that a long enough sentence to show I didn't use LLM editing? lol)</p>\n<p>I think the answer is a resounding <em>no.</em></p>\n<p>So, yeah, I must admit I don't intend to learn the language well enough to be competent. I want to use it to do something else I'm doing which may in fact be very valuable and important - and it is my earnest belief that is so. Is that somehow off-putting? </p>\n<p>I <em>am</em> using other people's time with respect, appreciation, and only putting it towards something I value greatly. I put my own extreme effort into that same project but from an entirely different direction.</p>\n<p>I think the respect and value of the time of others and consideration of community effort is what is key, isn't it?</p>\n<p>I am never punching a few keys and walking away or putting in trivial effort while asking others to put in real effort. If I ask for the help of another, I will have always put in at least ten times more effort than they have beforehand because I understand and respect the value of another person's effort. I'm just not a taker like that.</p>\n<p>I know that's rarely the case and you can only use statistics and heuristics to decide how to use your time, but perhaps you can go just a hair easier on people using AI if they also seem to be putting in effort and respecting yours?</p>\n<p><em>...and incidentally, looking at your icon, I hope you love Kelvin as much as I do and did you know that J.J. Thomson produced the first workable physical explanation of atomic valence based on knot theory?? So cool.</em></p>",
        "id": 574886976,
        "sender_full_name": "Shiva Meucci",
        "timestamp": 1771575838
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"1031284\">Shiva Meucci</span> <a href=\"#narrow/channel/113489-new-members/topic/New.20to.20Lean.20.E2.80.94.20did.20I.20formalize.20these.20proofs.20correctly.3F/near/574886976\">said</a>:</p>\n<blockquote>\n<p>I will have always put in at least ten times more effort than they have beforehand because I understand and respect the value of another person's effort</p>\n</blockquote>\n<p>I think this community tends to recognize genuine effort and responds in kind. People are also really busy, and it can take awhile for the right people to pop in with help or advice.</p>\n<p>You should expect needing to get to a certain level of understanding and familiarity with Lean to make progress. The bare minimum is being able to read the definitions and theorem statements and to be able to evaluate for yourself whether these are accurate. This is something people will be happy to help with, but rather than \"here's a dozen files, please evaluate them\", I think tends to be more effective when people identify a gap in their own understanding and post here a self-contained 5-15 line snippet (a \"<a href=\"https://leanprover-community.github.io/mwe.html\">#mwe</a>\") that illustrates the issue.</p>\n<p>What I see in AI-written Lean projects with novice Lean users is that the AI has convinced the user that the project does what it says it does, partly by including many comments giving the illusion that something has been done, but the theorems are largely simple arithmetic with no real content. I read through a number of files, including <a href=\"https://github.com/SteamPunkPhysics/Primes-as-Forbidden-Harmonics/blob/main/ForbiddenHarmonics/Uniqueness.lean\">this one</a> for example, and the comments claim there are these proofs about finite reflection groups, but the Lean itself has no bearing on finite reflection groups — it's all a bit of natural number arithmetic. I'm sure this was all a reasonable amount of effort on your part, but, please don't take this the wrong way, I'm sorry to say that it appears that the AI's fooled you :-( I looked through 10-15 files between the two projects, looking for anything, but there's no content, except for two things: (1) a couple identities involving the golden ratio, and (2) an inefficient version of Euclid's algorithm. This might not be the feedback you were hoping for.</p>\n<p>I don't believe this community <em>rejects</em> casual Lean users at all. I think it's likely that if you start this project from the beginning and develop it step-by-step in the open, you'll get useful feedback and help.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"1031284\">Shiva Meucci</span> <a href=\"#narrow/channel/113489-new-members/topic/New.20to.20Lean.20.E2.80.94.20did.20I.20formalize.20these.20proofs.20correctly.3F/near/574886976\">said</a>:</p>\n<blockquote>\n<p>I hope you love Kelvin as much as I do and did you know that J.J. Thomson produced the first workable physical explanation of atomic valence based on knot theory??</p>\n</blockquote>\n<p>I've enjoyed the stories of the origin of knot theory via the vortex model of the atom. Gauss too was an early investigator; I understand he studied the magnetic fields of knotted loops of current.</p>",
        "id": 574897708,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1771579579
    },
    {
        "content": "<p>As <span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> just said, it seems to be the case that the AI has fooled you. And it would be better to find out that you cannot trust the AI on a small example, before you share two large projects where there is suddenly \"too much to unpack\".</p>",
        "id": 574951178,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1771597122
    },
    {
        "content": "<p>My honest tip for beginners who want to use AI with Lean is to, at the very least, learn enough to write the definitions and the theorem statements <em>by hand</em>, leaving theorem proofs as <code>sorry</code>s. This way, one is forced to know what the code is talking about.</p>\n<p>Then ask for help from AI to replace <code>sorry</code>s by actual proofs. Here, you might find out that AI will sometimes struggle to get things correct. It often spits proofs that aren't accepted by Lean.</p>\n<p>Important: asking for feedback on your handwritten definitions and theorem statements is <em>absolutely fine</em>. Sometimes, even when you encode the right idea (mathematically speaking), it might not be the best design choice for a theorem prover. And the community has members with enough experience to help you there.</p>",
        "id": 574959240,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1771599132
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"451983\">Arthur Paulino</span> <a href=\"#narrow/channel/113489-new-members/topic/New.20to.20Lean.20.E2.80.94.20did.20I.20formalize.20these.20proofs.20correctly.3F/near/574959240\">said</a>:</p>\n<blockquote>\n<p>My honest tip for beginners who want to use AI with Lean is to, at the very least, learn enough to write the definitions and the theorem statements <em>by hand</em>, leaving theorem proofs as <code>sorry</code>s. This way, one is forced to know what the code is talking about.</p>\n</blockquote>\n<p>There's one problem with this: proving is exactly how you understand and tweak definitions.</p>\n<p>My advice is a bit different and more general: don't use AI to do something you don't see how to do yourself.</p>",
        "id": 575005357,
        "sender_full_name": "suhr",
        "timestamp": 1771611963
    },
    {
        "content": "<p>Thanks for the advice! </p>\n<p>This is something where I took on a bit more than I could handle in an already far overtaxed workload and it might be a case for paying more attention to the Icarus story. If I could bother any of you for just one more cursory eval, it could really help me gauge the distance I can take this and the value (or acute lack thereof) of the previous workflow and how far I am from goal. I might have to face that it may just demand more than what I can take on at the moment. I'd hate that, but forward momentum often requires letting go of some idealism.</p>\n<p>The 2nd proof on this list was much simpler.  (As a paper) It was the first. Is it just as bad? It seems you can kinda tell at a glance because of your experience. I presented them in reverse order because the second was the one I had the least confidence in. If the first is just as bad off then I need to take a very big step back.</p>\n<p>Lean has gotten a reputation for \"if you make it compile, it's worthwhile.\" ...and that's obviously just not even remotely true. Seems like maybe it needs a tautology checker like checking for sorryAx?</p>",
        "id": 575049753,
        "sender_full_name": "Shiva Meucci",
        "timestamp": 1771635842
    },
    {
        "content": "<p>Lean has such things, see <a href=\"https://leanprover-community.github.io/did_you_prove_it.html\">https://leanprover-community.github.io/did_you_prove_it.html</a> and <a href=\"https://github.com/leanprover/comparator\">https://github.com/leanprover/comparator</a> (but not for tautology AFAIK)</p>",
        "id": 575049953,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1771636049
    },
    {
        "content": "<p>Could you point at where you want help at? Which theorem?</p>",
        "id": 575050053,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1771636172
    },
    {
        "content": "<p>Since I (too easily) believed everything was working, this whole proof chain is now suspect.  When you think everything is okay, it's hard to know where to start to look for what's wrong. This should be mostly (fairly) straight forward geometry in <em>most</em> of the files. I'm not re-proving Klien etc. </p>\n<p>I guess the place that is most suspect might be the top-level Synthesis? If the steps are defined with named endpoints and closure is proved by \"rfl/simp\", that could collapse to “the path we wrote down is closed,” not “the constraints force this path/terminal point,” right? </p>\n<p>...but in general, if the whole damn thing is a mess instead of specific difficult points, then it's probably best to just give up the whole endeavor.</p>\n<p><a href=\"https://github.com/SteamPunkPhysics/Polyhedral-Loop-Lean\">https://github.com/SteamPunkPhysics/Polyhedral-Loop-Lean</a></p>",
        "id": 575051471,
        "sender_full_name": "Shiva Meucci",
        "timestamp": 1771637553
    }
]