[
    {
        "content": "<p>Hello and pleased to meet you! Im new to the community, sorry if im already doing something wrong.<br>\nIm aiming to learn lean while contributing, if this is possible/positively accepted?<br>\nSo basically im interested:<br>\n1) If I can choose some topics I like and want to dig into <br>\n2) If I can do some small lemmas and contribute them to the library<br>\nIs there a person I ask for where to go or a topic may be?</p>",
        "id": 562198465,
        "sender_full_name": "Anotherpieceofmyhead",
        "timestamp": 1764978220
    },
    {
        "content": "<p>This is the wrong channel. This post should ideally go to the <a class=\"stream\" data-stream-id=\"113489\" href=\"/#narrow/channel/113489-new-members\">#new members</a> channel</p>",
        "id": 562201364,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1764980678
    },
    {
        "content": "<p>But in order to avoid duplication I hope one of the moderators will move this topic to that channel</p>",
        "id": 562201395,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1764980708
    },
    {
        "content": "<p>In the meantime, it is helpful to know what areas of math you are fluent in</p>",
        "id": 562201440,
        "sender_full_name": "Shreyas Srinivas",
        "timestamp": 1764980752
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Newcomer.20where-to-go\">#mathlib4 &gt; Newcomer where-to-go</a> by <span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span>.</p>",
        "id": 562201445,
        "sender_full_name": "Notification Bot",
        "timestamp": 1764980761
    },
    {
        "content": "<p>oopsie, thanks for moving the topic to the right channel! <br>\nIm pretty confident in number theory (at least everything for understanding how RSA work), abstract algebra (rereading Aluffis Chptr 0 now), set theory and a bit of topology, open to learn new things (looking forward for categories/algebraic topology/homology stuff)</p>",
        "id": 562250965,
        "sender_full_name": "Anotherpieceofmyhead",
        "timestamp": 1765038186
    },
    {
        "content": "<p>In my experience, the way to contribute is to pick a specific low/medium-sized thing to formalize, e.g. pick a theorem from <a href=\"https://topology.pi-base.org/theorems\">https://topology.pi-base.org/theorems</a> or a mathoverflow undergrad answer, and on the way to the result you'll both learn Lean and become more comfortable with the relevant area of Mathlib, and you'll find many small lemmas that are missing.<br>\nFor an extreme example, formalizing IMO geometry problems reveals a ton of missing geometry lemmas; look at the huge list of dependencies in <a href=\"https://github.com/leanprover-community/mathlib4/pull/32295\">#32295</a></p>",
        "id": 562252491,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1765040024
    },
    {
        "content": "<p>Since you mentioned number theory, here's a list of classes of numbers that I think are missing from Mathlib:</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Primitive_abundant_number\">Primitive abundant number</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Highly_abundant_number\">Highly abundant number</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Superabundant_number\">Superabundant number</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Highly_composite_number\">Highly composite number</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Colossally_abundant_number\">Colossally abundant number</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Superior_highly_composite_number\">Superior highly composite number</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Primary_pseudoperfect_number\">Primary pseudoperfect number</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Practical_number\">Practical number</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Harshad_number\">Harshad/Niven numbers</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Safe_and_Sophie_Germain_primes\">Safe and Sophie Germain primes</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/File:Euler_diagram_numbers_with_many_divisors.svg\">Diagram of many of these classes</a></li>\n<li><a href=\"https://mathoverflow.net/questions/500941/proof-of-every-highly-abundant-number-greater-than-3-is-even\">Mathoverflow proof you can formalize about them</a></li>\n</ul>\n<p>It's half number theory and half recreational math, but I think Mathlib could benefit from having more of these.<br>\nMost of them should go in <a href=\"https://github.com/leanprover-community/mathlib4/blob/371379bb9ea102e32992dd9f7c7eb34c9ca2fc2e/Mathlib/NumberTheory/FactorisationProperties.lean\"><code>Mathlib/NumberTheory/FactorisationProperties.lean</code></a>.</p>",
        "id": 562252964,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1765040543
    },
    {
        "content": "<p>So, to sum it up:<br>\nI can go to the <br>\n-Stacks project<br>\n-nlab<br>\n-proofwiki<br>\n-mentioned here pi-base<br>\n-libraries of another provers like Isabelle and Metamath or CoQ<br>\n-even my Aluffi book</p>\n<p>look if something is absent in lean and do work on it?</p>",
        "id": 562312357,
        "sender_full_name": "Anotherpieceofmyhead",
        "timestamp": 1765118403
    },
    {
        "content": "<p>Im asking because the part where I do check if the theorem is already in lean or not sounds pretty time consuming, so if there is a list  like \"do lemmas x y z from here and here\" it would be nice to know before I dig</p>",
        "id": 562312974,
        "sender_full_name": "Anotherpieceofmyhead",
        "timestamp": 1765119137
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"660233\">Anotherpieceofmyhead</span> <a href=\"#narrow/channel/113489-new-members/topic/Newcomer.20where-to-go/near/562312974\">said</a>:</p>\n<blockquote>\n<p>if there is a list  like \"do lemmas x y z from here and here\" it would be nice to know before I dig</p>\n</blockquote>\n<p>What about the list I sent?</p>",
        "id": 562321842,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1765128002
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"660233\">@Anotherpieceofmyhead</span> To be fair I also have that problem in what to formalise. Most of the stuff in pretty hard to formalise in Mathlib generality for me and I am looking for easy and low hanging fruits.</p>\n<p>I don't know if anyone is working on them but how would you like formalising probability distributions. <a href=\"https://en.wikipedia.org/wiki/List_of_probability_distributions\">https://en.wikipedia.org/wiki/List_of_probability_distributions</a> There's a big list, (almost <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>) surely that should be useful.</p>",
        "id": 562324654,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1765130946
    },
    {
        "content": "<p>I think probability is a bit difficult for someone new to Lean, but if you're up for it you can start by reading <a href=\"https://leanprover-community.github.io/blog/posts/basic-probability-in-mathlib/\">this blog post</a>.<br>\nI think <a href=\"https://github.com/leanprover-community/mathlib4/tree/bcc3f989a77e2a870a307235d3ef9f1025992c55/Mathlib/Probability/Distributions\">this</a> is the home of all probability distributions in Mathlib, maybe you can knock off more from the list.</p>",
        "id": 562324974,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1765131246
    },
    {
        "content": "<p>I think the first few project doesn't need to aim for Mathlib generality as a whole. You can try formalizing (a special case of) a theorem as its own project, and during the process you will likely discover missing lemmas in mathlib, which are easier to formalize in Mathlib generality and suitable for contribution.</p>",
        "id": 562324999,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1765131272
    },
    {
        "content": "<p>I think that targeting mathlib for a first project is no longer a reasonable approach, things are very different to a few years ago and most of the low-hanging fruit is long gone. I just tell my students to find a theorem they like and prove it, and don't worry at all about whether it's already in the library. Writing code is the way to learn.</p>",
        "id": 562325263,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765131594
    },
    {
        "content": "<p>I think that if I were assigned a PR proposing adding some random class of number like primary pseudoperfect number or whatever, I would be sorely tempted to just close it as not something we particularly want in the library unless I could see a clear application.</p>",
        "id": 562325382,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765131748
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113489-new-members/topic/Newcomer.20where-to-go/near/562325382\">said</a>:</p>\n<blockquote>\n<p>I think that if I were assigned a PR proposing adding some random class of number like primary pseudoperfect number or whatever, I would be sorely tempted to just close it as not something we particularly want in the library unless I could see a clear application.</p>\n</blockquote>\n<p>I guess that depends on what you classify as \"random\", but you did approve <a href=\"https://github.com/leanprover-community/mathlib4/pull/14269\">#14269</a>. <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Nat.Weird#doc\">docs#Nat.Weird</a> isn't used for anything.<br>\nDoesn't a theorem such as <a href=\"https://mathoverflow.net/questions/500941/proof-of-every-highly-abundant-number-greater-than-3-is-even\">every highly abundant number above 3 is even</a> count as an application?<br>\nI agree if we're talking about a random number class that has a single paper about it and just happens to have a Wikipedia page, but much like the 1000+ theorems list, isn't having a medium-sized Wikipedia article a witness to the number class not being super random?</p>",
        "id": 562326509,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1765133147
    },
    {
        "content": "<p>Here's another number theory (adjacent?) project suggestion: prove that all the definitions of a <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/FieldTheory/Perfect.html#PerfectField\">perfect field</a> on <a href=\"https://en.wikipedia.org/wiki/Perfect_field\">Wikipedia</a> are equivalent. I'm not sure which ones already exist (I did find <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=perfectField_iff_splits_of_natSepDegree_eq_one#doc\">docs#perfectField_iff_splits_of_natSepDegree_eq_one</a> in another file) but for example \"The separable closure of k is algebraically closed\" only has one side of the implication (search <code>PerfectField, IsSepClosure</code> on <a href=\"https://loogle.lean-lang.org/\">#loogle</a>).</p>",
        "id": 562327206,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1765133966
    },
    {
        "content": "<p>I think that I am nowadays very much on the side of \"if there isn't a recent research paper in the Annals of Mathematics about it then why are we bothering with it\" side of things; other maintainers have far more liberal views. I have found that targetting the mathematics being done by experts is the most profitable way of growing mathlib and this is now possible but it's in general difficult for beginners to do. My personal feeling is that moving in any other direction is wasting reviewer time. But as I say I am only one of 30 or so maintainers.</p>\n<p>Developing more of the theory of perfect fields would be a great project. The issue with getting a beginner up to mathlib-contribution level if they don't have a local expert to hand is that it's again a very inefficient way of making progress. This is why I usually encourage beginners (for example the 30 people taking Imperial's formalization course every year) to just work on a project of their own choosing and not to target mathlib until they are proficient.</p>",
        "id": 562328492,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765134848
    },
    {
        "content": "<p>Some fields (e.g. combinatorics) tend to make more use of specialist journals and less of generalist journals; I don't think the culture of where people tend to publish in different fields is a particularly good basis for deciding what goes in mathlib (or, when we have multi-repository mathlib, what goes in the core mathlib repository versus one of the sub-mathlibs).</p>",
        "id": 562370617,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1765152256
    },
    {
        "content": "<p>I think Kevin's statement should be broadened to \"Annals or a similar top-tier journal in the respective field\" --- my impression is that this is what's meant anyway, and looking at the Annals is a starting point, not the final list.</p>",
        "id": 562434233,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1765190461
    },
    {
        "content": "<p>By that logic no progress can happen in graph theory in Mathlib. Surely none of the basic work from the 1700s has appeared in journals recently. We will hopefully get there, but your bar is super high, it's like you're saying that if a graph theory lemma doesn't help proving Robertson-Seymour then it should be deleted.<br>\nFor a silly example, I've added a proof that a graph is either connected or its complement is (<a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=SimpleGraph.connected_or_connected_compl#doc\">docs#SimpleGraph.connected_or_connected_compl</a>) and it probably won't be used to prove any result from a recent research paper.</p>",
        "id": 562540054,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1765220729
    },
    {
        "content": "<p>Well you will be pleased to know that plenty of other maintainers have plenty of other views. I'm just presenting my personal, rather extreme, and highly outspoken viewpoint which conforms to my personal goals for mathlib (get it to the point where it understands fashionable modern research as quickly as possible because that's where the big prizes are) rather than the community's goals (which seem to me to be ill-defined but certainly for some maintainers will include formalizing random stuff because they are happy with small prizes).</p>\n<p>But let's get back to the point. The OP is asking how they might contribute. I am saying \"please no more PRs adding random predicates on naturals for no good reason\" but that's a negative response. Perhaps a more positive response is \"which areas of mathematics are you an expert in? What are the challenging problems in your area? Can you work towards those? Can we even state them?\".</p>",
        "id": 562541662,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765221399
    },
    {
        "content": "<p>Regarding your example: I believe that \"obvious\" little lemmas have a tendency to show up when you don't expect them --- as long as the statement is a reasonable lemma about objects we find interesting, that might already suffice. (For new definition, I'd be more careful.)</p>",
        "id": 562543065,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1765221931
    },
    {
        "content": "<p>wow, that was a pretty long \"if you are not proficient enough you are not very much needed we have an army of bachelors for that ourselves\" topic, thanks for participating, I guess.<br>\nIll stick to <span class=\"user-mention\" data-user-id=\"933054\">@Snir Broshi</span> links and recommedations, thanks. Anyways Ill also go through Aluffis book, so may be there are one or two lemmas that were forgotten.</p>",
        "id": 562563892,
        "sender_full_name": "Anotherpieceofmyhead",
        "timestamp": 1765230365
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"660233\">Anotherpieceofmyhead</span> <a href=\"#narrow/channel/113489-new-members/topic/Newcomer.20where-to-go/near/562563892\">said</a>:</p>\n<blockquote>\n<p>wow, that was a pretty long \"if you are not proficient enough you are not very much needed we have an army of bachelors for that ourselves\" topic, thanks for participating, I guess.<br>\nIll stick to <span class=\"user-mention silent\" data-user-id=\"933054\">Snir Broshi</span> links and recommedations, thanks. Anyways Ill also go through Aluffis book, so may be there are one or two lemmas that were forgotten.</p>\n</blockquote>\n<p>I wouldn’t put it so bleakly, it is more that there are very few lean experts with very little time to fully mentor/teach new people, relative to the number of new people. And there are already so many pull requests into Mathlib as is.</p>\n<p>That first part of the comment kind of describes interactions of mutual interest in general, and I think for most lean experts it is a fully selfless thing to spend their time mentoring someone very new.  </p>\n<p>For example , to practice I chose to formalise some things about algebraic wheel theory. Even though it’s missing , I knew the entire time this has no place or interest to be in Mathlib. I think the moral is that you can formalise new things , without it being linked to Mathlib.</p>\n<p>For my own learning , since there are sparse resources , I also just review merged pull requests into Mathlib and read all the reviewer comments and discussion etc. Can learn a lot that way and eventually if you want you might end up doing something with Mathlib .</p>\n<p>Also keep in mind there are lots of smaller projects you can try join</p>",
        "id": 562564809,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1765230797
    },
    {
        "content": "<p>Keep in mind that the beginners of today become the experts of tomorrow. </p>\n<p>I started lean about a year ago and due to the many questions I asked during that time I became a lot more proficient at it.<br>\nThanks to some help from more experienced users (in particular <span class=\"user-mention\" data-user-id=\"816344\">@Aaron Liu</span> and <span class=\"user-mention\" data-user-id=\"110064\">@Kenny Lau</span> but also many more) which gracefully took their time to answer my sometimes silly questions I got good enough to answer simpler questions to newer users.</p>\n<p><span class=\"user-mention\" data-user-id=\"660233\">@Anotherpieceofmyhead</span>  Here's something which you can do, if you don't mind busywork. I find that there are tons of lemmas in the library that are missing grind annotations. Sometimes in my work grind is very smart and shortens a 10 line proof to one grind call. Sometimes it's not so smart and that's usually where some grind annotations might be missing. I'm still baffled how good grind is. Adding the correct grind annotations and making it even smarter for everyone downstream would even be better.</p>",
        "id": 563431165,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1765532473
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"660233\">Anotherpieceofmyhead</span> <a href=\"#narrow/channel/113489-new-members/topic/Newcomer.20where-to-go/near/562563892\">said</a>:</p>\n<blockquote>\n<p>wow, that was a pretty long \"if you are not proficient enough you are not very much needed we have an army of bachelors for that ourselves\" topic, thanks for participating, I guess.</p>\n</blockquote>\n<p>I do realise that my comments come across as harsh. I have thought quite a bit about this thread since making them, not least because I wanted to understand why I instinctively gave such a hostile answer. I think that a perhaps more reasonable way of presenting my thoughts on \"I'm new, how do I contribute to mathlib\" is perhaps this.</p>\n<p>Say I just learnt about C++ and thought \"wow, this is a great language\". Should my next thought be \"I want to make C++ better, how do I contribute to the C++ language\" and obviously this isn't the right idea at all; the C++ languge is maintained by a small group of experts and someone who's just come across it isn't yet ready to start changing the language itself. The correct thing to think next is \"I want to learn more about C++, maybe I should make some C++ projects of my own\". </p>\n<p>Similarly here, I think the next step after \"I've just discovered Lean\" is to choose a topic which you personally are interested in and to develop some of the theory yourself in your own project without worrying at all about contributing to a library. So basically answer (1) in your original message.</p>\n<p>The background to my original answer, which was basically \"please don't do (2)\" but expressed more harshly, is that I personally feel that mathlib is currently overwhelmed with people making random contributions which I feel is having a detrimental impact on the ecosystem, creating reviewer burden with very little obvious gain in terms of the big goals which the community has, and that it's already extremely hard work trying to get on top of this problem.</p>",
        "id": 563439275,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765535031
    },
    {
        "content": "<blockquote>\n<p>I want to make C++ better, how do I contribute to the C++ language</p>\n</blockquote>\n<p>The funny thing is, I know a person who did exactly that.</p>",
        "id": 563447807,
        "sender_full_name": "suhr",
        "timestamp": 1765537528
    },
    {
        "content": "<p>But you don't start with contributing into C++ language, you start with diving into a C++ compiler and figuring out how to do thing you you want to do.</p>",
        "id": 563448260,
        "sender_full_name": "suhr",
        "timestamp": 1765537659
    },
    {
        "content": "<p>And unlike a compiler, there's not much difference between adding definitions to your fork of Mathlib and adding definitions to your own library that uses Mathlib. But the later is easier to maintain.</p>",
        "id": 563449047,
        "sender_full_name": "suhr",
        "timestamp": 1765537927
    },
    {
        "content": "<p>Suppose I wanted to ask \"how do I contribute to mathematics?\" Well, I have two options. One option is I could go look in the various mathematics research journals that are being published out there and start learning about the maths that's going on there. After some years I learn enough and maybe I'm able to make a contribution to a research journal. But if I choose this path then I probably won't be able to contribute directly to the journal while I'm still learning, I'll maybe have to start with learning from a textbook. The other option is that maybe after looking in these journals I decide it doesn't really interest me, and what really interests me is to, say, contribute to a recreational maths website/magazine, or an online database of my liking, etc etc (nowadays there are so many places online where one can make a contribution). That's perfectly fine and it could be way more fun as well. In this option you might not always be able to contribute to all those journals from before, but this is simply because these journals have their own editorial considerations (someone has to look through your contribution, after all). Either way, you're still contributing to mathematics nonetheless. </p>\n<p>It's really no different for Lean. And in fact the great news is it probably doesn't take years to be able to contribute to mathlib, <em>and</em> there's already a wonderful online textbook to start with called <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">Mathematics in Lean</a>. The best advice, as already mentioned above, is to start with any piece of mathematics you're really interested in, and try to write that in Lean (and once you've tried some code you can even ask questions or get feedback on zulip, something you don't normally get that often in learning traditional mathematics). Whether your code eventually ends up in mathlib or another repository, you've still contributed to the entire Lean ecosystem and community nonetheless.</p>",
        "id": 563458642,
        "sender_full_name": "Bryan Wang",
        "timestamp": 1765541198
    },
    {
        "content": "<p>I would draw a distinction between wanting to PR superduperabundantnumbers or whatever, and wanting to PR basic results about commonly-used objects without necessarily having a plan to connect that result to a piece of modern maths. I'm not a maintainer and have no say in the goals of Mathlib, but surely the latter is the entire point of Mathlib?</p>",
        "id": 564143230,
        "sender_full_name": "Artie Khovanov",
        "timestamp": 1765923800
    },
    {
        "content": "<p>Contributing API lemmas which look useful is usually welcome. Indeed I opened a PR today <a href=\"https://github.com/leanprover-community/mathlib4/pull/32975\">#32975</a> which does just this -- because it came up in my own work and it seemed to be missing. Note that I discussed it beforehand here <a href=\"#narrow/channel/217875-Is-there-code-for-X.3F/topic/countable.20fibres.2C.20countable.20target.20.3D.3E.20countable.20source/near/563455378\">#Is there code for X? &gt; countable fibres, countable target =&gt; countable source @ 💬</a> . The thing which caused my visceral reaction above was the long list of <em>definitions</em>. A PR making a definition is much harder to review than a PR which just proves lemmas, because each definition comes with a cost (making all the lemmas to make it useful) and a possibly hard question (\"is this the idiomatic way to capture this idea in Lean's type theory?\"). Lemmas are cheap as long as the proofs compile quickly.</p>",
        "id": 564144306,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765924422
    },
    {
        "content": "<p>I understand, thanks for explaining. Not looking forward to the inevitable wave of \"low hanging fruit\" AI slop definitions..</p>",
        "id": 564144790,
        "sender_full_name": "Artie Khovanov",
        "timestamp": 1765924676
    },
    {
        "content": "<p>If you were a moderator you'd get to see far more of the AI slop posts we're already frantically deleting!</p>",
        "id": 564145237,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1765924916
    },
    {
        "content": "<p>Yeah I wouldn't wish it on anyone</p>",
        "id": 564146608,
        "sender_full_name": "Artie Khovanov",
        "timestamp": 1765925818
    }
]