[
    {
        "content": "<p>Hi everyone! <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> I'm Lionel, a mathematician/computer scientist. I've recently published a proof that no non-trivial cycles exist in the Collatz conjecture (extending Garner's 1981 approach via simple induction). Paper: Advances in Pure Mathematics (2025), DOI: 10.4236/apm.2025.156018 Link: <a href=\"https://www.scirp.org/journal/paperinformation?paperid=143316\">https://www.scirp.org/journal/paperinformation?paperid=143316</a> Main result: σ(s)=ω(s) for all n∈ℕ (where ω is Garner's coefficient stopping time). This directly implies no non-trivial cycles can exist. I'm new to Lean but very interested in formalizing this proof. I've started the Natural Number Game and understand the basics. Key lemma to formalize: Sequences s and 2^n·m+s have identical dynamics for the first n iterations, which enables a simple induction proof. Questions: 1. Would anyone be interested in collaborating on this formalization? 2. What's the best approach for formalizing an induction-based argument like this? Looking forward to learning from this community! Best, Lionel</p>",
        "id": 569869784,
        "sender_full_name": "Lionel Laurore",
        "timestamp": 1769263312
    },
    {
        "content": "<p><a href=\"#narrow/channel/113489-new-members/topic/No.20non-trivial.20cycles.20exist.20in.20the.20Collatz.20conjecture/near/569863592\">A message</a> was moved here from <a class=\"stream-topic\" data-stream-id=\"113489\" href=\"/#narrow/channel/113489-new-members/topic/Ortogonal.20projection.20of.20point.20onto.20line.2Fplane.2Fetc.2E/with/569869784\">#new members &gt; Ortogonal projection of point onto line/plane/etc.</a> by <span class=\"user-mention silent\" data-user-id=\"658873\">Ilmārs Cīrulis</span>.</p>",
        "id": 569870016,
        "sender_full_name": "Notification Bot",
        "timestamp": 1769263498
    },
    {
        "content": "<p><a href=\"#narrow/channel/113489-new-members/topic/No.20non-trivial.20cycles.20exist.20in.20the.20Collatz.20conjecture/near/569869784\">A message</a> was moved here from <a class=\"stream-topic\" data-stream-id=\"113489\" href=\"/#narrow/channel/113489-new-members/topic/Ortogonal.20projection.20of.20point.20onto.20line.2Fplane.2Fetc.2E/with/569860799\">#new members &gt; Ortogonal projection of point onto line/plane/etc.</a> by <span class=\"user-mention silent\" data-user-id=\"658873\">Ilmārs Cīrulis</span>.</p>",
        "id": 569870070,
        "sender_full_name": "Notification Bot",
        "timestamp": 1769263546
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1019279\">@Lionel Laurore</span> you are claiming a major result and the proof is not in a major journal (in fact it is in a journal which charges $699 in publishing fees), so it is probably not unreasonable for the null hypothesis still to be that there might be an error in the work. It is thus probably too premature to ask for a Lean formalization of the work. The way to make progress here is first to make what we in this community call a <em>formal blueprint</em> of the work, which is a document which is far longer than the paper and contains every single detail of all the arguments. But this is something which you should do yourself, before trying to recruit volunteers from this community.</p>",
        "id": 569871311,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1769264455
    },
    {
        "content": "<p>An example of a formal blueprint is <a href=\"https://teorth.github.io/pfr/blueprint/\">here</a>. It is a hybrid LaTeX/Lean document, but the LaTeX part comes first, and the LaTeX part is a carefully-documented and complete proof, containing full details or precise references for every assertion made. The way to get going with this is to use the Lean Project template here <a href=\"https://github.com/leanprover-community/LeanProject\">https://github.com/leanprover-community/LeanProject</a> and follow the instructions in the README. You have a long way to go before you're ready to write Lean code; what the community needs first is a LaTeX blueprint, which should be written by you as the person who understands the argument.</p>\n<p>The risk of launching straight into Lean code is that then you end up with thousands of lines of Lean code which will become worthless if an error is found in the argument and the error cannot be fixed. But the process of discovering the error is essentially always found in the blueprint phase of the formalization process, rather than in the actual writing of the Lean code. In my experience, it's not Lean that finds the errors, it's the humans preparing the way.</p>",
        "id": 569871859,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1769264818
    },
    {
        "content": "<p>@Kevin Buzzard. Thank you for your reply. I should clarify that my APM paper is a full-length article (about 40 pages in the published version) with complete definitions and detailed proofs. </p>\n<p>In my initial message I only summarized the result, which may have given the impression that the work was short or informal. I fully understand that a Lean blueprint would require a much more granular document, which is indeed a separate step.</p>\n<p>I appreciate your explanation of the community standards.</p>",
        "id": 569886340,
        "sender_full_name": "Lionel Laurore",
        "timestamp": 1769272985
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"1019279\">Lionel Laurore</span> <a href=\"#narrow/channel/113489-new-members/topic/No.20non-trivial.20cycles.20exist.20in.20the.20Collatz.20conjecture/near/569869784\">said</a>:</p>\n<blockquote>\n<p>identical dynamics</p>\n</blockquote>\n<p>What does \"identical dynamics\" mean? Does it just mean that the terms at the same position are either both odd or both even?</p>",
        "id": 569921634,
        "sender_full_name": "Bbbbbbbbba",
        "timestamp": 1769311440
    },
    {
        "content": "<p>Discussion of the proof is definitely off-topic on this forum. Feel free to take it to DMs.</p>",
        "id": 569941049,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1769332781
    }
]