[
    {
        "content": "<p>I think I'm confused as to what <code>noncomputable theory</code> does. I thought that having <code>noncomputable theory</code> at the top of a file means that you don't have to add <code>noncomputable</code> explicitly anymore.</p>\n<p>However, <a href=\"https://github.com/leanprover-community/mathlib/pull/5869/commits/970c7544b780451637c38302b3e10fae291fa896\">this commit</a> implements a suggestion I made to remove <code>noncomputable</code> from a <code>def</code> in a file that starts with <code>noncomputable theory</code> and Lean complains.</p>",
        "id": 225599391,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1612814488
    },
    {
        "content": "<p>what is the goal of letting certain functions be non computable? for example log? is it telling lean to not compute that value?</p>",
        "id": 444594583,
        "sender_full_name": "Pietro Lavino",
        "timestamp": 1718330770
    },
    {
        "content": "<p>There's useful stuff that can be reasoned about in Lean's theory, but can't actually be computed. The big one is <code>choice</code>. The <code>noncomputable</code> keyword is a viral marker that allows for a relatively clean separation of the computable and noncomputable parts, to prevent users from finding out at runtime that they accidentally relied on something that can't be computed.</p>",
        "id": 444599214,
        "sender_full_name": "Chris Bailey",
        "timestamp": 1718333813
    },
    {
        "content": "<p>If I’m not mistaken, it also saves the code generator the trouble of trying unsuccessfully to compile your definition to code for the VM, so it should speed things up a little too, and make your .olean slightly smaller. As for why <code>log</code> is non-computable, that is because classically defined real numbers are violently uncomputable, even testing for equality is undecidable. Coq has a neat little library for computable real analysis if you want to take a look at how one might go about it</p>",
        "id": 444674798,
        "sender_full_name": "Luigi Massacci",
        "timestamp": 1718362918
    }
]