[
    {
        "content": "<p>Hi all, does anyone know if there is a good comprehensive course in Lean 4 online or in any uni you could recommend? Video or live lectures would be great to get more personal with the overall ideas behind this language. And yes, I have already read big parts of the <a href=\"https://lean-lang.org/theorem_proving_in_lean4\">https://lean-lang.org/theorem_proving_in_lean4</a> and small parts of <a href=\"https://lean-lang.org/doc/reference/latest\">https://lean-lang.org/doc/reference/latest</a>.</p>",
        "id": 517785776,
        "sender_full_name": "Plamen Dimitrov",
        "timestamp": 1747130181
    },
    {
        "content": "<p>I don't have an answer but are you looking for a more mathematical or more CS introduction?</p>",
        "id": 517788081,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747130850
    },
    {
        "content": "<p>I have already taken some lectures in type theory as well as proof theory so the emphasis I would love to see would be strictly on using and completing proofs with Lean 4 - even hands-on workshop with the language would be really nice to have.</p>",
        "id": 517789434,
        "sender_full_name": "Plamen Dimitrov",
        "timestamp": 1747131290
    },
    {
        "content": "<p>Yes but do you want to see proofs about lists and types and arays or about topological vector spaces and schemes?</p>",
        "id": 517795337,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747133220
    },
    {
        "content": "<p>I think the topological vector spaces are rather a more advanced topic here related to homotopy type theory. I am fine seeing proofs about lists, natural numbers, and hopefully involving at least some type classes (e.g. from order theory ) in order to get a the overall feel about the language. Of course I am aware the choice is likely not going to be particularly large so any kind of lectures or workshops involving Lean 4 would be welcome.</p>",
        "id": 517802176,
        "sender_full_name": "Plamen Dimitrov",
        "timestamp": 1747135293
    },
    {
        "content": "<p>I assume no one has any ideas / suggestions?</p>",
        "id": 519274820,
        "sender_full_name": "Plamen Dimitrov",
        "timestamp": 1747708944
    },
    {
        "content": "<p>I think you might be interested in <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a>, which gets you doing actual math in Lean as fast as possible. The other major learning resource is <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a>, which is more type theory oriented. Based on what you said above, I think Mathematics in Lean is a better choice, but you should use Theorem Proving in Lean 4 as a reference.</p>",
        "id": 519287778,
        "sender_full_name": "Niels Voss",
        "timestamp": 1747714995
    },
    {
        "content": "<p>Oh wait, sorry, I didn't read your question close enough. I didn't realize you requested video lectures specifically and had already looked at Theorem Proving in Lean 4</p>",
        "id": 519287936,
        "sender_full_name": "Niels Voss",
        "timestamp": 1747715110
    },
    {
        "content": "<p>Making a good comprehensive online course costs a lot of time and money, so the chances of it existing right now is low because the community is quite new and small (at least in comparison to the big programming langauges), and Lean courses do exist but they typically run in universities rather than online. The chances of a good comprehensive course existing in the part of the ecosystem which you are speficically interested in is I guess even lower. You should perhaps take a look at <a href=\"https://leanprover-community.github.io/teaching/index.html\">https://leanprover-community.github.io/teaching/index.html</a> and contact anyone directly if it turns out that they've run a course in the part of the ecosystem which you're interested in, to see what resources they have. For example all the documentation for Imperial's Lean course (which is more math-focussed and AFAIK doesn't mention lists once) is <a href=\"https://b-mehta.github.io/formalising-mathematics-notes/\">here</a> and <a href=\"https://github.com/b-mehta/formalising-mathematics-notes/tree/main?tab=readme-ov-file\">here</a>, but I'm afraid there are no publically-available videos (to access the videos you need to be registered for the course).</p>",
        "id": 519294561,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1747719296
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"521331\">Niels Voss</span> <a href=\"#narrow/channel/113489-new-members/topic/Online.20coursers.20or.20any.20possible.20set.20of.20lectures/near/519287936\">said</a>:</p>\n<blockquote>\n<p>Oh wait, sorry, I didn't read your question close enough. I didn't realize you requested video lectures specifically</p>\n</blockquote>\n<p>Nevertheless, these are great read-up alternatives so thanks for that!</p>\n<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/channel/113489-new-members/topic/Online.20coursers.20or.20any.20possible.20set.20of.20lectures/near/519294561\">said</a>:</p>\n<blockquote>\n<p>You should perhaps take a look at <a href=\"https://leanprover-community.github.io/teaching/index.html\">https://leanprover-community.github.io/teaching/index.html</a></p>\n</blockquote>\n<p>This is also a great reference for previously existing courses and universities / people that actually teach Lean 4 directly or indirectly, will take a look as well! I guess then video courses are too much to ask given the current stage and scope of the community but I am glad to see there are at least some reading-based alternatives.</p>",
        "id": 519353589,
        "sender_full_name": "Plamen Dimitrov",
        "timestamp": 1747738383
    }
]