[
    {
        "content": "<p>Hi, I mostly work in UniMath (coq) for now, but I keep an eye on some relevant parts of mathlib. This caused me to wonder: Why is a presheaf defined as a functor from the * opposite category * of the \"topological space category\"?</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"c\">/-</span><span class=\"cm\">! We define `TopCat.Presheaf C X` simply as `(TopologicalSpace.Opens X)ᵒᵖ ⥤ C`, -/</span>\n</code></pre></div>\n<p>and</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"c\">/-</span><span class=\"cm\">! Since `Opens X` has a partial order, it automatically receives a `Category` instance. -/</span>\n</code></pre></div>\n<p>I guess that is the reason why we need to take the opposite category. But I would assume that</p>\n<ul>\n<li>The partial order is a somewhat arbitrary choice. One can also define A &lt; B to mean that A contains B (although, I admit, that this does look a bit weird).</li>\n<li>The additional <code>.op</code> everywhere might cause some trouble in the long run.</li>\n<li>One could also always work with <code>(TopologicalSpace.Opens X) ⥤ Cᵒᵖ</code> instead of <code>(TopologicalSpace.Opens X)ᵒᵖ ⥤ C</code>, right?</li>\n</ul>\n<p>What is the reasoning behind this choice? Is this maybe deliberately done this way to make sure that a presheaf is also a presheaf in the category theoretical sense? Wouldn't it be easier to define another category here, with <code>A -&gt; B</code> to mean that A contains B, and then use that to define the presheaf?</p>",
        "id": 461955018,
        "sender_full_name": "Arnoud van der Leer",
        "timestamp": 1723495464
    },
    {
        "content": "<p>Firstly, a choice had to be made! Secondly, in the mathematical literature, most authors consider \"contravariants functors from <code>C</code> to <code>D</code>\" as functors<code>Cᵒᵖ ⥤ D</code> rather than <code>C ⥤ Dᵒᵖ</code>. Another argument is that (pre)sheaves on topological spaces are only a special of a more general construction. Then, the objects in the source category <code>C</code> usually have a geometric meaning, and the morphisms also have a geometric interpretation: indeed, if <code>U</code> and <code>V</code> are open subsets of <code>X</code>, and <code>U</code> is contained in <code>V</code>, there is a continuous map from <code>U</code> to <code>V</code> (and not from <code>V</code> to <code>U</code>).</p>",
        "id": 462048437,
        "sender_full_name": "Joël Riou",
        "timestamp": 1723536723
    },
    {
        "content": "<p>Fair. These seem like decent considerations. Thanks.</p>",
        "id": 462065867,
        "sender_full_name": "Arnoud van der Leer",
        "timestamp": 1723542160
    }
]