[
    {
        "content": "<p>Hello all,<br>\nI'm a physics graduate (in industry at the moment) who's been casually following developments in Lean and theorem proving. I've become interested in doing a PhD that involves formalization somehow, but I'm slightly at a loss because I don't have any formal background in the area. (I entered Imperial around the time when Prof. Buzzard started using Lean, but I had no idea what was happening next door...) Sorry for the vague question, but I was wondering if the community could offer some guidance for someone in my position? <br>\nThanks for any pointers you could offer :)</p>",
        "id": 403675864,
        "sender_full_name": "Jun Kyu Lee",
        "timestamp": 1700693041
    },
    {
        "content": "<p>Hello, <span class=\"user-mention\" data-user-id=\"669208\">@Jun Kyu Lee</span>. Have you subscribed to the <a class=\"stream\" data-stream-id=\"395462\" href=\"/#narrow/stream/395462-Natural-sciences\">#Natural sciences</a> stream?</p>\n<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/395462-Natural-sciences/topic/Hamiltonian.20Mechanics/near/392112196\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"651864\">Lehel Csillag</span> <a href=\"#narrow/stream/395462-Natural-sciences/topic/Hamiltonian.20Mechanics/near/392103953\">said</a>:</p>\n<blockquote>\n<p>Are basics of symplectic geometry/ODE/PDE theory formalized already?</p>\n</blockquote>\n<p>We are still pretty far away from this. Differential forms are very close but not there yet. ODE theory has the fundamental existence of uniqueness result but not much more. PDE has nothing basically. There is a huge imbalance in the Lean user community between algebraic geometry and the rest of the world.</p>\n</blockquote>\n<p>We can start formalizing symplectic geometry, ODE, and PDE.</p>",
        "id": 403680198,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1700695709
    },
    {
        "content": "<p>I'll find time to learn undergraduate and graduate mathematics next year. I'm aiming to formalize symplectic geometry.</p>",
        "id": 403681071,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1700696308
    },
    {
        "content": "<p>Hello, thank you for alerting me to this stream - subscribed! I’ll try to figure out the current state of things and make a comment over there.</p>",
        "id": 403681676,
        "sender_full_name": "Jun Kyu Lee",
        "timestamp": 1700696788
    },
    {
        "content": "<p>Agree wholeheartedly with <span class=\"user-mention silent\" data-user-id=\"411020\">Bulhwi Cha</span>, formalizing simplistic geometry, ODEs, and PDEs, would all be great ways to contribute. </p>\n<p>We wrote a paper on formalizing aspects of chemical physics: <a href=\"https://pubs.rsc.org/en/content/articlelanding/2023/dd/d3dd00077j\">https://pubs.rsc.org/en/content/articlelanding/2023/dd/d3dd00077j</a></p>\n<p>You should also connect with <span class=\"user-mention\" data-user-id=\"346070\">@Tomas Skrivan</span>, the developer of SciLean: <a href=\"https://github.com/lecopivo/SciLean\">https://github.com/lecopivo/SciLean</a></p>\n<p>You could focus on formalizing some aspect of physics. You could also combine theorem proving with functional programming to make formally correct software for simulating particular systems.</p>",
        "id": 403689805,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1700703378
    },
    {
        "content": "<p>I’ve also thought that this treatment of classical thermodynamics might be addressed in enough detail to be reasonably translated into Lean. <a href=\"https://arxiv.org/abs/cond-mat/9708200\">https://arxiv.org/abs/cond-mat/9708200</a></p>",
        "id": 403690056,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1700703655
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"669208\">@Jun Kyu Lee</span> It would be good to hear more about your interests. Not necessarily tied to formalization/Lean as we can help you to figure out the connection. </p>\n<p>Are you interested in pure theory or do you want to write programs? Do you want to do physics and formalization? Or are you okay just formalizing math? Or proving software correct?</p>\n<p>As mentioned, I'm working on SciLean but formalization is only a small part of it. Mainly I'm exploring the use of Lean, a dependently typed language(as there are not many of those), as a language to write physics simulations. The main focus is on expressivity and usability. Formalization is mainly used only to prevent users from making silly mistakes.</p>",
        "id": 403692070,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1700705329
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"424214\">Tyler Josephson ⚛️</span> Thanks for your references and pointers! I'm intrigued how Lean can be utilized on the more 'applied' side of physics, I'll have a look at what your approach was.</p>",
        "id": 403696113,
        "sender_full_name": "Jun Kyu Lee",
        "timestamp": 1700707700
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"346070\">Tomas Skrivan</span> Well, I became interested in Lean because it brought back memories of reading Hofstadter's books a long time ago :) As a beginner, I am quite happy with learning anything about it, though I do wish I had more background in the theoretical aspects. But to give one specific example, I'm curious about how areas of physics can be properly axiomatized.<br>\nI had no idea Lean could solve DEs, the animation on the Github repo surprised me!</p>",
        "id": 403699831,
        "sender_full_name": "Jun Kyu Lee",
        "timestamp": 1700709481
    }
]