[
    {
        "content": "<p>Hello! I'm Nikolas Tapia, postdoc at the Weierstrass Institute in Berlin. I work on <a href=\"https://en.wikipedia.org/wiki/Rough_path\">rough paths</a> and <a href=\"https://en.wikipedia.org/wiki/Rough_path#Signature\">path signatures</a> and became interested in Lean4 after hearing about it from a colleague in Oxford.</p>\n<p>As a learning project I decided to try and implement pre-Lie algebras and prove a few facts about them.<br>\nI ended up mimicking <code>Algebra.Lie</code> and defined Lie-admissible rings as <code>NonUnitalNonAssocRing</code>s such that their associator satisfies a certain identity (see e.g. [p. 587, MKL]), and showed that it implies that the canonical commutator yields a <code>LieRing</code>.<br>\nThen one can show that every <code>PreLieRing</code> is a <code>LieAdmissibleRing</code> and hence a <code>LieRing</code>. There are algebra versions of these facts as well.</p>\n<p>I organised this in two files, which I plan to submit as two separate PRs.<br>\nSince I'm new to Lean4 I think some of the proofs can be improved or maybe even some of the conventions/definitions might not really fit the style.</p>\n<p>In particular, I was unsure about whether it was sensible to define both left and right pre-Lie rings and show they are equivalent under <code>op</code>.</p>\n<p>Thanks for such amazing software, I'm really loving it.</p>\n<p><strong>References</strong><br>\n[MKL] Munthe-Kaas, H.Z., Lundervold, A. <em>On Post-Lie Algebras, Lie–Butcher Series and Moving Frames</em>. <em>Found Comput Math</em> <strong>13</strong>, 583–613 (2013). <a href=\"https://doi.org/10.1007/s10208-013-9167-7\">https://doi.org/10.1007/s10208-013-9167-7</a></p>",
        "id": 534702774,
        "sender_full_name": "Nikolas Tapia",
        "timestamp": 1755286265
    },
    {
        "content": "<p>PR for pre-Lie algebras <a href=\"https://github.com/leanprover-community/mathlib4/pull/28495\">#28495</a></p>",
        "id": 534713986,
        "sender_full_name": "Nikolas Tapia",
        "timestamp": 1755292390
    },
    {
        "content": "<p>PR for Lie-admissible algebras <a href=\"https://github.com/leanprover-community/mathlib4/pull/28496\">#28496</a></p>",
        "id": 534715042,
        "sender_full_name": "Nikolas Tapia",
        "timestamp": 1755293070
    }
]