[
    {
        "content": "<p>What is the common way to (physically) print out the lean source code? I tried \"Print\" extension on VSCode but syntax highlighting was not functioning. I just wanted to print out what I see on VSCode.</p>",
        "id": 567889262,
        "sender_full_name": "Aki Hideaki Kawai",
        "timestamp": 1768354836
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"270676\" href=\"/#narrow/channel/270676-lean4/topic/Printing.20Lean.20source.20code\">#lean4 &gt; Printing Lean source code</a> by <span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span>.</p>",
        "id": 567955430,
        "sender_full_name": "Notification Bot",
        "timestamp": 1768388281
    },
    {
        "content": "<p>I don't think this is really a question about Lean -- it sounds like a question about VS Code and could be asked about any programming language. Does a web search asking for printing code with syntax highlighting show up anything?</p>",
        "id": 567955645,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1768388336
    },
    {
        "content": "<p><a href=\"https://github.com/microsoft/vscode/issues/5953\">vscode#5953</a></p>",
        "id": 567955659,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1768388342
    },
    {
        "content": "<p>The easy way is to copy-paste the code into powerpoint (or similar).<br>\nAll the syntax highlighting is preserved, you just have to set the background color.</p>",
        "id": 567955781,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1768388374
    },
    {
        "content": "<p>Thanks for the response. I found copy-paste into TextEdit works.</p>",
        "id": 568110096,
        "sender_full_name": "Aki Hideaki Kawai",
        "timestamp": 1768440135
    },
    {
        "content": "<p>Sorry for the unclear wording in my original question, but I wasn’t really asking about VS Code itself. What I’m actually wondering is whether there is any Lean-community–recommended way to export or print Lean code with proper syntax highlighting.</p>\n<p>My impression is that this may be related to the current state of Lean’s syntax-highlighting infrastructure (e.g. how parsing/highlighting is implemented in editors), but I may be mistaken.<br>\nIs there any recommended approach, or is copy-paste into rich-text editors currently the de facto solution?</p>",
        "id": 568113893,
        "sender_full_name": "Aki Hideaki Kawai",
        "timestamp": 1768442891
    },
    {
        "content": "<p>I imagine you won't find many people interested in printing code, this sounds super niche<br>\n(however exporting code to Latex/Powerpoint/Keynote/HTML is probably a common occurrence)</p>",
        "id": 568114147,
        "sender_full_name": "Snir Broshi",
        "timestamp": 1768443112
    },
    {
        "content": "<p>When I display code blocks in talks I just take a screenshot and insert that.</p>",
        "id": 568145041,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1768465035
    },
    {
        "content": "<p>Do you specifically want to print source code, or quote it when you're giving a presentation? (These are different.)</p>",
        "id": 568153182,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1768467680
    },
    {
        "content": "<p>The easiest way to ensure perfectly matching syntax highlighting is to take a screenshot: always works, no potential for failures somewhere, but updating them as code changes is more annoying.</p>",
        "id": 568153341,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1768467719
    },
    {
        "content": "<p>Other ways depend on your goal: are you doing a powerpoint presentations? (No idea then; good luck.) LaTeX beamer (people have managed; I've struggled with it)? Typst (heard good things, but not tried yet). Writing a paper (then typst won't help you.)<br>\nIf you tell us what you really want to do, we can answer your real question :-)</p>",
        "id": 568153679,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1768467815
    },
    {
        "content": "<p>For example, I wanted some basic syntax highlighting for a <a href=\"https://www.olsak.net/mirek/lean-poster.pdf\">poster</a>, and used this <a href=\"https://github.com/karlll/code2svg\">code2svg.</a></p>",
        "id": 568300173,
        "sender_full_name": "Mirek Olšák",
        "timestamp": 1768507021
    },
    {
        "content": "<p>Thanks for the suggestions.</p>\n<p>To be more specific, I wanted review a few hundred lines of Lean code. For me, reading on paper is sometimes easier than on screen, and thus, having good syntax/semantic highlighting matters for legibility.<br>\nIn that sense my question is about printing/exporting rather than presentation or publication.</p>\n<p>I learned that copy-pasting into a rich-text editor works, which is good to know. I was just wondering whether there is any other approach people use in this situation, especially when doing this repeatedly.</p>",
        "id": 568359578,
        "sender_full_name": "Aki Hideaki Kawai",
        "timestamp": 1768540517
    },
    {
        "content": "<p>That sounds like a very bad idea to me tbh. You lose all the interactive feature like hover information, which for me are essential for understanding Lean code, because of type inference.</p>",
        "id": 568360797,
        "sender_full_name": "Jakub Nowak",
        "timestamp": 1768541553
    },
    {
        "content": "<p>That makes sense, thanks for sharing your thoughts!</p>",
        "id": 568629846,
        "sender_full_name": "Aki Hideaki Kawai",
        "timestamp": 1768702718
    }
]