[
    {
        "content": "<p>My advisor asked me to study the Lean language and suggested that I try to prove the following proposition using Lean:</p>\n<p>Let X₁, X₂, ..., Xₙ be a random sample drawn from a normal distribution N(μ, σ²). Define the sample mean X̄ and the sample variance S² as follows:</p>\n<p>X̄ = (1/n) ∑ (from i = 1 to n) Xᵢ,<br>\nS² = (1/(n-1)) ∑ (from i = 1 to n) (Xᵢ - X̄)².</p>\n<p>The goal is to prove that S² and the sample mean X̄ are statistically independent.</p>\n<p>I already have a proof outline: First, both the sample mean X̄ and (X_i - X̄) are normally distributed variables. By calculating the expected value of their product, we find it to be 0, which implies that their covariance is 0. Since they are normally distributed variables, having zero covariance implies independence. Hence, it is clear that the sample mean X̄ is independent of each term within the summation of S², which means S² and X̄ are statistically independent.</p>\n<p>My question is how to translate this proof outline into Lean code. Any assistance would be greatly appreciated! (I have already configured my Lean environment.)</p>\n<p>Thank you in advance for your help!</p>",
        "id": 472872395,
        "sender_full_name": "SamuelShen",
        "timestamp": 1727349514
    },
    {
        "content": "<p>Do you have any experience with Lean? Also, may I ask who is your advisor?</p>",
        "id": 472874179,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1727350201
    },
    {
        "content": "<p>I am pretty new to Lean</p>",
        "id": 472876575,
        "sender_full_name": "SamuelShen",
        "timestamp": 1727351065
    },
    {
        "content": "<p>I think I need package about Gaussian distribution?</p>",
        "id": 472876901,
        "sender_full_name": "SamuelShen",
        "timestamp": 1727351167
    },
    {
        "content": "<p>We have <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Probability/Distributions/Gaussian.html#ProbabilityTheory.gaussianReal\">ProbabilityTheory.gaussianReal</a> that should be the gaussian distribution (I don't  know anything about how probability is done in mathlib). Anyway if you are pretty new to Lean it is probably better to familiarize a little bit with the language, for example spending a couple of hours playing the natural number game.</p>",
        "id": 472877886,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1727351516
    },
    {
        "content": "<p>Thank you! very good advice! I would take it!</p>",
        "id": 472908337,
        "sender_full_name": "SamuelShen",
        "timestamp": 1727360365
    },
    {
        "content": "<p>Note that it is not true in general that uncorrellated gaussians are independent, the implication only holds for the components of a Gaussian vector. And since we only have real valued gaussians in mathlib you will have to essentially start proving basic things about Gaussian vectors, starting with the definition.</p>",
        "id": 472921275,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1727363973
    },
    {
        "content": "<p>This does not feel like a beginners project ...</p>",
        "id": 472921591,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1727364065
    }
]