[
    {
        "content": "<p>I have a local mathlib4 clone on my laptop (an M1 MacBook Air) which I have not touched for a while.  After \"git pull\" to the latest master, is <code>lake exe cache get</code> the only thing I need to do?<br>\nI'm trying to review a Lean file in a PR.  But it seems that Lean is \"re-building\" a lot of files, judging from messages like the following I see in VScode.  What is it \"re-building\"?  Is it possible to skip or expedite the \"re-building\"?</p>\n<p><a href=\"/user_uploads/3121/9aQAvUoGP4lD_-qyEsUVxCe0/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/9aQAvUoGP4lD_-qyEsUVxCe0/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"544x28\" src=\"/user_uploads/thumbnail/3121/9aQAvUoGP4lD_-qyEsUVxCe0/image.png/840x560.webp\"></a></div>",
        "id": 499364231,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1739413070
    },
    {
        "content": "<p>That doesn't look like a lot of files, it looks like about 25 files. But yes, <code>lake exe cache get</code> should be the only thing you need to do, assuming you didn't edit mathlib locally (does git report any locally changed files?). Then you should have to rebuild 0 files.</p>",
        "id": 499406664,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1739435370
    },
    {
        "content": "<p>Just to be clear here, if you're reviewing a PR then you first switch to the branch and then get the cache afterwards, as you want the cache for the branch rather than for master.</p>",
        "id": 499407080,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1739435473
    },
    {
        "content": "<p>Thanks for the explanation!  It does take quite a while (maybe 15 min or so on my M1 MBA) to go through those \"Built ...\" messages (perhaps 600 files or so).  What exactly is Lean doing during that?  Not re-checking those proofs, right?  I guess re-checking them will take much longer.</p>",
        "id": 499578397,
        "sender_full_name": "Ching-Tsun Chou",
        "timestamp": 1739478881
    },
    {
        "content": "<p>That's way too long. Try <code>lake exe cache get!</code> first (with the exclamation mark)</p>",
        "id": 499588336,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1739482464
    }
]