[
    {
        "content": "<p>I've reached the point in my learning now where I can't put off knowing at the surface level what \"dependent type theory\" is.</p>\n<p>Can anyone suggest a short beginner-friendly (min jargon) overview?</p>\n<p>My aim is to understand (not in detail) how Lean uses it to validate proofs.</p>\n<p>For example - I have a rough idea how Prolog uses a \"search\" to answer logic queries against a database of propositions.</p>\n<p>I read somewhere that most previous theorem proof checkers used \"set theory\" but Lean took a different approach - but I have no clue how you would do it differently to axiomatic set theory.</p>\n<p>If I had to guess I would say that Lean/mathlib uses the idea that everything is a \"type\" and the rigour of this means that it can reason about them, using inference from built-in facts and also facts provides by the user's proof, augmented by helpful rules in mathlib.</p>",
        "id": 483940733,
        "sender_full_name": "rzeta0",
        "timestamp": 1732291206
    },
    {
        "content": "<p>You could try <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a> or the axioms section of the new lean reference manual</p>",
        "id": 483953689,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1732295119
    },
    {
        "content": "<p>BTW it's not true that most previous proof checkers used set theory, set theory based proof assistants are in the minority.</p>\n<ul>\n<li>Set theory: Metamath, Mizar</li>\n<li>Simple type theory: HOL4, HOL Light, Isabelle, ProofPower, PVS</li>\n<li>Dependent type theory: Automath, Lean, Coq, Agda</li>\n</ul>",
        "id": 483954388,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1732295321
    },
    {
        "content": "<p>thanks I'll try the chapter 2 in TPIL</p>",
        "id": 483957493,
        "sender_full_name": "rzeta0",
        "timestamp": 1732296419
    },
    {
        "content": "<p>Perhaps it's also worth double checking that you really mean to specifically learn about dependent type theory, and not that you're trying to learn a bit more about the Curry-Howard correspondence.</p>",
        "id": 483960007,
        "sender_full_name": "Julian Berman",
        "timestamp": 1732297315
    },
    {
        "content": "<p>(Either way possibly the resource is the same.)</p>",
        "id": 483960085,
        "sender_full_name": "Julian Berman",
        "timestamp": 1732297327
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321696\">@Julian Berman</span>  - good question. I started typing an answer but realised I can't really add more than \"I just want to know roughly how it works internally - what the big idea is\".</p>\n<p>Perhaps I'll be able to know better what I want to know once I've read chapter 3 of TPIL.</p>",
        "id": 483972075,
        "sender_full_name": "rzeta0",
        "timestamp": 1732301872
    }
]