[
    {
        "content": "<p>Hi! As a training exercise, I'm trying to prove some basic facts about Turing Machines (my own definition, not the one in mathlib). One technical difficulty is that I want to keep the number of tapes as a parameter, so I'm using a <code>Vector Tape k</code> for the tapes of a Turing Machine. Now a movement of the heads on the tape is implemented as maping a <code>moves : Vector Movement k</code> to a new configuration via <code>(tapes.zip moves).map (fun (tape, m) =&gt; tape.move m)</code>.<br>\nThen I have a statement about the <code>move</code> function, namely that the occupied space on a tape is at most one larger after applying move. Now I want to lift this to the Turing Machine's move function to state that the sum of occupied space after <code>move</code> is at most k plus the sum of occupied space before.</p>\n<p>And now to the actual question (sorry for the long introduction): I'm having a hard time dealing with all the <code>zip</code> and <code>map</code> functions, and I was wondering if I'm missing some functions or if it would be better to use indices instead of <code>zip</code> and <code>map</code>.</p>",
        "id": 541999529,
        "sender_full_name": "chris477",
        "timestamp": 1759142033
    },
    {
        "content": "<p>I think things will be much easier with indices</p>",
        "id": 542040482,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1759152630
    },
    {
        "content": "<p>That is, <code>tapes : Fin k -&gt; Tape</code></p>",
        "id": 542040728,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1759152679
    },
    {
        "content": "<p>Then you have <code>new_tapes := fun i =&gt; (tapes i).move (moves i)</code></p>",
        "id": 542040934,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1759152721
    },
    {
        "content": "<p>Oh you are saying you wouldn't even use <code>List</code>?</p>",
        "id": 542042822,
        "sender_full_name": "chris477",
        "timestamp": 1759153186
    },
    {
        "content": "<p>Thanks, I'll try!</p>",
        "id": 542055277,
        "sender_full_name": "chris477",
        "timestamp": 1759155948
    }
]