[
    {
        "content": "<p>Hey all,</p>\n<p>I am requesting feedback on the formalisation project:  <a href=\"https://github.com/YanYablonovskiy/AlgebraicWheelTheory\">https://github.com/YanYablonovskiy/AlgebraicWheelTheory</a></p>\n<p>NO AI OF ANY SORT HAS BEEN USED TO ANY CAPACITY IN THIS PROJECT.</p>\n<p>All the results are currently in: <a href=\"https://github.com/YanYablonovskiy/AlgebraicWheelTheory/blob/master/AlgebraicWheelTheory/Basic.lean\">https://github.com/YanYablonovskiy/AlgebraicWheelTheory/blob/master/AlgebraicWheelTheory/Basic.lean</a></p>\n<p>It is very early on, but i don't want to go deep into it to discover a lot of code debt.</p>\n<p>Specifically i would love feedback on best practices, design patterns , tips/tricks and golfing.</p>\n<p>Any feedback is appreciated.</p>",
        "id": 534877482,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1755498706
    },
    {
        "content": "<p>(Have we got both \"digitize\" and \"mechanize\" as synonyms for \"formalize\" now? I don't see the need.)</p>",
        "id": 534889257,
        "sender_full_name": "A.",
        "timestamp": 1755503386
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"111433\">A.</span> <a href=\"#narrow/channel/113489-new-members/topic/Request.20for.20formalisation.20feedback.3A.20Algebraic.20Wheels/near/534889257\">said</a>:</p>\n<blockquote>\n<p>(Have we got both \"digitize\" and \"mechanize\" as synonyms for \"formalize\" now? I don't see the need.)</p>\n</blockquote>\n<p>I am too new to know for sure, I sort of decided to inherit it from <a href=\"https://github.com/james18lpc/GibbsMeasure/\">https://github.com/james18lpc/GibbsMeasure/</a> .</p>\n<p><span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span>  Do you recall why this word was chosen instead of mechanize?</p>",
        "id": 534890315,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1755503760
    },
    {
        "content": "<p>\"formalise\" = \"write in a formal language\", \"digitise\" = \"make available to computers\", \"mechanise\" = \"render automatic \". Formalising isn't necessarily digitising (eg if you use Russell and Whitehead's formal language, on paper), and you can digitise without formalising (for example all the online libraries), but in practice formalising is a quasi-subset of digitising. Mechanising almost always involves borh digitising and formalising, and formalising gives opportunities to mechanise (by making it possible to write a new tactic, for example) but all formalising doesn't necessarily involve mechanising (you can write a proof without writing any new tactic to make it less manual).</p>",
        "id": 534892300,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1755504407
    },
    {
        "content": "<p>I took \"mechanise\" to be a synonym for \"formalise\" (in this context at least), because of the nature of type-theoretic proof assistants (and possibly some others as well): <em>checking</em> that the proof is correct is a purely mechanical (as in, computational, but computing did inherit some of its terminology from its beginnings based on mechanical devices) process.</p>",
        "id": 534951070,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1755523249
    },
    {
        "content": "<p>One reason i liked digitize a bit more when you are using  a Blueprint, is that you are also transferring it into a web format with cross-referencing to the \"mechanisation\" (or what have you). Whereas without this, mechanize has a bit more appeal, if you are simply turning it into machine executable code without any further digital transformation or deeper annotation.</p>",
        "id": 535033942,
        "sender_full_name": "Yan Yablonovskiy 🇺🇦",
        "timestamp": 1755559702
    }
]