[
    {
        "content": "<p>I have a project called <code>pr1</code>, and it has lean and mathlib working correctly without any problem. Now, I want to create a new project (let's call it <code>pr2</code>), and I want to use mathlib in it. So, it seems like I have two options :</p>\n<p>1) Just run <code>lake build</code>, and it downloads about 300mb and takes a lot of time to compile mathlib files (uses all of cpu cores!!)</p>\n<p>2) Run <code>lake exe cache get</code> before <code>lake build</code> so it downloads cache files (I have not run this command, so I don't know how much it downloads) </p>\n<p>So my question is, how can I use my <code>pr1</code> mathlib files for <code>pr2</code> ? instead of re-building or re-downloading mathlib again.</p>\n<p>I have another question, Is there any way to build mathlib locally on gpu? because I have gtx gpu on my computer that has 700 cores in it and building mathlib uses all 4 cores of my cpu, so I think it would take less time if it could instead use my gpu to build it. (and I know , writing a code for gpu is much harder)</p>",
        "id": 450805259,
        "sender_full_name": "Arshak Parsa",
        "timestamp": 1720729617
    },
    {
        "content": "<p>You should use <code>lake exe cache get</code></p>",
        "id": 450805425,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1720729660
    },
    {
        "content": "<p>If your lakefile and lakemanifest versions of mathlib are identical between the two projects, then you could probably symlink <code>pr2/.lake/packages/mathlib</code> to <code>pr1/.lake/packages/mathlib</code></p>",
        "id": 450805997,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1720729805
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"307953\">@Ruben Van de Velde</span>  Well, <code>lake exe cache get</code> tries to clone mathlib. I want to do it offline.</p>",
        "id": 450806147,
        "sender_full_name": "Arshak Parsa",
        "timestamp": 1720729850
    },
    {
        "content": "<p>If you already have a cache from a previous download, you can use <code>lake exe cache unpack</code></p>",
        "id": 450806196,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1720729872
    }
]