[
    {
        "content": "<p>I am (not for the first time) going through MIL, and trying to write some of the proofs both in tactic mode and in term mode. Mostly, I'm writing a tactic mode proof first, and then converting it into term mode.</p>\n<p>One point that I am having difficulty with is when my tactic mode proof uses <code>calc</code> (but here I more or less see why; <code>calc</code> uses a lot of transitivity and selective rewriting under the hood, and is much better at picking the right lemmas than I am), or does a little rewriting. </p>\n<p>What is the \"term mode equivalent\" of rewriting?</p>",
        "id": 509645494,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1743586159
    },
    {
        "content": "<p><code>\\t</code></p>",
        "id": 509648063,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1743586798
    },
    {
        "content": "<p>Yes, <code>h \\t x</code> where <code>h : a = b</code> and <code>x : .... a ...</code> has type <code>x : ... b ...</code> and it also works the other way round (turning <code>.... b ...</code> into <code>... a ...</code>). Regarding <code>calc</code>: <code>calc</code> also works in term mode and you can translate a <code>calc</code> proof basically entirely into a proof using <code>trans</code> (i.e. <code>trans h (trans h' ...)</code>).</p>",
        "id": 509903731,
        "sender_full_name": "Robin Arnez",
        "timestamp": 1743677435
    },
    {
        "content": "<p>OK thanks (I admit that I thought Kevin's answer was the result of a premature \"send\")</p>\n<p>I suppose <code>trans</code> is a somewhat high-level transitivity construct that knows how to deal with a variety of situations - something I tend to associate with tactic proofs, but I may have the wrong mental image here.</p>",
        "id": 509913143,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1743680188
    },
    {
        "content": "<p>Oh I'm sorry! I was on mobile. The answer is <code>▸</code> which is typed with <code>\\t</code></p>",
        "id": 509923291,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1743682787
    }
]