[
    {
        "content": "<p>Hello everyone!</p>\n<p>I'm Rodrigo. I am currently an ML/AI engineer working in tech but have always been fascinated by math. Officially, I studied CS for undergrad and master's with a minor in math.</p>\n<p>I've recently become intrigued by potentially contributing to math research myself, especially when I heard Terence Tao mentioning that there have been some polymath projects benefiting from contributions from non-experts. I'd especially be curious if there is any way to leverage my strengths in SWE, etc. to push formalization of math forward. Making useful contributions to pure math has always seemed very out of reach for me, but maybe this could be a unique opportunity :D</p>\n<p>Any recommendations and advice would be really appreciated! In general I think I'd be more likely to be helpful for topics that don't require very deep background (for example some areas of probability, combinatorics, especially topics relevant to ML/statistics/CS). I think my ideal project would involve contributing to some low-hanging fruit areas that are fundamental to recent research, but just have not really been done yet. Would love to hear if anyone has specific open starter projects on these topics or anything else that you think might be a good fit!</p>\n<p>Also would be interested if there are infrastructure / tooling projects that could greatly improve quality of life for contributors, since this might be more up my alley strengths-wise (but I would really like to contribute to the formalization itself of course).</p>",
        "id": 537014232,
        "sender_full_name": "Rodrigo C",
        "timestamp": 1756681363
    },
    {
        "content": "<p>Welcome! There is lots of infrastructure underpinning mathlib (and even a <a href=\"https://arxiv.org/abs/2508.21593\">hot off the press paper</a> about it), and all of that can use some help. Particularly by someone who knows more CS than a mathematician-who-had-CS-as-a-hobby-of-sorts (like me).</p>",
        "id": 537046478,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756711207
    },
    {
        "content": "<p>Some ideas that come to my mind</p>\n<ul>\n<li>helping with syntax linters: typically, you'd be programming something in Lean. (In involves metaprogramming, but relatively light one.) There's a <a href=\"https://github.com/leanprover-community/mathlib4/issues/7217\">wishlist issue</a> on github, but I can also suggest projects directly.</li>\n<li>one example, relatively easy: lint for non-existent filenames in documentation strings <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/Linter.20for.20links.3F/with/522888372\">#mathlib4 &gt; Linter for links?</a>. Not hard by any means, but useful.</li>\n<li>if you like heavy metaprogramming: there are a lot of ideas on better tactics, so tactic writing could be a fun project. (My advice, though: pair, or talk often enough, with somebody who has a clear idea what the tactic should do. This may influence your implementation choices.) There's a zulip thread with tactic ideas.</li>\n<li>a linter to generalise theorems: there was been prior work on this, see <a class=\"stream-topic\" data-stream-id=\"287929\" href=\"/#narrow/channel/287929-mathlib4/topic/linter.20to.20generalize.20theorems/with/536830688\">#mathlib4 &gt; linter to generalize theorems</a> (and coordinate with the student there who's also interested)</li>\n<li>a tool to suggest a good name for your declaration (see also the above thread)</li>\n</ul>",
        "id": 537047286,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756711550
    },
    {
        "content": "<p>There's one more project which can use lots of help: mathlib's review dashboard <a href=\"https://leanprover-community.github.io/queueboard/\">https://leanprover-community.github.io/queueboard/</a>. This is used by many reviewers, so possibly higher-impact than the others. The project is well-documented, even has a list of \"good first issues\" (well, still one and a half - I could write instructions for more).</p>",
        "id": 537047519,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756711640
    },
    {
        "content": "<p>If you like backend/continuous integration work (or just a solid CS problem), there's also a bunch of other tasks that need doing (that aren't documented, among others because they depend on context which takes a moment to write down). If you're interested, we could certainly discuss.</p>",
        "id": 537047668,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756711713
    },
    {
        "content": "<p>You're of course equally welcome to work on formalisation of things --- but my point is: we also need you if you're more of a programmer; mathlib survives because of its infrastructure, and that can always use more help!</p>",
        "id": 537047800,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1756711775
    },
    {
        "content": "<p>Awesome! Thanks for the ideas. I think for just a starter project, this one \"* one example, relatively easy: lint for non-existent filenames in documentation strings <a href=\"#narrow/channel/287929-mathlib4/topic/Linter.20for.20links.3F/with/522888372\">#mathlib4 &gt; Linter for links?</a>. Not hard by any means, but useful.\" sounds the most approachable and can get me to start grokking Lean and the mathlib codebase.</p>\n<p>Perhaps I can start branching out from there.</p>",
        "id": 537155423,
        "sender_full_name": "Rodrigo C",
        "timestamp": 1756750780
    },
    {
        "content": "<p>In case it helps, <a class=\"message-link\" href=\"/#narrow/channel/287929-mathlib4/topic/Naming.20convention.3A.20succ.20vs.2E.20add_one/near/537144977\">#mathlib4 &gt; Naming convention: succ vs. add_one @ 💬</a> is a recent example of some code that loops through all the declarations in the environment.  You can extract the docstring of a declaration (if it has one) using <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Lean.findDocString%3F#doc\">docs#Lean.findDocString?</a>.</p>",
        "id": 537157684,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1756752098
    }
]