[
    {
        "content": "<p>I just published my <code>SafeIdx</code> library <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n<ul>\n<li><a href=\"https://github.com/AdrienChampion/safeIdx\">https://github.com/AdrienChampion/safeIdx</a></li>\n</ul>\n<p>It basically generates <code>Uid</code> types that are just wrappers around <code>Nat</code>, and <code>Uid</code>-related mappings which are just arrays only indexable by a specific <code>Uid</code> type. The result is (hopefully) zero-cost arrays and indices, except that type-safety prevents from using, say, a <code>Client</code> index instead of a <code>Product</code> index in a <code>Product</code>-related mapping.<br>\nBecause this is Lean, SafeIdx also provides dependent (length-aware) mapping types which is super fun to write.</p>\n<p>Check out what it looks like on this example:</p>\n<ul>\n<li><a href=\"https://github.com/AdrienChampion/safeIdx/blob/9e585005f83162b067be2a7702376b520bfc7c44/SafeIdx/Test/Client.lean\">https://github.com/AdrienChampion/safeIdx/blob/9e585005f83162b067be2a7702376b520bfc7c44/SafeIdx/Test/Client.lean</a></li>\n</ul>",
        "id": 367175150,
        "sender_full_name": "Adrien Champion",
        "timestamp": 1687009047
    },
    {
        "content": "<p>I'm not here to argue that's the most useful library ever <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> But it might be interesting to others; I find the exercise of writing/reading such a library very valuable for beginners as it's not very ambitious so it's easy to grasp the concepts, but still requires playing around with types, relatively low-level array manipulations, coercion, custom-indexing, syntax extensions, and much more. It should also ideally be zero-cost, so there's even room for messing around with optimization.</p>\n<p>There's even a (very simple) termination proof in there!</p>",
        "id": 367175422,
        "sender_full_name": "Adrien Champion",
        "timestamp": 1687009117
    },
    {
        "content": "<p>Also, I'm definitely not a Lean expert so any remarks for improving readability/ergonomics or anything else would be great.</p>\n<p>Feel free to start with <a href=\"https://github.com/AdrienChampion/safeIdx/blob/9e585005f83162b067be2a7702376b520bfc7c44/SafeIdx/Dsl.lean#L205-L221\">this hideous bit</a> and let me know how to do this cleanly once you're done laughing</p>",
        "id": 367175628,
        "sender_full_name": "Adrien Champion",
        "timestamp": 1687009169
    }
]