[
    {
        "content": "<p>Hello, </p>\n<p>Is this a good idea: taking the online book series and associated video lectures \"Software Foundations\" for Coq and trying to do the equivalent in Lean4?</p>",
        "id": 508253255,
        "sender_full_name": "Trond Linjordet",
        "timestamp": 1742990071
    },
    {
        "content": "<p>If you are starting out with Lean I would suggest to use a Lean 4 resource to avoid learning 2 things at once. If you are particularly interested in software verification consider checking out <a href=\"https://lean-forward.github.io/hitchhikers-guide/2024/\">https://lean-forward.github.io/hitchhikers-guide/2024/</a></p>",
        "id": 508257268,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1742991125
    },
    {
        "content": "<p>Thanks! Besides inconvenience and inefficiency of dealing with Lean and Coq side by side, are there major differences in underlying assumptions about software verification with Lean versus Coq?</p>",
        "id": 508260213,
        "sender_full_name": "Trond Linjordet",
        "timestamp": 1742991944
    },
    {
        "content": "<p>If you are interested in specific niches it might be that the Coq eco system already has libraries that Lean doesn't but for all of the basic stuff not really.</p>",
        "id": 508264567,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1742993125
    },
    {
        "content": "<p>FWIW my first lean project when I was an absolute beginner was working through the first half of the first volume of software foundations and translating all the exercises into lean. However this was back in the day where there were essentially no resources for learning lean other than <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a> which I also worked through. I then started trying to do undergraduate level mathematics.</p>",
        "id": 508264570,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1742993127
    },
    {
        "content": "<p>Ah yes, I probably heard about that from a podcast interview and it stuck with me.</p>",
        "id": 508275536,
        "sender_full_name": "Trond Linjordet",
        "timestamp": 1742995721
    },
    {
        "content": "<p>Thanks for replies!</p>",
        "id": 508275610,
        "sender_full_name": "Trond Linjordet",
        "timestamp": 1742995741
    },
    {
        "content": "<p>I remember doing several exercises about various statements of logic several of which had names (eg Pierce's law) and all of which were to be proved to be equivalent to LEM and I think this was what inspired me to give up with software foundations!</p>",
        "id": 508279139,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1742996429
    },
    {
        "content": "<p>It was this sort of experience which really hammered home to me the fact that there seemed to be very little documentation available at that time which was suitable for a classical mathematician, in any system</p>",
        "id": 508279391,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1742996481
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"395550\">Henrik Böving</span> <a href=\"#narrow/channel/113489-new-members/topic/Self-studying.20Lean4.20with.20Software.20Foundations.3F/near/508264567\">said</a>:</p>\n<blockquote>\n<p>If you are interested in specific niches it might be that the Coq eco system already has libraries that Lean doesn't but for all of the basic stuff not really.</p>\n</blockquote>\n<p>Volume 5 or \"Verifiable C\" from \"Software Foundations\", probably, is related to this.</p>\n<p>Volume 1 or \"Logical Foundations\" definitely could be skipped if one isn't interested in Coq/Rocq, and Lean books used instead.</p>\n<p>Volume 3 or \"Verified Functional Algorithms\", hmm...  is the <a href=\"https://lean-lang.org/functional_programming_in_lean\">https://lean-lang.org/functional_programming_in_lean</a> something similar? I took a look at both and it seems that Volume 3 would be interesting to translate into Lean.</p>\n<p>Volume 4 or \"QuickChick: Property-Based Testing in Coq\" --- not sure, but isn't Plausible (which I have seen mentioned here) something similar? Anyway, I have read nothing of this book, so no idea.</p>\n<p>Volume 2 or \"Programming Language Foundations\" and Volume 6 or \"Separation Logic Foundations\" could be interesting to Program verification channel. And to me too, when I finish that \"Concrete Semantics\" book (which uses Isabelle/HOL, but I do exercises in Lean).</p>",
        "id": 508348905,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1743012809
    },
    {
        "content": "<p>Anyway, sorry, these are my 2 cents.</p>\n<p>I have tinkered with Coq (now Rocq) for many years, before I started to use Lean/Mathlib for basic math things. I have fond memories of it. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 508349489,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1743013014
    },
    {
        "content": "<p>And thank you for mentioning \"The Hitchhiker's Guide to Logical Verification\" book. I didn't know about it. :)</p>",
        "id": 508349850,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1743013150
    }
]