[
    {
        "content": "<p>(I'm not sure if this topic belongs in \"new members\" or \"mathlib4\".)</p>\n<p>I'd like to import mathlib3 files for use in Lean4 (I don't need the source), but I'm not sure what my actual options are for practically doing this.</p>\n<p>My understanding is that <code>mathport</code>/<code>binport</code> allows Lean3 binaries to be used in Lean4. But does this require maintaining a local copy of the entirety of mathlib3-after-<code>binport</code>ing? If so, how much space does that take up?</p>\n<p>The page for mathport mentions an alternative involving a lake dependency, but I don't quite understand the nitty-gritty of setting this up even after reading the README for lake (or what doing so would actually achieve, or even what being an \"artifact\" really means).</p>\n<p>If the size is prohibitive, is it possible to use VS code with remote repositories somehow to only download the binaries needed for a given project, instead of storing everything locally?</p>\n<p>I realize these questions are kind of scattered, and might be XY-problem-esque. Overall, though, any guidance or templates that help with the details of setting up a Lean 4 project that can use mathlib3 would be great! Thanks in advance!</p>",
        "id": 300905068,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1664228929
    },
    {
        "content": "<p>Assuming that you want to work on helping with the porting process, the most important thing atm is to get tactic ported, which doesn't really require <code>mathport</code> or <code>binport</code>.<br>\nIf you really want to set up the mathport repo, then you'll have to wait for another answer, because I can't help with that.</p>",
        "id": 300930611,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1664247770
    },
    {
        "content": "<p>Ok, totally new here—when you say \"get tactic ported\", is that one of the by-hand porting projects we need to do for mathlib4? (I'm guessing it's what's going on in <a href=\"#narrow/stream/287929-mathlib4/topic/Tactic.20porting.20assignments\">this topic</a>? Or is my guess off?)</p>\n<p>I do want to help with the porting process,  and I'd like to help with porting tactics if I can—it might be a good way to learn! But separately, I'm also just looking to start formalizing some particular math in Lean 4 that will make use of mathlib imports (for which I assume I only need the binaries). (I eventually found <a href=\"#narrow/stream/287929-mathlib4/topic/using.20binport.20only/near/300929618\">this thread</a> and asked a more specific question there after attempting what I could.)</p>",
        "id": 300930930,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1664248081
    }
]