[
    {
        "content": "<p>Hello! Little late the party but I have been going through Advent of Code and i just solved day 9. My solution can be found <a href=\"https://github.com/palani-johnson/advent-lean4-2024/blob/main/src/Advent/Day09.lean\">here</a>. If you look at both <code>condense!</code> functions you will see I am using <code>Array.get?</code> to get values at an array index. I believe I should be able to use <code>Array.get</code> as my indexes should never be out of bounds but I'm struggling to prove <code>Fin a.size</code>. Any hints on where to start with this?</p>",
        "id": 491442267,
        "sender_full_name": "Palani Johnson",
        "timestamp": 1735679373
    },
    {
        "content": "<p>I would've defined the <code>left</code> and <code>right</code> arguments as having type <code>Fin fileArray.size</code>. That would solve your problem. Of course you would need to do additional work to prove those constraints whenever you call the function, but that's kind of the point: you show that the original call satisifies the contraints, and then show that the recursive calls continue to satisfy those constraints.</p>",
        "id": 491450515,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1735686953
    },
    {
        "content": "<p>Also, you should change <code>if left &gt;= right then</code> to <code>if h : left &gt;= right then</code> so you can make use of <code>h : left &lt; right</code> in the else block.</p>",
        "id": 491451507,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1735687839
    },
    {
        "content": "<p>However, if you don't care about proofs and you just want to be able to get the value without jumping through hoops, there's always <code>Array.get!</code> which will panic if it's out of bounds... the only requirement is to show that the return type is Inhabited</p>",
        "id": 491452556,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1735688963
    },
    {
        "content": "<p>Thank you for your reply! I originally tried <code>Fin fileArray.size</code> using <code>Array.get</code> but just didn't know how to get the code to compile. Ill try using <code>if h : </code> since seems to do what i want it to</p>",
        "id": 491452685,
        "sender_full_name": "Palani Johnson",
        "timestamp": 1735689079
    }
]