[
    {
        "content": "<p>Have any attempts been made to formalise sieve methods? All I have been able to find is an estimate used in the <a href=\"https://b-mehta.github.io/unit-fractions/\">Unit Fractions project</a> (lemma 2.9) that was made using the sieve of Eratosthenes-Legendre. </p>\n<p>I ask because I've been learning lean in my free time and I'm at the point now where I should try to work on a larger project. I think it might be fruitful to formalise a proof of Brun's theorem by way of the Selberg sieve. These can be proved using almost entirely elementary methods, so they seem like a reasonable target for formalisation. </p>\n<p>Thanks!</p>",
        "id": 348179228,
        "sender_full_name": "Arend Mellendijk",
        "timestamp": 1681121488
    },
    {
        "content": "<p>There has been interest in formalising Maynard's sieve. I would personally like having it because it is a prerequisite to <a href=\"https://arxiv.org/abs/2301.10303\">Infinite partial sumsets in the primes</a>. I am ticking off another prerequisite, Bergelson's intersectivity lemma, in <a href=\"https://github.com/leanprover-community/mathlib/pull/18732\">#18732</a></p>",
        "id": 348180039,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1681121777
    },
    {
        "content": "<p>My impression is that this kind of mathematics is perhaps more talked about in the Xena Discord (a private chat) than here, which is not really a good outcome. Maybe it's time for a dedicated analytic number theory stream here? The Bloom-Mehta formalisation of Bloom's unit fractions result is one of mathlib's greatest successes I think -- contemporary maths being formalised in real time.</p>",
        "id": 348183073,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1681122911
    },
    {
        "content": "<p>Indeed one could argue that the success of the unit fractions project is evidence that this area is ripe for interesting formalisation projects.</p>",
        "id": 348183227,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1681122962
    },
    {
        "content": "<p>An update on this: I went ahead with my plan to formalise the Selberg sieve, and I've just finished proving (the simple version of) the Fundamental Theorem of the Selberg Sieve. You can find the repo <a href=\"https://github.com/FLDutchmann/selberg-sieve\">here</a>, with the main result <a href=\"https://github.com/FLDutchmann/selberg-sieve/blob/53025fc7705bec7222ebf6f042d5a653250fffad/src/selberg.lean#L546\">here</a>. </p>\n<p>My next goal is to prove Brun's theorem, or perhaps just that pi(x) &lt;&lt; x/log x to convince myself I've actually proved something useful. There is also another version of the fundamental theorem that's more intuitive to apply, but it relies on Mertens' third theorem both in proof (as far as I know) and application. Since Mertens' theorems aren't in mathlib yet I'm holding off on implementing that for the moment.</p>\n<p>I'd like to know what people think about adding a result like this to mathlib. It would take quite a bit of refactoring in its current form, as I haven't put much time into optimisation or using a style consistent with mathlib. I'd also be worried that the result is a little too specific. As it stands it's ~2000 (ungolfed) loc for a single result that doesn't do much to build a larger theory. That said if people are interested I'd definitely be willing to work on getting this code in shape.</p>",
        "id": 361942383,
        "sender_full_name": "Arend Mellendijk",
        "timestamp": 1685364525
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span></p>",
        "id": 361943876,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1685364885
    },
    {
        "content": "<p>Maynard sieve next? <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 361947811,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1685365820
    },
    {
        "content": "<p>I won't say I haven't considered it...</p>",
        "id": 361951305,
        "sender_full_name": "Arend Mellendijk",
        "timestamp": 1685366657
    },
    {
        "content": "<p>But frankly I'd need to read up on the proof of Bombieri-Vinogradov before I commit to anything.</p>",
        "id": 361951365,
        "sender_full_name": "Arend Mellendijk",
        "timestamp": 1685366670
    },
    {
        "content": "<p>Second update: I've just <a href=\"https://github.com/FLDutchmann/selberg-sieve4/blob/08c0fccef011f882e5cc5fa1355225ec7be877b9/SelbergSieve/MainResults.lean#L25\">finished proving</a></p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"kd\">theorem</span> <span class=\"n\">primeCounting_isBigO_atTop</span> <span class=\"o\">:</span> <span class=\"o\">(</span><span class=\"k\">fun</span> <span class=\"n\">N</span> <span class=\"bp\">=&gt;</span> <span class=\"o\">(</span><span class=\"n\">π</span> <span class=\"n\">N</span><span class=\"o\">:</span><span class=\"n\">ℝ</span><span class=\"o\">))</span> <span class=\"bp\">=</span><span class=\"n\">O</span><span class=\"o\">[</span><span class=\"n\">atTop</span><span class=\"o\">]</span> <span class=\"o\">(</span><span class=\"k\">fun</span> <span class=\"n\">N</span> <span class=\"bp\">=&gt;</span> <span class=\"n\">N</span> <span class=\"bp\">/</span> <span class=\"n\">Real.log</span> <span class=\"n\">N</span><span class=\"o\">)</span>\n</code></pre></div>\n<p>so at least I've convinced myself I've proved something nontrivial. I realise the result itself will probably be overshadowed by the prime number theorem relatively soon,  but most of the additional work came from a bound that will be useful for other simple sieve problems (like Brun's theorem). I'll definitely work to clean up the code for that bound and get it merged into mathlib.</p>",
        "id": 378465393,
        "sender_full_name": "Arend Mellendijk",
        "timestamp": 1690289862
    },
    {
        "content": "<p>This is great! (Apologies for the late response, I only just saw this thread.)</p>\n<p>As you say, the most that I know of are the sieve-type estimates that Bhavik and I formalised for unit fractions. This is essentially Eratosthenes-Legendre. I'm very glad to hear that the Selberg sieve has been formalised. </p>\n<p>For your prime big-O bound, just so you're aware, <span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span>  proved this via Chebyshev's estimates (also for unit fractions), not sure if this is in mathlib yet?</p>\n<p>I'd say that Selberg sieve should definitely be in mathlib, it's used all the time in analytic number theory.</p>\n<p>For a next project, how about the combinatorial sieve? e.g. Beta sieve. A little technical to write down the statement, but if anything the proof is actually step-by-step simpler than Selberg's, and is often more powerful.</p>\n<p>re: Bombieri-Vinogradov, before that's done, we need to formalise Vaughan's identity (<a href=\"https://en.wikipedia.org/wiki/Vaughan%27s_identity\">https://en.wikipedia.org/wiki/Vaughan%27s_identity</a> - just the elementary arithmetic function statement, ignore the version involving the zeta function). This is essential to a simple proof of B-V, and indeed is another everyday tool of analytic number theory that belongs in mathlib. (e.g. would be needed to formalise a proof that all sufficiently large odd numbers are the sum of three primes).</p>",
        "id": 391414554,
        "sender_full_name": "Thomas Bloom",
        "timestamp": 1694894216
    }
]