[
    {
        "content": "<p>Hello, I am new here so I am sorry if I missed something.</p>\n<p>I am working on a project where I need to work with random graphs, for that my plan is to define a random variable on the set of possible simple graphs, but whenever I try to use SimpleGraph there is an error saying it is an Unknown Identifier. Sorry it is a bit vague, I am not sure what to detail about.</p>\n<p>Thank you, Tomer</p>",
        "id": 565276862,
        "sender_full_name": "Tomer",
        "timestamp": 1766578357
    },
    {
        "content": "<p>Welcome. It's easier to answer questions if you make them an <a href=\"https://leanprover-community.github.io/mwe.html\">#mwe</a> (that's a link you can click). In particular sharing exactly what code you ran to get the message you're mentioning is the way to make your question less vague.</p>",
        "id": 565277468,
        "sender_full_name": "Julian Berman",
        "timestamp": 1766578830
    },
    {
        "content": "<p>That being said, you're probably missing an <code>import Mathlib</code> in what you're running, or you can use a more specific import like <code>import Mathlib.Combinatorics.SimpleGraph.Walk</code> but then you'll need to potentially add more imports if you start using things from other modules.</p>",
        "id": 565277572,
        "sender_full_name": "Julian Berman",
        "timestamp": 1766578908
    },
    {
        "content": "<p>Here's an example you can see working by clicking on the live web playground link that will show up if you hover your mouse over this code block here in Zulip:</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"kn\">import</span><span class=\"w\"> </span><span class=\"n\">Mathlib</span>\n<span class=\"bp\">#</span><span class=\"n\">check</span><span class=\"w\"> </span><span class=\"n\">SimpleGraph</span>\n</code></pre></div>",
        "id": 565277633,
        "sender_full_name": "Julian Berman",
        "timestamp": 1766578952
    },
    {
        "content": "<p>Hey! Out of curiosity, what kind of random graphs are you interested in?</p>",
        "id": 565277648,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1766578965
    },
    {
        "content": "<p>Sorry on the question, I accidentally imported only Mathlib.tactics, instead of the whole of mathlib so that was the problem, I am still stuck on trying to understand how to make the set of the simple graphs but that a different problem, I defiantly feel like I miss something in using the existing simple graph definition in defining this set.</p>\n<p>As for which random graph I try to make, simply trying to make G(n,p).</p>",
        "id": 565287806,
        "sender_full_name": "Tomer",
        "timestamp": 1766585426
    },
    {
        "content": "<p>Great :) G(n, p) is defined in <a href=\"https://github.com/leanprover-community/mathlib4/pull/31364\">#31364</a></p>",
        "id": 565287987,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1766585561
    },
    {
        "content": "<p>Thank you, it seems it is a new one which explains why it was so hard to find.</p>",
        "id": 565314978,
        "sender_full_name": "Tomer",
        "timestamp": 1766607197
    }
]