[
    {
        "content": "<p>I am going through MIL (Mathematics in Lean) and I am enjoying it a lot.</p>\n<p>But there's one issue that I find annoying. Every time I make a slight change to the code, the Lean InfoView starts updating the status and this can take a long time. For instance, I just added a <code>gcongr</code> call and it took ~5 minutes to complete the update.</p>\n<p>Is this normal? Is there something I can do to speed up this update process?</p>",
        "id": 543608998,
        "sender_full_name": "Luiz Kazuo Takei",
        "timestamp": 1759866132
    },
    {
        "content": "<p>That's not normal; something's not set up right.</p>",
        "id": 543609198,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1759866215
    },
    {
        "content": "<p>Does just the infoview take a long time, or also your code recompiling. In VS Code, you see orange bars every time you update a proof and Lean re-checks it. Do they also take so long?</p>",
        "id": 543609314,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1759866254
    },
    {
        "content": "<p>Well, this issue with <code>gcongr</code> does not happen very often: this was an extreme case. Usually it takes a few seconds. I guess this is normal?</p>\n<p>Also, when I open a new file (within the same MIL project), it always takes a few minutes for the Lean InfoView to finish whatever it has to do to properly display the goals. Is this normal? (So I usually ask VSCode to open it and go do something else for a bit...)</p>",
        "id": 543610602,
        "sender_full_name": "Luiz Kazuo Takei",
        "timestamp": 1759866761
    },
    {
        "content": "<p>No, that's not normal either.</p>",
        "id": 543611882,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1759867257
    },
    {
        "content": "<p>Can you provide some more details about your situation= It's hard to diagnose this remotely without knowing anything particular about your situation.</p>",
        "id": 543611956,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1759867284
    },
    {
        "content": "<p>For instance, what does Lean do in those few minutes? Do you see your computer running hot (as if it's building all of mathlib)? Do you get blue messages \"building file X/Y\", and you're slowly re-building mathlib? (That would be slow, but that can also be fixed.)</p>",
        "id": 543612112,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1759867342
    },
    {
        "content": "<p>Are you on windows and your anti-virus is kicking in? (If so, try disabling it on the directory of MIL and see if that fixes the issue.)</p>",
        "id": 543612189,
        "sender_full_name": "Michael Rothgang",
        "timestamp": 1759867371
    },
    {
        "content": "<p>this happens to me too I thought it was normal</p>",
        "id": 543612717,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1759867576
    },
    {
        "content": "<p>maybe I need to use <code>#exit</code> more often</p>",
        "id": 543612818,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1759867617
    },
    {
        "content": "<p>When I open a new file, I just see that rotating circle and if I hover my mouse over it, it just says \"Updating...\"</p>\n<p>I didn't see any message saying \"building file X/Y\"... I am on Windows and next time I will check if the anti-virus is doing something...</p>\n<p>I was not aware of #exit but I will certainly try that too when I have these issues again.</p>\n<p>Thanks for the tips!</p>",
        "id": 543613941,
        "sender_full_name": "Luiz Kazuo Takei",
        "timestamp": 1759868066
    }
]