[
    {
        "content": "<p>Can anyone give me some pointers for how to do level 7 of the family union world in the Set Theory Game?<br>\n( this one: <a href=\"https://adam.math.hhu.de/#/g/djvelleman/stg4/world/FamUnion/level/7\">https://adam.math.hhu.de/#/g/djvelleman/stg4/world/FamUnion/level/7</a> )<br>\nAfter doing what seems like default simplification steps I tend to repeat the exact same sequence of steps leading me to something that doesn't seem provable.</p>\n<div class=\"codehilite\" data-code-language=\"something\"><pre><span></span><code>ext\nrw [mem_inter_iff]\nrw [mem_sUnion]\nrw [mem_sUnion]\napply Iff.intro\nintro h\nuse A\nrw [mem_setOf]\napply And.intro\nuse A\napply And.intro\n</code></pre></div>\n<p>PS: I've used the \"spoiler\" option for the code above, but I can't see that it does much. Does anyone know how to make that work?</p>",
        "id": 454869527,
        "sender_full_name": "Thijs Vromen",
        "timestamp": 1722267308
    },
    {
        "content": "<p>Did you think about whether <code>A</code> was the right choice when you did <code>use A</code>,  or did you just guess?</p>",
        "id": 454872859,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1722268232
    },
    {
        "content": "<p>After <code>intro h</code>, you have <code>h : x ∈ A ∧ ∃ t ∈ F, x ∈ t</code>.  The second half of <code>h</code> says that something exists.  When you know that something exists, it is almost always a good idea to use <code>obtain</code> to introduce a name for the thing that exists.  I would do that right after <code>intro h</code>.</p>",
        "id": 454873243,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1722268341
    },
    {
        "content": "<p>After you have used <code>obtain</code>, I would suggest that you think more about the meaning of the goal.  The goal says that there exists some <code>t</code> with a complicated property: it must be an element of a certain set, and <code>x</code> must be an element of it.  You need to figure out what set would have that property.  That's the set you have to <code>use</code>, and it's not <code>A</code>.  Note that you can apply <code>use</code> to a complicated expression--it doesn't have to be just a variable.</p>",
        "id": 454875206,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1722268813
    },
    {
        "content": "<p>thank you for the hints! I have indeed used <code>obtain</code> and then also tried using the variable that comes out of that (by default w), but got stuck just the same. But I hadn't considered using more complicated expressions, that sounds helpful!  Since I hadn't considered that it was indeed a bit of a guessing game so far</p>",
        "id": 454877041,
        "sender_full_name": "Thijs Vromen",
        "timestamp": 1722269324
    },
    {
        "content": "<p>There's a lesson here:  Lean will let you <code>use</code> whatever you want when you are trying to prove an existential statement.  But if you make the wrong choice, you may end up trying to prove something that is false.</p>",
        "id": 454877876,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1722269461
    }
]