[
    {
        "content": "<p>Hi I am looking to define some basic properties of Brownian motion in mathlib, I am new to lean and mathlib and was wondering if anyone had an idea of how to represent or define a stochastic process in lean across some measurable space. I have defined a probability space and a random variable in that space. Any help or guidance is appropriated.</p>",
        "id": 325504525,
        "sender_full_name": "Joshua Banks",
        "timestamp": 1675374709
    },
    {
        "content": "<p>Hey! When you say you've defined a probability space, do you mean you defined a specific probability space using the existing <a href=\"https://leanprover-community.github.io/mathlib_docs/find/measure_theory.measure_space\">docs#measure_theory.measure_space</a>, or you defined <em>what it meant to be a probability space</em>?</p>",
        "id": 325505373,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1675375018
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"243312\">@Jason KY.</span> who is one of the main forces behind the push for probability in mathlib.</p>",
        "id": 325505448,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1675375057
    },
    {
        "content": "<p>yes sorry I should have clarified, I have just used existing documentation, I'm very new and just trying to understand how to represent and define certain concepts. Thanks for your quick response.</p>",
        "id": 325515856,
        "sender_full_name": "Joshua Banks",
        "timestamp": 1675379484
    },
    {
        "content": "<p>In my project LeanCamCombi, we defined sequences of Bernoulli random variables <a href=\"https://github.com/YaelDillies/LeanCamCombi/blob/main/src/weighted_cube.lean\">here</a>. This is more or less what you want for a stochastic process.</p>",
        "id": 325516260,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1675379676
    },
    {
        "content": "<p>We currently have a bit of martingale theory (optional stopping, martingale convergence, etc.. c.f. <a href=\"https://leanprover-community.github.io/mathlib_docs/probability/martingale/basic.html\">here</a>) mostly for discrete time martingales. We don't have the Gaussian yet so you will need to define that if you want to define Brownian motions. We are lacking a lot of tools for continuous time stochastic processes (e.g. previsibility, cadlag...) so it would be a good exercise to define those also</p>",
        "id": 325667203,
        "sender_full_name": "Jason KY.",
        "timestamp": 1675440208
    },
    {
        "content": "<p>Just to remark that it took me a long time to understand what people meant by \"the Gaussian\". David Loeffler just seems to have proved that e^{-x^2/2} is its own Fourier transform, and I would have said that this was \"the Gaussian\" but my understanding is that other people mean far more general things by this phrase.</p>",
        "id": 325676488,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1675442604
    }
]