[
    {
        "content": "<p>I am working with <code>SL</code> from mathlib and <code>SL(2,F)</code> is kinda throwing me off given that we don't use parens and commas for fn calls in Lean. Is this accepted best style to add parens for common math objects? Where does one draw the line?</p>\n<p>It's great that Lean is flexible enough to support it, but feels a bit hacky - for example <code>SL (2, F)</code> is syntax error.</p>\n<p>Also, not a big deal, just a passing curiosity as I am learning more about Lean.</p>",
        "id": 542869893,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1759468810
    },
    {
        "content": "<p>I think using parens in macros to distinguish them from regular functions is encouraged</p>",
        "id": 542877457,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1759473414
    },
    {
        "content": "<p>In this particular case, in informal maths I would write <code>SL₂(F)</code>, with optional parentheses around the <code>F</code>.</p>",
        "id": 542877774,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1759473580
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"488971\">@Rado Kirov</span> the observation here is that normal brackets require a space before it, so we're taking advantage of this fact and declaring <code>xx(</code> to be a macro, and this is used in a lot of places (even in core lean). another such widely used macro is <code>congr(</code>.</p>",
        "id": 542909413,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1759485286
    },
    {
        "content": "<blockquote>\n<p>In this particular case, in informal maths I would write <code>SL₂(F)</code>, with optional parentheses around the <code>F</code>.</p>\n</blockquote>\n<p>But in any informal math you also write  φ(x) and σ(x) (say for totient and permutation functions) but adding macros for those to use parens will surely be too much. So <code>SL</code> and <code>GL</code> (and I am not sure what else in mathlib) are somehow special and more \"consturctor-y\" than \"function-y\" which justifies the macro? I am thinking about what is the principle for which math functions get parenthesized macros and which shouldn't.</p>\n<p><code>congr(...)</code> and <code>ofNat(...)</code> are more clearly different beasts.</p>",
        "id": 542959927,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1759502029
    }
]