[
    {
        "content": "<p>Hello everyone! <br>\nI'm currently working on a tool that takes in the DOI of a mathematics paper, and tries to identify the citation intention (dependent/non-dependent citation) for each citation. Then, it creates a Directed Acyclic Graph of the true dependencies of a paper.<br>\nSince LLMs are not great at understanding the intention of the citation, I will add a \"Justification\" feature, in which the user can click on an edge in the graph to find the LLM's justification <em>why</em> it classified a citation intent as dependent (result). <br>\nI have 2 questions for the community:<br>\n1) Would such a tool be useful?<br>\n2) What features would make it more useful for formalization? (It's okay if you give a suggestion that would be useful but much different from the tool I'm currently working on)</p>\n<p>Thanks in advance!</p>",
        "id": 530123277,
        "sender_full_name": "Chintan Bhat",
        "timestamp": 1753183423
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"937773\">Chintan Bhat</span> <a href=\"#narrow/channel/113489-new-members/topic/Suggestions.20for.20a.20tool.20to.20aid.20formalization/near/530123277\">said</a>:</p>\n<blockquote>\n<p>LLMs are not great at understanding the intention of the citation</p>\n</blockquote>\n<p>Why wouldn't they be?</p>",
        "id": 530124049,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1753183657
    },
    {
        "content": "<p>I tried some papers with Gemini 2.5 Pro, and it seemed to look at only the surrounding text for indications that it is a dependent citation. But you're absolutely right - with better prompting and instructions, they can definitely do better. <br>\nI think Justification would be a useful feature nevertheless...</p>",
        "id": 530126293,
        "sender_full_name": "Chintan Bhat",
        "timestamp": 1753184366
    },
    {
        "content": "<p>I'm not really sure what this would be used for in the context of formalization</p>",
        "id": 530129335,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1753185383
    },
    {
        "content": "<p>It could be used as a quick tool to make a \"first approximation\" of a blueprint, to assess the feasibility of formalizing existing papers. <br>\nAgain, the goal is to make a tool that is actually very useful for formalization, so feel free to suggest other approaches (or features) that you think will help the community more than my current approach.</p>",
        "id": 530134240,
        "sender_full_name": "Chintan Bhat",
        "timestamp": 1753186941
    },
    {
        "content": "<p>I wonder if doing this on a paper level rather than a theorem level won't be too much of an overapproximation</p>",
        "id": 530134926,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1753187164
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/channel/113489-new-members/topic/Suggestions.20for.20a.20tool.20to.20aid.20formalization/near/530134926\">said</a>:</p>\n<blockquote>\n<p>I wonder if doing this on a paper level rather than a theorem level won't be too much of an overapproximation</p>\n</blockquote>\n<p>Thank you for the insight! I understand a theorem-level approximation would be significantly more useful. But if there were a theorem-level approximation, how useful do you think it would be? As in, how much time could it approximately save?</p>",
        "id": 530136956,
        "sender_full_name": "Chintan Bhat",
        "timestamp": 1753187804
    }
]