[
    {
        "content": "<p>I tried browsing the Mathlib documentation, checking to see if things I might want to use are there (and indeed they typically are), and found the <code>Summable</code> predicate (in <code>Mathlib.Topology.Algebra.InfiniteSum.Defs</code>), and related constructions/properties.</p>\n<p>Basically, <code>Summable</code> is part of what I was looking for: it states that some family of elements of a topological \"space\" has an unconditional sum.</p>\n<p>What surprised me are the instance parameters associated with the definition: <code>[AddCommMonoid a]</code> and <code>[TopologicalSpace a]</code>. My understanding is that this says that we have both a commutative monoid and a topological space with carrier set <code>a</code> (not sure how to type the Greek letters into Zulip, this is supposed to be an alpha), but it doesn't seem to impose any compatibility conditions on the two structures (like, a <code>TopologicalSemiring</code> is a semiring where addition and multiplication are continuous). Is there some subtle relationship between the two that I am missing in the definitions, or is that because at this point the definitions don't require any conditions and these come later in the theory? (This may very well come from a misunderstanding on my part of how instance parameters work)</p>\n<p>Also (and this is more related to the way Mathlib is built), I see this part of the library deals with infinite sums indexed over a whole type, and defines its notations for them. But does the library also have infinite sums indexed by a set (that is, add in a predicate for membership in the set into the notation)? Of course these would reduce to sums indexed by the whole type by mapping values not in the set to <code>0</code> (possibly with some added automation in proofs).</p>",
        "id": 478499509,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1729690927
    },
    {
        "content": "<p>You can look at the implementation notes:</p>\n<blockquote>\n<p>We say that a function <code>f : β → α</code> has an unconditional product of <code>a</code> if the function <code>fun s : [Finset](https://leanprover-community.github.io/mathlib4_docs/Mathlib/Data/Finset/Basic.html#Finset) β ↦ ∏ b ∈ s, f b</code> converges to <code>a</code> on the <code>atTop</code> filter on <code>[Finset](https://leanprover-community.github.io/mathlib4_docs/Mathlib/Data/Finset/Basic.html#Finset) β</code>. In other words, for every neighborhood <code>U</code> of <code>a</code>, there exists a finite set <code>s : [Finset](https://leanprover-community.github.io/mathlib4_docs/Mathlib/Data/Finset/Basic.html#Finset) β</code> of indices such that <code>∏ b ∈ s', f b ∈ U</code> for any finite set <code>s'</code> which is a superset of <code>s</code>.</p>\n</blockquote>\n<p>In particular, no relation between the topological space and the monoid is needed for the definition</p>",
        "id": 478503303,
        "sender_full_name": "Daniel Weber",
        "timestamp": 1729691906
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"726077\">Philippe Duchon</span> <a href=\"#narrow/channel/113489-new-members/topic/Summable.2C.20and.20multiple.20instance.20parameters/near/478499509\">said</a>:</p>\n<blockquote>\n<p>But does the library also have infinite sums indexed by a set</p>\n</blockquote>\n<p>This can be handled by treating the set as a type (ie, pairs of elements and proofs that they belong to the set)</p>\n<blockquote>\n<p>Of course these would reduce to sums indexed by the whole type by mapping values not in the set to <code>0</code> (possibly with some added automation in proofs).</p>\n</blockquote>\n<p><a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=tsum_subtype#doc\">docs#tsum_subtype</a> is the statement of this result.</p>",
        "id": 478503315,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1729691908
    },
    {
        "content": "<p>Thanks, this shows I still have a lot of work before I can semi-fluently read the docs...</p>",
        "id": 478513919,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1729694739
    },
    {
        "content": "<p>I was stunned once to notice the observation you're making, that there was no compatibility between the topology and addition in the definition and the first few theorems. The point is that all the theorems proved in the <code>Defs</code> file (and the beginning of the <code>Basic</code> file) are really trivial. <a href=\"https://github.com/leanprover-community/mathlib4/blob/9e3c142985604203ca1c976f9960bd5a2a19999e/Mathlib/Topology/Algebra/InfiniteSum/Basic.lean#L243\">Here</a> is the point in the exposition where the group law is assumed to be continuous with respect to the topology. The first theorem proved after that is (the multiplicative version of) sum of the limit is the limit of the sums, for two sequences.</p>",
        "id": 478562796,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1729709583
    }
]