[
    {
        "content": "<p>Hi all, I'm Talia, and I'm finally joining this Zulip. I'm primarily from the Coq community, but recently I have gotten looped into some cool discussions about AI for math with proof assistants in the loop, and correspondingly I want to stay in touch with this community and understand what is going on here.</p>\n<p>I'm a professor at UIUC and my work is on proof automation. These days I do everything from dependent type theory research to machine learning research in service of making formal proof more accessible. I also do a ton of community stuff, and I talk a lot on social media. Website is here: <a href=\"https://dependenttyp.es/\">https://dependenttyp.es/</a></p>\n<p>I am also really interested in potential collaborations with mathematicians, eventually. Most of my work has been for program verification, but I have strong views that if I'm building automation a community might use, I should know what it's like to do the work that community does. So I'd really enjoy doing some formal math at some point (I've done a small amount of math research before, before I ever got into computer science, but nothing with proof assistants), even before building automation targeting mathematicians specifically.</p>\n<p>Anyways, hello <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span></p>",
        "id": 378218283,
        "sender_full_name": "Talia Ringer",
        "timestamp": 1690218989
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> for reminding me this place exists lol</p>",
        "id": 378223351,
        "sender_full_name": "Talia Ringer",
        "timestamp": 1690220032
    },
    {
        "content": "<p>Welcome Talia! Great to see you here!</p>",
        "id": 378223593,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1690220079
    },
    {
        "content": "<p>Hi Talia, we're relatively close geographically; I'm at SIUE. We should chat a bit and find a time to get together.</p>",
        "id": 378226891,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1690220888
    },
    {
        "content": "<p>Sure, you can use my Calendly for that: <a href=\"https://calendly.com/taliaringer/1-on-1-with-talia?back=1&amp;month=2023-08\">https://calendly.com/taliaringer/1-on-1-with-talia?back=1&amp;month=2023-08</a> (for an initial chat, then we can plan from there)</p>",
        "id": 378227201,
        "sender_full_name": "Talia Ringer",
        "timestamp": 1690220965
    },
    {
        "content": "<p>I definitely want to plug the <a class=\"stream\" data-stream-id=\"219941\" href=\"/#narrow/stream/219941-Machine-Learning-for-Theorem-Proving\">#Machine Learning for Theorem Proving</a> steam to you.  Feel free to mention your papers and projects there when they come out.</p>",
        "id": 378228728,
        "sender_full_name": "Jason Rute",
        "timestamp": 1690221340
    },
    {
        "content": "<p>See <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> I joined after all :D</p>",
        "id": 378559929,
        "sender_full_name": "Talia Ringer",
        "timestamp": 1690307202
    }
]