[
    {
        "content": "<p>Hello everyone,</p>\n<p>My name is Rick van Oosterhout, I am a Master’s student in Computer Science and Engineering at the University of Technology Eindhoven. I have recently started my thesis on formalizing the relational algebra using Lean. The main goal of this thesis will be to prove the equivalence between first-order logic and the relational algebra. Given that I am currently working on my literature survey and initial experiments, I thought it would be helpful to reach out to more experienced Lean users. </p>\n<p>For me this will be my first project using Lean. I have worked with Coq and Haskell before, so many concepts should not be new to me. However, I have noticed that there is a lot to learn, before I can work on the implementation of the project.</p>\n<p>If anyone has any relevant sources, useful suggestions and starting guides or immediate feedback, feel free to join in on this conversation. I have already collected a number of resources and set up some initial experiments. But I would love to get some more insights from those who are more experienced with Lean.</p>",
        "id": 496884206,
        "sender_full_name": "Rick van Oosterhout",
        "timestamp": 1738277983
    },
    {
        "content": "<p>Welcome! Do you already know about <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a> ? That's one of the standard sources.</p>",
        "id": 496922269,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1738302368
    },
    {
        "content": "<p>I also had to learn Lean for my Bachelor's thesis, and going through <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a> was very helpful!</p>",
        "id": 496941886,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1738307768
    },
    {
        "content": "<p>Thanks for the suggestion! I definitely came across that book a few times already during my literature survey and first experiments. It indeed seems very useful to get started with my thesis.</p>",
        "id": 497164672,
        "sender_full_name": "Rick van Oosterhout",
        "timestamp": 1738416310
    },
    {
        "content": "<p>Is <a href=\"https://github.com/AviCraimer/relational-calculus-library-lean4\">https://github.com/AviCraimer/relational-calculus-library-lean4</a> related?</p>",
        "id": 497170452,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1738421592
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/channel/113489-new-members/topic/Thesis.20on.20Lean.20and.20Relational.20Algebra/near/497170452\">said</a>:</p>\n<blockquote>\n<p>Is <a href=\"https://github.com/AviCraimer/relational-calculus-library-lean4\">https://github.com/AviCraimer/relational-calculus-library-lean4</a> related?</p>\n</blockquote>\n<p>This seems very interesting and definitely related to what I will be working on. I will look into this and see how usefull it will be when I get more hands-on with Lean. Thanks!</p>",
        "id": 497420315,
        "sender_full_name": "Rick van Oosterhout",
        "timestamp": 1738585691
    },
    {
        "content": "<p>After a closer look at the repository you mentioned, I figured that it might not be as useful as I thought initially. The term relational calculus has a very different meaning in database theory, which made me optimistic initially. However, I am afraid that the calculus of relations does not really relate with the database theory concepts.</p>",
        "id": 498215287,
        "sender_full_name": "Rick van Oosterhout",
        "timestamp": 1738878077
    }
]