[
    {
        "content": "<p>I have previously learned to use <code>dsimp</code> to unfold definitions.</p>\n<p>For example <code>dsimp Odd</code> changes how a goal or hypothesis involving <code>Odd</code> is displayed, it is displayed as an existence proposition as per the definition in mathlib.</p>\n<p><code>dsimp</code> can be extended eg <code>dsimp [Odd, Even]</code> to unfold both definitions.</p>\n<p>Today I saw <code>dsimp</code> used without any parameters, just on its own - eg <a href=\"https://hrmacbeth.github.io/math2001/04_Proofs_with_Structure_II.html#id8\">example 4.1.7</a> in Mechanics of Proof.</p>\n<p><strong>Question 1:</strong> What does <code>dsimp</code> on its own do? It would be different from <code>dsimp at *</code>, which I am also not sure about.</p>\n<p><strong>Question 2:</strong> The mathlib definition of <code>dsimp</code> says it changes goal states, but the beginner course Mechanics of Proof says dsimp only changes how the goal state is displayed, nothing internal is changed. Is that just a useful simplification for beginners?</p>\n<p><strong>Question 3:</strong> I have found that the effect of <code>dsimp</code> seems to wear off and I need to repeat it further down the code. Is this a bug, or some scoping rule I'm not aware of. Sadly I don't have an MWE to show this.</p>",
        "id": 480047132,
        "sender_full_name": "rzeta0",
        "timestamp": 1730465728
    },
    {
        "content": "<p>I would suggest to read the hover information of <code>dsimp</code> and if that is not enough also read the one of <code>simp</code>.</p>",
        "id": 480047935,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1730466107
    },
    {
        "content": "<p>I should have been clearer in my original post - the docs aren't clear for a beginner like me.</p>",
        "id": 480054044,
        "sender_full_name": "rzeta0",
        "timestamp": 1730468671
    },
    {
        "content": "<p>Did you read \"Theorem proving in Lean\"? This has a section on <code>simp</code>.</p>",
        "id": 480054530,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1730468851
    },
    {
        "content": "<p>i'll take a look, thanks.</p>\n<p>I've been working through the Mechanics of Proof, doing every exercise as I proceed, but suddenly in chapter 4 new syntax is introduced a few times without explanation.</p>",
        "id": 480055000,
        "sender_full_name": "rzeta0",
        "timestamp": 1730469053
    },
    {
        "content": "<p>I think you once said that you found <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/\">#tpil</a> too hard going when you last looked at it, but you're a lot more experienced now and so maybe it's a better fit now. It's a great book. I came into this area knowing nothing about type theory or computer science and it got me started, although I had a strong background in mathematics.</p>",
        "id": 480056031,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1730469474
    }
]