[
    {
        "content": "<p>I tried to prove some IMO geometry problems, but it seems that mathlib doesn't have a definition of the incenter of a triangle. How do you define the incenter of a triangle?</p>",
        "id": 560896274,
        "sender_full_name": "vxctyxeha",
        "timestamp": 1764405789
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Affine.Simplex.incenter#doc\">docs#Affine.Simplex.incenter</a><br>\nthis one?</p>",
        "id": 560915217,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1764422955
    },
    {
        "content": "<p>Note that I currently have 16 open PRs needing review in my series working towards IMO 2024 P4 (and there will be at least 6 more PRs in that series, including the final one with the actual solution to IMO 2024 P4 itself, before it's done).</p>\n<p>In particular, you're unlikely to get far on many problems with the incenter without <a href=\"https://github.com/leanprover-community/mathlib4/pull/30982\">#30982</a>, relating to angle bisection, which has been open since October and depends on <a href=\"https://github.com/leanprover-community/mathlib4/pull/30981\">#30981</a> (also open since October, all dependencies now merged). Other open PRs in this series specifically involving the incenter include <a href=\"https://github.com/leanprover-community/mathlib4/pull/31057\">#31057</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/31733\">#31733</a>, <a href=\"https://github.com/leanprover-community/mathlib4/pull/31981\">#31981</a> (which has several unmerged dependencies).</p>\n<p>At this point you should expect that formalizing a solution to an IMO geometry problem will involve opening at least tens of PRs along the way with more generally useful definitions or lemmas that were missing from mathlib, unless the requirements for that particular problem are extremely close to those of previously formalized problems.</p>\n<p>You should also expect that most of the length of a formal solution will be proving nondegeneracy conditions, along with configuration properties such as the order of points on a line or which points are on the same side / opposite sides of a line or which angles are oriented the same way, rather than the parts corresponding more directly to the steps that are explicit in the informal solution.</p>",
        "id": 560916910,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1764424678
    },
    {
        "content": "<p>good old \"it's obvious from the diagram\"</p>",
        "id": 560917198,
        "sender_full_name": "Weiyi Wang",
        "timestamp": 1764424941
    }
]