[
    {
        "content": "<p>Has anyone attempted to write some kind of UI library/framework in Lean? I mean something React-like but actually written in Lean. Does the question even make sense? I guess maybe not without JS bindings. But maybe there are some DOM-like native targets that this could be prototyped against? I'm mostly just interested in the ergonomics of writing React-like components in Lean so I don't actually care what the underlying target is.</p>",
        "id": 536880803,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1756519030
    },
    {
        "content": "<p>There's <a href=\"https://github.com/leanprover-community/ProofWidgets4\">https://github.com/leanprover-community/ProofWidgets4</a> for writing UI in Lean. You get to use a DOM, and it uses React. Widgets show up in the Infoview.</p>\n<p>Somehow there's some RPC interface between Lean and Javascript for this for interactive widgets. I think it's sort of a server-client model, with Lean and Javascript-with-DOM.</p>",
        "id": 536881712,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1756520472
    },
    {
        "content": "<p>Interesting. This is fun but I guess I mean pure Lean, in the sense that the component model itself and reconciliation happens in Lean. My interest isn't anything practical but more like what a pure implementation of React reconciliation would look like.</p>",
        "id": 536881827,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1756520645
    },
    {
        "content": "<blockquote>\n<p>reconciliation happens in Lean</p>\n</blockquote>\n<p>The original implementation of ProofWidgets in Lean 3 did this; have a look at <span class=\"user-mention\" data-user-id=\"121918\">@Edward Ayers</span> <a href=\"https://www.edayers.com/thesis/widgets#system-description\">PhD thesis</a>. In that setting, reconciliation happens in the Lean server. This can unfortunately result in quite unresponsive UI when the JS client in which widgets appear and the Lean server are on different physical machines. So in the Lean 4 version, we made the decision to run widget code (including reconciliation) in clients using vanilla React; I would still like to see a Lean API for writing these, but that seems to basically require a Lean-to-JS compilation target. I don't know of anyone working on that atm.</p>\n<p>(Also here are <a href=\"#narrow/stream/270676-lean4/topic/Lean.204.20and.20WASM/near/242384891\">some</a> <a href=\"#narrow/channel/270676-lean4/topic/wasm.20build\">prior</a> <a href=\"#narrow/channel/270676-lean4/topic/Lean.204.20as.20an.20application.20language\">discussions</a> of Lean-WASM.)</p>",
        "id": 536882147,
        "sender_full_name": "𝚠𝚘𝚓𝚌𝚒𝚎𝚌𝚑 𝚗𝚊𝚠𝚛𝚘𝚌𝚔𝚒",
        "timestamp": 1756521101
    },
    {
        "content": "<p>Not directly related (sounds like there isn't any Lean UI library at the moment), but given Lean's Haskell adjacency, <a href=\"https://www.altocumulus.org/Fudgets\">https://www.altocumulus.org/Fudgets</a> might be of interest. It's ancient, unmaintained, no idea if any serious UI was ever built with it, but if one rebuilds a UI libary in Lean it might end up looking similar (due to purity, focus on composition and algebraic thinking).</p>",
        "id": 536884843,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1756524975
    },
    {
        "content": "<p>What would be the use case? If you want to interface with Lean from a UI perspective. It may be simpler to write something in a standard language like C# or python or javascript and interface with the Lean kernel.</p>\n<p>If you wanted just a dependently typed programming language for making general apps, then Idris would probably be a better choice.</p>\n<p>It would be nice if Lean became a general purpose programming language for making apps but I don't think it's going that way...</p>",
        "id": 536885101,
        "sender_full_name": "Mr Proof",
        "timestamp": 1756525328
    },
    {
        "content": "<blockquote>\n<p>making general apps, then Idris would probably be a better choice.</p>\n</blockquote>\n<p>OOC, what are the differences - core language, or existing ecosystem or something else?</p>",
        "id": 536885286,
        "sender_full_name": "Rado Kirov",
        "timestamp": 1756525622
    },
    {
        "content": "<p>I think it's just an opinion.</p>",
        "id": 536893593,
        "sender_full_name": "(deleted)",
        "timestamp": 1756534604
    },
    {
        "content": "<p>I don't agree with it.</p>",
        "id": 536893625,
        "sender_full_name": "(deleted)",
        "timestamp": 1756534640
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"418569\">Dan Abramov</span> <a href=\"#narrow/channel/113489-new-members/topic/UI.20in.20Lean/near/536880803\">said</a>:</p>\n<blockquote>\n<p>Has anyone attempted to write some kind of UI library/framework in Lean? I mean something React-like but actually written in Lean. Does the question even make sense? I guess maybe not without JS bindings. But maybe there are some DOM-like native targets that this could be prototyped against? I'm mostly just interested in the ergonomics of writing React-like components in Lean so I don't actually care what the underlying target is.</p>\n</blockquote>\n<p>What I like to see is whether lean4 (since it is a functional language) could re-implement (?) something like....</p>\n<p><a href=\"https://elm-lang.org\">https://elm-lang.org</a><br>\n<a href=\"https://elm-lang.org/try\">https://elm-lang.org/try</a></p>\n<p>Elm is a functional programming language that compiles to JavaScript, and is used for  websites and web apps. I find it vy user friendly! Would love to see that! <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 536895583,
        "sender_full_name": "Artur Lojewski",
        "timestamp": 1756536933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"725689\">@Mr Proof</span> Just to clarify, the Lean kernel is only one element of the Lean system, and it's not what you'd interface with for general-purpose programming. Lean <em>is</em> a general-purpose programming language, and that is one of the project's primary goals. Most of Lean is written in Lean, even the LSP server and compiler, and it compiles to efficient code. You would interface with compiled Lean code, which uses a C ABI.</p>\n<p>You can use that C ABI to bind to existing GUI libraries. Idris does not appear to have native GUI libraries either, so it's unclear what the advantage is.</p>",
        "id": 536895928,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1756537395
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"935848\">@Artur Lojewski</span> I'm looking forward to one day someone making a JS or WASM backend. There are some things I've written in Javascript that I'd love to be able to rewrite in Lean and feel more confident in being correct!</p>\n<p>That's not exactly what you're suggesting, but if there were such a backend, with Lean's powerful metaprogramming features I don't see why there couldn't be some Elm-like DSL in Lean.</p>",
        "id": 536896315,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1756537857
    },
    {
        "content": "<p>Well, it's just my opinion. The <a href=\"https://lean-lang.org/fro/roadmap/1900-1-1-the-lean-fro-year-3-roadmap/\">lean roadmap</a> doesn't seem to prioritise making it a user interface based langauge.</p>\n<p>If I wanted to write a Tetris game for a mobile phone, Lean would be the last language on my list to use. But I'm prepared to be proved wrong.</p>\n<p>It shouldn't be too hard anyway to support windows API calls within Lean. If you can call functions from a DLL that's basically all you need. But, I don't know why that would be better?</p>\n<p>BTW last year I tried to make a UI in C# to run Lean, but when I found the MathLib library took up about 4GB of RAM to run I gave up. But I think there's been improvements since then e.g. incremental loading.</p>",
        "id": 536943604,
        "sender_full_name": "Mr Proof",
        "timestamp": 1756593568
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"418569\">@Dan Abramov</span> I was immediately interested in this family of questions as well, both because of my experience with Elm and because of working on the more restricted \"diagrammar\" widget toolkit at Brilliant (<a href=\"https://www.youtube.com/watch?v=gT9Xu-ctNqI\">strangeloop talk about that</a>). </p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"gT9Xu-ctNqI\" href=\"https://www.youtube.com/watch?v=gT9Xu-ctNqI\"><img src=\"https://uploads.zulipusercontent.net/dbfc9361737cd25df2149cc8210a3243e7c5be2e/68747470733a2f2f692e7974696d672e636f6d2f76692f67543958752d63744e71492f6d7164656661756c742e6a7067\"></a></div><p>The leansplat-demo.mov here is a VERY hacked together tech demo I made that was actually using Lean metaprogramming to coax expressions in Lean's kernel language into javascript on the filesystem, and then using Vite to pick up those filesystem changes and refresh the page.<br>\n<a href=\"/user_uploads/3121/xSBjKEC9SqxQgsV4ZGuehYqZ/leansplat-demo.mov\">leansplat-demo.mov</a></p>",
        "id": 537707060,
        "sender_full_name": "Rob Simmons",
        "timestamp": 1757001885
    },
    {
        "content": "<p>Based on subsequent conversations I think you wouldn't want to actually hook into metaprogramming where I was choosing to do so, but I think trying to build an Elm Architecture-style setup this way could be quite cool.</p>",
        "id": 537707957,
        "sender_full_name": "Rob Simmons",
        "timestamp": 1757002176
    },
    {
        "content": "<p>maybe this'll embed better: </p>\n<p><a href=\"/user_uploads/3121/efrhMxjusug06yEva5HIlMZO/ezgif-2efc21f7c7c1f0.gif\">ezgif-2efc21f7c7c1f0.gif</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/efrhMxjusug06yEva5HIlMZO/ezgif-2efc21f7c7c1f0.gif\" title=\"ezgif-2efc21f7c7c1f0.gif\"><img data-animated=\"true\" data-original-content-type=\"image/gif\" data-original-dimensions=\"800x717\" src=\"/user_uploads/thumbnail/3121/efrhMxjusug06yEva5HIlMZO/ezgif-2efc21f7c7c1f0.gif/840x560-anim.webp\"></a></div>",
        "id": 537708018,
        "sender_full_name": "Rob Simmons",
        "timestamp": 1757002202
    }
]