[
    {
        "content": "<p>Hi everyone. I took undergraduate calculus a long time ago and consider myself quite rusty. I've been meaning to work through Spivak's <em>Calculus</em> to build that knowledge back up. I also have been meaning to play around with Lean. I'm toying around with the idea of using Lean to work through Spivak's material, but I don't remember enough about calculus and don't know enough about Lean and the capabilities of mathlib to have an idea of whether such an exercise would be futile. Any thoughts on the matter would be appreciated.</p>",
        "id": 324992649,
        "sender_full_name": "wanaks",
        "timestamp": 1675191825
    },
    {
        "content": "<p>I would give it a go. I'm sure you'll learn something!</p>",
        "id": 324993367,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1675192018
    },
    {
        "content": "<p>Thanks for the input. I know mathlib is an actively developed project. Do you think the library has enough support for this exercise? Or are there certain topics, for which mathlib might not currently have the functionality that I will need, of which I should be aware?</p>",
        "id": 324997222,
        "sender_full_name": "wanaks",
        "timestamp": 1675193086
    },
    {
        "content": "<p>Which bits of Spivak were you thinking of formalising? You can always search the mathlib docs <a href=\"https://leanprover-community.github.io/mathlib_docs/\">https://leanprover-community.github.io/mathlib_docs/</a></p>",
        "id": 324998318,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1675193407
    },
    {
        "content": "<p>No specific bits. I was planning on working through it cover-to-cover and using lean to either reconstruct proofs included in the text or write solutions to the exercise questions that ask for proofs.</p>",
        "id": 325002578,
        "sender_full_name": "wanaks",
        "timestamp": 1675194795
    },
    {
        "content": "<p>That's a LOT of work!</p>",
        "id": 325003244,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1675195007
    },
    {
        "content": "<p>Working on formalising the exercise statements might be interesting though, and might be useful for other classes or students? <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 325005710,
        "sender_full_name": "Gareth Ma",
        "timestamp": 1675195738
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/stream/113489-new-members/topic/Undergrad.20calculus/near/325003244\">said</a>:</p>\n<blockquote>\n<p>That's a LOT of work!</p>\n</blockquote>\n<p>Yes, I suspect I’ll need to be judicious in exercise selection. My experience with Lean is limited, so I’m likely underestimating the level of effort for writing the proofs as well (only one way to find out).</p>",
        "id": 325006080,
        "sender_full_name": "wanaks",
        "timestamp": 1675195862
    }
]