[
    {
        "content": "<p>Hello, I come across this paper <a href=\"https://www.usenix.org/system/files/osdi24-sun-xudong.pdf\">https://www.usenix.org/system/files/osdi24-sun-xudong.pdf</a><br>\nAnd I was interested in the concept of proving the correctness of a program.<br>\nI was wondering if Lean can do same stuff, like prove other programs like C let's say</p>",
        "id": 451070454,
        "sender_full_name": "Ayn",
        "timestamp": 1720816799
    },
    {
        "content": "<p><a href=\"#narrow/stream/113489-new-members/topic/using.20lean.20to.20prove.20programs.20in.20other.20languages/near/451070454\">A message</a> was moved here from <a class=\"stream-topic\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members/topic/match.20with.20toLex\">#new members &gt; match with toLex</a> by <span class=\"user-mention silent\" data-user-id=\"735916\">Ayn</span>.</p>",
        "id": 451071130,
        "sender_full_name": "Notification Bot",
        "timestamp": 1720817006
    },
    {
        "content": "<p>Yes there are multiple ways to verify programs not written in Lean with Lean, the three most common ones in increasing order of confidence in correctness:</p>\n<ul>\n<li>Formalizing a model of your algorithm in Lean, this is the technique the paper you linked uses. Note that this still relies on the fact that your algorithm is correctly implemented in your target language.</li>\n<li>Using differential fuzzing, you implement a version in Lean that you formalize and the actual version. Then you provide both versions with random inputs and check if they agree. Do this for a sufficient amount of inputs and you will get great confidence that your implementation does indeed behave the same as the verified one and thus most likely has the verified properties as well. This is for example how AWS verified Cedar in Lean.</li>\n<li>Actually formalize the semantics of your target programming language in Lean, read in the program and do reasoning about its semantics directly. Assuming that your semantics are correct this gives you basically absolute correctness confidence. This technique is <em>very</em> high effort and thus not employed often. One example of a high visibility project that did this is seL4 which was verified in this matter using Isabelle.</li>\n</ul>",
        "id": 451071645,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1720817164
    },
    {
        "content": "<p>Any pointers on how to start, I am both beginner in Lean and this \"science?!\"</p>",
        "id": 451072195,
        "sender_full_name": "Ayn",
        "timestamp": 1720817293
    },
    {
        "content": "<p>Is there anything concrete that you wish to work towards?</p>",
        "id": 451072544,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1720817385
    },
    {
        "content": "<p>I just need to start with very basic stuff, proving correctness of something very straight forward, and gradually going into more complex cases, like concurrency and distributed systems</p>",
        "id": 451072740,
        "sender_full_name": "Ayn",
        "timestamp": 1720817431
    },
    {
        "content": "<p>also worth noting that my mathematical background is very limited as I am not a math grad, so something doesn't involve a lot of math sounds like a good starter</p>",
        "id": 451072891,
        "sender_full_name": "Ayn",
        "timestamp": 1720817479
    },
    {
        "content": "<p>You can look into books like Theorem Proving in Lean 4 or Functional Programming in Lean 4 to get started. For material related to program verification you might want to check out the hitchickers guide to logic verification 2024.</p>\n<p>Note that concurrency and distributed systems people have not yet started to do work with  Lean so you will mostly be on your own if you wish to go into that precise direction.</p>",
        "id": 451074300,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1720817932
    },
    {
        "content": "<p>Thanks I will take a look at that</p>",
        "id": 451075554,
        "sender_full_name": "Ayn",
        "timestamp": 1720818423
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"735916\">@Ayn</span> if you don't have a specific C language program you want to verify, you could also start by just writing the program itself in lean. It's not \"just\" a proof language, and  you can write and run programs without having to prove that they're correct.</p>\n<p>In my (rather limited) experience, the verification part is <em>much</em> harder than the programming part, or at least requires a whole batch of new skills.</p>\n<p>I wrote a simple prime number generator in lean in a couple hours, and have been working to formally verify it for about <del>two</del> <em>three!</em> weeks now... :)  (I'm keeping a <a href=\"#narrow/stream/113489-new-members/topic/How.20do.20I.20prove.20my.20prime.20sieve.20works.3F\">devlog</a> in another thread if you're interested)</p>",
        "id": 451210272,
        "sender_full_name": "Michal Wallace (tangentstorm)",
        "timestamp": 1720896031
    },
    {
        "content": "<p>If one wants to work with C language specifically, there's an option to use <a href=\"https://vst.cs.princeton.edu/\">Coq and VST</a>. I have done the first two Project Euler exercises using it... the third one was too hard for me, so it's postponed... <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 451228888,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1720907072
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"423842\">Michal Wallace (tangentstorm)</span> <a href=\"#narrow/stream/113489-new-members/topic/using.20lean.20to.20prove.20programs.20in.20other.20languages/near/451210272\">said</a>:</p>\n<blockquote>\n<p>In my (rather limited) experience, the verification part is <em>much</em> harder than the programming part, or at least requires a whole batch of new skills.</p>\n</blockquote>\n<p>Completely agree...</p>",
        "id": 451228970,
        "sender_full_name": "Ilmārs Cīrulis",
        "timestamp": 1720907151
    }
]