[
    {
        "content": "<p>The recent discussion on variables made me think of this question.</p>\n<p>Say I want to work with a specific instance of a typeclass. How do I make this clear to Lean?</p>\n<p>Say, for instance, I want to work with formal power series: I have some ring <code>R</code> of coefficients, but I want the discrete topology on it so I can use the product topology. If I just write <code>variable {R: Type*} [TopologicalSpace R]</code>, Lean will expect, based on what my concrete <code>R</code> is (probably the rationals, or the reals, or the complexes; with the integers, default typeclass synthesis would probably pick the one I want), to infer a topology on this, but this won't be the one I had in mind - and neither will the product topology on power series.</p>\n<p>So, in a sense, I would like to say, \"in this section, if you ever need a <code>TopologicalSpace R</code>, this is the one I have in mind\". Now that I rephrase it this way, this is probably a very dumb question...</p>",
        "id": 525730850,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1750863071
    },
    {
        "content": "<p>Do you want <code>variable {R : Type*} [TopologicalSpace R] [DiscreteTopology R]</code>?</p>",
        "id": 525731094,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1750863139
    },
    {
        "content": "<p>Or do you want a type synonym to equip a type with the discrete topology</p>",
        "id": 525731295,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1750863202
    },
    {
        "content": "<p>You might find that power series rings have got an optional topology which you can \"switch on\" which doesn't ask for a topology on R at all, but puts the maximal-ideal-adic topology on the power series ring.</p>",
        "id": 525746912,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1750867754
    },
    {
        "content": "<p>The topology example was just one that seemed to fit the question (a case where the exact wanted instance of a typeclass might reasonably depend on the situation); my question was more general in spirit.</p>",
        "id": 525755326,
        "sender_full_name": "Philippe Duchon",
        "timestamp": 1750870757
    },
    {
        "content": "<p>The general solutions are type synonyms and prop-valued classes such as <code>[Discrete topology R]</code> or <code>[IsModuleTopology R]</code></p>",
        "id": 525761505,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1750873172
    },
    {
        "content": "<p>Similarly in measure theory there is <code>[BorelSpace X]</code> to say 'this arbitrary sigma algebra you just attached to this topological space is the Borel sigma algebra\"</p>",
        "id": 525761678,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1750873233
    }
]