[
    {
        "content": "<p>Hello, I'm a philosopher (not a practicing academic) interested in condensing natural language for the purposes of education. I'd be interested in getting feedback on a pamphlet I've written that I hope will engage public conversations about language: <a href=\"https://github.com/rj-calvin/verisimilitude/blob/main/out/verisimilitude.pdf\">https://github.com/rj-calvin/verisimilitude/blob/main/out/verisimilitude.pdf</a>.</p>\n<p>By virtue of the aggressive take on simplicity, there are only 4 pages of content since this is meant to be easy for people to make the time for in their busy lives. The rhetoric is meant to function as a riddle, but the general idea is that our collective love for Einstein's brilliance are beginning to hold us back as a society due to the abstraction of \"reference frames.\" The goal of the pamphlet is to prompt the reader to consider whether or not Einstein's special relativity really is as indestructible as it appears.</p>",
        "id": 506826416,
        "sender_full_name": "Calvin",
        "timestamp": 1742417754
    },
    {
        "content": "<p>Can you explain how this relates to courses taught using Lean?</p>",
        "id": 506827747,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1742418229
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"187764\" href=\"/#narrow/channel/187764-Lean-for-teaching/topic/Verisimilitude.20and.20Interpretations\">#Lean for teaching &gt; Verisimilitude and Interpretations</a> by <span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span>.</p>",
        "id": 506828529,
        "sender_full_name": "Notification Bot",
        "timestamp": 1742418526
    },
    {
        "content": "<p>Ah, perhaps a mistranslation has occurred. It seems firstly that I was mistaken in the specificity of what was meant by _teaching_. My impetus was rather in attempting to broaden how people can think using the axioms of the calculus of constructions with the more general idea of encouraging communities to consider transitioning away from natural languages for the purpose of scientific rhetoric. Instead, we should consider adopting new strategies for how we utilize natural language to communicate and collaborate.</p>",
        "id": 506828576,
        "sender_full_name": "Calvin",
        "timestamp": 1742418544
    },
    {
        "content": "<p>My apologies for not \"reading the room\" here.</p>",
        "id": 506828669,
        "sender_full_name": "Calvin",
        "timestamp": 1742418583
    },
    {
        "content": "<p>I'm more curious about what this has to do with lean, the connection to teaching is clear enough</p>",
        "id": 506840575,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1742423852
    },
    {
        "content": "<p>Of course, Lean doesn't monopolize any implementation of calculus, but the principles that the language is based on have connections to physics that I don't think I've been seeing in outside community. My intention is to boil down the problem into it's most fundamental issues so that hopefully this connection can become more visible.</p>\n<p>I intend to follow this up with more detail about how coinage could be used to formulate special relativity in terms that are very evocative of quantum mechanics, but mathematics is challenging and I wished to share in the meantime.</p>",
        "id": 506849995,
        "sender_full_name": "Calvin",
        "timestamp": 1742428808
    }
]