[
    {
        "content": "<p>With elan, I can select the \"leanprover/lean4:stable\" toolchain, which right now is the 4.0.0-m5 release. Is there any way to have the nice one-click inside VSCode install select that toolchain? I have a class that'll be installing it quite soon, and the idea that they might all be on slightly different nightly versions is a _nightmare_, but also, being able to just have VSCode install is nicer than dealing with commandline stuff.</p>",
        "id": 323552597,
        "sender_full_name": "Daniel Patterson",
        "timestamp": 1674670255
    },
    {
        "content": "<p>I'm assuming the lack of response means this isn't possible! That was what I thought, but thought I'd check in case there was something undocumented!</p>",
        "id": 323943265,
        "sender_full_name": "Daniel Patterson",
        "timestamp": 1674783854
    },
    {
        "content": "<p>Perhaps some of the folks who teach with lean can chime in, but if you use a <code>lean-toolchain</code> file, then <code>elan</code> will automatically select the right version, so if you distribute a lean project for students to work in which has the <code>lean-toolchain</code> file already set then this will not be an issue even if you are on nightly</p>",
        "id": 323946305,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1674786212
    },
    {
        "content": "<p>this is true even if you use the vscode one-click install, since this installs <code>elan</code> which downloads the right version of <code>lean</code></p>",
        "id": 323946443,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1674786312
    },
    {
        "content": "<p>(Also, lean 4 isn't really stable. Those are release candidates, and the last one was some time ago and I wouldn't really recommend it. Lean 4 is still working toward the stable release.)</p>",
        "id": 323946539,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1674786401
    },
    {
        "content": "<p>I teach with lean 3 but I just tell my class \"download the course repo\" and they're then all on the same lean</p>",
        "id": 323988731,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1674808020
    },
    {
        "content": "<p>Daniel, I recommend you provide autonomous archives, similar to what you can find at <a href=\"https://leanprover-community.github.io/get_started.html#maybe-a-couple-of-nights\">Maybe a couple of nights</a>. You can see what's inside at <a href=\"https://github.com/leanprover-community/azure-scripts/blob/master/mk_bundle.py\">https://github.com/leanprover-community/azure-scripts/blob/master/mk_bundle.py</a>. If your users are more experts and VSCode is already installed then you can prepare a shell script to download and execute.</p>",
        "id": 323991167,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1674808899
    }
]