[
    {
        "content": "<p>When I have a project that imports the mathlib, the vscode outline extension works in my own files, but when I use goto-definition to something in the math library, in that file, the outline is not showing. Instead there is a message saying \"no symbols found in document &lt;filename&gt;\". I had setup the project using lake in the recommended way for projects using the mathlib. As an example, if I checkout the mathematics in lean repo, the outline works fine in its files, but not those in the .lake subdirectory. When I had cloned the repo, I had then done:</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"n\">lake</span><span class=\"w\"> </span><span class=\"n\">exe</span><span class=\"w\"> </span><span class=\"n\">cache</span><span class=\"w\"> </span><span class=\"n\">get</span>\n<span class=\"n\">lake</span><span class=\"w\"> </span><span class=\"n\">build</span>\n</code></pre></div>\n<p>Is there something else I should do?<br>\nI also experimented with trying to build the mathlib that was below in .lake/packages, but that did not seem to help.</p>",
        "id": 442000461,
        "sender_full_name": "Richard L Ford",
        "timestamp": 1717299204
    },
    {
        "content": "<p>I can reproduce this, even for files within the same project. Breadcrumbs and other language server navigation features for that file are not available either. I've checked that the language server receives the request and responds to it appropriately, but for some reason VS Code decides to not display the result. I'll have to do some deeper debugging of this issue.</p>",
        "id": 442045054,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1717330423
    },
    {
        "content": "<p>I'm now fairly confident that this is a VS Code bug (not an LSP language client library bug). One shoddy workaround is to add a line to the document you're looking at and then deleting it. This seems to make VS Code refresh the outline view when the document is fully processed.</p>",
        "id": 442051857,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1717334192
    },
    {
        "content": "<p>I think we looked into this in the past for Lean 3, and it was something like the outline view request coming in long before the Lean file had been processed</p>",
        "id": 442053466,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1717335223
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/stream/113489-new-members/topic/VSCODE.20outline.20mode.20not.20working.20in.20imports/near/442053466\">said</a>:</p>\n<blockquote>\n<p>I think we looked into this in the past for Lean 3, and it was something like the outline view request coming in long before the Lean file had been processed</p>\n</blockquote>\n<p>\"Processing a file\" is a language server notion and the Lean 3 and Lean 4 language servers couldn't possibly be more different. The server does the right thing here and provides the result when the file has been fully processed, VS Code just doesn't render it. I'll have to do some VS Code debugging tomorrow to figure out why.</p>",
        "id": 442053742,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1717335367
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"221921\">@Marc Huisinga</span>, thanks for the workaround! That works for me.</p>",
        "id": 442072864,
        "sender_full_name": "Richard L Ford",
        "timestamp": 1717346543
    },
    {
        "content": "<p>I managed to find and fix this issue and a new vscode-lean4 version containing the fix will be released soon.<br>\nIf you're curious about the details: <a href=\"https://github.com/leanprover-community/vscode-lean4/pull/460\">vscode-lean4#460</a></p>",
        "id": 442524208,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1717506041
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"221921\">@Marc Huisinga</span>  Thanks for fixing this!</p>",
        "id": 443396624,
        "sender_full_name": "Richard L Ford",
        "timestamp": 1717803228
    }
]