[
    {
        "content": "<p>Hi,</p>\n<p>I've started learning Lean by working through the exercises in the Mathematics in Lean book and I'm having a bit of trouble with VSCode: the Lean 4 extension fails to start with a \"cannot find git\" error. It used to work before I restarted VSCode recently and I tried configuring the git path manually in VSCode without success. (Git is installed on the system to be clear.) Has anyone run into this before?</p>",
        "id": 471331120,
        "sender_full_name": "Agost Biro",
        "timestamp": 1726687110
    },
    {
        "content": "<p>A hack to make this work is to add the installation path of Git to the <code>Lean 4: Env Path Extensions</code> setting. But ideally, it would be good to figure out why VS Code can't find Git.</p>\n<ol>\n<li>How did you install VS Code and Git?</li>\n<li>How are you launching VS Code (e.g. as administrator or as a regular user, from a terminal, from a shortcut?)</li>\n<li>Is Git in your PATH? Can you call it from the command line?</li>\n<li>Does the \"Source Control\" feature of VS Code still work fine in a Git repository when this error shows up?</li>\n</ol>",
        "id": 471431646,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1726734010
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"221921\">Marc Huisinga</span> <a href=\"#narrow/stream/113489-new-members/topic/VSCode.20extension.20doesn't.20start/near/471431646\">said</a>:</p>\n<blockquote>\n<p>A hack to make this work is to add the installation path of Git to the <code>Lean 4: Env Path Extensions</code> setting. But ideally, it would be good to figure out why VS Code can't find Git.</p>\n<ol>\n<li>How did you install VS Code and Git?</li>\n<li>How are you launching VS Code (e.g. as administrator or as a regular user, from a terminal, from a shortcut?)</li>\n<li>Is Git in your PATH? Can you call it from the command line?</li>\n<li>Does the \"Source Control\" feature of VS Code still work fine in a Git repository when this error shows up?</li>\n</ol>\n</blockquote>\n<p>Hi, thanks for the detailed reply! I just sat down with Lean again and it started working. I suspect the issue was caused by an Xcode update where I had to accept the license before being able to use Xcode Command Line Tools (that bundle Git) again. I didn't notice this immediately, as I'm using a custom installation of Git in my normal workflow.</p>",
        "id": 471894598,
        "sender_full_name": "Agost Biro",
        "timestamp": 1726901858
    },
    {
        "content": "<p>Thanks, that's very helpful information in case someone else has this issue on MacOS in the future!</p>",
        "id": 471901751,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1726905639
    }
]