[
    {
        "content": "<p>I've been using Lean for a while and I still have no idea what <code>show</code> actually does.</p>\n<p>Partially it's because its documentation seems to be written for somebody who already understands some fundamental ideas like \"unification\", and doesn't consider it necessary to elaborate with even a single tiny example of what that means in practice. Unfortunately I'm a learning procrastinator, so I have not read about those (yet?)</p>\n<p><a href=\"/user_uploads/3121/oyUQqxKWwtFjhMQE4IGcgkXu/Screenshot-2025-07-20-at-01.45.47.png\">Screenshot 2025-07-20 at 01.45.47.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/oyUQqxKWwtFjhMQE4IGcgkXu/Screenshot-2025-07-20-at-01.45.47.png\" title=\"Screenshot 2025-07-20 at 01.45.47.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1528x420\" src=\"/user_uploads/thumbnail/3121/oyUQqxKWwtFjhMQE4IGcgkXu/Screenshot-2025-07-20-at-01.45.47.png/840x560.webp\"></a></div><p>You can try to search for it:</p>\n<p><a href=\"/user_uploads/3121/3VxS7ZzBND8nvbPyq3sa2S8N/Screenshot-2025-07-20-at-01.50.04.png\">Screenshot 2025-07-20 at 01.50.04.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/3VxS7ZzBND8nvbPyq3sa2S8N/Screenshot-2025-07-20-at-01.50.04.png\" title=\"Screenshot 2025-07-20 at 01.50.04.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1748x1608\" src=\"/user_uploads/thumbnail/3121/3VxS7ZzBND8nvbPyq3sa2S8N/Screenshot-2025-07-20-at-01.50.04.png/840x560.webp\"></a></div><p>Ironically, one of the results is someone asking where to find the documentation. (Maybe even more ironically, the answer that got inlined in the Google search page is someone saying they don't know if a list of keywords even exists.)</p>\n<p>The <a href=\"https://leanprover.github.io/theorem_proving_in_lean/tactics.html\">first result</a> does look related but it is not a reference (so you have to scan the text). Luckily the text does seem to dive into some detail about it, but less fortunately it is written almost entirely in the abstract style and not so much in the \"here's how we usually use it in practice\" mode. Which is great for a certain frame of mind but maybe not always.</p>\n<p>I understand so far that it changes the goal to some equivalent, and maybe a bit more, but the \"a bit more\" part is a bit fuzzy and I just haven't found a good resource that explains how people use it in practice. Like, at which point in a proof you would think, \"<code>show</code> would be nice here\". What is the rule of thumb for using it?</p>\n<p>Are there any cases where it particularly helps? Or does it serve more as a midpoint documentation about \"where we are\" in the proof?</p>",
        "id": 529621266,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1752972860
    },
    {
        "content": "<p>The reason I'm curious about it is that I'm starting to realize that the way things are framed in the InfoView is actually kind of important. With more complex expressions, especially choice, I really need to \"outline\" some stuff to \"see the pattern\" sometimes. So I'm starting to use <code>change</code> a bit more to explore the definitionally equivalent things, and curious if I'm missing a bunch of patterns that people normally do. Using <code>set</code> to \"notice\" repeating patterns is another habit I picked up (not sure if good or bad habit).</p>",
        "id": 529621599,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1752973361
    },
    {
        "content": "<p>\"Unification\" is the definitional equality procedure. The terminology comes from logic languages like Prolog. You can think of <code>show</code> as being a term-mode <code>change</code>.</p>",
        "id": 529622258,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1752974409
    },
    {
        "content": "<p>Oh, wait, you mean the <code>show</code> tactic. There's not much use for the <code>show</code> tactic, since we have <code>change</code>.</p>\n<p>In a recent Lean, the value-add for <code>show</code> is that you can use it to select one of the goals. The <code>change</code> tactic only applies to the first goal.</p>",
        "id": 529622310,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1752974499
    },
    {
        "content": "<p>The <code>show</code> term though is somewhat useful. Writing <code>show T from e</code> is like <code>(e : T)</code>, but it annotates the expression to ensure that its type is actually <code>T</code>. All <code>(e : T)</code> does is makes sure that the type of the result is definitionally equal to (\"unifies with\") <code>T</code>.</p>",
        "id": 529622379,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1752974593
    },
    {
        "content": "<p>You can see it in things like <code>rw [show a = b from rfl]</code> to change all <code>a</code>s to <code>b</code>s. The type of <code>rfl</code> will be something like <code>a = a</code>, so it's important to have this annotation that actually makes it be <code>a = b</code>.</p>",
        "id": 529622422,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1752974658
    },
    {
        "content": "<p>ahhh okay</p>",
        "id": 529622445,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1752974704
    },
    {
        "content": "<p><code>change T</code> is pretty much the same as <code>refine show T from ?_</code></p>",
        "id": 529622450,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1752974709
    },
    {
        "content": "<p>and until recently, the <code>show</code> tactic was a synonym for this — hence why the tactic is called <code>show</code></p>",
        "id": 529622486,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1752974775
    }
]