[
    {
        "content": "<p>I've recently written one of my own, and I'm sure there are likely a few hidden out there on the internet or a corner of the Zulip.</p>",
        "id": 503675430,
        "sender_full_name": "Joseph McKinsey",
        "timestamp": 1741226510
    },
    {
        "content": "<p>The three largest blogs about Lean are the <a href=\"https://lean-lang.org/blog/\">Lean Project Blog</a>, the <a href=\"https://leanprover-community.github.io/blog/\">Lean community blog</a> and the <a href=\"https://xenaproject.wordpress.com/\">Xena blog</a>. Posts about Lean appearing elsewhere on the internet are sometimes discussed at <a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/channel/113488-general/topic/Lean.20in.20the.20wild/with/148772776\">#general &gt; Lean in the wild</a>.</p>",
        "id": 503719104,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1741246006
    },
    {
        "content": "<p>That last one is interesting for sure, but I expect my blog post is already quite domesticated in comparison. Here is my blog post, so maybe you have your own opinion here. It's 50% about formalizing floating point numbers in Lean and 50% what I learned about Lean. <a href=\"https://josephmckinsey.com/flean2.html\">https://josephmckinsey.com/flean2.html</a>.</p>",
        "id": 503815517,
        "sender_full_name": "Joseph McKinsey",
        "timestamp": 1741273030
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"786459\">@Joseph McKinsey</span>, thank you for writing this. It was a really interesting read, and your section on \"Learning Lean as a Language\" has a lot of really useful feedback that we will try to work on.</p>\n<p>Very much appreciated.</p>",
        "id": 503911766,
        "sender_full_name": "Kim Morrison",
        "timestamp": 1741303572
    },
    {
        "content": "<p>It's feedback for myself too. A lot of things I talked about are things that I could work on if I put my mind to it too, so I hope to get around to some of them. Like I could be writing a tutorial for positivity extensions, but I'd like to understand macros more first, etc.</p>",
        "id": 503912588,
        "sender_full_name": "Joseph McKinsey",
        "timestamp": 1741303900
    },
    {
        "content": "<p>Reading this over breakfast on mobile in a hotel, very excited to see the use of (what is presumably) Verso! Makes the page interactive and hence much easier to understand! Thanks for putting in the effort to get this working!</p>",
        "id": 504027596,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1741332796
    },
    {
        "content": "<p>It's hacked together using a custom Verso Genre with a bunch of copy pasted code from the normal genres, so I could get it working with my Python-based html generator Pelican. <a href=\"https://github.com/josephmckinsey/FleanBlogPost\">https://github.com/josephmckinsey/FleanBlogPost</a>.</p>",
        "id": 504102741,
        "sender_full_name": "Joseph McKinsey",
        "timestamp": 1741356264
    }
]