[
    {
        "content": "<p>Hi all, I have a general question about how the Lean community works (or aspires to work)</p>",
        "id": 488914645,
        "sender_full_name": "Alex Altair",
        "timestamp": 1734121385
    },
    {
        "content": "<p>I understand that mathlib is currently being built up to be <em>the</em> standard library that contains the foundations for mathematical fields. On the other end of the spectrum, researchers can write Lean proofs of their own theorems, and keep these proofs somewhere publicly accessible, like github. I guess I have a couple questions;</p>",
        "id": 488914707,
        "sender_full_name": "Alex Altair",
        "timestamp": 1734121416
    },
    {
        "content": "<p>1) Are there currently any libraries that are standardized, community-maintained projects that are more specialized than mathlib, but less specialized than the work of individual people? What (or who) determines what goes into mathlib itself?</p>",
        "id": 488914780,
        "sender_full_name": "Alex Altair",
        "timestamp": 1734121443
    },
    {
        "content": "<p>2) For individual researchers who do produce their own proofs, is there any standardized place for those to be hosted? It would be nice, for example, when you find a Lean proof someone wrote, to be able to see that it's a valid proof, without having to download the file yourself and run it in an instance of Lean.</p>",
        "id": 488914924,
        "sender_full_name": "Alex Altair",
        "timestamp": 1734121489
    },
    {
        "content": "<p>For 1, there's a number of projects aiming to formalize various results, from sphere eversion over the prime number theorem to (parts of) Fermat's Last Theorem, as well as projects whose scope are less clear to me like LeanCamCombi and SciLean. Not sure that answers your question. What and who - basically the same answer: the maintainers have to approve incoming code, and incoming code needs maintainers who have at least some interest or expertise to do the reviews</p>",
        "id": 488920842,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1734123984
    },
    {
        "content": "<p>For 2, does \"GitHub\" count as an answer? There's also reservoir, but I haven't looked at it</p>",
        "id": 488920964,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1734124039
    },
    {
        "content": "<p>My question is more like, where is the code for those projects going? Presumably a lot of the code developed for FLT (for example) will go into mathlib, but maybe not all of it? And where will that other code live afterwards? Are people planning to keep it \"live\" (in the sense that that proof will remain valid for the more recent version of Lean/mathlib)?</p>",
        "id": 488922222,
        "sender_full_name": "Alex Altair",
        "timestamp": 1734124556
    },
    {
        "content": "<p>Typically, first in an external repository that depends on mathlib (e.g. <a href=\"https://github.com/ImperialCollegeLondon/FLT\">https://github.com/ImperialCollegeLondon/FLT</a>), and indeed, some of the code is already being moved into mathlib (see <a href=\"https://github.com/leanprover-community/mathlib4/pulls?q=is%3Apr+label%3AFLT\">https://github.com/leanprover-community/mathlib4/pulls?q=is%3Apr+label%3AFLT</a>). FLT is a bit special here in the sense that the current goal isn't to formalize everything down to the axioms, but to take results from the 1980s and before as given - so anything that depends on those assumptions will stay out of mathlib.</p>\n<p>In general these projects stay up to date with mathlib for as long as someone's motivated to keep them up to date :)</p>",
        "id": 488924850,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1734125740
    }
]