[
    {
        "content": "<p>Being a programmer first when any reference to a math theory, conjecture etc.  is noted I instantly convert into a mental gap and continue, E.g.  <code>Hedetniemi's conjecture</code>.  While I can use Wikipedia to learn more about them, is there a better place to learn about them to connect the dots to make what I read make sense. I am not looking to get a degree in math but something that doesn't have me filling my mind with gaps. Even a connection to another gap is better than just a gap alone, at least then I am making progress.</p>",
        "id": 267037627,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1641459081
    },
    {
        "content": "<p>I guess this depends <em>a lot</em> on the type of theory / conjecture you are talking about.</p>",
        "id": 267037690,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1641459138
    },
    {
        "content": "<p>For many things, Wiki is great. But on the other end of the spectrum, there are conjectures, where you need to be in Bonn, or at MIT, or wherever, to start learning about them.</p>",
        "id": 267037755,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1641459196
    },
    {
        "content": "<p>In general, I would say: check Wiki. If it isn't covered, do a quick internet search. If that doesn't show up anything on Encyclopedia of Math, or planetmath, or groupprops, or math.stackexchange, then you can ask a question on math.stackexchange.</p>\n<p>If it is slightly Lean/mathlib related, just ask a question in <a class=\"stream\" data-stream-id=\"116395\" href=\"/#narrow/stream/116395-maths\">#maths</a>. The cool thing about this community is that you have access to a bunch of friendly experts that will be happy to give you a pointer, or a more detailed explanation.</p>",
        "id": 267037868,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1641459304
    },
    {
        "content": "<p>Some replies to this thread were split off to <a href=\"#narrow/stream/113489-new-members/topic/Lean.20for.20the.20Inept.20Mathematician\">https://leanprover.zulipchat.com/#narrow/stream/113489-new-members/topic/Lean.20for.20the.20Inept.20Mathematician</a></p>",
        "id": 267063911,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1641477740
    }
]