[
    {
        "content": "<p>Hi all,</p>\n<p>My name is Keith Rush, and I'm excited to have discovered Lean and its community.</p>\n<p>My background is as a mathematician--in the circle of stuff around real and harmonic analysis, mathematical physics, and approximation theory. These days however I tend to work more with empirics than theory, particularly with ML and AI things. (I was in grad school during the deep learning revolution, which is what convinced me I needed to actually learn how to program and build systems).</p>\n<p>I've always retained a soft spot for the concerns of mathematics, though I've gone a bit far afield. I'm the type of nerd who got very excited upon finding Lean and its capabilities, so the last week or so I've been poking around mathlib, playing through the NNG, and working through a couple simple examples. From my time in programming, though, I tend to feel there is no better approach to learning something new than just tackling a real problem or two, nevermind the fact that one is likely to flail for a while (and possibly just fail).</p>\n<p>So I'm curious: is there a natural way or place for someone like me to start getting their hands dirty? I thought about formalizing some of the proofs from my recent works as an exercise (which, from a mathematical perspective, are pretty elementary). But I figured that this may be too difficult, and perhaps might require chasing some things down that I'm not prepared for (e.g., it's not obvious to me if the square root of a <a href=\"https://github.com/leanprover-community/mathlib/blob/master/src/linear_algebra/matrix/pos_def.lean\">positive definite matrix</a> is defined anywhere). So I'm wondering if anyone has experience in a similar situation--should I just 'take direction' from someone and attempt some basic contributions (e.g. some stuff in calculus that is known to be needed but maybe doesn't exist yet), or have others successfully just 'formalized backwards' from work they are familiar with (like their own)?</p>",
        "id": 410046327,
        "sender_full_name": "Keith Rush",
        "timestamp": 1703609139
    },
    {
        "content": "<p>Welcome! <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> Squareroot of a positive matrix was just done by a student of <span class=\"user-mention\" data-user-id=\"481963\">@David Loeffler</span></p>",
        "id": 410048977,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1703611057
    },
    {
        "content": "<p>Awesome! I realize now I was poking around mathlib instead of mathlib4 <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 410053583,
        "sender_full_name": "Keith Rush",
        "timestamp": 1703614437
    },
    {
        "content": "<p>I started very recently as well, I just went through the list of issues on GitHub and checked if there was something that I knew how to do/for which I knew the math, and started doing that!</p>",
        "id": 410053795,
        "sender_full_name": "Josha Dekker",
        "timestamp": 1703614615
    }
]