[
    {
        "content": "<p>I've noticed that <code>mapFinIdx</code> in <code>List</code> is defined as follows (and similarly in <code>Array</code>):</p>\n<p><code>def mapFinIdx (as : List α) (f : (i : Nat) → α → (h : i &lt; as.length) → β) : List β</code></p>\n<p>Is there any reason it isn't instead defined as follows:</p>\n<p><code>def mapFinIdx (as : List α) (f : (i : Fin as.length) → α → β) : List β</code></p>\n<p>I was just writing some of my own helpers for something which I ended up replacing with uses of <code>mapFinIdx</code>, but it seems strange to me that the index and its in-range proof are carried around separately, rather than packaged inside <code>Fin</code>, especially given the name of the method contains \"Fin\".</p>\n<p>I'm not trying to start an argument, just trying to get some insight into that design decision. I searched Zulip history with no luck, but if there's another way I should look for this kind of info please let me know. Thank you!</p>",
        "id": 565264823,
        "sender_full_name": "Scott Buckley",
        "timestamp": 1766570064
    },
    {
        "content": "<p>Looking at the git blame I found <a href=\"https://github.com/leanprover/lean4/pull/6697\">lean4#6697</a> but I'm not entirely sure what the 'rest of the API' means here. It better matches <code>mapIdx</code> for example, but not sure if the motivation was broader than that.</p>",
        "id": 565275451,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1766577343
    },
    {
        "content": "<p>(I'd also be curious to know if there's a reason the hypothesis is after \\a, it seems more natural to have it closer to the index.)</p>",
        "id": 565275687,
        "sender_full_name": "Vlad Tsyrklevich",
        "timestamp": 1766577508
    },
    {
        "content": "<p>From my experience unbundled is easier to work with. Compared to bundled you don't have to deal with coercion and <code>simp</code> cannot unbundle the proof. But tbh, I'd rather we fix the problems with using bundled version instead of changing to unbundled.</p>",
        "id": 565282891,
        "sender_full_name": "Jakub Nowak",
        "timestamp": 1766582273
    }
]