[
    {
        "content": "<p>I've been wondering about this for a while. The question is: why these long scary identifiers?</p>\n<p><a href=\"/user_uploads/3121/lcnBNf6tgRSqNNwJCuGp3aTp/Screenshot-2025-08-07-at-02.13.05.png\">Screenshot 2025-08-07 at 02.13.05.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/lcnBNf6tgRSqNNwJCuGp3aTp/Screenshot-2025-08-07-at-02.13.05.png\" title=\"Screenshot 2025-08-07 at 02.13.05.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"874x706\" src=\"/user_uploads/thumbnail/3121/lcnBNf6tgRSqNNwJCuGp3aTp/Screenshot-2025-08-07-at-02.13.05.png/840x560.webp\"></a></div><p>I get that we need to show <em>something</em> and we don't have names for them. But these are particularly frustrating because the number gets super long and that kind of makes them hard to scan for up and down. So you have to mentally sort of tune them out. Except that they are also some of the longest things painted on the screen. So they clutter everything up.</p>\n<p>I was wondering whether it would be possible to partially elide them in the UI where you don't have more than 10-20 showing up at a given time (in most cases; I get that exceptions and different printing modes exist). I could imagine \"local\" numbering being used if these identifiers can't be relied on in code (like <code>?m.1</code> etc). Maybe a \"global\" system is better when debugging issues or coordinating some kind of internal representation? And maybe there's a downside to showing something different to the user (like when trying to correlate types of holes across multiple files)? I'm not sure but I would've appreciated seeing much smaller numbers on the screen.</p>\n<p>It's also possible I'm thinking about this from the wrong end and maybe their placeholder names could've been better somehow? Like inferred from usage somehow? I'm not sure if this is a case where it's impossible to even describe the hole because we don't know anything about it, or if there's some inference of intent we could make to show a friendlier label.</p>",
        "id": 533202333,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1754530166
    },
    {
        "content": "<p><code>set_option pp.mvars.anonymous false</code> to turn off the numbers</p>",
        "id": 533202715,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1754530446
    },
    {
        "content": "<p>I don't know of any way to make them \"better\" without turning them off completely</p>",
        "id": 533202811,
        "sender_full_name": "Aaron Liu",
        "timestamp": 1754530545
    },
    {
        "content": "<p>Yea this seems a bit too much maybe. I guess I wouldn't mind tiny colored squares with unique color per number :D</p>\n<p>But in any case ideally, if something better can be done (e.g. short normalized numbers, or good inferred friendly labels), I'd want that to be a default rather than an option. Since options aren't very discoverable and require people to have to agree with each other.</p>",
        "id": 533202928,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1754530634
    },
    {
        "content": "<p>We've thought about trying to do local renumbering when pretty printing. The problem is correlation across Infoview states and across messages. You don't want these things to change numbers as you go from state to state, and also you want hovers to have consistent numbering.</p>\n<p>I have a draft PR somewhere that tries to give these more informative names, drawing the names from what the metavariable stands for, for example an argument for parameter x to a function could be represented as <code>?x.22</code>. That one needs some more work though.</p>\n<p>The internal detail here is that every metavariable has a \"metavariable ID\" (or \"mvarid\") that's of the form <code>_uniq.nn</code> where <code>nn</code> is a number drawn from a source of fresh numbers. The number generator is reset at the beginning of each file. When pretty printing, if there's no registered name for the metavariable, then a metavariable with mvarid <code>_uniq.22</code> gets pretty printed as <code>?m.22</code>. Metavariables don't survive across modules, or even across commands, so it should be safe to reset this generator per command, but the generator is also shared by a couple other features, and I'm not sure whether or not it's safe to reset it for them. There probably should be an option to keep the current behavior at least, to help catch caching bugs that accidentally use metavariables across multiple commands.</p>",
        "id": 533204166,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1754531743
    },
    {
        "content": "<p>Maybe there's a way to improve things without touching the name generator.</p>\n<p>The \"metavariable context\" is what keeps track of metavariable declarations and their assignments. It already keeps track of a metavariable index, which is independent of the mvarid. The pretty printer could easily print that instead, and each command starts with an empty metavariable context.</p>",
        "id": 533204558,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1754532079
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover/lean4/pull/9778\">lean4#9778</a> implements this for expression metavariables</p>\n<p>It doesn't do anything for universe metavariables (e.g. in <code>Sort ?u.123123</code>) because they don't have indices. Maybe later.</p>",
        "id": 533209783,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1754536631
    },
    {
        "content": "<p>It's kind of nice, no matter where you are in a file, the same small metavariable numbers!</p>\n<div class=\"codehilite\" data-code-language=\"Lean4\"><pre><span></span><code><span class=\"bp\">#</span><span class=\"n\">check</span><span class=\"w\"> </span><span class=\"bp\">_</span>\n<span class=\"c1\">-- ?m.2 : ?m.1</span>\n</code></pre></div>",
        "id": 533210008,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1754536882
    },
    {
        "content": "<p>I wonder if it would be nice to pretty print these as <code>?m¹²³</code> instead of <code>?m.123</code>. Superscripts to match how hygienic names pretty print (<code>x✝¹</code>). It saves one character, and also it's a bit less prominent.</p>",
        "id": 533210468,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1754537289
    },
    {
        "content": "<p>Thanks!</p>\n<blockquote>\n<p>I have a draft PR somewhere that tries to give these more informative names, drawing the names from what the metavariable stands for, for example an argument for parameter x to a function could be represented as <code>?x.22</code>. That one needs some more work though.</p>\n</blockquote>\n<blockquote>\n<p>I wonder if it would be nice to pretty print these as <code>?m¹²³</code> instead of <code>?m.123</code>. Superscripts to match how hygienic names pretty print (<code>x✝¹</code>). It saves one character, and also it's a bit less prominent.</p>\n</blockquote>\n<p>I'm in favor of both of these!</p>",
        "id": 533271198,
        "sender_full_name": "Dan Abramov",
        "timestamp": 1754565234
    }
]