[
    {
        "content": "<p>Im debating if I should spend time learning Lean but Im not sure if it will be usefull to me as a math undergrad. Can someone explain whether it will be usefull or not?</p>",
        "id": 384041071,
        "sender_full_name": "Ethan Kharitonov",
        "timestamp": 1691773550
    },
    {
        "content": "<p><a href=\"#narrow/stream/113489-new-members/topic/Will.20Lean.20be.20useful.20for.20me.3F/near/384041071\">A message</a> was moved here from <a class=\"stream-topic\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members/topic/Hypotheses.20in.20branches\">#new members &gt; Hypotheses in branches</a> by <span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span>.</p>",
        "id": 384041325,
        "sender_full_name": "Notification Bot",
        "timestamp": 1691773601
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"640055\">@Ethan Kharitonov</span> welcome! I moved your message to a new thread.</p>",
        "id": 384041443,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1691773625
    },
    {
        "content": "<p>Whether Lean will be useful for you depends a lot on what you want to do with it</p>",
        "id": 384041517,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1691773639
    },
    {
        "content": "<p>If your goal is to learn lots of maths in a short amount of time, then Lean will not be very useful, but I would rather encourage you to find a group of peers that are also ambitious to learn a lot of maths. Organise reading groups, go to undergrad seminars, etc...</p>",
        "id": 384041862,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1691773708
    },
    {
        "content": "<p>If your goal is to learn how maths can be made 100% precise, and how computers can check proofs, or even search for proofs, then learning more about Lean will be a good investment.</p>",
        "id": 384042026,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1691773750
    },
    {
        "content": "<p>I 100% agree with what Johan said.</p>\n<p>But maybe an undertone in the question \"if it will be useful to me as a math undergrad\" is whether learning Lean as an undergrad will be useful after your undergrad studies. If that is a consideration, then I'd add that:</p>\n<ul>\n<li>Formalized math on the scale that we have today has a very short history --- no one <em>really</em> knows how useful Lean (and computer formalized math in general) will be even in the relatively near future (say 5 years), let alone during the whole future career of a current undergraduate student. Moreover the future usefulness is also not deterministic; it depends heavily on how many smart people (current undergraduates?) take it up and make most of it --- in both expected and unexpected ways. On this Zulip probably everyone believes that at least some aspects of formalization will be \"useful\" (whatever that means).</li>\n</ul>\n<p>And in any case I think it is relevant to add the warning:</p>\n<ul>\n<li>Formalization is not just useful, it is also a lot of fun! The level of fun accessible with Lean &amp; Mathlib may be dangerous during your undergraduate studies. But if one is able enjoy it in moderation, then formalization can have a positive impact on one's life.</li>\n</ul>",
        "id": 384084150,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1691784971
    },
    {
        "content": "<p>Just do a project and stick it on github and then decide yourself whether it was useful.</p>",
        "id": 384106881,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1691794057
    },
    {
        "content": "<p>Most math majors I met would say formalization is not useful for studying math, but I think Mathlib helps me understand math better. It's an actual implementation of math, so you can use it to find what was missing from your comprehension.</p>",
        "id": 384135428,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1691806786
    },
    {
        "content": "<p>Besides, I make so many mistakes when writing by hand or in LaTeX that it's better to write Lean code. I just need a program that exports Lean math proofs into a format that mathematicians can understand who don't know anything about Lean.</p>",
        "id": 384136190,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1691807180
    }
]