[
    {
        "content": "<p>Hi all, I wanted to introduce myself. I am currently working on a book about the history of Lean, to be published in 2026 under the imprint Quanta Books, which is a new joint initiative between the Simons Foundation and a major trade press (exact details to be released soon). I'm a long-time journalist with Quanta Magazine and I've written about Lean in the past, including the 2020 story, \"Building the Mathematical Library of the Future\": </p>\n<p><a href=\"https://www.quantamagazine.org/building-the-mathematical-library-of-the-future-20201001/\">https://www.quantamagazine.org/building-the-mathematical-library-of-the-future-20201001/</a></p>\n<p>I'm planning to spend some time observing the activity here and reaching out to people as I have questions. Please don't hesitate to get in touch if there's anything in particular you'd like to chat about.</p>",
        "id": 475298115,
        "sender_full_name": "Kevin Hartnett",
        "timestamp": 1728307858
    },
    {
        "content": "<p>That 2020 article is how I learned about Lean. Thanks for writing it, and good luck for the book!</p>",
        "id": 475303123,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1728309233
    },
    {
        "content": "<p>I think the need to further develop beginner-friendly pathways for newcomers is worth exploring.</p>\n<p>That's fairly vague but happy to have a 1-2-1 chat if you're interested. </p>\n<p>I'm a beginner re Lean but have 25 years experience constantly learning other technologies, teaching beginners, some small experience making other tech more easily accessible to beginners, ...  so perhaps can offer a comparative perspective.</p>",
        "id": 475321282,
        "sender_full_name": "rzeta0",
        "timestamp": 1728314254
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"724904\">@rzeta0</span> It's a book about <em>the history of Lean</em>. Your suggestion sounds like it belongs to tutorials, or other types of books. Or maybe I misunderstood you.</p>",
        "id": 475330853,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1728316452
    },
    {
        "content": "<p>\"Lean is making history\" is going to become as literal as it can get. I'm eager to read the book!</p>",
        "id": 475331566,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1728316668
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> yes, you misunderstood.</p>\n<p>... and perfectly illustrated my point :)</p>",
        "id": 475365018,
        "sender_full_name": "rzeta0",
        "timestamp": 1728326198
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"724904\">@rzeta0</span>'s point is that the Lean's entrance bar being high has consequences and is part of its history.</p>",
        "id": 475385295,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1728331593
    }
]