[
    {
        "content": "<p>Hi, I'm Yuri. I'm a mathematician working in homotopy theory (adjacent to a little bit of the condensed stuff). I'm also the developer of <a href=\"https://liqvidjs.org/\">Liqvid</a>, a tool for making interactive videos for teaching math/coding; I'm hoping this could be used for interactive Lean tutorials. I played around with Lean at a HoTT workshop several years ago, but haven't kept up with it.</p>",
        "id": 527040413,
        "sender_full_name": "Yuri Sulyma",
        "timestamp": 1751561849
    },
    {
        "content": "<p>I have no idea what any of those words mean, but welcome!</p>",
        "id": 527058796,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1751569482
    },
    {
        "content": "<p>Well, I always get an existential dread when I read category theory, so you're not alone. Welcome <span class=\"user-mention\" data-user-id=\"934566\">@Yuri Sulyma</span></p>",
        "id": 527058991,
        "sender_full_name": "metakuntyyy",
        "timestamp": 1751569580
    },
    {
        "content": "<p>Can you make a short video explaining a roadmap to formalising prismatic cohomology in lean? Maybe start by discussing the definition here and the community can say what we already have</p>",
        "id": 527072233,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1751576462
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> to clarify, I'm not trying to formalize prismatic cohomology in Lean (at this time). I'm interested in extending my animation software to record interactive Lean videos (about much more elementary topics).</p>",
        "id": 527079035,
        "sender_full_name": "Yuri Sulyma",
        "timestamp": 1751580029
    },
    {
        "content": "<p>You might want to consider getting in touch with <span class=\"user-mention\" data-user-id=\"354934\">@David Thrane Christiansen</span>, who is writing the reference manual and verso, which is sort of like a supercharged version of markdown or mdbook designed for Lean. Not sure if there's any overlap, but it might be worth checking.</p>",
        "id": 527253392,
        "sender_full_name": "Niels Voss",
        "timestamp": 1751690446
    }
]