[
    {
        "content": "<p>Hi folks! I'm a robotics MSc student looking for a PhD next year. I'm learning Lean to develop tools for engineering students. Hit me up if you're nearby, I'd love to chat <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 396452162,
        "sender_full_name": "Rick de Wolf",
        "timestamp": 1697184788
    },
    {
        "content": "<p>Hey, I'm from the FMT group in the zilverling building. I have a colleague in my team and we regularly discuss Lean, if you're still around we should hang out!</p>",
        "id": 422187227,
        "sender_full_name": "Bob Rubbens",
        "timestamp": 1708333023
    },
    {
        "content": "<p>Anyone else who's here of course feel free to reach out to us as well :) We're in room Zi 3082. We also have some group members working with Isabelle.</p>",
        "id": 422188988,
        "sender_full_name": "Bob Rubbens",
        "timestamp": 1708333538
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"381694\">Bob Rubbens</span> <a href=\"#narrow/channel/224796-Geographic-locality/topic/Enschede.2C.20NL/near/422188988\">said</a>:</p>\n<blockquote>\n<p>Anyone else who's here of course feel free to reach out to us as well :) We're in room Zi 3082. We also have some group members working with Isabelle.</p>\n</blockquote>\n<p>Hi Bob and Rick<br>\nI will attend IWOTA2025 which will be held at the Twente University between 14-18 July 2025. I will be happy to learn more about the group and your Lean activities if anyone will be there at that time)<br>\nBest</p>",
        "id": 519383682,
        "sender_full_name": "Yagub Aliyev",
        "timestamp": 1747747342
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"682831\">@Yagub Aliyev</span> , cool!</p>\n<p>Unfortunately around that time probably it'll be a bit quiet around the group, though not so much as in august, since probably some group members might still be wrapping up teaching activities. So it'll be hard to organize something truly spontaneous and informal . Also, again unfortunately, we won't have a colloquium, our weekly group presentation, in that period because of the summer break. If you happen to have something you think is fun/interesting for the group that you'd like to present, I'd be happy to see if I can organize an informal one. This is of course also possible if you'd like to visit sometime outside the summer break ;)</p>\n<p>In addition, if you have downtime around Enschede and want to have lunch/dinner or just want to meet up/join our group lunch, that's definitely possible. I'll DM you my details so you can contact me when you are in Enschede. <span class=\"user-mention\" data-user-id=\"603023\">@Rick de Wolf</span> Same for you!</p>\n<p>Lately there has not been much talk about Lean in my office (sadly!), but plenty of group members published papers. You can view the papers published in our group in general here, to get an idea of what we're working on: <a href=\"https://www.utwente.nl/en/eemcs/fmt/news-and-vacancies/news/\">https://www.utwente.nl/en/eemcs/fmt/news-and-vacancies/news/</a> Names you can look for who work on ITP stuff, mostly Isabelle, are Peter Lammich, Bram Kohlen and Edoardo Putti. I'm happy to tell you more if there's anything in particular you're interested in. In my subteam we work on vercors (<a href=\"https://utwente.nl/vercors\">https://utwente.nl/vercors</a>), which is an auto-active verifier for C, Java, GPGPU programs, LLVM, System-C and choreographies, so I can also tell you more about that if you want :)</p>",
        "id": 520040184,
        "sender_full_name": "Bob Rubbens",
        "timestamp": 1748002651
    }
]