[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"710010\">@Jafar Tanoukhi</span> and I are meeting in Beirut to chat about Lean. We would be happy if you could join us. <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 440456361,
        "sender_full_name": "Rida Hamadani",
        "timestamp": 1716536124
    },
    {
        "content": "<p>Well I'm part of both Lebanon and Saarbrücken chats I guess :)</p>",
        "id": 442064307,
        "sender_full_name": "Bashar Hamade",
        "timestamp": 1717342025
    },
    {
        "content": "<p>Hi I am Swapna, building <a href=\"https://app.thelabcompany.co/\">https://app.thelabcompany.co/</a> so everyone can participate in building cool things with technology. So excited and thankful for this class on Lean and providing access to anyone to learn on the edge of technology! Thank you <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span></p>",
        "id": 569273667,
        "sender_full_name": "Swapna Iyer",
        "timestamp": 1769006821
    },
    {
        "content": "<p>I'm Sal, learning Lean4 with PROOF101 gang. Nice to meet you all!</p>",
        "id": 569273954,
        "sender_full_name": "Sal Hasan",
        "timestamp": 1769006886
    },
    {
        "content": "<p>Hi, I'm Karsten. I’m a CS master's student at the University of Southern Denmark. I'm have joined the course PROOF101 at AUB. I'm excited to learn more about Lean4 and formal methods.</p>",
        "id": 569274173,
        "sender_full_name": "Karsten Pedersen",
        "timestamp": 1769006934
    },
    {
        "content": "<p>Hi i'm Jaafar Tanoukhi and i like lean. Currently learning it using the Proof 101 course.</p>",
        "id": 569274184,
        "sender_full_name": "Jafar Tanoukhi",
        "timestamp": 1769006935
    },
    {
        "content": "<p>Hello Sujan Acharya here from Nepal. Currently in Proof101.</p>",
        "id": 569274677,
        "sender_full_name": "sujan",
        "timestamp": 1769007047
    },
    {
        "content": "<p>Hello Lean community!</p>\n<p>My name is Hadi. I am an Electrical and Computer Engineering (ECE) &amp; CS student at AUB. I'm looking forward to learn more about Lean4 in the Proof101 course!</p>",
        "id": 569281090,
        "sender_full_name": "Hadi Al Shmaissani",
        "timestamp": 1769008463
    },
    {
        "content": "<p>Hello I'm Fatma an undergraduate student, and I look forward to learn more about lean4 and it's applications.</p>",
        "id": 569303638,
        "sender_full_name": "Attas",
        "timestamp": 1769014015
    },
    {
        "content": "<p>Hello, I'm Saad. I am an Electronics engineer from India working on post-quantum cryptography. I am really interested in formal verification and how I can formally prove the RTL using mathematical models. i would love to know more about Lean and how I can actively contribute to it.</p>",
        "id": 569327070,
        "sender_full_name": "Saad Siddiqui",
        "timestamp": 1769020288
    },
    {
        "content": "<p>Hello! I am Daniel Dia, a Computer &amp; Communications Engineering and Mathematics student at AUB, interested in the intersection between systems, cryptography, and formal verification. I am the primary \"instructor\" and organizer of the <a href=\"https://danieldia-dev.github.io/proofs/\">PROOF101 (Introduction to Formal Verification &amp; Proof Assistants) seminar series</a> (or \"course\" if you like), and I am very excited to introduce Lean4 to our students!</p>",
        "id": 569415519,
        "sender_full_name": "Daniel Dia",
        "timestamp": 1769062623
    },
    {
        "content": "<p>Hello, I am Varsha Jarali. I have completed Ph.D in Mathematics. I am currently working on a project focused on the \"formal verification of cryptographic protocols\". As part of this work, we use tools such as ProVerif, CryptoVerif, and Frama-C for protocol and implementation-level verification. In addition, we are thinking to  explore the use of Lean4 to formally prove the correctness of cryptographic operations and to extract verified implementations for further use. Through this course, I hope to gain a strong foundational understanding of Lean4, including its proof methodology and practical workflow. I believe that your guidance and expertise will significantly support our learning process and help us effectively integrate Lean4 into our verification pipeline.</p>",
        "id": 569416705,
        "sender_full_name": "Varsha Jarali",
        "timestamp": 1769063381
    },
    {
        "content": "<p><span class=\"topic-mention\">@topic</span> Thanks all for introducing yourselves! Are all of you in Lebanon? This channel is meant for people finding other Lean users near them, and potentially organizing local meetups. So please post in a (new) thread that is about your city/region/country.</p>",
        "id": 569418956,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1769064708
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> apologies, it is my fault, I thought all the students are from Lebanon and suggested <span class=\"user-mention\" data-user-id=\"1012074\">@Daniel Dia</span> to ask them to introduce themselves here.</p>",
        "id": 569458783,
        "sender_full_name": "Rida Hamadani",
        "timestamp": 1769079246
    },
    {
        "content": "<p>Hello Lean community! I am a computer science student at AUB and I am very curious about learn4, so I am excited to learn more about it in the proof101 course which I am attending in person.</p>",
        "id": 569904038,
        "sender_full_name": "Nour Chehab",
        "timestamp": 1769289418
    },
    {
        "content": "<p>Hello, im Mohamed Mahdi, a third year mechanical engineering student at AUB</p>",
        "id": 569952725,
        "sender_full_name": "Mohamed Mahdi Tarhini",
        "timestamp": 1769345732
    },
    {
        "content": "<p>Hi, I'm Ali. I'm a CS graduate from Al Maaref University and I'm learning formal verification in the Proof 101 Course at AUB.</p>",
        "id": 569980801,
        "sender_full_name": "Ali Jradi",
        "timestamp": 1769373313
    },
    {
        "content": "<p>Hello, I'm Sinan. I will be following Proof 101 course at AUB. I'm not in Lebanon or AUB but I still wanted to say hi. Especially after seeing all the other greeting messages.</p>\n<p>I graduated from Maths a long time ago and I have been working as a software developer and IT / Cloud infrastructure engineer. I know Scala and I wanted to learn dependent type theory and Lean as well for a long time. I'm so gald that I came across this course and eventually this community.</p>",
        "id": 569982456,
        "sender_full_name": "Sinan Akpolat",
        "timestamp": 1769375094
    },
    {
        "content": "<p>Hello, I'm Manar, a CS student at the Lebanese University. I have joined the proof101 course at AUB to learn about lean4 and formal methods. Excited to be part of this community.</p>",
        "id": 569982494,
        "sender_full_name": "Manar Darsa",
        "timestamp": 1769375119
    },
    {
        "content": "<p>Hello everyone! I’m Maryam Fakih, a computer science student at LU. I recently came across a LinkedIn post about Proof101, and the title immediately caught my attention. What could be better than formally proving that a program is correct?</p>\n<p>I signed up right away and have been really curious about Lean4 ever since. A big thank you to Daniel Dia for introducing us to the world of formal verification!</p>",
        "id": 569984335,
        "sender_full_name": "Maryam Fakih",
        "timestamp": 1769377228
    },
    {
        "content": "<p>Hello! I'm Layan Jaber, a first year Electrical and Computer Engineering student. Looking forward to learning about Lean4 with the Proof101 course and engaging with its community!</p>",
        "id": 569984692,
        "sender_full_name": "Layan Jaber",
        "timestamp": 1769377641
    },
    {
        "content": "<p>Hello! I'm Abbas Al Shab.  A senior year computer science student at LIU. Thrilled to be learning about Lean4 through the Proof101 course!</p>",
        "id": 569990203,
        "sender_full_name": "Abbas Alshab",
        "timestamp": 1769384108
    },
    {
        "content": "<p>Hello, I'm Ritwik Sen. I'm a cryptography professional taking this course to learn the dark arts of formal verification <span aria-label=\"octopus\" class=\"emoji emoji-1f419\" role=\"img\" title=\"octopus\">:octopus:</span></p>",
        "id": 570023536,
        "sender_full_name": "Ritwik Sen",
        "timestamp": 1769412451
    },
    {
        "content": "<p>Hello lean community! I am Heba Bitar, a Computer Science student at LU. I’ve always been fascinated by the intersection of Mathematics and CS, which is what led me to join the PROOF101 seminar. I’m excited to dive into formal verification and explore how Lean4 can be used to bridge these two worlds. Looking forward to learning with you all!</p>",
        "id": 570071747,
        "sender_full_name": "Heba Bitar",
        "timestamp": 1769428413
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 570084792,
        "sender_full_name": "Anuj More",
        "timestamp": 1769432287
    }
]