[
    {
        "content": "<p>Pittsburgh represent!<br>\nThe Pittsburgh area has a very active Lean community, centered around Carnegie Mellon University and the neighboring University of Pittsburgh. </p>\n<p>We have weekly Lean meetings every Tuesday at 4.30pm in Thackeray Hall at Pitt.  (At least we used to, until the university closed down.)</p>",
        "id": 193712811,
        "sender_full_name": "Koundinya Vajjha",
        "timestamp": 1586697330
    },
    {
        "content": "<p>We use the <code>cmu-lean</code> mailing list on Google groups for the weekly meeting announcements. It is a private mailing list  but anyone is welcome to join. You should be able to find it on Google groups and click a button to send a request, but in any case you can email me at <code>avigad@cmu.edu</code> and I will send an invite. </p>\n<p>The meetings are informal. Sometimes we just talk shop, but I generally try to line up a volunteer to present something they are working on or a paper they are reading, or lead a discussion. The topics are not restricted to Lean; participants are generally interested in all aspects of formal methods and their applications to mathematics.</p>\n<p>We have had a few meetings by Zoom since the lockdown began. We'll take a break this week, but we're still planning to meet sporadically, as people volunteer to present. I have nearly all the slides done for a talk I was going to give at a phil math conference last week (<a href=\"https://princetonphilmath.wordpress.com/\" title=\"https://princetonphilmath.wordpress.com/\">https://princetonphilmath.wordpress.com/</a>), so I'll present those a week from Tuesday (April 21) unless we get a better offer.</p>",
        "id": 193713831,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1586699158
    },
    {
        "content": "<p>Tim Daly</p>\n<p>Out near the KPIT airport, just behind the Raccoon State Park.</p>",
        "id": 193950386,
        "sender_full_name": "Tim Daly",
        "timestamp": 1586894781
    },
    {
        "content": "<p>I am in Bethel Park.  Once this whole pandemic thing has resolved itself, I hope to become more involved with the Lean community at CMU and Pitt.  My background is in financial engineering, and as a result my mathematics background is more on the applied side.</p>",
        "id": 212414528,
        "sender_full_name": "William Sealy Gosset",
        "timestamp": 1601984272
    },
    {
        "content": "<p>Just arrived to Pittsburgh, I'm joining CMU to work on scientific computing in Lean. Looking forward to meeting everyone!</p>",
        "id": 324461788,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1675010797
    },
    {
        "content": "<p>Oh that's great news! Expecting more great things from SciLean!</p>",
        "id": 324467704,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1675013677
    },
    {
        "content": "<p>Hi, I'm in Pittsburgh. I don't know how involved I will be with the local lean community, but if I can make any event I will do it! I'm a professional programmer, write haskell in my day job, and interested in Lean.</p>",
        "id": 338547565,
        "sender_full_name": "Joel McCracken",
        "timestamp": 1677579672
    },
    {
        "content": "<p>Also, I help run the pgh functional programming meetup group. We haven’t really had many events since pandemic, but our slack chat is active and we get together many weeks via zoom to chat about what we’ve been hacking on lately. If any of you are interested, let me know and I’ll get you an invitation. And if anyone would like to give a talk on any topics, either over zoom or in person, we’d be happy to host you!</p>",
        "id": 339774250,
        "sender_full_name": "Joel McCracken",
        "timestamp": 1678076024
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"589587\">@Joel McCracken</span>,  we've been doing an informal software verification reading group at the Hoskinson Center at Carnegie Mellon on Fridays at 10am. (There is no meeting this week; it's spring break.) If you might want to attend some of them, let me know, and I'll send you an invite to our Google group mailing list.</p>",
        "id": 339929000,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1678124165
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span>  Sure, i'd love to be on the mailing list at the very least; you can send the invite to <a href=\"mailto:mccracken.joel@gmail.com\">mccracken.joel@gmail.com</a></p>",
        "id": 340225335,
        "sender_full_name": "Joel McCracken",
        "timestamp": 1678227584
    },
    {
        "content": "<p>Funnily enough, I just read <a href=\"http://philsci-archive.pitt.edu/20979/7/talk_archive.pdf\">http://philsci-archive.pitt.edu/20979/7/talk_archive.pdf</a></p>",
        "id": 340226660,
        "sender_full_name": "Joel McCracken",
        "timestamp": 1678228128
    },
    {
        "content": "<p>I just joined the <a href=\"https://www.cmu.edu/hoskinson/\">Hoskinson center</a> in Pittsburgh for one year! During the fall semester I'll be at CMU for sure at least on Monday, Wednesday and Friday since I'll be teaching interactive theorem proving those days.</p>",
        "id": 387487114,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1693106206
    },
    {
        "content": "<p>Hi all, big Lean enthusiast here. I'll be in Pittsburgh tomorrow and would love to pop by the Hoskinson center and introduce myself! Would that be okay? If so, let me know if there's a better or worse time. I'm a big fan of all of your work, and I'm hoping to become a more active contributor to the Lean ecosystem in the coming months.</p>",
        "id": 420308714,
        "sender_full_name": "Timo Carlin-Burns",
        "timestamp": 1707328158
    },
    {
        "content": "<p>I won’t be on campus tomorrow, sorry.</p>",
        "id": 420312051,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1707329273
    },
    {
        "content": "<p>Hey Timo, I'm happy to meet. I have office at the Hoskinson center and will be there the whole day tomorrow.</p>",
        "id": 420336999,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1707337763
    },
    {
        "content": "<p>Too bad you are not coming today as we have a weekly meeting and you could meet more people. Otherwise people are spread all around the campus or working from home.</p>",
        "id": 420337583,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1707337945
    },
    {
        "content": "<p>I will be visiting Pittsburgh from Saturday March 30 to Saturday April 6.  If anyone wants to get together and chat in that time frame, e.g. <span class=\"user-mention\" data-user-id=\"409334\">@Sean Welleck</span>, <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span>, <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span>, <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span>, <span class=\"user-mention\" data-user-id=\"128280\">@Wojciech Nawrocki</span>, and others (I'm not sure who all is in Pittsburgh right now), I'd love to schedule something.</p>",
        "id": 426833502,
        "sender_full_name": "Jason Rute",
        "timestamp": 1710542621
    },
    {
        "content": "<p>I’ll be around, and happy to talk. I’m usually on campus on Mondays, Wednesdays and Fridays. We have the weekly Hoskinson center meeting on Wednesday afternoon at 4:30 where you are very welcome.</p>",
        "id": 426836479,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1710544431
    },
    {
        "content": "<p>I just moved to Pittsburgh and will be studying math at CMU this semester! I'm looking forward to seeing some of your faces around campus :)</p>",
        "id": 463557071,
        "sender_full_name": "Timo Carlin-Burns",
        "timestamp": 1724118935
    },
    {
        "content": "<p>Are the Wednesday Hoskinson center meetings happening tomorrow? I would like to check it out if so</p>",
        "id": 522169343,
        "sender_full_name": "Li Xuanji",
        "timestamp": 1748968214
    },
    {
        "content": "<p>No, we take a break over the summer, because lots of people travel, do internships, or work at home. But some of us are around; I'll be on campus on Thursday. Are you in Pittsburgh? If so, how long will you be here?</p>",
        "id": 522227369,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1748990212
    },
    {
        "content": "<p>I work and live here! (I’ve just been generally not free on Wednesdays)</p>",
        "id": 522232966,
        "sender_full_name": "Li Xuanji",
        "timestamp": 1748993032
    },
    {
        "content": "<p>Hi, I just found out about this channel .  did the weekly meetings resume?</p>",
        "id": 542460173,
        "sender_full_name": "Nadim Farhat",
        "timestamp": 1759314639
    },
    {
        "content": "<p>I should have introduced myself. I am Nadim , I have been in Pittsburgh since 2012 . I have been working in scientifc computing ever since, from medical image analysis , to electromagnetic and ultrasound simulation to medical robotics. I earned my PhD from University of Pittsburgh working at ultra high field MRI .  When i was trying to prove some propostions by Jaynes in his book Probability theory , I found i am incapable to verify my own proofs. so I started looking for computer assisted proofs which led me to lean 4</p>",
        "id": 542488466,
        "sender_full_name": "Nadim Farhat",
        "timestamp": 1759323539
    },
    {
        "content": "<p>We're meeting at 4:30 today as usual in Baker Hall 139, and online at <a href=\"http://cmu.zoom.us/my/avigad\">cmu.zoom.us/my/avigad</a>. Nadim, you are welcome to join us any time. Shall I add you to our mailing list? It's usually just a weekly reminder.</p>",
        "id": 542543693,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1759338013
    },
    {
        "content": "<p>Yes can I be added to the mailing, please use <a href=\"mailto:nadim.farhat@gmail.com\">nadim.farhat@gmail.com</a>. This time i will join online. Thank you for the invite.</p>",
        "id": 542562030,
        "sender_full_name": "Nadim Farhat",
        "timestamp": 1759344511
    },
    {
        "content": "<p>Hi, I'm Anish; Im a current undergrad studying math at CMU, mainly interested in formal logic and programming languages. I've been programming in lean for the past 1-2 months and have been really enjoying it. I was curious if these meetings still happen, and if I could also be added to the mailing list?</p>",
        "id": 555380795,
        "sender_full_name": "Anish Rajeev",
        "timestamp": 1763046275
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"986582\">@Anish Rajeev</span> I just sent an invite!</p>",
        "id": 556720842,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1763333694
    }
]