[
    {
        "content": "<p>Hi all,</p>\n<p>I'm wondering who here is from western Canada or Washington. Specifically, are there any people here (aside from myself and <span class=\"user-mention\" data-user-id=\"391579\">@Jake Levinson</span>) affiliated with a university that is part of <a href=\"https://www.pims.math.ca/scientific\">PIMS</a>?</p>",
        "id": 342358768,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1678982637
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"490964\">@Jarod Alper</span> is at UW.</p>",
        "id": 342365223,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1678984103
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"243562\">@Adam Topaz</span> - <span class=\"user-mention\" data-user-id=\"391579\">@Jake Levinson</span>  and I just recently exchanged some messages about west coast people working in Lean. I'm faculty at North Island College on Vancouver Island, but that particular role isn't too relevant to Lean (I teach in a vocational diploma program for web and mobile app developers). However, I am also simultaneously completing a (second) MSc at UVic where I'm working on a Lean-based project in cryptography. I don't think anyone else is doing anything with Lean at UVic, but would be interested to discuss further to see how I can help out.</p>",
        "id": 342468651,
        "sender_full_name": "Ashley Blacquiere",
        "timestamp": 1679027110
    },
    {
        "content": "<p>Also I saw <span class=\"user-mention\" data-user-id=\"578430\">@Luke Mantle</span>'s post recently about being a student at UBC - anything happening there, Luke?</p>",
        "id": 342468761,
        "sender_full_name": "Ashley Blacquiere",
        "timestamp": 1679027215
    },
    {
        "content": "<p>Great! Just a bit more context: I’m thinking about applying to run one of these <a href=\"https://courses.pims.math.ca\">PIMS network graduate courses</a>   about formalizing pure mathematics using lean. It’s mostly geared toward graduate students at PIMS institutions, so I wanted to gauge the interest. If you would be interested in such a course (or know of someone who will), please let me know!</p>",
        "id": 342580964,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1679064195
    },
    {
        "content": "<p>Oooh.. I actually very much might be... Will DM you.</p>",
        "id": 342581243,
        "sender_full_name": "Ashley Blacquiere",
        "timestamp": 1679064267
    },
    {
        "content": "<p>Just a quick followup to the above: The PIMS-wide graduate course will run! It can be found here: <br>\n<a href=\"https://courses.pims.math.ca/\">https://courses.pims.math.ca/</a></p>\n<p>If you know of any students in western Canada who might be interested, please let them know!</p>",
        "id": 366018172,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1686701570
    },
    {
        "content": "<p>Hey all, no longer in western Canada but I grew up in Edmonton and most of my extended family lives the Lower Mainland or Vancouver Island; did my BSc. at the University of Alberta, and my Msc. at UBC.</p>\n<p>When I finish my PhD and find myself on the job market, if I'm lucky I'll interview at your school :-)</p>",
        "id": 425225204,
        "sender_full_name": "Nathan Taylor",
        "timestamp": 1709785492
    }
]