[
    {
        "content": "<p>Some questions about code actions.</p>\n<ul>\n<li>Is there a mechanism (whether generic or Lean specific) to run all code actions in a file? Or all code actions of a specified <code>kind?</code>?</li>\n<li>What if I wanted to run all code actions across many files (ideally able to do this from the command line / a script)?</li>\n</ul>",
        "id": 387388896,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1693028723
    },
    {
        "content": "<p>(I'm thinking here that there are some things which are useful both as user prompts and library-wide edit tools, and hoping that one can just implement these as code actions.)</p>",
        "id": 387388972,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1693028769
    },
    {
        "content": "<p>No, not really. We would need another interface for that, a framework for plugging in to a \"do all the things\" edit API</p>",
        "id": 387392651,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693032014
    },
    {
        "content": "<p>What would the front end of such an API be? Something like <code>cargo --fix</code>, or a custom command in vscode?</p>",
        "id": 387392688,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693032074
    },
    {
        "content": "<p>The way I would describe <code>cargo --fix</code> in lean terms is that compilation can produce diagnostics (warnings and errors) that are change requests tagged as \"machine-applicable\", and then <code>--fix</code> collects all of these by running lean in a special mode where it outputs these diagnostics in JSON format and then follows up with a global file edit which applies all machine-applicable diagnostic change suggestions.</p>",
        "id": 387393604,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693032923
    },
    {
        "content": "<p>Oh, I was imagining instead some tool that collected all the change requests <strong>via the LSP</strong> (hence wondering if there might be something generic for all langauges).</p>",
        "id": 387397377,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1693035846
    },
    {
        "content": "<p>But a quick google finds nothing, which is a pity.</p>",
        "id": 387398188,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1693036129
    },
    {
        "content": "<p>The LSP interface (which is reflected in the lean interface) is that the client asks about what code actions exist at a given location or selection, the server responds with a list of suggestions, then the client picks one and the server sends a text edit</p>",
        "id": 387401177,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693037387
    },
    {
        "content": "<p>so if you wanted to use the LSP interface directly you would (1) have to ask at each character and (2) identify and filter out duplicate suggestions, which would be very inefficient</p>",
        "id": 387401331,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693037444
    },
    {
        "content": "<p>It is probably possible to come up with a combined interface which is usable for both workflows though, so that the code actions can share code with the autofix</p>",
        "id": 387401519,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1693037549
    }
]